#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Abducted_Pipe_LG_02_Leak

#include "Basic.hpp"

#include "Abducted_Pipe_LG_02_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Abducted_Pipe_LG_02_Leak.Abducted_Pipe_LG_02_Leak_C
// 0x0028 (0x0C10 - 0x0BE8)
class AAbducted_Pipe_LG_02_Leak_C final : public AAbducted_Pipe_LG_02_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Abducted_Pipe_LG_02_Leak_C;         // 0x0BE8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAudioComponent*                        Audio_Pipe_Leak_Water_Splashes_Loop;               // 0x0BF0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        Audio_Pipe_Leak_Spout_Water_Loop;                  // 0x0BF8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      LeakEffect;                                        // 0x0C00(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        SplashHeight;                                      // 0x0C08(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();
	void OnDeathPlayEffects(float Damage, const struct FGameplayTagContainer& DamageTags, const struct FVector& Momentum, const struct FHitResult& HitInfo, class AFortPawn* InstigatedBy, class AActor* DamageCauser, const struct FGameplayEffectContextHandle& EffectContext);
	void ExecuteUbergraph_Abducted_Pipe_LG_02_Leak(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Abducted_Pipe_LG_02_Leak_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Abducted_Pipe_LG_02_Leak_C")
	}
	static class AAbducted_Pipe_LG_02_Leak_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAbducted_Pipe_LG_02_Leak_C>();
	}
};
DUMPER7_ASSERTS_AAbducted_Pipe_LG_02_Leak_C;

}

