#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AIPatrolPath

#include "Basic.hpp"

#include "FortniteAI_structs.hpp"


namespace SDK::Params
{

// Function AIPatrolPath.AIPatrolPathComponent.GeneratePathPoints
// 0x0002 (0x0002 - 0x0000)
struct AIPatrolPathComponent_GeneratePathPoints final
{
public:
	EFortCreativePatrolPathGroup                  PatrolPathGroup;                                   // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bGenerationCausedByDuplication;                    // 0x0001(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AIPatrolPathComponent_GeneratePathPoints;

// Function AIPatrolPath.AIPatrolPathComponent.GetPatrolFilterOptions
// 0x0008 (0x0008 - 0x0000)
struct AIPatrolPathComponent_GetPatrolFilterOptions final
{
public:
	TSubclassOf<class UNavigationQueryFilter>     ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AIPatrolPathComponent_GetPatrolFilterOptions;

// Function AIPatrolPath.AIPatrolPathComponent.NotifyEditorUserOptionChanged
// 0x0010 (0x0010 - 0x0000)
struct AIPatrolPathComponent_NotifyEditorUserOptionChanged final
{
public:
	TArray<class FString>                         UserOptions;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AIPatrolPathComponent_NotifyEditorUserOptionChanged;

// Function AIPatrolPath.AIPatrolPathComponent.OnPathExtremitiesChanged
// 0x0002 (0x0002 - 0x0000)
struct AIPatrolPathComponent_OnPathExtremitiesChanged final
{
public:
	bool                                          bIsStart;                                          // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsEnd;                                            // 0x0001(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AIPatrolPathComponent_OnPathExtremitiesChanged;

// Function AIPatrolPath.AIPatrolPathComponent.PatrolPathStarted
// 0x0008 (0x0008 - 0x0000)
struct AIPatrolPathComponent_PatrolPathStarted final
{
public:
	class AAIController*                          Instigator;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AIPatrolPathComponent_PatrolPathStarted;

// Function AIPatrolPath.AIPatrolPathComponent.PatrolPathStopped
// 0x0008 (0x0008 - 0x0000)
struct AIPatrolPathComponent_PatrolPathStopped final
{
public:
	class AAIController*                          Instigator;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AIPatrolPathComponent_PatrolPathStopped;

// Function AIPatrolPath.AIPatrolPathComponent.PatrolPointFailedToReach
// 0x0010 (0x0010 - 0x0000)
struct AIPatrolPathComponent_PatrolPointFailedToReach final
{
public:
	class AFortAthenaPatrolPoint*                 PathPoint;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AAIController*                          Instigator;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AIPatrolPathComponent_PatrolPointFailedToReach;

// Function AIPatrolPath.AIPatrolPathComponent.PatrolPointReached
// 0x0010 (0x0010 - 0x0000)
struct AIPatrolPathComponent_PatrolPointReached final
{
public:
	class AFortAthenaPatrolPoint*                 PathPoint;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AAIController*                          Instigator;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AIPatrolPathComponent_PatrolPointReached;

// Function AIPatrolPath.AIPatrolPathComponent.PropagatePatrolPathIndexToDevice
// 0x0004 (0x0004 - 0x0000)
struct AIPatrolPathComponent_PropagatePatrolPathIndexToDevice final
{
public:
	int32                                         NewPatrolPathIndex;                                // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AIPatrolPathComponent_PropagatePatrolPathIndexToDevice;

// Function AIPatrolPath.AIPatrolPathComponent.PropagatePatrolPathPointIndexToDevice
// 0x0004 (0x0004 - 0x0000)
struct AIPatrolPathComponent_PropagatePatrolPathPointIndexToDevice final
{
public:
	int32                                         NewPatrolPathPointIndex;                           // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AIPatrolPathComponent_PropagatePatrolPathPointIndexToDevice;

// Function AIPatrolPath.AIPatrolPathComponent.RemovePoint
// 0x0001 (0x0001 - 0x0000)
struct AIPatrolPathComponent_RemovePoint final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AIPatrolPathComponent_RemovePoint;

// Function AIPatrolPath.AIPatrolPathComponent.SetPatrollingMode
// 0x0001 (0x0001 - 0x0000)
struct AIPatrolPathComponent_SetPatrollingMode final
{
public:
	EPatrollingMode                               NewMode;                                           // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AIPatrolPathComponent_SetPatrollingMode;

// Function AIPatrolPath.AIPatrolPathComponent.SetPatrolPathEnabled
// 0x0001 (0x0001 - 0x0000)
struct AIPatrolPathComponent_SetPatrolPathEnabled final
{
public:
	bool                                          bIsEnabled;                                        // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AIPatrolPathComponent_SetPatrolPathEnabled;

// Function AIPatrolPath.AIPatrolPathComponent.SetPatrolPathGroup
// 0x0001 (0x0001 - 0x0000)
struct AIPatrolPathComponent_SetPatrolPathGroup final
{
public:
	EFortCreativePatrolPathGroup                  PatrolPathGroup;                                   // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AIPatrolPathComponent_SetPatrolPathGroup;

// Function AIPatrolPath.AIPatrolPathComponent.SetRenderPath
// 0x0001 (0x0001 - 0x0000)
struct AIPatrolPathComponent_SetRenderPath final
{
public:
	bool                                          bRenderPath;                                       // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AIPatrolPathComponent_SetRenderPath;

// Function AIPatrolPath.AIPatrolPathComponent.ShouldRenderPath
// 0x0001 (0x0001 - 0x0000)
struct AIPatrolPathComponent_ShouldRenderPath final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AIPatrolPathComponent_ShouldRenderPath;

// Function AIPatrolPath.AIPatrolPathComponent.CanNextPointBeReached
// 0x0001 (0x0001 - 0x0000)
struct AIPatrolPathComponent_CanNextPointBeReached final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AIPatrolPathComponent_CanNextPointBeReached;

// Function AIPatrolPath.AIPatrolPathComponent.GetLinkedPatrolPoints
// 0x0010 (0x0010 - 0x0000)
struct AIPatrolPathComponent_GetLinkedPatrolPoints final
{
public:
	TArray<class UAIPatrolPathComponent*>         ReturnValue;                                       // 0x0000(0x0010)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AIPatrolPathComponent_GetLinkedPatrolPoints;

// Function AIPatrolPath.AIPatrolPathComponent.GetNextAvailablePatrolPathIndex
// 0x0008 (0x0008 - 0x0000)
struct AIPatrolPathComponent_GetNextAvailablePatrolPathIndex final
{
public:
	int32                                         NextAvailableIndex;                                // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AIPatrolPathComponent_GetNextAvailablePatrolPathIndex;

// Function AIPatrolPath.AIPatrolPathComponent.GetPatrollingMode
// 0x0001 (0x0001 - 0x0000)
struct AIPatrolPathComponent_GetPatrollingMode final
{
public:
	EPatrollingMode                               ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AIPatrolPathComponent_GetPatrollingMode;

// Function AIPatrolPath.AIPatrolPathComponent.GetPatrolPathGroup
// 0x0001 (0x0001 - 0x0000)
struct AIPatrolPathComponent_GetPatrolPathGroup final
{
public:
	EFortCreativePatrolPathGroup                  ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AIPatrolPathComponent_GetPatrolPathGroup;

// Function AIPatrolPath.AIPatrolPathComponent.GetPatrolPathIndex
// 0x0004 (0x0004 - 0x0000)
struct AIPatrolPathComponent_GetPatrolPathIndex final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AIPatrolPathComponent_GetPatrolPathIndex;

// Function AIPatrolPath.AIPatrolPathComponent.GetPatrolPathIndexFromDevice
// 0x0004 (0x0004 - 0x0000)
struct AIPatrolPathComponent_GetPatrolPathIndexFromDevice final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AIPatrolPathComponent_GetPatrolPathIndexFromDevice;

// Function AIPatrolPath.AIPatrolPathComponent.GetPatrolPathPoint
// 0x0010 (0x0010 - 0x0000)
struct AIPatrolPathComponent_GetPatrolPathPoint final
{
public:
	int32                                         InPatrolPathIndex;                                 // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InPatrolPathPointIndex;                            // 0x0004(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAIPatrolPathComponent*                 ReturnValue;                                       // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AIPatrolPathComponent_GetPatrolPathPoint;

// Function AIPatrolPath.AIPatrolPathComponent.GetPatrolPathPointIndex
// 0x0004 (0x0004 - 0x0000)
struct AIPatrolPathComponent_GetPatrolPathPointIndex final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AIPatrolPathComponent_GetPatrolPathPointIndex;

// Function AIPatrolPath.AIPatrolPathComponent.GetPatrolPathPointIndexFromDevice
// 0x0004 (0x0004 - 0x0000)
struct AIPatrolPathComponent_GetPatrolPathPointIndexFromDevice final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AIPatrolPathComponent_GetPatrolPathPointIndexFromDevice;

// Function AIPatrolPath.AIPatrolPathComponent.HasValidPatrolPath
// 0x0001 (0x0001 - 0x0000)
struct AIPatrolPathComponent_HasValidPatrolPath final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AIPatrolPathComponent_HasValidPatrolPath;

}

