#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AlwaysSpawn_RareChest

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function AlwaysSpawn_RareChest.AlwaysSpawn_RareChest_C.UserConstructionScript
// 0x0010 (0x0010 - 0x0000)
struct AlwaysSpawn_RareChest_C_UserConstructionScript final
{
public:
	TArray<class UNiagaraComponent*>              K2Node_MakeArray_Array;                            // 0x0000(0x0010)(ReferenceParm, ContainsInstancedReference)
};
DUMPER7_ASSERTS_AlwaysSpawn_RareChest_C_UserConstructionScript;

// Function AlwaysSpawn_RareChest.AlwaysSpawn_RareChest_C.ExecuteUbergraph_AlwaysSpawn_RareChest
// 0x00C0 (0x00C0 - 0x0000)
struct AlwaysSpawn_RareChest_C_ExecuteUbergraph_AlwaysSpawn_RareChest final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0xC];                                        // 0x0004(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x0010(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0070(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0088(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x00A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue;        // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_AlwaysSpawn_RareChest_C_ExecuteUbergraph_AlwaysSpawn_RareChest;

}

