#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaBroadcastSquadStatusTG

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaBroadcastSquadStatusTG.AthenaBroadcastSquadStatusTG_C
// 0x0030 (0x0390 - 0x0360)
class UAthenaBroadcastSquadStatusTG_C final : public UAthenaBroadcastSquadStatusWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0360(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAthenaBroadcastTeamTag_C*              AthenaBroadcastTeamTag;                            // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaBroadcastPlayerStatusTG_C*       FollowedPlayerStatus;                              // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortDynamicEntryBox*                   SquadMateList;                                     // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           StatusVB;                                          // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bPipModeEnabled;                                   // 0x0388(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UpdateTeamTagVisibility();
	void UpdateFromMinigameTeamId(const class UFortMinigameTeamIdentification* MinigameTeamId);
	void RebuildSquad();
	void PreConstruct(bool IsDesignTime);
	void OnSquadSessionRankChanged(class UAthenaRemoteSquadViewData* InSquadData, int32 InSquadSessionRank);
	void OnPlayerAdded(class UAthenaRemoteSquadViewData* InSquadData, class UAthenaRemotePlayerViewData* InPlayerData);
	void OnPipModeChanged(bool bPipModeEnabled_0);
	void OnMinigameTeamIdChanged(const class UFortMinigameTeamIdentification* MinigameTeamId);
	void OnFollowedPlayerChanged();
	void HandleDisplaySessionRankChanged(bool bDisplay);
	void ExecuteUbergraph_AthenaBroadcastSquadStatusTG(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("AthenaBroadcastSquadStatusTG_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AthenaBroadcastSquadStatusTG_C")
	}
	static class UAthenaBroadcastSquadStatusTG_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaBroadcastSquadStatusTG_C>();
	}
};
DUMPER7_ASSERTS_UAthenaBroadcastSquadStatusTG_C;

}

