#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaEventMatchScoreboardSquadWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaEventMatchScoreboardSquadWidget.AthenaEventMatchScoreboardSquadWidget_C
// 0x0028 (0x0360 - 0x0338)
class UAthenaEventMatchScoreboardSquadWidget_C final : public UAthenaEventMatchScoreboardSquadWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0338(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UFortDynamicEntryBox*                   PlayerBox;                                         // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             SquadId;                                           // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          SquadIdBorder;                                     // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SquadIdSB;                                         // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void SetSquadIdVisible(bool bSquadIdVisible);
	void RebuildPlayerList();
	void OnSquadIdChanged(class UAthenaRemoteSquadViewData* InSquadData, uint8 InSquadId);
	void OnSquadColorChanged(class UAthenaRemoteSquadViewData* InSquadData, const struct FLinearColor& InSquadColor);
	void OnPlayerAdded(class UAthenaRemoteSquadViewData* InSquadData, class UAthenaRemotePlayerViewData* InPlayerData);
	void ExecuteUbergraph_AthenaEventMatchScoreboardSquadWidget(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("AthenaEventMatchScoreboardSquadWidget_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AthenaEventMatchScoreboardSquadWidget_C")
	}
	static class UAthenaEventMatchScoreboardSquadWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaEventMatchScoreboardSquadWidget_C>();
	}
};
DUMPER7_ASSERTS_UAthenaEventMatchScoreboardSquadWidget_C;

}

