#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaMatchStatusTextPlayer

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaMatchStatusTextPlayer.AthenaMatchStatusTextPlayer_C
// 0x00D8 (0x0398 - 0x02C0)
class UAthenaMatchStatusTextPlayer_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       TopPlayerDead;                                     // 0x02C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       NewTopPlayer;                                      // 0x02D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 LensFlare1;                                        // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LensFlare2;                                        // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LensFlare3;                                        // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LensFlare4;                                        // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 StrikeThrough;                                     // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock;                                         // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FSlateFontInfo                         Font;                                              // 0x0308(0x0058)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FSlateColor                            Color;                                             // 0x0360(0x0014)(Edit, BlueprintVisible)
	bool                                          ShowMaterialHighlight;                             // 0x0374(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_375[0x3];                                      // 0x0375(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstance*                      HighlightMaterial;                                 // 0x0378(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class FText                                   TextToDisplay;                                     // 0x0380(0x0018)(Edit, BlueprintVisible)

public:
	void SetText(const class FText& InText, bool ApplyImmediately);
	void SetOpacityAndColor(const struct FSlateColor& ColorIn);
	void SetFont(const struct FSlateFontInfo& FontIn);
	void PreConstruct(bool IsDesignTime);
	void HighlightMaterialOn();
	void HighlightMaterialOff();
	void HighlightMaterialControl();
	void GetFont(struct FSlateFontInfo* Output);
	void ExecuteUbergraph_AthenaMatchStatusTextPlayer(int32 EntryPoint);
	void ApplyText();
	void ApplyNewText();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("AthenaMatchStatusTextPlayer_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AthenaMatchStatusTextPlayer_C")
	}
	static class UAthenaMatchStatusTextPlayer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaMatchStatusTextPlayer_C>();
	}
};
DUMPER7_ASSERTS_UAthenaMatchStatusTextPlayer_C;

}

