#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaBroadcastStormStatus

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaBroadcastStormStatus.AthenaBroadcastStormStatus_C
// 0x0028 (0x0370 - 0x0348)
class UAthenaBroadcastStormStatus_C final : public UAthenaBroadcastMatchStatusWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0348(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAthenaBroadcastGameTimeWidget_C*       AthenaBroadcastGameTimeWidget;                     // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             CurrentStormPhaseText;                             // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             MaxStormPhaseText;                                 // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               StormPhaseSB;                                      // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void SetMinigameOverride(class AFortMinigame* MinigameOverride);
	void OnStormPhaseCountChanged(int32 StormPhaseCount);
	void OnStormPhaseChanged(int32 StormPhase);
	void ExecuteUbergraph_AthenaBroadcastStormStatus(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("AthenaBroadcastStormStatus_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AthenaBroadcastStormStatus_C")
	}
	static class UAthenaBroadcastStormStatus_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaBroadcastStormStatus_C>();
	}
};
DUMPER7_ASSERTS_UAthenaBroadcastStormStatus_C;

}

