#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaBroadcasterMapSettings

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaBroadcasterMapSettings.AthenaBroadcasterMapSettings_C
// 0x0080 (0x0488 - 0x0408)
class UAthenaBroadcasterMapSettings_C final : public UFortBroadcasterMapSettings
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0408(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class URotatorSelectorReplaySettings_C*       BusPathsRotator;                                   // 0x0410(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         ButtonBox;                                         // 0x0418(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOptionsMenuSliderReplay_C*             NameZoomVisibility;                                // 0x0420(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URotatorSelectorReplaySettings_C*       VehicleIconsRotator;                               // 0x0428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URotatorSelectorReplaySettings_C*       WeaponTracersRotator;                              // 0x0430(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMap<class UCommonButtonLegacy*, class UClass*> MapIconVisibility;                               // 0x0438(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)

public:
	void Refresh_Options();
	void PreConstruct(bool IsDesignTime);
	void OnMapIconClicked(class UCommonButtonLegacy* ButtonClicked);
	void Map_Icon_Added(class UFortSpectateClickableMapIcon* Icon);
	void ExecuteUbergraph_AthenaBroadcasterMapSettings(int32 EntryPoint);
	void BP_OnActivated();
	void BP_HandleMapIconAdded(class UFortSpectateClickableMapIcon* MapIcon);
	void BndEvt__WeaponTracersRotator_K2Node_ComponentBoundEvent_0_Selection_Changed__DelegateSignature(int32 Selected_Index);
	void BndEvt__VehicleIconsRotator_K2Node_ComponentBoundEvent_2_Selection_Changed__DelegateSignature(int32 Selected_Index);
	void BndEvt__PlayerIndicatorsRotator_K2Node_ComponentBoundEvent_3_Selection_Changed__DelegateSignature(int32 Selected_Index);
	void BndEvt__NameZoomVisibility_K2Node_ComponentBoundEvent_1_SliderChanged__DelegateSignature(double Slider_Value);
	void BndEvt__BusPathsRotator_K2Node_ComponentBoundEvent_4_Selection_Changed__DelegateSignature(int32 Selected_Index);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("AthenaBroadcasterMapSettings_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AthenaBroadcasterMapSettings_C")
	}
	static class UAthenaBroadcasterMapSettings_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaBroadcasterMapSettings_C>();
	}
};
DUMPER7_ASSERTS_UAthenaBroadcasterMapSettings_C;

}

