#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaGamePhaseChangeWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Slate_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "UMG_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaGamePhaseChangeWidget.AthenaGamePhaseChangeWidget_C
// 0x0198 (0x06E8 - 0x0550)
class UAthenaGamePhaseChangeWidget_C final : public UAthenaHUDGamePhaseChangingBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0550(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Ranked_BusLockedIntro_Option2;                     // 0x0558(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Ranked_BusLockedIntro;                             // 0x0560(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Ranked_SimpleIntro;                                // 0x0568(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       BusIntro;                                          // 0x0570(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       IconSlide;                                         // 0x0578(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       IconPulse;                                         // 0x0580(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ModeChanged;                                       // 0x0588(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UFortVisualAttachment*                  FortVisualAttachment_Habanero;                     // 0x0590(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_SkewBG_Ranked;                               // 0x0598(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Trapeze;                                     // 0x05A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_Habanero;                                  // 0x05A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Particles_Outward;                                 // 0x05B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Particles_Outward_Medium;                          // 0x05B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Particles_Outward_Small;                           // 0x05C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPapaya_ServerWarning_C*                ServerStatus;                                      // 0x05C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonVisibilitySwitcher*              Switcher_BusIconState_Ranked;                      // 0x05D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonVisibilitySwitcher*              Switcher_GameMode;                                 // 0x05D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_BusPhase_PlaylistText;                        // 0x05E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_BusPhase_Ranked;                              // 0x05E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_BusTimer_Ranked;                              // 0x05F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonVisualAttachment*                VisualAttachment_Trapeze;                          // 0x05F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Habanero_Icon_C*                   WBP_Habanero_Icon;                                 // 0x0600(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FGameplayTagContainer                  HideForSetupTags;                                  // 0x0608(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)
	EFortMinigameState                            MinigameState;                                     // 0x0628(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_629[0x7];                                      // 0x0629(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortMinigame*                          CachedMinigame;                                    // 0x0630(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UActorComponent*                        CachedSpawnOverrideComponent;                      // 0x0638(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  JoiningLobbyTagContainer;                          // 0x0640(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)
	struct FScalableFloat                         ShouldDisplayGamePhaseUIOnStarterIsland;           // 0x0660(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UFortHabaneroDisplayData*               RankData;                                          // 0x0688(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          ShowRanked;                                        // 0x0690(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_691[0x7];                                      // 0x0691(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   BusPhaseLockedText;                                // 0x0698(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)
	class FText                                   BusPhaseGetReadyPhaseText;                         // 0x06B0(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)
	class FText                                   BusPhaseFlyingText;                                // 0x06C8(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)
	bool                                          HasValidMessaging;                                 // 0x06E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void SetupForMinigame();
	void SequenceEvent__ENTRYPOINTAthenaGamePhaseChangeWidget_2();
	void SequenceEvent__ENTRYPOINTAthenaGamePhaseChangeWidget_1();
	void SequenceEvent__ENTRYPOINTAthenaGamePhaseChangeWidget_0();
	void SequenceEvent__ENTRYPOINTAthenaGamePhaseChangeWidget();
	void PlayIntroAnimation(const EAthenaGamePhaseStep Step);
	void OnReady_6E2579ED4185775736441C935A5E4C4B(class AFortGameStateAthena* GameState, const class UFortPlaylist* Playlist, const struct FGameplayTagContainer& PlaylistContextTags);
	void OnMinigameReady(class AFortMinigame* Minigame);
	void On_AnimFinished();
	void MinigameStateChangedEvent(const class AFortMinigame* Minigame, const EFortMinigameState NewMinigameState);
	void IsSpawningViaAircraft(bool* bIsSpawningViaAircraft);
	bool IsRiftSpawning();
	void HasSpawnOverrideComponent(bool* bHasSpawnOverrideInterface);
	void ForceResetWidgetIfSpatialGameplay();
	void ExecuteUbergraph_AthenaGamePhaseChangeWidget(int32 EntryPoint);
	void EventHandleJump();
	bool DoesMinigamePreventUpdatesAtPhase(uint8 Value);
	void DevicesUpdated();
	void Destruct();
	void Construct();
	void BusIntro_Audio();
	void BP_UpdateMessaging(const EAthenaGamePhaseStep Step, const class FText& NewMessage, const class FText& NewTimeText);
	void BP_SetRankedProgress(const class FString& ProgressKey, const int32 RankedTier, const int32 RankedPosition, const float RankedPercent);
	void BP_SetPlaylistName(const class FText& PlaylistName);
	void BP_SetIsRanked(const bool bIsRanked);
	void BP_HandleGamePhaseStepChanged(const EAthenaGamePhaseStep Step);
	void BindToMinigameEvents(bool bShouldBind);

	void ToggleCompass(bool bHide) const;
	void PlayGamePhaseAlertSound(const EAthenaGamePhaseStep Step) const;
	void PlayCountdownAudio(const class FText& NewTimeText, const EAthenaGamePhaseStep Step) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("AthenaGamePhaseChangeWidget_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AthenaGamePhaseChangeWidget_C")
	}
	static class UAthenaGamePhaseChangeWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaGamePhaseChangeWidget_C>();
	}
};
DUMPER7_ASSERTS_UAthenaGamePhaseChangeWidget_C;

}

