#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaBroadcastStormStatus

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function AthenaBroadcastStormStatus.AthenaBroadcastStormStatus_C.SetMinigameOverride
// 0x0008 (0x0008 - 0x0000)
struct AthenaBroadcastStormStatus_C_SetMinigameOverride final
{
public:
	class AFortMinigame*                          MinigameOverride;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_AthenaBroadcastStormStatus_C_SetMinigameOverride;

// Function AthenaBroadcastStormStatus.AthenaBroadcastStormStatus_C.OnStormPhaseCountChanged
// 0x0004 (0x0004 - 0x0000)
struct AthenaBroadcastStormStatus_C_OnStormPhaseCountChanged final
{
public:
	int32                                         StormPhaseCount;                                   // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_AthenaBroadcastStormStatus_C_OnStormPhaseCountChanged;

// Function AthenaBroadcastStormStatus.AthenaBroadcastStormStatus_C.OnStormPhaseChanged
// 0x0004 (0x0004 - 0x0000)
struct AthenaBroadcastStormStatus_C_OnStormPhaseChanged final
{
public:
	int32                                         StormPhase;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_AthenaBroadcastStormStatus_C_OnStormPhaseChanged;

// Function AthenaBroadcastStormStatus.AthenaBroadcastStormStatus_C.ExecuteUbergraph_AthenaBroadcastStormStatus
// 0x00C0 (0x00C0 - 0x0000)
struct AthenaBroadcastStormStatus_C_ExecuteUbergraph_AthenaBroadcastStormStatus final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_StormPhase;                           // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0008(0x0018)()
	class AFortMinigame*                          K2Node_CustomEvent_MinigameOverride;               // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_StormPhaseCount;                      // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x0030(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0048(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0098(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00A8(0x0018)()
};
DUMPER7_ASSERTS_AthenaBroadcastStormStatus_C_ExecuteUbergraph_AthenaBroadcastStormStatus;

}

