#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaReadyUpTooltipWidget

#include "Basic.hpp"

#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaReadyUpTooltipWidget.AthenaReadyUpTooltipWidget_C
// 0x0060 (0x0360 - 0x0300)
class UAthenaReadyUpTooltipWidget_C final : public UAthenaReadyUpTooltipWidget
{
public:
	class UAthenaReadyUpTooltipTickWidget_C*      AthenaReadyUpTooltipTickWidget;                    // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaReadyUpTooltipTickWidget_C*      AthenaReadyUpTooltipTickWidget_1;                  // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaReadyUpTooltipTickWidget_C*      AthenaReadyUpTooltipTickWidget_2;                  // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaReadyUpTooltipTickWidget_C*      AthenaReadyUpTooltipTickWidget_3;                  // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaReadyUpTooltipTickWidget_C*      AthenaReadyUpTooltipTickWidget_4;                  // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaReadyUpTooltipTickWidget_C*      AthenaReadyUpTooltipTickWidget_5;                  // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaReadyUpTooltipTickWidget_C*      AthenaReadyUpTooltipTickWidget_6;                  // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaReadyUpTooltipTickWidget_C*      AthenaReadyUpTooltipTickWidget_7;                  // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Backplate;                                   // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_BackplateShadow;                             // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Tail;                                        // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImageTailShadow;                                   // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("AthenaReadyUpTooltipWidget_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AthenaReadyUpTooltipWidget_C")
	}
	static class UAthenaReadyUpTooltipWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaReadyUpTooltipWidget_C>();
	}
};
DUMPER7_ASSERTS_UAthenaReadyUpTooltipWidget_C;

}

