#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaSpectatorMapPlayerListRow

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaSpectatorMapPlayerListRow.AthenaSpectatorMapPlayerListRow_C
// 0x0048 (0x0508 - 0x04C0)
class UAthenaSpectatorMapPlayerListRow_C final : public UAthenaSpectatorPlayerListEntryBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UVerticalBox*                           HitPointInfoVB;                                    // 0x04C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          ScoreboardStateBorder;                             // 0x04D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_EventScore;                                // 0x04D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_SquadId;                                   // 0x04E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UClass*                                 DefaultStyle;                                      // 0x04E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 IrrelevantStyle;                                   // 0x04F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 EliminatedStyle;                                   // 0x04F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESpectatorMapPlayerListState                  DesignTime_State;                                  // 0x0500(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UpdateStyle(ESpectatorMapPlayerListState PlayerListState);
	void PreConstruct(bool IsDesignTime);
	void OnSquadIdVisibilityChanged(bool bVisible);
	void OnPlayerDataChanged(class UAthenaRemotePlayerViewData* InPlayerData);
	void OnIsInRelevancyChanged(bool bIsInRelevancy);
	void OnEventScoreChanged(int32 EventScore);
	void OnDisconnectedChanged(bool bIsDisconnected);
	void OnDeadStateChanged(bool bIsDead);
	void ExecuteUbergraph_AthenaSpectatorMapPlayerListRow(int32 EntryPoint);

	void GetPlayerListState(ESpectatorMapPlayerListState* PlayerListState) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("AthenaSpectatorMapPlayerListRow_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AthenaSpectatorMapPlayerListRow_C")
	}
	static class UAthenaSpectatorMapPlayerListRow_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaSpectatorMapPlayerListRow_C>();
	}
};
DUMPER7_ASSERTS_UAthenaSpectatorMapPlayerListRow_C;

}

