#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_DaySequenceVolume_Storm

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function B_DaySequenceVolume_Storm.B_DaySequenceVolume_Storm_C.UserConstructionScript
// 0x0001 (0x0001 - 0x0000)
struct B_DaySequenceVolume_Storm_C_UserConstructionScript final
{
public:
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_B_DaySequenceVolume_Storm_C_UserConstructionScript;

// Function B_DaySequenceVolume_Storm.B_DaySequenceVolume_Storm_C.OnSavedEventStateExists_9B8BD4A24DDFBB247B81D3B4FAC54225
// 0x0008 (0x0008 - 0x0000)
struct B_DaySequenceVolume_Storm_C_OnSavedEventStateExists_9B8BD4A24DDFBB247B81D3B4FAC54225 final
{
public:
	class UAsyncAction_StartListeningToStatefulEvent* ProxyObject;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_B_DaySequenceVolume_Storm_C_OnSavedEventStateExists_9B8BD4A24DDFBB247B81D3B4FAC54225;

// Function B_DaySequenceVolume_Storm.B_DaySequenceVolume_Storm_C.OnEventStateCleared_9B8BD4A24DDFBB247B81D3B4FAC54225
// 0x0008 (0x0008 - 0x0000)
struct B_DaySequenceVolume_Storm_C_OnEventStateCleared_9B8BD4A24DDFBB247B81D3B4FAC54225 final
{
public:
	class UAsyncAction_StartListeningToStatefulEvent* ProxyObject;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_B_DaySequenceVolume_Storm_C_OnEventStateCleared_9B8BD4A24DDFBB247B81D3B4FAC54225;

// Function B_DaySequenceVolume_Storm.B_DaySequenceVolume_Storm_C.OnEventReceived_9B8BD4A24DDFBB247B81D3B4FAC54225
// 0x0008 (0x0008 - 0x0000)
struct B_DaySequenceVolume_Storm_C_OnEventReceived_9B8BD4A24DDFBB247B81D3B4FAC54225 final
{
public:
	class UAsyncAction_StartListeningToStatefulEvent* ProxyObject;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_B_DaySequenceVolume_Storm_C_OnEventReceived_9B8BD4A24DDFBB247B81D3B4FAC54225;

// Function B_DaySequenceVolume_Storm.B_DaySequenceVolume_Storm_C.ExecuteUbergraph_B_DaySequenceVolume_Storm
// 0x0128 (0x0128 - 0x0000)
struct B_DaySequenceVolume_Storm_C_ExecuteUbergraph_B_DaySequenceVolume_Storm final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAsyncAction_StartListeningToStatefulEvent* K2Node_CustomEvent_ProxyObject_1;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UAsyncAction_StartListeningToStatefulEvent* ProxyObject)> K2Node_CreateDelegate_OutputDelegate; // 0x0010(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FFortSafeZoneIndicatorUpdatedEvent     Temp_struct_Variable;                              // 0x001C(0x0008)(NoDestructor)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAsyncAction_StartListeningToStatefulEvent* K2Node_CustomEvent_ProxyObject;                // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UAsyncAction_StartListeningToStatefulEvent* ProxyObject)> K2Node_CreateDelegate_OutputDelegate_1; // 0x0030(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FFortSafeZoneIndicatorUpdatedEvent     Temp_struct_Variable_1;                            // 0x003C(0x0008)(NoDestructor)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAsyncAction_StartListeningToStatefulEvent* Temp_object_Variable;                          // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetPayload_ReturnValue;                   // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASafeZoneIndicator_C*                   K2Node_DynamicCast_AsSafe_Zone_Indicator;          // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_62[0x2];                                       // 0x0062(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortSafeZoneIndicatorUpdatedEvent     Temp_struct_Variable_2;                            // 0x0064(0x0008)(NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x006C(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetPayload_ReturnValue_1;                 // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_1;          // 0x007A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7B[0x1];                                       // 0x007B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortSafeZoneIndicatorUpdatedEvent     Temp_struct_Variable_3;                            // 0x007C(0x0008)(NoDestructor)
	TDelegate<void(EFortSafeZoneState SafeZoneState)> K2Node_CreateDelegate_OutputDelegate_3;        // 0x0084(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetPayload_ReturnValue_2;                 // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortSafeZoneState                            K2Node_CustomEvent_SafeZoneState;                  // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_92[0x6];                                       // 0x0092(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAsyncAction_StartListeningToStatefulEvent* K2Node_CustomEvent_ProxyObject_2;              // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameplayEventRouterComponent*          CallFunc_GetEventRouter_ReturnValue;               // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAsyncAction_StartListeningToStatefulEvent* CallFunc_StartListeningToStatefulEvent_ReturnValue; // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetGameTimeInSeconds_ReturnValue;         // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x00C8(0x0008)(NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetGameTimeInSeconds_ReturnValue_1;       // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetGameTimeInSeconds_ReturnValue_2;       // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SafeDivide_ReturnValue;                   // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_1;      // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UAsyncAction_StartListeningToStatefulEvent* ProxyObject)> K2Node_CreateDelegate_OutputDelegate_4; // 0x0108(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0114(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_115[0x3];                                      // 0x0115(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_B_ImplicitCast;          // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetCustomVolumeBlendWeight_Weight_ImplicitCast; // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_B_DaySequenceVolume_Storm_C_ExecuteUbergraph_B_DaySequenceVolume_Storm;

// Function B_DaySequenceVolume_Storm.B_DaySequenceVolume_Storm_C.DSV_OnSafeZoneStateChanged
// 0x0001 (0x0001 - 0x0000)
struct B_DaySequenceVolume_Storm_C_DSV_OnSafeZoneStateChanged final
{
public:
	EFortSafeZoneState                            SafeZoneState;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_B_DaySequenceVolume_Storm_C_DSV_OnSafeZoneStateChanged;

}

