#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_DaySequenceVolume_Storm

#include "Basic.hpp"

#include "B_DaySequenceVolume_Parent_classes.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_DaySequenceVolume_Storm.B_DaySequenceVolume_Storm_C
// 0x0040 (0x0380 - 0x0340)
class AB_DaySequenceVolume_Storm_C final : public AB_DaySequenceVolume_Parent_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_B_DaySequenceVolume_Storm_C;        // 0x0340(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          EnableVolume;                                      // 0x0348(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_349[0x7];                                      // 0x0349(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAsyncAction_StartListeningToStatefulEvent* SafeZoneIndicatorUpdatedAsyncTask;             // 0x0350(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         DelayBeforeFadeIn_Seconds_;                        // 0x0358(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35C[0x4];                                      // 0x035C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           FadeInTimerHandle;                                 // 0x0360(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         FadeInUpdateFrequency_Seconds_;                    // 0x0368(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36C[0x4];                                      // 0x036C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        FadeGameTimeStart;                                 // 0x0370(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        TotalFadeTime_Seconds_;                            // 0x0378(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();
	void UpdateScalabilitySequence();
	void ReceiveBeginPlay();
	void OnSavedEventStateExists_9B8BD4A24DDFBB247B81D3B4FAC54225(class UAsyncAction_StartListeningToStatefulEvent* ProxyObject);
	void OnRep_EnableVolume();
	void OnEventStateCleared_9B8BD4A24DDFBB247B81D3B4FAC54225(class UAsyncAction_StartListeningToStatefulEvent* ProxyObject);
	void OnEventReceived_9B8BD4A24DDFBB247B81D3B4FAC54225(class UAsyncAction_StartListeningToStatefulEvent* ProxyObject);
	void OnBlendTargetSet();
	void FadeStormDaySeqVolIn();
	void ExecuteUbergraph_B_DaySequenceVolume_Storm(int32 EntryPoint);
	void DSV_OnSafeZoneStateChanged(EFortSafeZoneState SafeZoneState);
	void CustomEvent();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("B_DaySequenceVolume_Storm_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"B_DaySequenceVolume_Storm_C")
	}
	static class AB_DaySequenceVolume_Storm_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_DaySequenceVolume_Storm_C>();
	}
};
DUMPER7_ASSERTS_AB_DaySequenceVolume_Storm_C;

}

