#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_DaySequenceVolume_Parent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "DaySequence_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_DaySequenceVolume_Parent.B_DaySequenceVolume_Parent_C
// 0x00B0 (0x0340 - 0x0290)
class AB_DaySequenceVolume_Parent_C : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBoxComponent*                          Box;                                               // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDaySequenceModifierComponent*          DaySequenceModifier;                               // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBillboardComponent*                    Icon;                                              // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          UseVolume;                                         // 0x02B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B9[0x7];                                      // 0x02B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAsyncAction_WaitForTimeOfDayManagerUpdated* WaitForTimeOfDayManagerTask;              // 0x02C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FDaySequenceModifierNamedSequence      Array_Element;                                     // 0x02C8(0x0060)(Edit, BlueprintVisible, DisableEditOnInstance)
	class AFortPawn*                              CurrentViewTarget;                                 // 0x0328(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AFortDaySequenceActor*                  CachedTimeOfDayManager;                            // 0x0330(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          Game_State_Async_Fired;                            // 0x0338(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          TODM_Async_Fired;                                  // 0x0339(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33A[0x2];                                      // 0x033A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         PlayerControllerWaitTickCount;                     // 0x033C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();
	void UpdateScalabilitySequence();
	void TryEnableModifier();
	void Setup_Volume_Events();
	void Setup_TODM();
	void Setup_Controller_Events();
	void SetBlendTarget(class AFortPawn* InFortPawn);
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void ReceiveBeginPlay();
	void Post_TODM_Cached();
	void OnUpdated_1BAC673E411C4434067AF5893093C24F(TScriptInterface<class IFortTimeOfDayManagerInterface> TimeOfDayManager);
	void OnReady_01075D4145C8526FE8238CAED0ECAA91(class AGameStateBase* GameState);
	void OnOverlapEnd(class AActor* OverlappingActor);
	void OnOverlapBegin(class AActor* OverlappingActor);
	void OnDaySequenceActorSet(class ADaySequenceActor* NewActor);
	void OnBlendTargetSet();
	void IsLocalPawn(class AFortPlayerPawn* Pawn, bool* Result);
	void Init_Modifier(TScriptInterface<class IFortTimeOfDayManagerInterface> TODM_Inteface);
	void ExecuteUbergraph_B_DaySequenceVolume_Parent(int32 EntryPoint);
	void Event_OnViewTargetChanged(class AFortPlayerController* PlayerController, class AActor* OldViewTarget, class AActor* NewViewTarget);
	void EnableDaysequenceVolume();
	void EnableAllDaysequenceVolumesInMap();
	void DisableDaysequenceVolume();
	void DisableAllDaysequenceVolumesInMap();
	void DaySeqVolDebugDump();
	void BndEvt__B_DaySequenceVolume_Parent_DaySequenceModifier_K2Node_ComponentBoundEvent_3_OnPostEnableModifier__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("B_DaySequenceVolume_Parent_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"B_DaySequenceVolume_Parent_C")
	}
	static class AB_DaySequenceVolume_Parent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_DaySequenceVolume_Parent_C>();
	}
};
DUMPER7_ASSERTS_AB_DaySequenceVolume_Parent_C;

}

