#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_MusicPartyRadio

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_MusicPartyRadio.B_MusicPartyRadio_C
// 0x0048 (0x0318 - 0x02D0)
class AB_MusicPartyRadio_C final : public AFortMediaStreamingRadio
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UFortQuartzSynchronizer*                FortQuartzSynchronizer;                            // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UMediaSoundComponent*                   MediaSound;                                        // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Volume_Fader_Vol_B11BB9954EA34D1D418927A0EE62F6E5; // 0x02E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Volume_Fader__Direction_B11BB9954EA34D1D418927A0EE62F6E5; // 0x02EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2ED[0x3];                                      // 0x02ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Volume_Fader;                                      // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          bRadioIsActive;                                    // 0x02F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F9[0x3];                                      // 0x02F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         StationIndex;                                      // 0x02FC(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	class UMusicPartyManagerComponent_C*          Manager;                                           // 0x0300(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, InstancedReference, RepNotify, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	double                                        LastStartStopCall;                                 // 0x0308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        StartStopDebounceTimeS;                            // 0x0310(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Volume_Fader__UpdateFunc();
	void Volume_Fader__FinishedFunc();
	void StopRadio();
	void StopMusicParty();
	void StartRadio();
	void StartMusicParty();
	void ReceiveBeginPlay();
	void OnRep_StationIndex();
	void GetQuartzClock(class UQuartzClockHandle** Quartz_Clock);
	void Fade_In_Media();
	void ExecuteUbergraph_B_MusicPartyRadio(int32 EntryPoint);
	void ChangeStation(int32 Station_Index);
	void BndEvt__B_HollowBasePartyController_FortQuartzSynchronizer_K2Node_ComponentBoundEvent_0_OnTimestampEvent__DelegateSignature(const struct FFortTimestampEvent& Event);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("B_MusicPartyRadio_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"B_MusicPartyRadio_C")
	}
	static class AB_MusicPartyRadio_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_MusicPartyRadio_C>();
	}
};
DUMPER7_ASSERTS_AB_MusicPartyRadio_C;

}

