#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_SparksCosmeticPreviewDisplay

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_SparksCosmeticPreviewDisplay_Base_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_SparksCosmeticPreviewDisplay.B_SparksCosmeticPreviewDisplay_C
// 0x0050 (0x04C0 - 0x0470)
class AB_SparksCosmeticPreviewDisplay_C final : public ABP_SparksCosmeticPreviewDisplay_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0470(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USkeletalMeshComponent*                 MicMesh;                                           // 0x0478(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 LHDrumstick;                                       // 0x0480(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 RHDrumstick;                                       // 0x0488(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 MicStandMesh;                                      // 0x0490(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 DrumMesh;                                          // 0x0498(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 GuitarMesh;                                        // 0x04A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          Is__active;                                        // 0x04A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A9[0x7];                                      // 0x04A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              NewEventDispatcher;                                // 0x04B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void CustomizePreviewInstance(const class UFortItemDefinition* InItemDefinition);
	void ExecuteUbergraph_B_SparksCosmeticPreviewDisplay(int32 EntryPoint);
	void FixupMeshAndMaterials(class USkeletalMeshComponent* MeshComponent, class USkeletalMesh* NewMesh, class UMaterialInstance* Material1, class UMaterialInstance* Material2, class UFXSystemAsset* FX);
	void Hide_all();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("B_SparksCosmeticPreviewDisplay_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"B_SparksCosmeticPreviewDisplay_C")
	}
	static class AB_SparksCosmeticPreviewDisplay_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_SparksCosmeticPreviewDisplay_C>();
	}
};
DUMPER7_ASSERTS_AB_SparksCosmeticPreviewDisplay_C;

}

