#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_SparksOffActorPreview

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SparksCoreRuntime_structs.hpp"
#include "Bp_SparksActorPreviewLightRig_Base_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_SparksOffActorPreview.B_SparksOffActorPreview_C
// 0x00A0 (0x0528 - 0x0488)
class AB_SparksOffActorPreview_C final : public ABp_SparksActorPreviewLightRig_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0488(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USkeletalMeshComponent*                 SampleMesh;                                        // 0x0490(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Arrow;                                             // 0x0498(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDirectionalLightComponent*             DirectionalLight_pc;                               // 0x04A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDirectionalLightComponent*             DirectionalLight_mobile;                           // 0x04A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkyLightComponent*                     SkyLight_mobile;                                   // 0x04B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    RimRight3_pc;                                      // 0x04B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkyLightComponent*                     SkyLight_pc;                                       // 0x04C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    SpotLight_rimlight_pc;                             // 0x04C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    RimRight2_pc;                                      // 0x04D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    RimBottom_pc;                                      // 0x04D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    RimTop_pc;                                         // 0x04E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Lighting;                                          // 0x04E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_HiddenAmount_1D4E289F4B8CA6B6B9F4579D0FE7ABCC; // 0x04F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_1D4E289F4B8CA6B6B9F4579D0FE7ABCC; // 0x04F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F5[0x3];                                      // 0x04F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x04F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline__Direction_941C70EB408D2013A38BD198CDF9688B; // 0x0500(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_501[0x7];                                      // 0x0501(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline;                                          // 0x0508(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Is__active;                                        // 0x0510(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_511[0x7];                                      // 0x0511(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USkeletalMeshComponent*>         SkeletalMeshToResIn;                               // 0x0518(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)

public:
	void ExecuteUbergraph_B_SparksOffActorPreview(int32 EntryPoint);
	void GetInstrumentMeshComponents();
	void HandleLightingSettingsChanged();
	void Light_Control(bool Active);
	void OnAllLODStreamingComplete();
	void OnPreviewVisualsBeginLoading();
	void OnPreviewVisualsSpawned(const bool bUseSecondaryTransitionEffects, const bool bShowFloor);
	void Set_UP_Lighting();
	void Switch_Erebus_Lighting(bool Visibility);
	void Switch_Mobile_Lighting(bool NewParam);
	void Switch_PC_Lighting(bool Visibility);
	void Timeline_0__FinishedFunc();
	void Timeline_0__UpdateFunc();
	void Timeline__FinishedFunc();
	void Timeline__LoadingFXOutro__EventFunc();
	void Timeline__PlayResIn__EventFunc();
	void Timeline__ShowPawn__EventFunc();
	void Timeline__UpdateFunc();
	void UpdateSettings();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("B_SparksOffActorPreview_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"B_SparksOffActorPreview_C")
	}
	static class AB_SparksOffActorPreview_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_SparksOffActorPreview_C>();
	}
};
DUMPER7_ASSERTS_AB_SparksOffActorPreview_C;

}

