#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BattleRoyaleFrontend

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class BattleRoyaleFrontend.BattleRoyaleFrontendExperienceFlow
// 0x0108 (0x0130 - 0x0028)
class UBattleRoyaleFrontendExperienceFlow : public UObject
{
public:
	uint8                                         Pad_28[0x20];                                      // 0x0028(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         DefaultFlowStepArray;                              // 0x0048(0x0010)(ZeroConstructor, Config, NativeAccessSpecifierPrivate)
	TArray<class FString>                         FirstTimeSeasonFlowStepArray;                      // 0x0058(0x0010)(ZeroConstructor, Config, NativeAccessSpecifierPrivate)
	TMap<class FString, class FString>            BRVideoRating;                                     // 0x0068(0x0050)(Config, NativeAccessSpecifierPrivate)
	uint8                                         Pad_B8[0x8];                                       // 0x00B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftClassPtr<class UClass>                   VideoPlayerClass;                                  // 0x00C0(0x0020)(Edit, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortStreamMediaSource*                 VideoStream_Source;                                // 0x00E0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UHabaneroIntroModal>        HabaneroIntroModalClass;                           // 0x00E8(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftClassPtr<class UClass>                   FireModeSelectionReminderModalClass;               // 0x00F0(0x0020)(Edit, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftClassPtr<class UClass>                   FireModeSelectionScreenClass;                      // 0x0110(0x0020)(Edit, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BattleRoyaleFrontendExperienceFlow")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BattleRoyaleFrontendExperienceFlow")
	}
	static class UBattleRoyaleFrontendExperienceFlow* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBattleRoyaleFrontendExperienceFlow>();
	}
};
DUMPER7_ASSERTS_UBattleRoyaleFrontendExperienceFlow;

}

