#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AthenaFullScreenMapBrowsingControlsWidget

#include "Basic.hpp"

#include "CommonInput_structs.hpp"


namespace SDK::Params
{

// Function BP_AthenaFullScreenMapBrowsingControlsWidget.BP_AthenaFullScreenMapBrowsingControlsWidget_C.OnInputMethodChanged
// 0x0001 (0x0001 - 0x0000)
struct BP_AthenaFullScreenMapBrowsingControlsWidget_C_OnInputMethodChanged final
{
public:
	bool                                          isGamepad;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_AthenaFullScreenMapBrowsingControlsWidget_C_OnInputMethodChanged;

// Function BP_AthenaFullScreenMapBrowsingControlsWidget.BP_AthenaFullScreenMapBrowsingControlsWidget_C.ExecuteUbergraph_BP_AthenaFullScreenMapBrowsingControlsWidget
// 0x0030 (0x0030 - 0x0000)
struct BP_AthenaFullScreenMapBrowsingControlsWidget_C_ExecuteUbergraph_BP_AthenaFullScreenMapBrowsingControlsWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool bUsingGamepad)>           K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              CallFunc_GetCurrentInputType_ReturnValue;          // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_IsGamePad;                      // 0x001F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool bUsingGamepad)>           K2Node_CreateDelegate_OutputDelegate_1;            // 0x0020(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_AthenaFullScreenMapBrowsingControlsWidget_C_ExecuteUbergraph_BP_AthenaFullScreenMapBrowsingControlsWidget;

}

