#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AthenaQuestPanel

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function BP_AthenaQuestPanel.BP_AthenaQuestPanel_C.UpdateXPBarCollapsedState
// 0x0001 (0x0001 - 0x0000)
struct BP_AthenaQuestPanel_C_UpdateXPBarCollapsedState final
{
public:
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_AthenaQuestPanel_C_UpdateXPBarCollapsedState;

// Function BP_AthenaQuestPanel.BP_AthenaQuestPanel_C.UpdateCosmeticGateText
// 0x0048 (0x0048 - 0x0000)
struct BP_AthenaQuestPanel_C_UpdateCosmeticGateText final
{
public:
	TArray<struct FFortItemQuantityPair>          ItemQuantityPairs;                                 // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class ULocalPlayer*                           CallFunc_GetOwningLocalPlayer_ReturnValue;         // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<TScriptInterface<class ICosmeticItemGatingInterface>> CallFunc_ConvertItemQuantityPairsToCosmeticGatingInterfaces_OutCosmeticItemGatingInterfaces; // 0x0018(0x0010)(ReferenceParm)
	class FText                                   CallFunc_GetOfferRatingRestrictionText_ReturnValue; // 0x0028(0x0018)()
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_AthenaQuestPanel_C_UpdateCosmeticGateText;

// Function BP_AthenaQuestPanel.BP_AthenaQuestPanel_C.SetXPBarVisibility
// 0x0005 (0x0005 - 0x0000)
struct BP_AthenaQuestPanel_C_SetXPBarVisibility final
{
public:
	bool                                          ShouldHide;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_AthenaQuestPanel_C_SetXPBarVisibility;

// Function BP_AthenaQuestPanel.BP_AthenaQuestPanel_C.OnUpdateScrollPosition
// 0x0008 (0x0008 - 0x0000)
struct BP_AthenaQuestPanel_C_OnUpdateScrollPosition final
{
public:
	class UWidget*                                WidgetToScroll;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_AthenaQuestPanel_C_OnUpdateScrollPosition;

// Function BP_AthenaQuestPanel.BP_AthenaQuestPanel_C.ExecuteUbergraph_BP_AthenaQuestPanel
// 0x0088 (0x0088 - 0x0000)
struct BP_AthenaQuestPanel_C_ExecuteUbergraph_BP_AthenaQuestPanel final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFortItemQuantityPair>          K2Node_Event_ItemQuantityPairs;                    // 0x0008(0x0010)(ConstParm, ReferenceParm)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_1;         // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                K2Node_Event_WidgetToScroll;                       // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsQuestsTabActive_ReturnValue;            // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGlobalUIContext*                   CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInZone_ReturnValue;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_53[0x5];                                       // 0x0053(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGlobalUIContext*                   CallFunc_GetLocalPlayerSubsystem_ReturnValue_1;    // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInZone_ReturnValue_1;                   // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_1;               // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_AthenaQuestPanel_C_ExecuteUbergraph_BP_AthenaQuestPanel;

// Function BP_AthenaQuestPanel.BP_AthenaQuestPanel_C.BP_UpdateCosmeticAgeGate
// 0x0010 (0x0010 - 0x0000)
struct BP_AthenaQuestPanel_C_BP_UpdateCosmeticAgeGate final
{
public:
	TArray<struct FFortItemQuantityPair>          ItemQuantityPairs;                                 // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
DUMPER7_ASSERTS_BP_AthenaQuestPanel_C_BP_UpdateCosmeticAgeGate;

// Function BP_AthenaQuestPanel.BP_AthenaQuestPanel_C.BndEvt__BP_AthenaQuestPanel_Button_Progression_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_AthenaQuestPanel_C_BndEvt__BP_AthenaQuestPanel_Button_Progression_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_AthenaQuestPanel_C_BndEvt__BP_AthenaQuestPanel_Button_Progression_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature;

// Function BP_AthenaQuestPanel.BP_AthenaQuestPanel_C.BndEvt__BP_AthenaQuestPanel_Button_Progression_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_AthenaQuestPanel_C_BndEvt__BP_AthenaQuestPanel_Button_Progression_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_AthenaQuestPanel_C_BndEvt__BP_AthenaQuestPanel_Button_Progression_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature;

}

