#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AthenaMapPlayerEliminations

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function BP_AthenaMapPlayerEliminations.BP_AthenaMapPlayerEliminations_C.UpdateRankedProgress
// 0x0018 (0x0018 - 0x0000)
struct BP_AthenaMapPlayerEliminations_C_UpdateRankedProgress final
{
public:
	struct FRankedProgressReplicatedData          RankedProgress;                                    // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
DUMPER7_ASSERTS_BP_AthenaMapPlayerEliminations_C_UpdateRankedProgress;

// Function BP_AthenaMapPlayerEliminations.BP_AthenaMapPlayerEliminations_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct BP_AthenaMapPlayerEliminations_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_AthenaMapPlayerEliminations_C_PreConstruct;

// Function BP_AthenaMapPlayerEliminations.BP_AthenaMapPlayerEliminations_C.ExecuteUbergraph_BP_AthenaMapPlayerEliminations
// 0x0158 (0x0158 - 0x0000)
struct BP_AthenaMapPlayerEliminations_C_ExecuteUbergraph_BP_AthenaMapPlayerEliminations final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0004(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0018(0x0014)()
	bool                                          K2Node_Event_IsDesignTime;                         // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRankedProgressReplicatedData          K2Node_Event_RankedProgress;                       // 0x0030(0x0018)(ConstParm)
	bool                                          Temp_bool_Variable;                                // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortHabaneroModeList                  CallFunc_Map_Find_Value;                           // 0x0050(0x0010)()
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_Select_Default;                             // 0x0064(0x0014)()
	struct FFortHabaneroTier                      CallFunc_Array_Get_Item;                           // 0x0078(0x00E0)()
};
DUMPER7_ASSERTS_BP_AthenaMapPlayerEliminations_C_ExecuteUbergraph_BP_AthenaMapPlayerEliminations;

}

