#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Commerce_TastingRoomBar_A_A

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Artemis_WildWest_StandingBar_A_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Commerce_TastingRoomBar_A_A.BP_Commerce_TastingRoomBar_A_A_C
// 0x0030 (0x0C70 - 0x0C40)
class ABP_Commerce_TastingRoomBar_A_A_C final : public AArtemis_WildWest_StandingBar_A_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_Commerce_TastingRoomBar_A_A_C;   // 0x0C40(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBoxComponent*                          Box3;                                              // 0x0C48(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Box2;                                              // 0x0C50(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Box1;                                              // 0x0C58(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Box;                                               // 0x0C60(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHierarchicalInstancedStaticMeshComponent* HierarchicalInstancedStaticMesh;                // 0x0C68(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ReceiveDestroyed();
	void ExecuteUbergraph_BP_Commerce_TastingRoomBar_A_A(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Commerce_TastingRoomBar_A_A_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Commerce_TastingRoomBar_A_A_C")
	}
	static class ABP_Commerce_TastingRoomBar_A_A_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Commerce_TastingRoomBar_A_A_C>();
	}
};
DUMPER7_ASSERTS_ABP_Commerce_TastingRoomBar_A_A_C;

}

