#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CropRow

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_CropRow.BP_CropRow_C.SetBillBoardLocation
// 0x0130 (0x0130 - 0x0000)
struct BP_CropRow_C_SetBillBoardLocation final
{
public:
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0000(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAtSplinePoint_ReturnValue;     // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x0048(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
DUMPER7_ASSERTS_BP_CropRow_C_SetBillBoardLocation;

// Function BP_CropRow.BP_CropRow_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_CropRow_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_CropRow_C_ReceiveTick;

// Function BP_CropRow.BP_CropRow_C.GetSimpleDestructiblePropResourceType
// 0x0001 (0x0001 - 0x0000)
struct BP_CropRow_C_GetSimpleDestructiblePropResourceType final
{
public:
	EFortResourceType                             OutResourceType;                                   // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_CropRow_C_GetSimpleDestructiblePropResourceType;

// Function BP_CropRow.BP_CropRow_C.GetSimpleDestructiblePropComponents
// 0x0030 (0x0030 - 0x0000)
struct BP_CropRow_C_GetSimpleDestructiblePropComponents final
{
public:
	TArray<class UStaticMeshComponent*>           StaticMeshComponents;                              // 0x0000(0x0010)(Parm, OutParm, ContainsInstancedReference)
	class UInstancedStaticMeshComponent*          CallFunc_GetComponentByClass_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UStaticMeshComponent*>           K2Node_MakeArray_Array;                            // 0x0018(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_CropRow_C_GetSimpleDestructiblePropComponents;

// Function BP_CropRow.BP_CropRow_C.GetSimpleDestructiblePropCollisionMask
// 0x0004 (0x0004 - 0x0000)
struct BP_CropRow_C_GetSimpleDestructiblePropCollisionMask final
{
public:
	int32                                         OutCollisionMask;                                  // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_CropRow_C_GetSimpleDestructiblePropCollisionMask;

// Function BP_CropRow.BP_CropRow_C.ExecuteUbergraph_BP_CropRow
// 0x0008 (0x0008 - 0x0000)
struct BP_CropRow_C_ExecuteUbergraph_BP_CropRow final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_CropRow_C_ExecuteUbergraph_BP_CropRow;

}

