#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CalendarEventBase

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_CalendarEventBase.BP_CalendarEventBase_C
// 0x0030 (0x02C0 - 0x0290)
class ABP_CalendarEventBase_C : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          bIgnoreInCreative;                                 // 0x02A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A1[0x7];                                      // 0x02A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         EventNames;                                        // 0x02A8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          bUpdateInMatch;                                    // 0x02B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ReceiveBeginPlay();
	void OnSyncComplete_D9042C214A6830968D37BE8205A0A38E();
	void OnReady_D8A6649C4DDF823D6E8B578302D553F6(class AFortGameStateAthena* GameState, const class UFortPlaylist* Playlist, const struct FGameplayTagContainer& PlaylistContextTags);
	void OnInitialNavSystemBuildLockCompleted_0051055C4811AF91412FC0BDF1F33E45();
	void OnEventUpdated_43448D714C5D2D0B4A20B8A42D2586AA(const class FString& EventName, const struct FTimespan& TimeUntilEnd, const struct FTimespan& TimeSinceBegin, float TimespanRatio);
	void OnEventEnded_43448D714C5D2D0B4A20B8A42D2586AA(const class FString& EventName, const struct FTimespan& TimeUntilEnd, const struct FTimespan& TimeSinceBegin, float TimespanRatio);
	void OnEventActive_43448D714C5D2D0B4A20B8A42D2586AA(const class FString& EventName, const struct FTimespan& TimeUntilEnd, const struct FTimespan& TimeSinceBegin, float TimespanRatio);
	void HandleEventEnded(const class FString& EventName);
	void HandleEventActive(const class FString& EventName);
	void GetEventNames(TArray<class FString>* EventNames_0);
	void ExecuteUbergraph_BP_CalendarEventBase(int32 EntryPoint);
	void CanUpdateInMatch(bool* bCanUpdateInMatch);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_CalendarEventBase_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_CalendarEventBase_C")
	}
	static class ABP_CalendarEventBase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_CalendarEventBase_C>();
	}
};
DUMPER7_ASSERTS_ABP_CalendarEventBase_C;

}

