#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Container_Boxes_D

#include "Basic.hpp"

#include "Graybox_Prop_Small_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Container_Boxes_D.BP_Container_Boxes_D_C
// 0x0028 (0x0BF8 - 0x0BD0)
class ABP_Container_Boxes_D_C final : public AGraybox_Prop_Small_C
{
public:
	class UBoxComponent*                          Box3;                                              // 0x0BD0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Box2;                                              // 0x0BD8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Box1;                                              // 0x0BE0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Box;                                               // 0x0BE8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHierarchicalInstancedStaticMeshComponent* HierarchicalInstancedStaticMesh;                // 0x0BF0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Container_Boxes_D_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Container_Boxes_D_C")
	}
	static class ABP_Container_Boxes_D_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Container_Boxes_D_C>();
	}
};
DUMPER7_ASSERTS_ABP_Container_Boxes_D_C;

}

