#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Container_JuiceBottlesCase_B

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Graybox_Prop_Small_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Container_JuiceBottlesCase_B.BP_Container_JuiceBottlesCase_B_C
// 0x0040 (0x0C10 - 0x0BD0)
class ABP_Container_JuiceBottlesCase_B_C final : public AGraybox_Prop_Small_C
{
public:
	class UStaticMeshComponent*                   SM_Container_JuiceBottles_D5;                      // 0x0BD0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Container_JuiceBottles_D4;                      // 0x0BD8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Container_JuiceBottles_D3;                      // 0x0BE0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Container_JuiceBottles_D2;                      // 0x0BE8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Container_JuiceBottles_D1;                      // 0x0BF0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Container_JuiceBottles_D;                       // 0x0BF8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           TintColor;                                         // 0x0C00(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Container_JuiceBottlesCase_B_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Container_JuiceBottlesCase_B_C")
	}
	static class ABP_Container_JuiceBottlesCase_B_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Container_JuiceBottlesCase_B_C>();
	}
};
DUMPER7_ASSERTS_ABP_Container_JuiceBottlesCase_B_C;

}

