#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Default_Ambient

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Default_Ambient.BP_Default_Ambient_C
// 0x0028 (0x02B8 - 0x0290)
class ABP_Default_Ambient_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAmbientAudioComponent*                 AmbientAudio_Weather;                              // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAmbientAudioDataAsset*                 DefaultAudioBank;                                  // 0x02A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         DefaultAudioBankPriority;                          // 0x02B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   AmbientName;                                       // 0x02B4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void WeatherComponentReady(class UFortTimeOfDayWeatherComponent* WeatherComponent);
	void WeatherChanged(EGlobalWeatherState WeatherState, const struct FFortReplicatedWeatherEventData& WeatherData);
	void SetWeatherTags(int32 Selection);
	void ReceiveBeginPlay();
	void OnReady_C65C4919436D0ED92141E6913B3C3C6D(TScriptInterface<class IFortTimeOfDayManagerInterface> TimeOfDayManager);
	void ExecuteUbergraph_BP_Default_Ambient(int32 EntryPoint);
	void ClearFogTags();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Default_Ambient_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Default_Ambient_C")
	}
	static class ABP_Default_Ambient_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Default_Ambient_C>();
	}
};
DUMPER7_ASSERTS_ABP_Default_Ambient_C;

}

