#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Default_Ambient

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function BP_Default_Ambient.BP_Default_Ambient_C.WeatherComponentReady
// 0x0008 (0x0008 - 0x0000)
struct BP_Default_Ambient_C_WeatherComponentReady final
{
public:
	class UFortTimeOfDayWeatherComponent*         WeatherComponent;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Default_Ambient_C_WeatherComponentReady;

// Function BP_Default_Ambient.BP_Default_Ambient_C.WeatherChanged
// 0x0018 (0x0018 - 0x0000)
struct BP_Default_Ambient_C_WeatherChanged final
{
public:
	EGlobalWeatherState                           WeatherState;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortReplicatedWeatherEventData        WeatherData;                                       // 0x0004(0x0014)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
DUMPER7_ASSERTS_BP_Default_Ambient_C_WeatherChanged;

// Function BP_Default_Ambient.BP_Default_Ambient_C.SetWeatherTags
// 0x0010 (0x0010 - 0x0000)
struct BP_Default_Ambient_C_SetWeatherTags final
{
public:
	int32                                         Selection;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAmbientAudioSubsystem*                 CallFunc_GetWorldSubsystem_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Default_Ambient_C_SetWeatherTags;

// Function BP_Default_Ambient.BP_Default_Ambient_C.OnReady_C65C4919436D0ED92141E6913B3C3C6D
// 0x0010 (0x0010 - 0x0000)
struct BP_Default_Ambient_C_OnReady_C65C4919436D0ED92141E6913B3C3C6D final
{
public:
	TScriptInterface<class IFortTimeOfDayManagerInterface> TimeOfDayManager;                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Default_Ambient_C_OnReady_C65C4919436D0ED92141E6913B3C3C6D;

// Function BP_Default_Ambient.BP_Default_Ambient_C.ExecuteUbergraph_BP_Default_Ambient
// 0x00A8 (0x00A8 - 0x0000)
struct BP_Default_Ambient_C_ExecuteUbergraph_BP_Default_Ambient final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAmbientAudioSubsystem*                 CallFunc_GetWorldSubsystem_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UFortAsyncAction_TimeOfDayManagerReady* CallFunc_GetTimeOfDayManagerReady_ReturnValue;     // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IFortTimeOfDayManagerInterface> Temp_interface_Variable;                  // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortTimeOfDayWeatherComponent*         CallFunc_GetWeatherComponent_ReturnValue;          // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UFortTimeOfDayWeatherComponent* WeatherComponent)> K2Node_CreateDelegate_OutputDelegate; // 0x0038(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsNullItem_Is_Null_Item;                  // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortTimeOfDayWeatherComponent*         K2Node_CustomEvent_WeatherComponent;               // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EGlobalWeatherState WeatherState, const struct FFortReplicatedWeatherEventData& WeatherData)> K2Node_CreateDelegate_OutputDelegate_1; // 0x0050(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EGlobalWeatherState                           K2Node_CustomEvent_WeatherState;                   // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortReplicatedWeatherEventData        K2Node_CustomEvent_WeatherData;                    // 0x0060(0x0014)(NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EGlobalWeatherState WeatherState, const struct FFortReplicatedWeatherEventData& WeatherData)> K2Node_CreateDelegate_OutputDelegate_2; // 0x0078(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_85[0x3];                                       // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IFortTimeOfDayManagerInterface> K2Node_CustomEvent_TimeOfDayManager;      // 0x0088(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TDelegate<void(TScriptInterface<class IFortTimeOfDayManagerInterface> TimeOfDayManager)> K2Node_CreateDelegate_OutputDelegate_3; // 0x0098(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Default_Ambient_C_ExecuteUbergraph_BP_Default_Ambient;

// Function BP_Default_Ambient.BP_Default_Ambient_C.ClearFogTags
// 0x0008 (0x0008 - 0x0000)
struct BP_Default_Ambient_C_ClearFogTags final
{
public:
	class UAmbientAudioSubsystem*                 CallFunc_GetWorldSubsystem_ReturnValue;            // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Default_Ambient_C_ClearFogTags;

}

