#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Explorers_Parachutes_A_A

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Apollo_Industrial_ShippingContainer_01_classes.hpp"
#include "ENUM_ParachuteColors_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Explorers_Parachutes_A_A.BP_Explorers_Parachutes_A_A_C
// 0x0040 (0x0D40 - 0x0D00)
#pragma pack(push, 0x1)
class alignas(0x08) ABP_Explorers_Parachutes_A_A_C : public AApollo_Industrial_ShippingContainer_01_C
{
public:
	class UStaticMeshComponent*                   Parachute;                                         // 0x0D00(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Color;                                             // 0x0D08(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_ParachuteColors                          ParachuteColor;                                    // 0x0D18(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D19[0x7];                                      // 0x0D19(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMesh*                            ParachuteMesh;                                     // 0x0D20(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CustomColor;                                       // 0x0D28(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ExposeOnSpawn;                                     // 0x0D38(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();
	void SelectColor();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Explorers_Parachutes_A_A_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Explorers_Parachutes_A_A_C")
	}
	static class ABP_Explorers_Parachutes_A_A_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Explorers_Parachutes_A_A_C>();
	}
};
#pragma pack(pop)
DUMPER7_ASSERTS_ABP_Explorers_Parachutes_A_A_C;

}

