#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Lightsource_CH5_GlobalProp_Parent

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function BP_Lightsource_CH5_GlobalProp_Parent.BP_Lightsource_CH5_GlobalProp_Parent_C.UserConstructionScript
// 0x0001 (0x0001 - 0x0000)
struct BP_Lightsource_CH5_GlobalProp_Parent_C_UserConstructionScript final
{
public:
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Lightsource_CH5_GlobalProp_Parent_C_UserConstructionScript;

// Function BP_Lightsource_CH5_GlobalProp_Parent.BP_Lightsource_CH5_GlobalProp_Parent_C.GetTimeOfDayBlueprintDefaultVariables
// 0x0050 (0x0050 - 0x0000)
struct BP_Lightsource_CH5_GlobalProp_Parent_C_GetTimeOfDayBlueprintDefaultVariables final
{
public:
	struct FTimeOfDayBlueprintDefaultVariables    OutVariables;                                      // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
	struct FTimeOfDayBlueprintDefaultVariables    K2Node_MakeStruct_TimeOfDayBlueprintDefaultVariables; // 0x0010(0x0010)(NoDestructor)
	TArray<class ULightComponent*>                CallFunc_K2_GetComponentsByClass_ReturnValue;      // 0x0020(0x0010)(ReferenceParm, ContainsInstancedReference)
	class ULightComponent*                        CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsEmpty_ReturnValue;                // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimeOfDayBlueprintDefaultVariables    K2Node_MakeStruct_TimeOfDayBlueprintDefaultVariables_1; // 0x0040(0x0010)(NoDestructor)
};
DUMPER7_ASSERTS_BP_Lightsource_CH5_GlobalProp_Parent_C_GetTimeOfDayBlueprintDefaultVariables;

// Function BP_Lightsource_CH5_GlobalProp_Parent.BP_Lightsource_CH5_GlobalProp_Parent_C.CollectAssetReferencesToAllow
// 0x0070 (0x0070 - 0x0000)
struct BP_Lightsource_CH5_GlobalProp_Parent_C_CollectAssetReferencesToAllow final
{
public:
	struct FFortExposedAssetReferenceCollector    Collector;                                         // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMaterialInterface*>             CallFunc_GetMaterials_ReturnValue;                 // 0x0028(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     CallFunc_Array_Get_Item;                           // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UMaterialInterface>      CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue; // 0x0050(0x0020)(UObjectWrapper, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Lightsource_CH5_GlobalProp_Parent_C_CollectAssetReferencesToAllow;

// Function BP_Lightsource_CH5_GlobalProp_Parent.BP_Lightsource_CH5_GlobalProp_Parent_C.BuildExposedAssetProviderVersion
// 0x0004 (0x0004 - 0x0000)
struct BP_Lightsource_CH5_GlobalProp_Parent_C_BuildExposedAssetProviderVersion final
{
public:
	struct FFortExposedAssetProviderVersion       Version;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
DUMPER7_ASSERTS_BP_Lightsource_CH5_GlobalProp_Parent_C_BuildExposedAssetProviderVersion;

}

