#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Milkshake_EarthquakeDebug

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Milkshake_EarthquakeDebug.BP_Milkshake_EarthquakeDebug_C
// 0x0090 (0x0320 - 0x0290)
class ABP_Milkshake_EarthquakeDebug_C final : public AActor
{
public:
	class UStaticMeshComponent*                   DebugSphereGreen;                                  // 0x0290(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   DebugSphereRed;                                    // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UTextRenderComponent*                   DebugText;                                         // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   DebugSphereOuter;                                  // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        SphereGreen_Radius;                                // 0x02B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        RadiusToScaleRatio;                                // 0x02C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   EarthquakeText;                                    // 0x02C8(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	double                                        SphereRed_Radius;                                  // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SphereRed_Location;                                // 0x02E8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	double                                        SphereOuterRadius;                                 // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	struct FVector                                SphereGreen_Location;                              // 0x0308(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void UserConstructionScript();
	void DestroyComponents(TArray<class UActorComponent*>& Components);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Milkshake_EarthquakeDebug_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Milkshake_EarthquakeDebug_C")
	}
	static class ABP_Milkshake_EarthquakeDebug_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Milkshake_EarthquakeDebug_C>();
	}
};
DUMPER7_ASSERTS_ABP_Milkshake_EarthquakeDebug_C;

}

