#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Milkshake_Earthquake

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "MilkshakeEarthquakeInfoStruct_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "MilkshakeRuntime_classes.hpp"
#include "MilkshakeEarthquakeRepInfoStruct_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Milkshake_Earthquake.BP_Milkshake_Earthquake_C
// 0x0560 (0x08A0 - 0x0340)
class ABP_Milkshake_Earthquake_C final : public AMilkshakeEarthquakeActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0340(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UFortAutoRegisterActorComponent*        FortAutoRegisterActor;                             // 0x0348(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0350(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         MovementTimeline_Alpha_FE7B572A48B4D841E70D269915DCAA70; // 0x0358(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            MovementTimeline__Direction_FE7B572A48B4D841E70D269915DCAA70; // 0x035C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35D[0x3];                                      // 0x035D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     MovementTimeline;                                  // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          bEarthquakeActive;                                 // 0x0368(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_369[0x7];                                      // 0x0369(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMilkshakeEarthquakeRepInfoStruct      EarthquakeRepInfo;                                 // 0x0370(0x0020)(Edit, BlueprintVisible, Net, DisableEditOnInstance, RepNotify, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           EarthquakeDurationTimerHandle;                     // 0x0390(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ABP_MilkshakeFieldSystemActor_C*        RadialForce;                                       // 0x0398(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        MovementStartLocation;                             // 0x03A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MovementEndSplineAlpha;                            // 0x03A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Milkshake_Spline_Earthquake_C*      SplineActor;                                       // 0x03B0(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	double                                        RadialForceStrength;                               // 0x03B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        RadialForceStartAndEndDurationRatio;               // 0x03C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         DamageNextBuildingSetInterval;                     // 0x03C8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         BuildingActorsDamageTaskInterval;                  // 0x03F0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FTimerHandle                           AsyncOverlapTraceTimerHandle;                      // 0x0418(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           BuildingActorsDamageTimerHandle;                   // 0x0420(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class ABuildingSMActor*>               BuildingActorsToDamageForCurrentTask;              // 0x0428(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	bool                                          bBuildingActorsDamageTaskRunning;                  // 0x0438(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_439[0x7];                                      // 0x0439(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         MaxNumberOfBuildingActorsToDamageEverySet;         // 0x0440(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FName                                   EarthquakeIdentificationName;                      // 0x0468(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_46C[0x4];                                      // 0x046C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCurveFloat*                            BuildingDamageNeverDestroyCurve;                   // 0x0470(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        BuildingDamageSpreadThresholdHealthPercent;        // 0x0478(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSubclassOf<class UGameplayEffect>            EarthquakeEnvironmentDamageGE;                     // 0x0480(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	struct FScalableFloat                         BuildingDamageSpreadThresholdHealthPercent_SF;     // 0x0488(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          bAsyncOverlapTraceInProgress;                      // 0x04B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B1[0x3];                                      // 0x04B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   EarthquakeDamageBuildingActorTag;                  // 0x04B4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 EarthquakeDamageBuildingActorTagSuffix;            // 0x04B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	struct FScalableFloat                         AsyncOverlapTraceUpdateInterval;                   // 0x04C8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         MaxNumOfActorsToLoopPerDelayDurationConst;         // 0x04F0(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   EarthquakePhysicsActorTag;                         // 0x04F4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 EarthquakePhysicsActorTagSuffix;                   // 0x04F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	struct FMilkshakeEarthquakeInfoStruct         ServerEarthquakeInfoStruct;                        // 0x0508(0x00E0)(Edit, BlueprintVisible, ExposeOnSpawn, HasGetValueTypeHash)
	class UBP_MilkshakeEarthquakeManagerComponent_C* OwningEarthquakeComponent;                      // 0x05E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	double                                        QuakeFXParamUpdateInterval;                        // 0x05F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         QuakeFXSystem;                                     // 0x05F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      QuakeFX;                                           // 0x0600(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 BuildingDamageNeverDestroyGameplayEffectClass;     // 0x0608(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UCurveFloat*                            BuildingDamageDestroyCurve;                        // 0x0610(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UCurveFloat*                            PlayerBuildingDamageCurve;                         // 0x0618(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 BuildingDamageDestroyGameplayEffectClass;          // 0x0620(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<EFortBuildingType>                     BuildingTypesNeverDestroy;                         // 0x0628(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTag                           EarthquakeReactActorTag;                           // 0x0638(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_63C[0x4];                                      // 0x063C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_Milkshake_React_Parent_C*>   RegisteredEarthquakeReactActors;                   // 0x0640(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	double                                        UpdateEarthquakeReactActorsOverlapStatusInterval;  // 0x0650(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Milkshake_EarthquakeDebug_C*        Cheat_RadiusSphere;                                // 0x0658(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TSubclassOf<class UGameplayEffect>            InsideDangerEffect;                                // 0x0660(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	double                                        AdditionalDangerRadius;                            // 0x0668(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         bAllowAIDanager;                                   // 0x0670(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         NumOfPhysicsTreesAllowDestroy;                     // 0x0698(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69C[0x4];                                      // 0x069C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         MaxNumOfPhysicsTreesAllowDestroy;                  // 0x06A0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	class ABP_Milkshake_RandomEarthquakeSpawner_C* RandomEarthquakeSpawner;                          // 0x06C8(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class ABP_Milkshake_RandomEarthquakeManager_C* RandomEarthquakeManager;                          // 0x06D0(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class FName                                   EarthquakeAudioParameterName;                      // 0x06D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6DC[0x4];                                      // 0x06DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             Earthquake_Sound;                                  // 0x06E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        Earthquake_Audio_Component;                        // 0x06E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        Earthquake_Fade_Out_Duration;                      // 0x06F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAudioFaderCurve                              Earthquake_Fade_Curve;                             // 0x06F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6F9[0x7];                                      // 0x06F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        DelayBeforeQuakeFXSpawn;                           // 0x0700(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ABuildingSMActor*>               BuildingActorsToDamageForCurrentTaskLoop;          // 0x0708(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	TArray<class ABuildingSMActor*>               NeighboringBuildingActorsToDamageForCurrentTask;   // 0x0718(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	struct FGameplayTagQuery                      QueryBuildingActorAlwaysDestroyable;               // 0x0728(0x0048)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTagQuery                      QueryBuildingActorNeverDestroyable;                // 0x0770(0x0048)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         BuildingDamageDestroyChanceWeightMultiplier;       // 0x07B8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         BuildingDamageMultiplier;                          // 0x07E0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTagQuery                      QueryBuildingActorConsiderOnGround;                // 0x0808(0x0048)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         PlayerBuildingDamageMulitplier;                    // 0x0850(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         NonPlayerBuildingDamageMulitplier;                 // 0x0878(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void UpdateRegisteredReactActorsOverlapStatus();
	void UpdateQuakeFXParams();
	void UnregisterActorFromEarthquakePhysicsForces(class AActor* Actor);
	void TickLifetime();
	void TickDebugEarthquake();
	void StartNextBuildingActorsDamageTask();
	void StartDamageBuildingActors();
	void SpawnRadialForceActor();
	void SetupUniqueActorTagNameVariables();
	void SetReplicatedEarthquakeInfo();
	void SetRegisterToPlayerControllerComponents(bool bRegister);
	void SetEnableDangerGameplayEffectOnAI(class AActor* Actor, bool bEnable);
	void SetDamageTypeGameplayEffectForBuildingActor(class ABuildingSMActor* BuildingActor);
	void RunAsyncOverlapTrace();
	void RemoveEarthquakeReactActorListeners();
	void RemoveActorTagFromActors(TArray<class AActor*>& Actors, const class FName& ActorTag);
	void RegisterActorForEarthquakePhysicsForces_(class AActor* Actor);
	void ReceiveTick(float DeltaSeconds);
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void ReceiveBeginPlay();
	void OnRep_EarthquakeRepInfo();
	void OnActorRemovedFromAsyncOverlappedActors(class AActor* RemovedActor);
	void MovementTimeline__UpdateFunc();
	void MovementTimeline__FinishedFunc();
	void IsVehicleOnGround(class AFortAthenaVehicle* Vehicle, bool* bOnGround);
	void IsDebugEnabled(bool* bEnabled, bool* bDrawDebugOutlines);
	void IsActorWithinEarthquakeRadius(class AActor* Actor, bool* bWithinRadius);
	void HandleOverlappedActorDestroyed(class AActor* DestroyedActor);
	void HandleEarthquakeReactActorUnregistered(const struct FGameplayTag& GameplayTag, class AActor* UnregisteredActor);
	void HandleEarthquakeReactActorRegistered(const struct FGameplayTag& GameplayTag, class AActor* RegisteredActor);
	void HandleEarthquakeDurationComplete();
	void HandleActorEndAsyncOverlap(class AActor* Actor);
	void HandleActorBeginAsyncOverlap(class AActor* Actor);
	float GetNormalizedMagnitudeAtLocation(const struct FVector& Location);
	void GetNormalizedEarthquakeStrength(double* Value);
	void GetNormalizedEarthquakeMagnitudeAtLocation(const struct FVector& Location, double* Alpha);
	void GetNormalizedDistanceBetweenLocationAndEarthquake(const struct FVector& Location, double* Alpha);
	void GetNeighboringActorsAsBuildingActors(const struct FBuildingNeighboringActorInfo& Info, TArray<class ABuildingSMActor*>* BuildingActors);
	void GetEventName(class FString* Name_0);
	void GetEarthquakeTimeElapsed(double* Value);
	void GetEarthquakeInfo(struct FMilkshakeEarthquakeInfoStruct* ServerInfo, struct FMilkshakeEarthquakeRepInfoStruct* RepInfo);
	void GetBuildingDamageMultiplier(class ABuildingActor* BuildingActor, double* Value);
	class UClass* GetBuildingDamageGameplayEffectClassToUse(class ABuildingActor* BuildingActor);
	void GenerateNextForceDirectionUpdateTime(double* Value);
	void GenerateNewForceDirectionForPhysicsActor(class AActor* Actor, const struct FVector& PreviousForceDirection, struct FVector* NewForceDirection);
	void ExecuteUbergraph_BP_Milkshake_Earthquake(int32 EntryPoint);
	void DamageBuildingActor(class ABuildingSMActor* BuildingActor, TArray<class ABuildingSMActor*>* NeighboringBuildingActorsToDamage);
	void Cheat_SpawnRadiusSphere();
	void CanActorSimulateEarthquakePhysicsForces(const class AActor* Actor, bool* bCanSimulate);
	void BeginEarthquake();
	void AsyncOverlapTrace_ShouldCancelProgress(bool* ShouldCancel);
	void AsyncOverlapTrace_ProcessHitActor(class AActor* HitActor);
	void AsyncOverlapTrace_Completion(bool WasCancelled);
	void AddEarthquakeReactActorListeners();
	void AddBuildingActorToDamage(class ABuildingSMActor* BuildingActor, bool* bSuccess);

	float GetRadius() const;
	struct FBox GetDangerSourceBounds() const;
	bool GetDangerSourceActive() const;
	float GetDangerAtLocation(const struct FVector& Location) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Milkshake_Earthquake_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Milkshake_Earthquake_C")
	}
	static class ABP_Milkshake_Earthquake_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Milkshake_Earthquake_C>();
	}
};
DUMPER7_ASSERTS_ABP_Milkshake_Earthquake_C;

}

