#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Milkshake_RandomEarthquakeManager

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "GameplayAbilities_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "MilkshakeCalendarEventInfoStruct_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "AIModule_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Milkshake_RandomEarthquakeManager.BP_Milkshake_RandomEarthquakeManager_C
// 0x0220 (0x04B0 - 0x0290)
class ABP_Milkshake_RandomEarthquakeManager_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBillboardComponent*                    Billboard_EDITORONLY;                              // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FString                                 CalendarEvent;                                     // 0x02A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	double                                        CalendarEventStatusUpdateInterval;                 // 0x02B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMilkshakeCalendarEventInfoStruct      CalendarStatus;                                    // 0x02C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         bRandomEarthquakesEnabled;                         // 0x02C8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         bMilkshakeEnabled;                                 // 0x02F0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         NumOfRandomEarthquakesPerMatch;                    // 0x0318(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         NumOfRandomEarthquakesToSpawn;                     // 0x0340(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_344[0x4];                                      // 0x0344(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           EarthquakeSpawnCheckTimerHandle;                   // 0x0348(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         EarthquakeSpawnCheckInterval;                      // 0x0350(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         MinNumberOfEarthquakesAtOnce;                      // 0x0378(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	double                                        UpdateMaxNumberOfEarthquakesAtOnceInterval;        // 0x03A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 MaxNumberOfEarthquakesAtOnceList;                  // 0x03A8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class ABP_Milkshake_Earthquake_C*>     CurrentEarthquakes;                                // 0x03B8(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	class UEnvQueryInstanceBlueprintWrapper*      EarthquakeSpawnPointQueryInstance;                 // 0x03C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           RandomEarthquakeSpawnerRegisterTag;                // 0x03D0(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D4[0x4];                                      // 0x03D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           UpdateMaxNumberOfEarthquakesAtOnceTimerHandle;     // 0x03D8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         TotalNumOfEarthquakesSpawned;                      // 0x03E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E4[0x4];                                      // 0x03E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           EarthquakeSpawnCooldownTimer;                      // 0x03E8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         MaxNumberOfEarthquakesAtOnce;                      // 0x03F0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         MinEarthquakeSpawnCooldownDuration;                // 0x0418(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         MaxEarthquakeSpawnCooldownDuration;                // 0x0440(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UTextRenderComponent*>           Cheat_EventNameTextComponents;                     // 0x0468(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	double                                        Cheat_TextComponentLocationOffsetZ;                // 0x0478(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bCheat_SpawnersShowing;                            // 0x0480(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_481[0x7];                                      // 0x0481(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           Cheat_TextCompFaceCameraTimerHandle;               // 0x0488(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          bCheat_EarthquakeShow;                             // 0x0490(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_491[0x7];                                      // 0x0491(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Cheat_ForceCalendarTimeSpanRatio;                  // 0x0498(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UFortMiniMapComponent*>          Cheat_SpawnerMinimapComponents;                    // 0x04A0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)

public:
	void UpdateMaxNumberOfEarthquakesAtOnceValues();
	void UpdateCalendarEventStatus();
	void UnregisterFromActorRegistrySubsystemDelegates();
	void TrySpawnEarthquake();
	void StartEarthquakeSpawnCooldownTimer();
	void StartEarthquakeSpawnCheckTimer();
	void RegisterToActorRegistrySubsystemDelegates();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void ReceiveBeginPlay();
	void RandomEarthquakesEventStart();
	void RandomEarthquakesEventEnd();
	void OnReady_C52053D048C6349818695A84198FCABA(class AFortGameStateAthena* GameState, const class UFortPlaylist* Playlist, const struct FGameplayTagContainer& PlaylistContextTags);
	void MilkshakeSpawnEarthquake(const class FString& EventName);
	void MilkshakeShowRandomSpawners();
	void MilkshakeSetRandomEarthquakeCalendarRatio(double Value);
	void MilkshakeSetEarthquakeShow(bool bShow);
	void MilkshakeHideRandomSpawners();
	void HandleEarthquakeSpawnCooldownTimerComplete();
	void HandleEarthquakeComplete(class AActor* DestroyedActor);
	void HandleActorRegistrySubsystemRegisterActor(const struct FGameplayTag& GameplayTag, class AActor* RegisteredActor);
	void GetSafeZonePhase(int32* Value);
	void GetNumberOfPlayersNearActor(class AActor* Actor, int32* NumOfPlayers);
	void GetEarthquakeSpawnCooldownDuration(double* duration);
	void GetCurrentMaxNumberOfEarthquakesAtOnce(int32* Value);
	void GetCalendarEventStatus(bool* bIsEventActive, double* TimespanRatio);
	void GetCachedCalendarEventStatus(struct FMilkshakeCalendarEventInfoStruct* Status);
	void GetActorClosestToMostPlayers(TArray<class AActor*>& InActors, class AActor** SelectedActor, int32* PlayerCount);
	void ExecuteUbergraph_BP_Milkshake_RandomEarthquakeManager(int32 EntryPoint);
	void EQSQueryComplete_RandomEarthquakeLocationFinder(class UEnvQueryInstanceBlueprintWrapper* QueryInstance, EEnvQueryStatus QueryStatus);
	void Cheat_GetEarthquakeShow(bool* bShow);
	void Cheat_EventNameTextCompFaceCamera();
	bool CanSpawnEarthquakes();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Milkshake_RandomEarthquakeManager_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Milkshake_RandomEarthquakeManager_C")
	}
	static class ABP_Milkshake_RandomEarthquakeManager_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Milkshake_RandomEarthquakeManager_C>();
	}
};
DUMPER7_ASSERTS_ABP_Milkshake_RandomEarthquakeManager_C;

}

