#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MeshGrass

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "MeshGrass_ISMData_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_MeshGrass.BP_MeshGrass_C
// 0x0078 (0x0308 - 0x0290)
class ABP_MeshGrass_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UObject*                                EUBP_MeshGrassUtilityComponent;                    // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          TargetISM;                                         // 0x02A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<struct FTransform>                     Instances;                                         // 0x02B0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FTransform>                     Instances_medium;                                  // 0x02C0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FTransform>                     Instances_low;                                     // 0x02D0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         PreviewFoliageQuality;                             // 0x02E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E4[0x4];                                      // 0x02E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FMeshGrass_ISMData>             ISMData;                                           // 0x02E8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	int32                                         SlicingThreshold;                                  // 0x02F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ISMsToSlice;                                       // 0x02FC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CurrentISMToSlice;                                 // 0x0300(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();
	void SortISMData();
	void SliceISMs(int32 Quality);
	void SliceISM();
	void ReceiveBeginPlay();
	void PruneTransforms(int32 Quality, TArray<struct FTransform>& SourceTransforms, TArray<struct FTransform>* PrunedTransforms);
	void PruneISMs(int32 Quality, bool Preview);
	void PreviewQuality();
	void PreviewPopulateISMDataMap();
	void InitPostSpawn();
	void InitISMQuality(int32 Quality, bool Preview);
	void Handle_on_View_Distance_Quality_Changed(int32 Quality, bool Preview);
	TArray<class UInstancedStaticMeshComponent*> GetISMComponents();
	void GatherISMInstanceTransforms(class UInstancedStaticMeshComponent* SourceISM, TArray<struct FTransform>* OutInstanceTransform);
	void GatherISMData_LightWeight();
	void GatherISMData(class UInstancedStaticMeshComponent* SourceISM, struct FMeshGrass_ISMData* OutISMData);
	void ExecuteUbergraph_BP_MeshGrass(int32 EntryPoint);
	void DelayHandling();
	void CreateISM(int32 InTargetIndex);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_MeshGrass_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_MeshGrass_C")
	}
	static class ABP_MeshGrass_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_MeshGrass_C>();
	}
};
DUMPER7_ASSERTS_ABP_MeshGrass_C;

}

