#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Milkshake_React_Parent

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_Milkshake_React_Parent.BP_Milkshake_React_Parent_C.UpdateEarthquakeOverlappingStatus
// 0x0018 (0x0018 - 0x0000)
struct BP_Milkshake_React_Parent_C_UpdateEarthquakeOverlappingStatus final
{
public:
	bool                                          IsOverlapping;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Milkshake_Earthquake_C*             OverlappingEarthquakeActor;                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_BoolBool_ReturnValue;          // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Milkshake_React_Parent_C_UpdateEarthquakeOverlappingStatus;

// Function BP_Milkshake_React_Parent.BP_Milkshake_React_Parent_C.StartReact
// 0x0008 (0x0008 - 0x0000)
struct BP_Milkshake_React_Parent_C_StartReact final
{
public:
	class ABP_Milkshake_Earthquake_C*             OverlappingEarthquake;                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Milkshake_React_Parent_C_StartReact;

// Function BP_Milkshake_React_Parent.BP_Milkshake_React_Parent_C.OnRep_CurrentOverlapEarthquakeActor
// 0x0002 (0x0002 - 0x0000)
struct BP_Milkshake_React_Parent_C_OnRep_CurrentOverlapEarthquakeActor final
{
public:
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Milkshake_React_Parent_C_OnRep_CurrentOverlapEarthquakeActor;

// Function BP_Milkshake_React_Parent.BP_Milkshake_React_Parent_C.ExecuteUbergraph_BP_Milkshake_React_Parent
// 0x0040 (0x0040 - 0x0000)
struct BP_Milkshake_React_Parent_C_ExecuteUbergraph_BP_Milkshake_React_Parent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Milkshake_Earthquake_C*             K2Node_CustomEvent_OverlappingEarthquake;          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetValueAsBool_ReturnValue;               // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Milkshake_React_Parent_C_ExecuteUbergraph_BP_Milkshake_React_Parent;

}

