#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MilkshakeEarthquakeManagerComponent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_MilkshakeEarthquakeManagerComponent.BP_MilkshakeEarthquakeManagerComponent_C
// 0x00B0 (0x0150 - 0x00A0)
class UBP_MilkshakeEarthquakeManagerComponent_C final : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class FString                                 EarthquakeEventName;                               // 0x00A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, ExposeOnSpawn, HasGetValueTypeHash)
	struct FTimerHandle                           AttemptSpawnEarthquakeTimerHandle;                 // 0x00B8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ABP_Milkshake_Earthquake_C*             CurrentEarthquake;                                 // 0x00C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         NumOfEarthquakesSpawned;                           // 0x00C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MaxNumOfEarthquakes;                               // 0x00CC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         CalendarEventStatusUpdateInterval;                 // 0x00D0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          bCalendarEventActive;                              // 0x00F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           UpdateCalendarEventStatusTimerHandle;              // 0x0100(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           EarthquakeActorRegisterTag;                        // 0x0108(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10C[0x4];                                      // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         EarthquakeAttemptSpawnInterval;                    // 0x0110(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FTimerHandle                           EarthquakeSpawnCooldownTimerHandle;                // 0x0138(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        Initial_Start_Delay;                               // 0x0140(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Initial_Start_Delay_Variance;                      // 0x0148(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UpdateCalendarEventActiveStatus();
	void StartEarthquakeSpawnCooldownTimer();
	void StartEarthquakeAttemptSpawnTimer();
	void SpawnEarthquake();
	void SetupEarthquakeComponentProperties();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void ReceiveBeginPlay();
	void IsOwningCalendarEventActive(bool* bActive);
	void HandleEarthquakeSpawnCooldownTimerComplete();
	void HandleEarthquakeActorDestroyed(class AActor* DestroyedActor);
	void GetOwningEarthquakeSplineActor(class ABP_Milkshake_Spline_Earthquake_C** SplineActor);
	void GetEventName(class FString* Name_0);
	void GetEarthquakeInfo(struct FMilkshakeEarthquakeInfoStruct* Info);
	void ExecuteUbergraph_BP_MilkshakeEarthquakeManagerComponent(int32 EntryPoint);
	void EndEarthquakeEvent();
	void CanSpawnEarthquake(bool* bSpawn);
	void BeginEarthquakeEvent();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_MilkshakeEarthquakeManagerComponent_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_MilkshakeEarthquakeManagerComponent_C")
	}
	static class UBP_MilkshakeEarthquakeManagerComponent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_MilkshakeEarthquakeManagerComponent_C>();
	}
};
DUMPER7_ASSERTS_UBP_MilkshakeEarthquakeManagerComponent_C;

}

