#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Milkshake_Spline_Earthquake

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "MilkshakeCalendarEventInfoStruct_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Milkshake_Spline_Earthquake.BP_Milkshake_Spline_Earthquake_C
// 0x0110 (0x03A0 - 0x0290)
class ABP_Milkshake_Spline_Earthquake_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USplineComponent*                       Spline;                                            // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          bDebugDrawRuntimeOutlines;                         // 0x02A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bDebug;                                            // 0x02A9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2AA[0x6];                                      // 0x02AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           DebugEarthquakeDataTableRowNames;                  // 0x02B0(0x0010)(Edit, BlueprintVisible)
	class UDataTable*                             EarthquakeInfoDatatable;                           // 0x02C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          bCheat_SplineShowing;                              // 0x02C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C9[0x7];                                      // 0x02C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UTextRenderComponent*>           Cheat_EventNameTextComponents;                     // 0x02D0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	double                                        Cheat_SphereRadius;                                // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Cheat_TextComponentLocationOffsetZ;                // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           Cheat_TextCompFaceCameraTimerHandle;               // 0x02F0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class FString                                 CalendarEvent;                                     // 0x02F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	double                                        Cheat_ForceCalendarTimeSpanRatio;                  // 0x0308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          Cheat_InstancedStaticMeshComponent;                // 0x0310(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          bCheat_EarthquakeShow;                             // 0x0318(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_319[0x7];                                      // 0x0319(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         bMilkshakeEnabled;                                 // 0x0320(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         CalendarEventStatusUpdateInterval;                 // 0x0348(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FMilkshakeCalendarEventInfoStruct      CalendarStatus;                                    // 0x0370(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         bMilkshakeSplineEnabled;                           // 0x0378(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void UpdateCalendarEventStatus();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void ReceiveBeginPlay();
	void OnReady_CB98639E43FEBE0B6E64AEBB2538A6FD(class AFortGameStateAthena* GameState, const class UFortPlaylist* Playlist, const struct FGameplayTagContainer& PlaylistContextTags);
	void MilkshakeStopAllEarthquakeEvents();
	void MilkshakeStartEarthquakeEvent(const class FString& EventName);
	void MilkshakeSplineShow();
	void MilkshakeSplineHide();
	void MilkshakeSpawnEarthquake(const class FString& EventName);
	void MilkshakeSetEarthquakeShow(bool bShow);
	void MilkshakeSetCalendarRatio(double Ratio);
	void IsDebugEnabled(bool* bEnabled, bool* bDrawDebugOutlines);
	void IsCalendarEventActive(const class FString& EventName, bool* bActive);
	void GetSplineLocationAtAlpha(double Alpha, struct FVector* Location);
	void GetEarthquakeInfoForEvent(const class FString& EventName, struct FMilkshakeEarthquakeInfoStruct* Info, bool* bFound);
	void GetEarthquakeComponentForEvent(class FString& EventName, class UBP_MilkshakeEarthquakeManagerComponent_C** EarthquakeComponent);
	void GetCalendarEventStatus(bool* bIsEventActive, double* TimespanRatio);
	void ExecuteUbergraph_BP_Milkshake_Spline_Earthquake(int32 EntryPoint);
	void Editor_DrawDebugEarthquake();
	void Editor_DestroyAllDebugEarthquake();
	void DoesCurrentPlaylistAllowEarthquake(struct FGameplayTagContainer& RequiredPlaylistTags, bool* bAllow, class FString* PlaylistName);
	void CreateEarthquakeComponent(const class FString& EarthquakeEventName, bool* bCreated);
	void Cheat_SpawnSimpleInstancedSphere(const struct FVector& SpawnLocation);
	void Cheat_GetEarthquakeShow(bool* bShow);
	void Cheat_EventNameTextCompFaceCamera();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Milkshake_Spline_Earthquake_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Milkshake_Spline_Earthquake_C")
	}
	static class ABP_Milkshake_Spline_Earthquake_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Milkshake_Spline_Earthquake_C>();
	}
};
DUMPER7_ASSERTS_ABP_Milkshake_Spline_Earthquake_C;

}

