#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CameraModesRuntime

#include "Basic.hpp"


namespace SDK::Params
{

// Function CameraModesRuntime.CameraModes_FirstPersonCameraController.ClearFovOverride
// 0x0004 (0x0004 - 0x0000)
struct CameraModes_FirstPersonCameraController_ClearFovOverride final
{
public:
	float                                         TransitionTime;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CameraModes_FirstPersonCameraController_ClearFovOverride;

// Function CameraModesRuntime.CameraModes_FirstPersonCameraController.HandleWeaponEquipped
// 0x0010 (0x0010 - 0x0000)
struct CameraModes_FirstPersonCameraController_HandleWeaponEquipped final
{
public:
	class AFortWeapon*                            NewWeapon;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFortWeapon*                            PrevWeapon;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CameraModes_FirstPersonCameraController_HandleWeaponEquipped;

// Function CameraModesRuntime.CameraModes_FirstPersonCameraController.OnLocalPlayerVisibilityChanged
// 0x0001 (0x0001 - 0x0000)
struct CameraModes_FirstPersonCameraController_OnLocalPlayerVisibilityChanged final
{
public:
	bool                                          bShouldBeVisible;                                  // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CameraModes_FirstPersonCameraController_OnLocalPlayerVisibilityChanged;

// Function CameraModesRuntime.CameraModes_FirstPersonCameraController.SetFovOverride
// 0x0008 (0x0008 - 0x0000)
struct CameraModes_FirstPersonCameraController_SetFovOverride final
{
public:
	float                                         FOV;                                               // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TransitionTime;                                    // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CameraModes_FirstPersonCameraController_SetFovOverride;

// Function CameraModesRuntime.CameraModes_FirstPersonCameraController.UpdateFirstPersonFOV
// 0x0004 (0x0004 - 0x0000)
struct CameraModes_FirstPersonCameraController_UpdateFirstPersonFOV final
{
public:
	float                                         FOV;                                               // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CameraModes_FirstPersonCameraController_UpdateFirstPersonFOV;

}

