#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CameraModesRuntime

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// Class CameraModesRuntime.CameraModes_FirstPersonCameraController
// 0x0028 (0x03E8 - 0x03C0)
class ACameraModes_FirstPersonCameraController final : public AFortFirstPersonCameraController
{
public:
	struct FGameplayTag                           PreventWeaponHolsterTag;                           // 0x03C0(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         HeadMotionScalar;                                  // 0x03C4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<TSubclassOf<class AFortWeapon>>        AllowedWeaponClassList;                            // 0x03C8(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, UObjectWrapper, NativeAccessSpecifierPublic)
	class USkeletalMeshComponent*                 FirstPersonSkeletalMeshComp;                       // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3E0[0x8];                                      // 0x03E0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ClearFovOverride(float TransitionTime);
	void HandleWeaponEquipped(class AFortWeapon* NewWeapon, class AFortWeapon* PrevWeapon);
	void OnLocalPlayerVisibilityChanged(const bool bShouldBeVisible);
	void SetFovOverride(float FOV, float TransitionTime);
	void UpdateFirstPersonFOV(const float FOV);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CameraModes_FirstPersonCameraController")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CameraModes_FirstPersonCameraController")
	}
	static class ACameraModes_FirstPersonCameraController* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACameraModes_FirstPersonCameraController>();
	}
};
DUMPER7_ASSERTS_ACameraModes_FirstPersonCameraController;

}

