#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CentralPicnicNativeRuntime

#include "Basic.hpp"


namespace SDK
{

// ScriptStruct CentralPicnicNativeRuntime.CentralPicnicMeshNetworkMetadata
// 0x0018 (0x0018 - 0x0000)
struct FCentralPicnicMeshNetworkMetadata final
{
public:
	int64                                         CurrentHealth;                                     // 0x0000(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         DefaultHealth;                                     // 0x0008(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DamageModifier;                                    // 0x0010(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHasInitialized;                                   // 0x0014(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHasCompleted;                                     // 0x0015(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_16[0x2];                                       // 0x0016(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FCentralPicnicMeshNetworkMetadata;

// ScriptStruct CentralPicnicNativeRuntime.CentralPicnicEvent_HealthUpdated
// 0x0008 (0x0008 - 0x0000)
struct FCentralPicnicEvent_HealthUpdated final
{
public:
	int64                                         CurrentHealth;                                     // 0x0000(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FCentralPicnicEvent_HealthUpdated;

// ScriptStruct CentralPicnicNativeRuntime.CentralPicnicEvent_DefaultHealthUpdated
// 0x0008 (0x0008 - 0x0000)
struct FCentralPicnicEvent_DefaultHealthUpdated final
{
public:
	int64                                         CurrentDefaultHealth;                              // 0x0000(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FCentralPicnicEvent_DefaultHealthUpdated;

// ScriptStruct CentralPicnicNativeRuntime.CentralPicnicEvent_DamageModifierUpdated
// 0x0004 (0x0004 - 0x0000)
struct FCentralPicnicEvent_DamageModifierUpdated final
{
public:
	float                                         CurrentDamageModifier;                             // 0x0000(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FCentralPicnicEvent_DamageModifierUpdated;

// ScriptStruct CentralPicnicNativeRuntime.CentralPicnicEvent_ChainsDamaged
// 0x0008 (0x0008 - 0x0000)
struct FCentralPicnicEvent_ChainsDamaged final
{
public:
	int64                                         DamageDealt;                                       // 0x0000(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FCentralPicnicEvent_ChainsDamaged;

}

