#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CentralPicnicNativeRuntime

#include "Basic.hpp"

#include "MeshNetwork_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class CentralPicnicNativeRuntime.CentralPicnicMeshNetworkBridge
// 0x0060 (0x02F0 - 0x0290)
class ACentralPicnicMeshNetworkBridge final : public AInfo
{
public:
	class UMeshNetworkComponent*                  MeshNetworkComponent;                              // 0x0290(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         CurrentHealth;                                     // 0x0298(0x0008)(BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int64                                         DefaultHealth;                                     // 0x02A0(0x0008)(BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         DamageModifier;                                    // 0x02A8(0x0004)(BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2AC[0x44];                                     // 0x02AC(0x0044)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleMeshNetworkTypeSet(EMeshNetworkNodeType NodeType);
	void WaitForMeshNetwork();

	void BroadcastEvent_ChainsDamaged(const int64 DamageDealt) const;
	void BroadcastEvent_DamageModifierUpdated(const float NewValue) const;
	void BroadcastEvent_DefaultHealthUpdated(const int64 NewValue) const;
	void BroadcastEvent_HealthUpdated(const int64 NewValue) const;
	void OnRep_CurrentHealth(const int64 OldValue) const;
	void OnRep_DamageModifier(const float OldValue) const;
	void OnRep_DefaultHealth(const int64 OldValue) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CentralPicnicMeshNetworkBridge")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CentralPicnicMeshNetworkBridge")
	}
	static class ACentralPicnicMeshNetworkBridge* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACentralPicnicMeshNetworkBridge>();
	}
};
DUMPER7_ASSERTS_ACentralPicnicMeshNetworkBridge;

}

