#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CentralPicnic_MasterEventController

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass CentralPicnic_MasterEventController.CentralPicnic_MasterEventController_C
// 0x00A8 (0x0338 - 0x0290)
class ACentralPicnic_MasterEventController_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDataLayerAsset*                        Pre_Fist;                                          // 0x02A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UDataLayerAsset*                        FistPump;                                          // 0x02A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UDataLayerAsset*                        Chaos;                                             // 0x02B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UDataLayerAsset*                        Primary;                                           // 0x02B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UDataLayerAsset*                        Post_Lead_Animations;                              // 0x02C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UDataLayerAsset*                        Post_Chains;                                       // 0x02C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class FString>                         Pre_Emergence_Events;                              // 0x02D0(0x0010)(Edit, BlueprintVisible)
	class FString                                 Primary_Events;                                    // 0x02E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Post_Chain_Event;                                  // 0x02F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class UDataLayerAsset*                        Constants;                                         // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UDataLayerAsset*                        Constants_Sub1;                                    // 0x0308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UDataLayerAsset*                        Constants_Sub2;                                    // 0x0310(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Developer_Mode;                                    // 0x0318(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          NewVar;                                            // 0x0319(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31A[0x6];                                      // 0x031A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Pre_Emergence_Event;                               // 0x0320(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	int32                                         CachedPreCheckInt;                                 // 0x0330(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Set_Data_Layer_Activity(const TArray<class UDataLayerAsset*>& Active_Data_Layers, const TArray<class UDataLayerAsset*>& Loaded_Data_Layers, TArray<class UDataLayerAsset*>& Unloaded_Data_Layers);
	void ReceiveBeginPlay();
	void OnSyncComplete_6C49500A4AB13514F7F77C8ECDC099AE();
	void OnReady_DDCBDAA741D860624E48EA8A81386E05(class AFortGameStateAthena* GameState, const class UFortPlaylist* Playlist, const struct FGameplayTagContainer& PlaylistContextTags);
	void ExecuteUbergraph_CentralPicnic_MasterEventController(int32 EntryPoint);
	void CentralPicnic_Layer_Primary();
	void CentralPicnic_Layer_Pre();
	void CentralPicnic_Layer_Post();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("CentralPicnic_MasterEventController_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CentralPicnic_MasterEventController_C")
	}
	static class ACentralPicnic_MasterEventController_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACentralPicnic_MasterEventController_C>();
	}
};
DUMPER7_ASSERTS_ACentralPicnic_MasterEventController_C;

}

