#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CentralPicnicNativeRuntime

#include "Basic.hpp"

#include "MeshNetwork_structs.hpp"


namespace SDK::Params
{

// Function CentralPicnicNativeRuntime.CentralPicnicMeshNetworkBridge.HandleMeshNetworkTypeSet
// 0x0001 (0x0001 - 0x0000)
struct CentralPicnicMeshNetworkBridge_HandleMeshNetworkTypeSet final
{
public:
	EMeshNetworkNodeType                          NodeType;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CentralPicnicMeshNetworkBridge_HandleMeshNetworkTypeSet;

// Function CentralPicnicNativeRuntime.CentralPicnicMeshNetworkBridge.BroadcastEvent_ChainsDamaged
// 0x0008 (0x0008 - 0x0000)
struct CentralPicnicMeshNetworkBridge_BroadcastEvent_ChainsDamaged final
{
public:
	int64                                         DamageDealt;                                       // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CentralPicnicMeshNetworkBridge_BroadcastEvent_ChainsDamaged;

// Function CentralPicnicNativeRuntime.CentralPicnicMeshNetworkBridge.BroadcastEvent_DamageModifierUpdated
// 0x0004 (0x0004 - 0x0000)
struct CentralPicnicMeshNetworkBridge_BroadcastEvent_DamageModifierUpdated final
{
public:
	float                                         NewValue;                                          // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CentralPicnicMeshNetworkBridge_BroadcastEvent_DamageModifierUpdated;

// Function CentralPicnicNativeRuntime.CentralPicnicMeshNetworkBridge.BroadcastEvent_DefaultHealthUpdated
// 0x0008 (0x0008 - 0x0000)
struct CentralPicnicMeshNetworkBridge_BroadcastEvent_DefaultHealthUpdated final
{
public:
	int64                                         NewValue;                                          // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CentralPicnicMeshNetworkBridge_BroadcastEvent_DefaultHealthUpdated;

// Function CentralPicnicNativeRuntime.CentralPicnicMeshNetworkBridge.BroadcastEvent_HealthUpdated
// 0x0008 (0x0008 - 0x0000)
struct CentralPicnicMeshNetworkBridge_BroadcastEvent_HealthUpdated final
{
public:
	int64                                         NewValue;                                          // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CentralPicnicMeshNetworkBridge_BroadcastEvent_HealthUpdated;

// Function CentralPicnicNativeRuntime.CentralPicnicMeshNetworkBridge.OnRep_CurrentHealth
// 0x0008 (0x0008 - 0x0000)
struct CentralPicnicMeshNetworkBridge_OnRep_CurrentHealth final
{
public:
	int64                                         OldValue;                                          // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CentralPicnicMeshNetworkBridge_OnRep_CurrentHealth;

// Function CentralPicnicNativeRuntime.CentralPicnicMeshNetworkBridge.OnRep_DamageModifier
// 0x0004 (0x0004 - 0x0000)
struct CentralPicnicMeshNetworkBridge_OnRep_DamageModifier final
{
public:
	float                                         OldValue;                                          // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CentralPicnicMeshNetworkBridge_OnRep_DamageModifier;

// Function CentralPicnicNativeRuntime.CentralPicnicMeshNetworkBridge.OnRep_DefaultHealth
// 0x0008 (0x0008 - 0x0000)
struct CentralPicnicMeshNetworkBridge_OnRep_DefaultHealth final
{
public:
	int64                                         OldValue;                                          // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CentralPicnicMeshNetworkBridge_OnRep_DefaultHealth;

}

