#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Chains_MeshNetworkComponent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "MeshNetwork_structs.hpp"
#include "CentralPicnicNativeRuntime_structs.hpp"


namespace SDK::Params
{

// Function Chains_MeshNetworkComponent.Chains_MeshNetworkComponent_C.RootConnectivityChanged
// 0x0001 (0x0001 - 0x0000)
struct Chains_MeshNetworkComponent_C_RootConnectivityChanged final
{
public:
	bool                                          bConnected;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Chains_MeshNetworkComponent_C_RootConnectivityChanged;

// Function Chains_MeshNetworkComponent.Chains_MeshNetworkComponent_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct Chains_MeshNetworkComponent_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Chains_MeshNetworkComponent_C_ReceiveEndPlay;

// Function Chains_MeshNetworkComponent.Chains_MeshNetworkComponent_C.OnReady_BD88416C47D9FAC982CF2F87C5927CAA
// 0x0001 (0x0001 - 0x0000)
struct Chains_MeshNetworkComponent_C_OnReady_BD88416C47D9FAC982CF2F87C5927CAA final
{
public:
	EMeshNetworkNodeType                          NodeType;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Chains_MeshNetworkComponent_C_OnReady_BD88416C47D9FAC982CF2F87C5927CAA;

// Function Chains_MeshNetworkComponent.Chains_MeshNetworkComponent_C.OnReady_95A661984B51F7CF275093BDAA4AEED9
// 0x0001 (0x0001 - 0x0000)
struct Chains_MeshNetworkComponent_C_OnReady_95A661984B51F7CF275093BDAA4AEED9 final
{
public:
	EMeshNetworkNodeType                          NodeType;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Chains_MeshNetworkComponent_C_OnReady_95A661984B51F7CF275093BDAA4AEED9;

// Function Chains_MeshNetworkComponent.Chains_MeshNetworkComponent_C.OnReady_8972017F4B2CE40815FAD2AA5F7722DF
// 0x0001 (0x0001 - 0x0000)
struct Chains_MeshNetworkComponent_C_OnReady_8972017F4B2CE40815FAD2AA5F7722DF final
{
public:
	EMeshNetworkNodeType                          NodeType;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Chains_MeshNetworkComponent_C_OnReady_8972017F4B2CE40815FAD2AA5F7722DF;

// Function Chains_MeshNetworkComponent.Chains_MeshNetworkComponent_C.OnEventReceived_0D91F280415955FE08007DB2D2D22592
// 0x0008 (0x0008 - 0x0000)
struct Chains_MeshNetworkComponent_C_OnEventReceived_0D91F280415955FE08007DB2D2D22592 final
{
public:
	class UAsyncAction_StartListeningToEvent*     ProxyObject;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Chains_MeshNetworkComponent_C_OnEventReceived_0D91F280415955FE08007DB2D2D22592;

// Function Chains_MeshNetworkComponent.Chains_MeshNetworkComponent_C.ExecuteUbergraph_Chains_MeshNetworkComponent
// 0x0500 (0x0500 - 0x0000)
struct Chains_MeshNetworkComponent_C_ExecuteUbergraph_Chains_MeshNetworkComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameplayEventRouterComponent*          CallFunc_GetGlobalEventRouter_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	EMeshNetworkNodeType                          K2Node_CustomEvent_NodeType_2;                     // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EMeshNetworkNodeType NodeType)> K2Node_CreateDelegate_OutputDelegate;             // 0x0014(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EMeshNetworkNodeType                          Temp_byte_Variable;                                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAsyncAction_MeshNetworkReady*      CallFunc_MeshNetworkReadyAsync_ReturnValue;        // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0040(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0058(0x0050)(HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AA[0x6];                                       // 0x00AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMeshNetworkSubsystem*                  CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMeshNetworkSubsystem*                  CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EMeshNetworkNodeType                          K2Node_CustomEvent_NodeType_1;                     // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x3];                                       // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EMeshNetworkNodeType NodeType)> K2Node_CreateDelegate_OutputDelegate_1;           // 0x00C4(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EMeshNetworkNodeType                          Temp_byte_Variable_1;                              // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAsyncAction_MeshNetworkReady*      CallFunc_MeshNetworkReadyAsync_ReturnValue_1;      // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMeshNetworkNodeType                          K2Node_CustomEvent_NodeType;                       // 0x00E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E3[0x1];                                       // 0x00E3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EMeshNetworkNodeType NodeType)> K2Node_CreateDelegate_OutputDelegate_2;           // 0x00E4(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EMeshNetworkNodeType                          Temp_byte_Variable_2;                              // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAsyncAction_MeshNetworkReady*      CallFunc_MeshNetworkReadyAsync_ReturnValue_2;      // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_2;                    // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_102[0x6];                                      // 0x0102(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMeshNetworkSubsystem*                  CallFunc_GetGameInstanceSubsystem_ReturnValue_2;   // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMeshNetworkSubsystem*                  CallFunc_GetGameInstanceSubsystem_ReturnValue_3;   // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int64                                         K2Node_CustomEvent_DamageApplied;                  // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_MaxInt64_ReturnValue;                     // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0128(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FCentralPicnicEvent_ChainsDamaged      Temp_struct_Variable;                              // 0x0130(0x0008)(NoDestructor)
	class UAsyncAction_StartListeningToEvent*     CallFunc_StartListeningToEvent_ReturnValue;        // 0x0138(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0141(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsConnectedToMeshRoot_ReturnValue;        // 0x0142(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_143[0x1];                                      // 0x0143(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0144(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_BoolToText_ReturnValue;              // 0x0150(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0168(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x01B8(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x01C8(0x0018)()
	class FText                                   CallFunc_Conv_NameToText_ReturnValue;              // 0x01E0(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x01F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0208(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0258(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0268(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_1;          // 0x0280(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetMetaDataWithKey_ReturnValue;           // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetValueAsBool_ReturnValue;               // 0x0291(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_292[0x6];                                      // 0x0292(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x0298(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ACentralPicnicMeshNetworkBridge*        K2Node_DynamicCast_AsCentral_Picnic_Mesh_Network_Bridge; // 0x02A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A9[0x3];                                      // 0x02A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetValueAsInteger_ReturnValue;            // 0x02AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue_1;            // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_Int64Int64_ReturnValue;           // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C1[0x7];                                      // 0x02C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAsyncAction_StartListeningToEvent*     Temp_object_Variable;                              // 0x02C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x02D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetPayload_ReturnValue;                   // 0x02D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D5[0x3];                                      // 0x02D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCentralPicnicEvent_ChainsDamaged      Temp_struct_Variable_1;                            // 0x02D8(0x0008)(NoDestructor)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_3;            // 0x02E0(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_2;                          // 0x0330(0x0010)(ReferenceParm)
	int64                                         CallFunc_MaxInt64_ReturnValue_1;                   // 0x0340(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue_2;                     // 0x0348(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_2;          // 0x0360(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_2;                   // 0x0370(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EMeshNetworkNodeType                          CallFunc_GetMeshNetworkNodeType_ReturnValue;       // 0x0378(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_379[0x7];                                      // 0x0379(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACentralPicnicMeshNetworkBridge*        K2Node_DynamicCast_AsCentral_Picnic_Mesh_Network_Bridge_1; // 0x0380(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0388(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_3;                    // 0x0389(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_38A[0x6];                                      // 0x038A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_3;                   // 0x0390(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAsyncAction_StartListeningToEvent*     K2Node_CustomEvent_ProxyObject;                    // 0x0398(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ACentralPicnicMeshNetworkBridge*        K2Node_DynamicCast_AsCentral_Picnic_Mesh_Network_Bridge_2; // 0x03A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x03A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_Int64Int64_ReturnValue;         // 0x03A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3AA[0x6];                                      // 0x03AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_Subtract_Int64Int64_ReturnValue;          // 0x03B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_MaxInt64_ReturnValue_2;                   // 0x03B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetMetaDataWithKey_ReturnValue_1;         // 0x03C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C1[0x3];                                      // 0x03C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UAsyncAction_StartListeningToEvent* ProxyObject)> K2Node_CreateDelegate_OutputDelegate_4; // 0x03C4(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool bConnected)>              K2Node_CreateDelegate_OutputDelegate_5;            // 0x03D0(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bConnected;                     // 0x03DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3DD[0x3];                                      // 0x03DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_BoolToText_ReturnValue_1;            // 0x03E0(0x0018)()
	EMeshNetworkNodeType                          CallFunc_GetMeshNetworkNodeType_ReturnValue_1;     // 0x03F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F9[0x7];                                      // 0x03F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_4;            // 0x0400(0x0050)(HasGetValueTypeHash)
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue_1; // 0x0450(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0460(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_5;            // 0x0478(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_3;                          // 0x04C8(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_3;                     // 0x04D8(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_3;          // 0x04F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Chains_MeshNetworkComponent_C_ExecuteUbergraph_Chains_MeshNetworkComponent;

// Function Chains_MeshNetworkComponent.Chains_MeshNetworkComponent_C.DamageChains
// 0x0008 (0x0008 - 0x0000)
struct Chains_MeshNetworkComponent_C_DamageChains final
{
public:
	int64                                         DamageApplied;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Chains_MeshNetworkComponent_C_DamageChains;

}

