#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Coliseum_WallFountain_01

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Coliseum_WallFountain_01.Coliseum_WallFountain_01_C
// 0x0038 (0x0C00 - 0x0BC8)
class AColiseum_WallFountain_01_C final : public ABuildingProp
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0BC8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAudioComponent*                        Fountain_Audio_Loop;                               // 0x0BD0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               P_Colliseum_WaterFountain_Splash;                  // 0x0BD8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               P_Colliseum_WaterFountain;                         // 0x0BE0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SplashHeight;                                      // 0x0BE8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();
	void OnDeathPlayEffects(float Damage, const struct FGameplayTagContainer& DamageTags, const struct FVector& Momentum, const struct FHitResult& HitInfo, class AFortPawn* InstigatedBy, class AActor* DamageCauser, const struct FGameplayEffectContextHandle& EffectContext);
	void ExecuteUbergraph_Coliseum_WallFountain_01(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Coliseum_WallFountain_01_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Coliseum_WallFountain_01_C")
	}
	static class AColiseum_WallFountain_01_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AColiseum_WallFountain_01_C>();
	}
};
DUMPER7_ASSERTS_AColiseum_WallFountain_01_C;

}

