#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Component_0

#include "Basic.hpp"

#include "Component_0_structs.hpp"
#include "EpicGamesTemporary_structs.hpp"
#include "VerseNative_structs.hpp"
#include "VerseColors_structs.hpp"


namespace SDK::Params
{

// Function Component.Component_attachment_component.$InitCDO
// 0x0120 (0x0120 - 0x0000)
struct Component_attachment_component__InitCDO final
{
public:
	TOptional<struct FSpatialMath_transform>      _ExprResult_0;                                     // 0x0000(0x0070)(ZeroConstructor, NoDestructor)
	TOptional<EVerseFalse>                        __verse_0x00000000__1;                             // 0x0070(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_1 : 1;                                 // 0x0072(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	TOptional<EVerseFalse>                        _ExprResultStack_2;                                // 0x0073(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TOptional<class UEntity_core_entity*, true>   _ExprResult_3;                                     // 0x0078(0x0008)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<EVerseFalse>                        __verse_0x00000000__3;                             // 0x0080(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_4 : 1;                                 // 0x0082(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	TOptional<EVerseFalse>                        _ExprResultStack_5;                                // 0x0083(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_85[0xB];                                       // 0x0085(0x000B)(Fixing Size After Last Property [ Dumper-7 ])
	TOptional<struct FSpatialMath_transform>      _ExprResult_6;                                     // 0x0090(0x0070)(ZeroConstructor, NoDestructor)
	TOptional<EVerseFalse>                        __verse_0x00000000__5;                             // 0x0100(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_7 : 1;                                 // 0x0102(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	TOptional<EVerseFalse>                        _ExprResultStack_8;                                // 0x0103(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_105[0x3];                                      // 0x0105(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TOptional<class UEntity_core_entity*, true>   _ExprResult_9;                                     // 0x0108(0x0008)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<EVerseFalse>                        __verse_0x00000000__7;                             // 0x0110(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_10 : 1;                                // 0x0112(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	TOptional<EVerseFalse>                        _ExprResultStack_11;                               // 0x0113(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Component_attachment_component__InitCDO;

// Function Component.Component_attachment_component._L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fattachment__component_N_RAttachTo_L_Ncore__entity_M_Ntransform_R
// 0x0080 (0x0080 - 0x0000)
struct Component_attachment_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fattachment__component_N_RAttachTo_L_Ncore__entity_M_Ntransform_R final
{
public:
	struct Ftuple_Lcore__entity_Mtransform_R      __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0070)(Parm, HasGetValueTypeHash)
	TOptional<EVerseTrue>                         RetVal;                                            // 0x0070(0x0002)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Component_attachment_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fattachment__component_N_RAttachTo_L_Ncore__entity_M_Ntransform_R;

// Function Component.Component_attachment_component._L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fattachment__component_N_RAttachTo_L_Ncore__entity_R
// 0x0010 (0x0010 - 0x0000)
struct Component_attachment_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fattachment__component_N_RAttachTo_L_Ncore__entity_R final
{
public:
	class UEntity_core_entity*                    __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<EVerseTrue>                         RetVal;                                            // 0x0008(0x0002)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Component_attachment_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fattachment__component_N_RAttachTo_L_Ncore__entity_R;

// Function Component.Component_attachment_component._L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fattachment__component_N_RDetachFrom
// 0x0003 (0x0003 - 0x0000)
struct Component_attachment_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fattachment__component_N_RDetachFrom final
{
public:
	struct Component_0::Ftuple_L_R                __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	TOptional<EVerseTrue>                         RetVal;                                            // 0x0001(0x0002)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Component_attachment_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fattachment__component_N_RDetachFrom;

// Function Component.Component_attachment_component._L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fattachment__component_N_RGetAttachedTransform
// 0x0080 (0x0080 - 0x0000)
struct Component_attachment_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fattachment__component_N_RGetAttachedTransform final
{
public:
	struct Component_0::Ftuple_L_R                __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0xF];                                        // 0x0001(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	TOptional<struct FSpatialMath_transform>      RetVal;                                            // 0x0010(0x0070)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor)
};
DUMPER7_ASSERTS_Component_attachment_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fattachment__component_N_RGetAttachedTransform;

// Function Component.Component_attachment_component._L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fattachment__component_N_RSetRelativeTransform_L_Ntransform_R
// 0x0070 (0x0070 - 0x0000)
struct Component_attachment_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fattachment__component_N_RSetRelativeTransform_L_Ntransform_R final
{
public:
	struct FSpatialMath_transform                 __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0060)(Parm, NoDestructor)
	TOptional<EVerseTrue>                         RetVal;                                            // 0x0060(0x0002)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Component_attachment_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fattachment__component_N_RSetRelativeTransform_L_Ntransform_R;

// Function Component.Component_attachment_component._L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fattachment__component_N_RSetRelativeTransformFromGlobal_L_Ntransform_R
// 0x0070 (0x0070 - 0x0000)
struct Component_attachment_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fattachment__component_N_RSetRelativeTransformFromGlobal_L_Ntransform_R final
{
public:
	struct FSpatialMath_transform                 __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0060)(Parm, NoDestructor)
	TOptional<EVerseTrue>                         RetVal;                                            // 0x0060(0x0002)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Component_attachment_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fattachment__component_N_RSetRelativeTransformFromGlobal_L_Ntransform_R;

// Function Component.Component_attachment_component._L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcore__entity__component_N_RInitialize
// 0x0001 (0x0001 - 0x0000)
struct Component_attachment_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcore__entity__component_N_RInitialize final
{
public:
	struct Component_0::Ftuple_L_R                __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Component_attachment_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcore__entity__component_N_RInitialize;

// Function Component.Component_attachment_component._L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcore__entity__component_N_RIsAllowedOnClient
// 0x0002 (0x0002 - 0x0000)
struct Component_attachment_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcore__entity__component_N_RIsAllowedOnClient final
{
public:
	struct Component_0::Ftuple_L_R                __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         RetVal : 1;                                        // 0x0001(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash))
};
DUMPER7_ASSERTS_Component_attachment_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcore__entity__component_N_RIsAllowedOnClient;

// Function Component.Component_attachment_component._L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcore__entity__component_N_RUninitialize
// 0x0001 (0x0001 - 0x0000)
struct Component_attachment_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcore__entity__component_N_RUninitialize final
{
public:
	struct Component_0::Ftuple_L_R                __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Component_attachment_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcore__entity__component_N_RUninitialize;

// Function Component.Component_camera_entity_component.$InitCDO
// 0x0030 (0x0030 - 0x0000)
struct Component_camera_entity_component__InitCDO final
{
public:
	double                                        _ExprResult_0;                                     // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        _ExprResult_1;                                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_2 : 1;                                 // 0x0010(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        _ExprResult_3;                                     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        _ExprResult_4;                                     // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_5 : 1;                                 // 0x0028(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
};
DUMPER7_ASSERTS_Component_camera_entity_component__InitCDO;

// Function Component.Component_camera_entity_component._L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_RGetAspectRatio
// 0x0010 (0x0010 - 0x0000)
struct Component_camera_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_RGetAspectRatio final
{
public:
	struct Component_0::Ftuple_L_R                __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Component_camera_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_RGetAspectRatio;

// Function Component.Component_camera_entity_component._L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_RGetFieldOfView
// 0x0010 (0x0010 - 0x0000)
struct Component_camera_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_RGetFieldOfView final
{
public:
	struct Component_0::Ftuple_L_R                __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Component_camera_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_RGetFieldOfView;

// Function Component.Component_camera_entity_component._L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_RGetIsActive
// 0x0002 (0x0002 - 0x0000)
struct Component_camera_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_RGetIsActive final
{
public:
	struct Component_0::Ftuple_L_R                __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         RetVal : 1;                                        // 0x0001(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash))
};
DUMPER7_ASSERTS_Component_camera_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_RGetIsActive;

// Function Component.Component_camera_entity_component._L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_ROnRep__AspectRatio
// 0x0038 (0x0038 - 0x0000)
struct Component_camera_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_ROnRep__AspectRatio final
{
public:
	struct Component_0::Ftuple_L_R                __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_0;                          // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_1;                                         // 0x0008(0x0010)(HasGetValueTypeHash)
	struct Component_0::Ftuple_L_R                _ExprResult_2;                                     // 0x0018(0x0001)(HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_3;                          // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_4;                                         // 0x0020(0x0010)(HasGetValueTypeHash)
	struct Component_0::Ftuple_L_R                _ExprResult_5;                                     // 0x0030(0x0001)(HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Component_camera_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_ROnRep__AspectRatio;

// Function Component.Component_camera_entity_component._L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_ROnRep__FieldOfView
// 0x0038 (0x0038 - 0x0000)
struct Component_camera_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_ROnRep__FieldOfView final
{
public:
	struct Component_0::Ftuple_L_R                __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_0;                          // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_1;                                         // 0x0008(0x0010)(HasGetValueTypeHash)
	struct Component_0::Ftuple_L_R                _ExprResult_2;                                     // 0x0018(0x0001)(HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_3;                          // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_4;                                         // 0x0020(0x0010)(HasGetValueTypeHash)
	struct Component_0::Ftuple_L_R                _ExprResult_5;                                     // 0x0030(0x0001)(HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Component_camera_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_ROnRep__FieldOfView;

// Function Component.Component_camera_entity_component._L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_ROnRep__IsActive
// 0x0038 (0x0038 - 0x0000)
struct Component_camera_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_ROnRep__IsActive final
{
public:
	struct Component_0::Ftuple_L_R                __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_0;                          // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_1;                                         // 0x0008(0x0010)(HasGetValueTypeHash)
	struct Component_0::Ftuple_L_R                _ExprResult_2;                                     // 0x0018(0x0001)(HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_3;                          // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_4;                                         // 0x0020(0x0010)(HasGetValueTypeHash)
	struct Component_0::Ftuple_L_R                _ExprResult_5;                                     // 0x0030(0x0001)(HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Component_camera_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_ROnRep__IsActive;

// Function Component.Component_camera_entity_component._L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_RSetAspectRatio_L_Nfloat_R
// 0x0058 (0x0058 - 0x0000)
struct Component_camera_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_RSetAspectRatio_L_Nfloat_R final
{
public:
	double                                        __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        _AssignmentScratch_0;                              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_1;                          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_2;                                         // 0x0018(0x0010)(HasGetValueTypeHash)
	struct Component_0::Ftuple_L_R                _ExprResult_3;                                     // 0x0028(0x0001)(HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        _AssignmentScratch_4;                              // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_5;                          // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_6;                                         // 0x0040(0x0010)(HasGetValueTypeHash)
	struct Component_0::Ftuple_L_R                _ExprResult_7;                                     // 0x0050(0x0001)(HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Component_camera_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_RSetAspectRatio_L_Nfloat_R;

// Function Component.Component_camera_entity_component._L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_RSetFieldOfView_L_Nfloat_R
// 0x0058 (0x0058 - 0x0000)
struct Component_camera_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_RSetFieldOfView_L_Nfloat_R final
{
public:
	double                                        __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        _AssignmentScratch_0;                              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_1;                          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_2;                                         // 0x0018(0x0010)(HasGetValueTypeHash)
	struct Component_0::Ftuple_L_R                _ExprResult_3;                                     // 0x0028(0x0001)(HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        _AssignmentScratch_4;                              // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_5;                          // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_6;                                         // 0x0040(0x0010)(HasGetValueTypeHash)
	struct Component_0::Ftuple_L_R                _ExprResult_7;                                     // 0x0050(0x0001)(HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Component_camera_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_RSetFieldOfView_L_Nfloat_R;

// Function Component.Component_camera_entity_component._L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_RSetIsActive_L_Nlogic_R
// 0x0038 (0x0038 - 0x0000)
struct Component_camera_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_RSetIsActive_L_Nlogic_R final
{
public:
	uint8                                         __verse_0xB2CDDD72_Argument : 1;                   // 0x0000(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, NoDestructor, HasGetValueTypeHash))
	EVerseTrue                                    _InvokeSureResultDummy_0;                          // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_1;                                         // 0x0008(0x0010)(HasGetValueTypeHash)
	struct Component_0::Ftuple_L_R                _ExprResult_2;                                     // 0x0018(0x0001)(HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_3;                          // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_4;                                         // 0x0020(0x0010)(HasGetValueTypeHash)
	struct Component_0::Ftuple_L_R                _ExprResult_5;                                     // 0x0030(0x0001)(HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Component_camera_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_RSetIsActive_L_Nlogic_R;

// Function Component.Component_camera_entity_component._L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_RUpdateAspectRatio
// 0x0001 (0x0001 - 0x0000)
struct Component_camera_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_RUpdateAspectRatio final
{
public:
	struct Component_0::Ftuple_L_R                __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Component_camera_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_RUpdateAspectRatio;

// Function Component.Component_camera_entity_component._L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_RUpdateFieldOfView
// 0x0001 (0x0001 - 0x0000)
struct Component_camera_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_RUpdateFieldOfView final
{
public:
	struct Component_0::Ftuple_L_R                __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Component_camera_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_RUpdateFieldOfView;

// Function Component.Component_camera_entity_component._L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_RUpdateIsActive
// 0x0001 (0x0001 - 0x0000)
struct Component_camera_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_RUpdateIsActive final
{
public:
	struct Component_0::Ftuple_L_R                __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Component_camera_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_RUpdateIsActive;

// Function Component.Component_camera_entity_component._L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcore__entity__component_N_RAddedToWorld
// 0x0001 (0x0001 - 0x0000)
struct Component_camera_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcore__entity__component_N_RAddedToWorld final
{
public:
	struct Component_0::Ftuple_L_R                __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Component_camera_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcore__entity__component_N_RAddedToWorld;

// Function Component.Component_camera_entity_component._L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcore__entity__component_N_RBeginPlay
// 0x0001 (0x0001 - 0x0000)
struct Component_camera_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcore__entity__component_N_RBeginPlay final
{
public:
	struct Component_0::Ftuple_L_R                __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Component_camera_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcore__entity__component_N_RBeginPlay;

// Function Component.Component_camera_entity_component._L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcore__entity__component_N_RInitialize
// 0x0001 (0x0001 - 0x0000)
struct Component_camera_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcore__entity__component_N_RInitialize final
{
public:
	struct Component_0::Ftuple_L_R                __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Component_camera_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcore__entity__component_N_RInitialize;

// Function Component.Component_camera_entity_component._L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcore__entity__component_N_RIsAllowedOnClient
// 0x0002 (0x0002 - 0x0000)
struct Component_camera_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcore__entity__component_N_RIsAllowedOnClient final
{
public:
	struct Component_0::Ftuple_L_R                __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         RetVal : 1;                                        // 0x0001(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash))
};
DUMPER7_ASSERTS_Component_camera_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcore__entity__component_N_RIsAllowedOnClient;

// Function Component.Component_camera_entity_component._L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcore__entity__component_N_RRemovingFromWorld
// 0x0001 (0x0001 - 0x0000)
struct Component_camera_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcore__entity__component_N_RRemovingFromWorld final
{
public:
	struct Component_0::Ftuple_L_R                __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Component_camera_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcore__entity__component_N_RRemovingFromWorld;

// Function Component.Component_camera_entity_component._L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcore__entity__component_N_RUninitialize
// 0x0001 (0x0001 - 0x0000)
struct Component_camera_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcore__entity__component_N_RUninitialize final
{
public:
	struct Component_0::Ftuple_L_R                __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Component_camera_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcore__entity__component_N_RUninitialize;

// Function Component.Component_light_entity_component._L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcore__entity__component_N_RInitialize
// 0x0001 (0x0001 - 0x0000)
struct Component_light_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcore__entity__component_N_RInitialize final
{
public:
	struct Component_0::Ftuple_L_R                __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Component_light_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcore__entity__component_N_RInitialize;

// Function Component.Component_light_entity_component._L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcore__entity__component_N_RIsAllowedOnClient
// 0x0002 (0x0002 - 0x0000)
struct Component_light_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcore__entity__component_N_RIsAllowedOnClient final
{
public:
	struct Component_0::Ftuple_L_R                __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         RetVal : 1;                                        // 0x0001(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash))
};
DUMPER7_ASSERTS_Component_light_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcore__entity__component_N_RIsAllowedOnClient;

// Function Component.Component_light_entity_component._L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcore__entity__component_N_RUninitialize
// 0x0001 (0x0001 - 0x0000)
struct Component_light_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcore__entity__component_N_RUninitialize final
{
public:
	struct Component_0::Ftuple_L_R                __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Component_light_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcore__entity__component_N_RUninitialize;

// Function Component.Component_spot_light_entity_component.$InitCDO
// 0x0090 (0x0090 - 0x0000)
struct Component_spot_light_entity_component__InitCDO final
{
public:
	double                                        _ExprResult_0;                                     // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FColors_color                          _ExprResult_1;                                     // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	double                                        _ExprResult_2;                                     // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        _ExprResult_3;                                     // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        _ExprResult_4;                                     // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        _ExprResult_5;                                     // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        _ExprResult_6;                                     // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        _ExprResult_7;                                     // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FColors_color                          _ExprResult_8;                                     // 0x0050(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	double                                        _ExprResult_9;                                     // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        _ExprResult_10;                                    // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        _ExprResult_11;                                    // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        _ExprResult_12;                                    // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        _ExprResult_13;                                    // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Component_spot_light_entity_component__InitCDO;

// Function Component.Component_spot_light_entity_component._L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fspot__light__entity__component_N_RGetAttenuationRadius
// 0x0010 (0x0010 - 0x0000)
struct Component_spot_light_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fspot__light__entity__component_N_RGetAttenuationRadius final
{
public:
	struct Component_0::Ftuple_L_R                __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Component_spot_light_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fspot__light__entity__component_N_RGetAttenuationRadius;

// Function Component.Component_spot_light_entity_component._L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fspot__light__entity__component_N_RGetColor
// 0x0020 (0x0020 - 0x0000)
struct Component_spot_light_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fspot__light__entity__component_N_RGetColor final
{
public:
	struct Component_0::Ftuple_L_R                __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FColors_color                          RetVal;                                            // 0x0008(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_Component_spot_light_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fspot__light__entity__component_N_RGetColor;

// Function Component.Component_spot_light_entity_component._L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fspot__light__entity__component_N_RGetInnerConeAngle
// 0x0010 (0x0010 - 0x0000)
struct Component_spot_light_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fspot__light__entity__component_N_RGetInnerConeAngle final
{
public:
	struct Component_0::Ftuple_L_R                __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Component_spot_light_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fspot__light__entity__component_N_RGetInnerConeAngle;

// Function Component.Component_spot_light_entity_component._L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fspot__light__entity__component_N_RGetIntensity
// 0x0010 (0x0010 - 0x0000)
struct Component_spot_light_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fspot__light__entity__component_N_RGetIntensity final
{
public:
	struct Component_0::Ftuple_L_R                __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Component_spot_light_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fspot__light__entity__component_N_RGetIntensity;

// Function Component.Component_spot_light_entity_component._L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fspot__light__entity__component_N_RGetOuterConeAngle
// 0x0010 (0x0010 - 0x0000)
struct Component_spot_light_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fspot__light__entity__component_N_RGetOuterConeAngle final
{
public:
	struct Component_0::Ftuple_L_R                __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Component_spot_light_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fspot__light__entity__component_N_RGetOuterConeAngle;

// Function Component.Component_spot_light_entity_component._L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fspot__light__entity__component_N_RGetSourceLength
// 0x0010 (0x0010 - 0x0000)
struct Component_spot_light_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fspot__light__entity__component_N_RGetSourceLength final
{
public:
	struct Component_0::Ftuple_L_R                __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Component_spot_light_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fspot__light__entity__component_N_RGetSourceLength;

// Function Component.Component_spot_light_entity_component._L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fspot__light__entity__component_N_RGetSourceRadius
// 0x0010 (0x0010 - 0x0000)
struct Component_spot_light_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fspot__light__entity__component_N_RGetSourceRadius final
{
public:
	struct Component_0::Ftuple_L_R                __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Component_spot_light_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fspot__light__entity__component_N_RGetSourceRadius;

// Function Component.Component_spot_light_entity_component._L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fspot__light__entity__component_N_ROnRep__AttenuationRadius
// 0x0038 (0x0038 - 0x0000)
struct Component_spot_light_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fspot__light__entity__component_N_ROnRep__AttenuationRadius final
{
public:
	struct Component_0::Ftuple_L_R                __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_0;                          // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_1;                                         // 0x0008(0x0010)(HasGetValueTypeHash)
	struct Component_0::Ftuple_L_R                _ExprResult_2;                                     // 0x0018(0x0001)(HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_3;                          // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_4;                                         // 0x0020(0x0010)(HasGetValueTypeHash)
	struct Component_0::Ftuple_L_R                _ExprResult_5;                                     // 0x0030(0x0001)(HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Component_spot_light_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fspot__light__entity__component_N_ROnRep__AttenuationRadius;

// Function Component.Component_spot_light_entity_component._L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fspot__light__entity__component_N_ROnRep__Color
// 0x0038 (0x0038 - 0x0000)
struct Component_spot_light_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fspot__light__entity__component_N_ROnRep__Color final
{
public:
	struct Component_0::Ftuple_L_R                __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_0;                          // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_1;                                         // 0x0008(0x0010)(HasGetValueTypeHash)
	struct Component_0::Ftuple_L_R                _ExprResult_2;                                     // 0x0018(0x0001)(HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_3;                          // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_4;                                         // 0x0020(0x0010)(HasGetValueTypeHash)
	struct Component_0::Ftuple_L_R                _ExprResult_5;                                     // 0x0030(0x0001)(HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Component_spot_light_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fspot__light__entity__component_N_ROnRep__Color;

// Function Component.Component_spot_light_entity_component._L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fspot__light__entity__component_N_ROnRep__InnerConeAngle
// 0x0038 (0x0038 - 0x0000)
struct Component_spot_light_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fspot__light__entity__component_N_ROnRep__InnerConeAngle final
{
public:
	struct Component_0::Ftuple_L_R                __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_0;                          // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_1;                                         // 0x0008(0x0010)(HasGetValueTypeHash)
	struct Component_0::Ftuple_L_R                _ExprResult_2;                                     // 0x0018(0x0001)(HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_3;                          // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_4;                                         // 0x0020(0x0010)(HasGetValueTypeHash)
	struct Component_0::Ftuple_L_R                _ExprResult_5;                                     // 0x0030(0x0001)(HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Component_spot_light_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fspot__light__entity__component_N_ROnRep__InnerConeAngle;

// Function Component.Component_spot_light_entity_component._L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fspot__light__entity__component_N_ROnRep__Intensity
// 0x0038 (0x0038 - 0x0000)
struct Component_spot_light_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fspot__light__entity__component_N_ROnRep__Intensity final
{
public:
	struct Component_0::Ftuple_L_R                __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_0;                          // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_1;                                         // 0x0008(0x0010)(HasGetValueTypeHash)
	struct Component_0::Ftuple_L_R                _ExprResult_2;                                     // 0x0018(0x0001)(HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_3;                          // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_4;                                         // 0x0020(0x0010)(HasGetValueTypeHash)
	struct Component_0::Ftuple_L_R                _ExprResult_5;                                     // 0x0030(0x0001)(HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Component_spot_light_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fspot__light__entity__component_N_ROnRep__Intensity;

// Function Component.Component_spot_light_entity_component._L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fspot__light__entity__component_N_ROnRep__OuterConeAngle
// 0x0038 (0x0038 - 0x0000)
struct Component_spot_light_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fspot__light__entity__component_N_ROnRep__OuterConeAngle final
{
public:
	struct Component_0::Ftuple_L_R                __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_0;                          // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_1;                                         // 0x0008(0x0010)(HasGetValueTypeHash)
	struct Component_0::Ftuple_L_R                _ExprResult_2;                                     // 0x0018(0x0001)(HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_3;                          // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_4;                                         // 0x0020(0x0010)(HasGetValueTypeHash)
	struct Component_0::Ftuple_L_R                _ExprResult_5;                                     // 0x0030(0x0001)(HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Component_spot_light_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fspot__light__entity__component_N_ROnRep__OuterConeAngle;

// Function Component.Component_spot_light_entity_component._L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fspot__light__entity__component_N_ROnRep__SourceLength
// 0x0038 (0x0038 - 0x0000)
struct Component_spot_light_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fspot__light__entity__component_N_ROnRep__SourceLength final
{
public:
	struct Component_0::Ftuple_L_R                __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_0;                          // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_1;                                         // 0x0008(0x0010)(HasGetValueTypeHash)
	struct Component_0::Ftuple_L_R                _ExprResult_2;                                     // 0x0018(0x0001)(HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_3;                          // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_4;                                         // 0x0020(0x0010)(HasGetValueTypeHash)
	struct Component_0::Ftuple_L_R                _ExprResult_5;                                     // 0x0030(0x0001)(HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Component_spot_light_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fspot__light__entity__component_N_ROnRep__SourceLength;

// Function Component.Component_spot_light_entity_component._L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fspot__light__entity__component_N_ROnRep__SourceRadius
// 0x0038 (0x0038 - 0x0000)
struct Component_spot_light_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fspot__light__entity__component_N_ROnRep__SourceRadius final
{
public:
	struct Component_0::Ftuple_L_R                __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_0;                          // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_1;                                         // 0x0008(0x0010)(HasGetValueTypeHash)
	struct Component_0::Ftuple_L_R                _ExprResult_2;                                     // 0x0018(0x0001)(HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_3;                          // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
