#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CosmeticsFrameworkLoadouts

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "CosmeticsFrameworkLoadouts_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function CosmeticsFrameworkLoadouts.CosmeticLoadoutSchema.GetTemplateId
// 0x0010 (0x0010 - 0x0000)
struct CosmeticLoadoutSchema_GetTemplateId final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CosmeticLoadoutSchema_GetTemplateId;

// Function CosmeticsFrameworkLoadouts.CosmeticLoadoutSlotTemplate.GetAlwaysUseDefaultCosmeticItemId
// 0x0001 (0x0001 - 0x0000)
struct CosmeticLoadoutSlotTemplate_GetAlwaysUseDefaultCosmeticItemId final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CosmeticLoadoutSlotTemplate_GetAlwaysUseDefaultCosmeticItemId;

// Function CosmeticsFrameworkLoadouts.CosmeticLoadoutSlotTemplate.GetDefaultCosmeticItemId
// 0x0008 (0x0008 - 0x0000)
struct CosmeticLoadoutSlotTemplate_GetDefaultCosmeticItemId final
{
public:
	struct FPrimaryAssetId                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CosmeticLoadoutSlotTemplate_GetDefaultCosmeticItemId;

// Function CosmeticsFrameworkLoadouts.CosmeticLoadoutSlotTemplate.GetMetaTags
// 0x0020 (0x0020 - 0x0000)
struct CosmeticLoadoutSlotTemplate_GetMetaTags final
{
public:
	struct FGameplayTagContainer                  ReturnValue;                                       // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CosmeticLoadoutSlotTemplate_GetMetaTags;

// Function CosmeticsFrameworkLoadouts.CosmeticLoadoutSlotTemplate.GetRequirements
// 0x0050 (0x0050 - 0x0000)
struct CosmeticLoadoutSlotTemplate_GetRequirements final
{
public:
	struct FCosmeticLoadoutSlotRequirements       ReturnValue;                                       // 0x0000(0x0050)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CosmeticLoadoutSlotTemplate_GetRequirements;

// Function CosmeticsFrameworkLoadouts.CosmeticLoadoutSlotTemplate.GetShortName
// 0x0010 (0x0010 - 0x0000)
struct CosmeticLoadoutSlotTemplate_GetShortName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CosmeticLoadoutSlotTemplate_GetShortName;

// Function CosmeticsFrameworkLoadouts.CosmeticLoadoutSlotTemplate.GetSlotTag
// 0x0004 (0x0004 - 0x0000)
struct CosmeticLoadoutSlotTemplate_GetSlotTag final
{
public:
	struct FGameplayTag                           ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CosmeticLoadoutSlotTemplate_GetSlotTag;

}

