#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CosmeticsFrameworkLoadouts

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "CosmeticsFrameworkLoadouts_structs.hpp"
#include "Engine_classes.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK
{

// Class CosmeticsFrameworkLoadouts.BasicCosmeticLoadoutContext
// 0x0008 (0x0030 - 0x0028)
class UBasicCosmeticLoadoutContext : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BasicCosmeticLoadoutContext")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BasicCosmeticLoadoutContext")
	}
	static class UBasicCosmeticLoadoutContext* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBasicCosmeticLoadoutContext>();
	}
};
DUMPER7_ASSERTS_UBasicCosmeticLoadoutContext;

// Class CosmeticsFrameworkLoadouts.CosmeticCustomizableItemDefinition
// 0x0000 (0x0000 - 0x0000)
class ICosmeticCustomizableItemDefinition final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CosmeticCustomizableItemDefinition")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CosmeticCustomizableItemDefinition")
	}
	static class ICosmeticCustomizableItemDefinition* GetDefaultObj()
	{
		return GetDefaultObjImpl<ICosmeticCustomizableItemDefinition>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_ICosmeticCustomizableItemDefinition;

// Class CosmeticsFrameworkLoadouts.CosmeticLoadoutContext
// 0x0000 (0x0000 - 0x0000)
class ICosmeticLoadoutContext final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CosmeticLoadoutContext")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CosmeticLoadoutContext")
	}
	static class ICosmeticLoadoutContext* GetDefaultObj()
	{
		return GetDefaultObjImpl<ICosmeticLoadoutContext>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_ICosmeticLoadoutContext;

// Class CosmeticsFrameworkLoadouts.CosmeticLoadoutItemDefinition
// 0x0000 (0x0000 - 0x0000)
class ICosmeticLoadoutItemDefinition final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CosmeticLoadoutItemDefinition")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CosmeticLoadoutItemDefinition")
	}
	static class ICosmeticLoadoutItemDefinition* GetDefaultObj()
	{
		return GetDefaultObjImpl<ICosmeticLoadoutItemDefinition>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_ICosmeticLoadoutItemDefinition;

// Class CosmeticsFrameworkLoadouts.CosmeticLoadoutSchema
// 0x0010 (0x0040 - 0x0030)
class UCosmeticLoadoutSchema final : public UPrimaryDataAsset
{
public:
	TArray<class UCosmeticLoadoutSlotTemplate*>   Slots;                                             // 0x0030(0x0010)(Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate)

public:
	class FString GetTemplateId() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CosmeticLoadoutSchema")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CosmeticLoadoutSchema")
	}
	static class UCosmeticLoadoutSchema* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCosmeticLoadoutSchema>();
	}
};
DUMPER7_ASSERTS_UCosmeticLoadoutSchema;

// Class CosmeticsFrameworkLoadouts.CosmeticLoadoutSlotTemplate
// 0x0098 (0x00C8 - 0x0030)
class UCosmeticLoadoutSlotTemplate final : public UPrimaryDataAsset
{
public:
	struct FGameplayTag                           SlotTag;                                           // 0x0030(0x0004)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  MetaTags;                                          // 0x0038(0x0020)(Edit, NativeAccessSpecifierPrivate)
	struct FCosmeticLoadoutSlotRequirements       Requirements;                                      // 0x0058(0x0050)(Edit, NativeAccessSpecifierPrivate)
	class FString                                 ShortName;                                         // 0x00A8(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FPrimaryAssetId                        DefaultCosmeticItemId;                             // 0x00B8(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bAlwaysUseDefaultCosmeticItemId;                   // 0x00C0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool GetAlwaysUseDefaultCosmeticItemId() const;
	struct FPrimaryAssetId GetDefaultCosmeticItemId() const;
	const struct FGameplayTagContainer GetMetaTags() const;
	const struct FCosmeticLoadoutSlotRequirements GetRequirements() const;
	class FString GetShortName() const;
	struct FGameplayTag GetSlotTag() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CosmeticLoadoutSlotTemplate")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CosmeticLoadoutSlotTemplate")
	}
	static class UCosmeticLoadoutSlotTemplate* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCosmeticLoadoutSlotTemplate>();
	}
};
DUMPER7_ASSERTS_UCosmeticLoadoutSlotTemplate;

}

