#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CraftingRuntime

#include "Basic.hpp"

#include "DataRegistry_structs.hpp"
#include "ModularGameplay_classes.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "CraftingRuntime_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class CraftingRuntime.CraftingObjectBGA
// 0x0068 (0x09E8 - 0x0980)
class ACraftingObjectBGA : public ABuildingGameplayActor
{
public:
	uint8                                         Pad_980[0x8];                                      // 0x0980(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortInventory*                         Inventory;                                         // 0x0988(0x0008)(Net, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_990[0x18];                                     // 0x0990(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class USphereComponent*                       SphereComponent_InteractionRange;                  // 0x09A8(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftClassPtr<class UClass>                   MenuWidget;                                        // 0x09B0(0x0020)(Edit, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UWidgetComponent*                       WidgetComponent_PotContents;                       // 0x09D0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bShowCraftingUI;                                   // 0x09D8(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bSendEventMessageOnLocalInteract;                  // 0x09D9(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_9DA[0x6];                                      // 0x09DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   CraftingObjectMesh;                                // 0x09E0(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void HandleInteractionRangeBeginOverlap(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void HandleInteractionRangeEndOverlap(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CraftingObjectBGA")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CraftingObjectBGA")
	}
	static class ACraftingObjectBGA* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACraftingObjectBGA>();
	}
};
DUMPER7_ASSERTS_ACraftingObjectBGA;

// Class CraftingRuntime.CraftingCheatManager
// 0x0000 (0x0028 - 0x0028)
class UCraftingCheatManager final : public UChildCheatManager
{
public:
	void StartSelfCrafting(class FName FormulaName);
	void ToggleFreeCrafting();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CraftingCheatManager")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CraftingCheatManager")
	}
	static class UCraftingCheatManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCraftingCheatManager>();
	}
};
DUMPER7_ASSERTS_UCraftingCheatManager;

// Class CraftingRuntime.CraftingObjectComponent
// 0x03D0 (0x0470 - 0x00A0)
class UCraftingObjectComponent final : public UGameFrameworkComponent
{
public:
	TMulticastInlineDelegate<void(const struct FCraftingObjectStateChangedEvent& Payload)> CraftingObjectStateChanged; // 0x00A0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const class FName& FormulaRowName, bool bIsCraftable)> OnFormulaCraftableChanged; // 0x00B0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FCraftingObjectSuccessEvent& Payload)> OnCraftingSuccess; // 0x00C0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TDelegate<void(class AFortPlayerController* Instigator)> OnCraftingAdditionalValidationCheck;    // 0x00D0(0x000C)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FCraftingObjectRepStateData>    CraftingObjectRepStateData;                        // 0x00E0(0x0010)(Net, ZeroConstructor, Transient, RepNotify, NativeAccessSpecifierPrivate)
	TMap<struct FCraftingMultiKey, struct FCraftingObjectServerStateData> CraftingObjectServerStateData; // 0x00F0(0x0050)(Transient, NativeAccessSpecifierPrivate)
	class FName                                   LastCraftedItemFormulaRow;                         // 0x0140(0x0004)(Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_144[0x4];                                      // 0x0144(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 LastIngredientStringForAnalytics;                  // 0x0148(0x0010)(ZeroConstructor, Transient, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                 LastFormulaStringForAnalytics;                     // 0x0158(0x0010)(ZeroConstructor, Transient, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                 LastResultsStringForAnalytics;                     // 0x0168(0x0010)(ZeroConstructor, Transient, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayAbilitySpecHandle             WhileCraftingAbilitySpecHandle;                    // 0x0178(0x0004)(Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayAbilitySpecHandle             OwnerCraftingAbilitySpecHandle;                    // 0x017C(0x0004)(Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTag                           CraftingObjectTag;                                 // 0x0180(0x0004)(NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_184[0x4];                                      // 0x0184(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CraftingObjectTags;                                // 0x0188(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         CraftingTimeLength;                                // 0x01A8(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         ReadyTimeLength;                                   // 0x01D0(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         OverCraftingTimeLength;                            // 0x01F8(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         ResettingTimeLength;                               // 0x0220(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	class FName                                   OverCraftingLootTierKey;                           // 0x0248(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         bTakeItemsAtCraftingStart : 1;                     // 0x024C(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         Pad_24D[0x3];                                      // 0x024D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DecayRate;                                         // 0x0250(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         bGiveIngredientsToCraftingObject : 1;              // 0x0254(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bGiveIngredientsToInstigator : 1;                  // 0x0254(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         Pad_255[0x3];                                      // 0x0255(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                IngredientSpawnOffset;                             // 0x0258(0x0018)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         bGiveToCraftingObject : 1;                         // 0x0270(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bGiveResultToInstigator : 1;                       // 0x0270(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         Pad_271[0x7];                                      // 0x0271(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftClassPtr<class UClass>                   OwnerCraftingAbility;                              // 0x0278(0x0020)(Edit, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftClassPtr<class UClass>                   WhileCraftingAbility;                              // 0x0298(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftClassPtr<class UClass>                   InstigatorWhileCraftingAbility;                    // 0x02B8(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bScaleMultiCraftingTime;                           // 0x02D8(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2D9[0x7];                                      // 0x02D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CraftingFailedTags;                                // 0x02E0(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_300[0x168];                                    // 0x0300(0x0168)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          FreeCraftingEnabled;                               // 0x0468(0x0001)(Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_469[0x7];                                      // 0x0469(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandlePickupCraftingItemPickedUp(class AFortPickup* Pickup, class AFortPawn* InteractingPawn, const class UFortWorldItemDefinition* WorldItemDefinition, const struct FVector& PickupLocation);
	void OnRep_CraftingObjectRepStateData(const TArray<struct FCraftingObjectRepStateData>& OldValue);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CraftingObjectComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CraftingObjectComponent")
	}
	static class UCraftingObjectComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCraftingObjectComponent>();
	}
};
DUMPER7_ASSERTS_UCraftingObjectComponent;

// Class CraftingRuntime.FortControllerComponent_CraftingNetworkEvents
// 0x0010 (0x00B8 - 0x00A8)
class UFortControllerComponent_CraftingNetworkEvents final : public UFortControllerComponent
{
public:
	TMulticastInlineDelegate<void(const struct FCraftingObjectSuccessEvent& Payload)> OnCraftingSuccess; // 0x00A8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)

public:
	void ClientNotifyCraftingFailed(class AActor* CraftingObject, const struct FGameplayTagContainer& FailedReason, const struct FCraftingMultiKey& Key);
	void ClientNotifyCraftingSuccess(class AActor* CraftingObject, const class FName& FormulaRowName, const TArray<struct FFortItemEntry>& ConsumedIngredients, const struct FCraftingMultiKey& Key);
	void NotifyCraftingSuccess(class AActor* CraftingObject, const class FName& FormulaRowName, const TArray<struct FFortItemEntry>& ConsumedIngredients, const struct FCraftingMultiKey& Key);
	void ServerCancelCrafting(class AActor* CraftingObject, const struct FCraftingMultiKey& Key);
	void ServerClaimCraftingResults(class AActor* CraftingObject, const struct FCraftingMultiKey& Key);
	void ServerEjectItems(class AActor* CraftingObject);
	void ServerPauseCrafting(class AActor* CraftingObject, bool bDecayPausedTime, const struct FCraftingMultiKey& Key);
	void ServerPickupItemAndStartCrafting(class AActor* CraftingObject, class AFortPickup* Pickup, const class FName& CraftingFormulaName, const struct FCraftingMultiKey& Key);
	void ServerReportCraftingSuccess(class AActor* CraftingObject, const struct FCraftingMultiKey& Key);
	void ServerResumeCrafting(class AActor* CraftingObject, const struct FCraftingMultiKey& Key);
	void ServerStartCrafting(class AActor* CraftingObject, const class FName& CraftingFormulaName, const int32 NumberToCraft, const struct FCraftingMultiKey& Key);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortControllerComponent_CraftingNetworkEvents")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortControllerComponent_CraftingNetworkEvents")
	}
	static class UFortControllerComponent_CraftingNetworkEvents* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortControllerComponent_CraftingNetworkEvents>();
	}
};
DUMPER7_ASSERTS_UFortControllerComponent_CraftingNetworkEvents;

// Class CraftingRuntime.FortGameStateComponent_Crafting
// 0x01B0 (0x0250 - 0x00A0)
class UFortGameStateComponent_Crafting : public UFortGameStateComponent
{
public:
	struct FDataRegistryType                      CraftingFormulaRegistryType;                       // 0x00A0(0x0004)(ZeroConstructor, Config, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FDataRegistryType                      CraftingIngredientsUIDataRegistryType;             // 0x00A4(0x0004)(ZeroConstructor, Config, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_A8[0x148];                                     // 0x00A8(0x0148)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FCraftingResult>                CraftingResultsList;                               // 0x01F0(0x0010)(Net, ZeroConstructor, RepNotify, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_200[0x50];                                     // 0x0200(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnPlaylistDataReady(class AFortGameStateAthena* GameState, const class UFortPlaylist* Playlist, const struct FGameplayTagContainer& PlaylistContextTags);
	void OnRep_CraftingResultsList();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortGameStateComponent_Crafting")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortGameStateComponent_Crafting")
	}
	static class UFortGameStateComponent_Crafting* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortGameStateComponent_Crafting>();
	}
};
DUMPER7_ASSERTS_UFortGameStateComponent_Crafting;

// Class CraftingRuntime.FortPickupInteractOverrideComponent_Crafting
// 0x0020 (0x00E0 - 0x00C0)
class UFortPickupInteractOverrideComponent_Crafting final : public UFortPickupInteractOverrideComponent
{
public:
	class UFortItemDefinition*                    LastPickupItemDef;                                 // 0x00C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortItemDefinition*                    LastFocusedItemDef;                                // 0x00C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   LastTargetFormulaName;                             // 0x00D0(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         ContextualCraftingInteractDuration;                // 0x00D4(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ETInteractionType                             CachedInteractionType;                             // 0x00D8(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EInteractionBeingAttempted                    CachedInteractionBeingAttempted;                   // 0x00D9(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_DA[0x6];                                       // 0x00DA(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortPickupInteractOverrideComponent_Crafting")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortPickupInteractOverrideComponent_Crafting")
	}
	static class UFortPickupInteractOverrideComponent_Crafting* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortPickupInteractOverrideComponent_Crafting>();
	}
};
DUMPER7_ASSERTS_UFortPickupInteractOverrideComponent_Crafting;

// Class CraftingRuntime.FortContextualTutorial_CraftingComplete
// 0x0000 (0x00F8 - 0x00F8)
class UFortContextualTutorial_CraftingComplete final : public UFortContextualTutorial
{
public:
	void OnCraftingSuccess(const struct FCraftingObjectSuccessEvent& Event);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortContextualTutorial_CraftingComplete")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortContextualTutorial_CraftingComplete")
	}
	static class UFortContextualTutorial_CraftingComplete* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortContextualTutorial_CraftingComplete>();
	}
};
DUMPER7_ASSERTS_UFortContextualTutorial_CraftingComplete;

// Class CraftingRuntime.FortContextualTutorial_CraftingReady
// 0x0000 (0x00F8 - 0x00F8)
class UFortContextualTutorial_CraftingReady final : public UFortContextualTutorial
{
public:
	void HandleFormulaCraftableChanged(const class FName& FormulaRowName, bool bIsCraftable);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortContextualTutorial_CraftingReady")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortContextualTutorial_CraftingReady")
	}
	static class UFortContextualTutorial_CraftingReady* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortContextualTutorial_CraftingReady>();
	}
};
DUMPER7_ASSERTS_UFortContextualTutorial_CraftingReady;

// Class CraftingRuntime.FortContextualTutorial_CraftingTabOpen
// 0x0008 (0x0100 - 0x00F8)
class UFortContextualTutorial_CraftingTabOpen final : public UFortContextualTutorial
{
public:
	uint8                                         Pad_F8[0x8];                                       // 0x00F8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleFormulaCraftableChanged(const class FName& FormulaRowName, bool bIsCraftable);
	void HandleInventoryTabChanged(const class FName InventoryTabNameId);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortContextualTutorial_CraftingTabOpen")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortContextualTutorial_CraftingTabOpen")
	}
	static class UFortContextualTutorial_CraftingTabOpen* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortContextualTutorial_CraftingTabOpen>();
	}
};
DUMPER7_ASSERTS_UFortContextualTutorial_CraftingTabOpen;

// Class CraftingRuntime.CraftingGlobals
// 0x0000 (0x0028 - 0x0028)
class UCraftingGlobals final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CraftingGlobals")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CraftingGlobals")
	}
	static class UCraftingGlobals* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCraftingGlobals>();
	}
};
DUMPER7_ASSERTS_UCraftingGlobals;

// Class CraftingRuntime.CraftingLibrary
// 0x0000 (0x0028 - 0x0028)
class UCraftingLibrary final : public UBlueprintFunctionLibrary
{
public:
	static void CancelAllCrafting(class AActor* CraftingObject);
	static void CancelCrafting(class AFortPlayerController* Instigator, class AActor* CraftingObject, const struct FCraftingMultiKey& Key);
	static bool CanCraftFormula(const class AFortPlayerController* FortPC, const class AActor* CraftingObject, const class FName CraftingFormulaRow, TArray<struct FCraftingIngredientQueryState>* OutIngredientStates, const int32 NumberToCraft);
	static bool CanCraftFormulaWithAdditionalItems(const class AFortPlayerController* FortPC, const class AActor* CraftingObject, const class FName CraftingFormulaRow, const TArray<struct FItemAndCount>& AdditionalItems, TArray<struct FCraftingIngredientQueryState>* OutIngredientStates, const int32 NumberToCraft);
	static void ClaimCraftingResults(class AFortPlayerController* Instigator, class AActor* CraftingObject, const struct FCraftingMultiKey& Key);
	static void EjectItems(class AFortPlayerController* Instigator, class AActor* CraftingObject);
	static void GetAllCraftableFormulas(const class AFortPlayerController* FortPC, const class AActor* CraftingObject, TArray<class FName>* OutFormulas);
	static void GetAllCraftingFormulas(const class AFortPlayerController* FortPC, const class AActor* CraftingObject, TArray<class FName>* OutFormulas);
	static void GetAllValidIngredients(const class AFortPlayerController* FortPC, const class AActor* CraftingObject, TArray<struct FGameplayTagContainer>* OutIngredients);
	static TArray<class UFortWorldItem*> GetCraftedResults_TempItems(class AActor* CraftingObject, const struct FCraftingMultiKey& Key);
	static bool GetCraftingFormulaIngredientRequirements(class UObject* WorldContextObject, const class FName& CraftingFormulaRow, TArray<struct FCraftingIngredientRequirement>* OutIngredientRequirements);
	static class FName GetCraftingFormulaNameBeingCrafted(class AActor* CraftingObject, const struct FCraftingMultiKey& Key);
	static TArray<class UFortWorldItem*> GetCraftingIngredients_TempItems(class AActor* CraftingObject, const struct FCraftingMultiKey& Key);
	static class UCraftingObjectComponent* GetCraftingObjectComponent(const class AActor* CraftingObject);
	static ECraftingObjectState GetCraftingObjectCraftingState(class AActor* CraftingObject, const struct FCraftingMultiKey& Key);
	static float GetCraftingObjectCurrentCraftingStateEndTime(const class AActor* CraftingObject, const struct FCraftingMultiKey& Key);
	static float GetCraftingObjectCurrentCraftingStateStartTime(const class AActor* CraftingObject, const struct FCraftingMultiKey& Key);
	static float GetCraftingObjectCurrentCraftingStateTimeLeft(const class AActor* CraftingObject, const struct FCraftingMultiKey& Key);
	static float GetCraftingObjectPausedTime(const class AActor* CraftingObject, const struct FCraftingMultiKey& Key);
	static struct FGameplayTagContainer GetCraftingObjectTags(const class AActor* CraftingObject);
	static void GetCraftingResultsForRowName(const class UObject* WorldContextObject, const class FName& CraftingFormulaRow, TArray<struct FItemAndCount>* OutResults, int32 NumToCraft);
	static TArray<class UFortWorldItem*> GetIngredientsInCraftingObject(class AActor* CraftingObject);
	static void GetKnownCraftingFormulas(const class AFortPlayerController* FortPC, const class AActor* CraftingObject, TArray<class FName>* OutFormulas);
	static class FName GetLastCraftedItemFormulaName(class AActor* CraftingObject);
	static float GetTimeToCraftRecipe(const class AActor* CraftingObject, const class FName& CraftingFormulaName);
	static void GetUIDataForCraftingIngredientTags(class UObject* WorldContextObject, const struct FGameplayTagContainer& IngredientTags, TArray<TSoftObjectPtr<class UFortItemDefinition>>* OutItemDefs, TArray<TSoftObjectPtr<class UObject>>* OutIcons);
	static void GetValidIngredientsInInventory(const class AFortPlayerController* FortPC, const class AActor* CraftingObject, TArray<class UFortWorldItem*>* OutIngredients);
	static void GiveItemToCraftingObject(class AFortPlayerController* Instigator, class AActor* CraftingObject, const struct FFortItemEntry& ItemEntryToGrant);
	static bool IsFreeCraftingEnabled(const class AActor* CraftingObject);
	static bool IsValidIngredient(const class AFortPlayerController* FortPC, const class AActor* CraftingObject, const class UFortItemDefinition* ItemDef);
	static void PauseCrafting(class AFortPlayerController* Instigator, class AActor* CraftingObject, bool bDecayPausedTime, const struct FCraftingMultiKey& Key);
	static void PickupItemAndStartCrafting(class AFortPlayerController* Instigator, class AActor* CraftingObject, class AFortPickup* Pickup, const class FName& CraftingFormulaName, const struct FCraftingMultiKey& Key);
	static void ReportCraftingSuccess(class AFortPlayerController* Instigator, class AActor* CraftingObject, const struct FCraftingMultiKey& Key);
	static void ResumeCrafting(class AFortPlayerController* Instigator, class AActor* CraftingObject, const struct FCraftingMultiKey& Key);
	static void StartCrafting(class AFortPlayerController* Instigator, class AActor* CraftingObject, const class FName& CraftingFormulaName, const int32 NumberToCraft, const struct FCraftingMultiKey& Key);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CraftingLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CraftingLibrary")
	}
	static class UCraftingLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCraftingLibrary>();
	}
};
DUMPER7_ASSERTS_UCraftingLibrary;

}

