#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CreativeEmporiumUI

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "CreativeEmporiumUI_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function CreativeEmporiumUI.EmporiumBrowserFilterEntry.SetIsFilterActive
// 0x0001 (0x0001 - 0x0000)
struct EmporiumBrowserFilterEntry_SetIsFilterActive final
{
public:
	bool                                          bInFilterActive;                                   // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EmporiumBrowserFilterEntry_SetIsFilterActive;

// Function CreativeEmporiumUI.EmporiumBrowserFilterEntry.UpdateCheckMarkState
// 0x0001 (0x0001 - 0x0000)
struct EmporiumBrowserFilterEntry_UpdateCheckMarkState final
{
public:
	bool                                          bIsChecked;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EmporiumBrowserFilterEntry_UpdateCheckMarkState;

// Function CreativeEmporiumUI.EmporiumBrowserFilterEntry.UpdateItemCount
// 0x0004 (0x0004 - 0x0000)
struct EmporiumBrowserFilterEntry_UpdateItemCount final
{
public:
	int32                                         ItemCount;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EmporiumBrowserFilterEntry_UpdateItemCount;

// Function CreativeEmporiumUI.EmporiumBrowserFilterEntry.IsFilterActive
// 0x0001 (0x0001 - 0x0000)
struct EmporiumBrowserFilterEntry_IsFilterActive final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EmporiumBrowserFilterEntry_IsFilterActive;

// Function CreativeEmporiumUI.EmporiumBrowserFiltersPanel.ExcludeItemDetailTag
// 0x0004 (0x0004 - 0x0000)
struct EmporiumBrowserFiltersPanel_ExcludeItemDetailTag final
{
public:
	class FName                                   TagID;                                             // 0x0000(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EmporiumBrowserFiltersPanel_ExcludeItemDetailTag;

// Function CreativeEmporiumUI.EmporiumBrowserFiltersPanel.HandleCategoryActivated
// 0x0010 (0x0010 - 0x0000)
struct EmporiumBrowserFiltersPanel_HandleCategoryActivated final
{
public:
	bool                                          bIsExpanded;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                ListItemObject;                                    // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EmporiumBrowserFiltersPanel_HandleCategoryActivated;

// Function CreativeEmporiumUI.EmporiumBrowserFiltersPanel.HandleCategoryExpansion
// 0x0008 (0x0008 - 0x0000)
struct EmporiumBrowserFiltersPanel_HandleCategoryExpansion final
{
public:
	class UObject*                                ListItemObject;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EmporiumBrowserFiltersPanel_HandleCategoryExpansion;

// Function CreativeEmporiumUI.EmporiumBrowserFiltersPanel.HandleCategoryWidgetDestroyed
// 0x0008 (0x0008 - 0x0000)
struct EmporiumBrowserFiltersPanel_HandleCategoryWidgetDestroyed final
{
public:
	class UObject*                                ListItemObject;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EmporiumBrowserFiltersPanel_HandleCategoryWidgetDestroyed;

// Function CreativeEmporiumUI.EmporiumBrowserFiltersPanel.HandleFilterEnabled
// 0x0010 (0x0010 - 0x0000)
struct EmporiumBrowserFiltersPanel_HandleFilterEnabled final
{
public:
	bool                                          bIsFilterEnabled;                                  // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                ListItemObject;                                    // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EmporiumBrowserFiltersPanel_HandleFilterEnabled;

// Function CreativeEmporiumUI.EmporiumBrowserFiltersPanel.HandleFilterSelected
// 0x0010 (0x0010 - 0x0000)
struct EmporiumBrowserFiltersPanel_HandleFilterSelected final
{
public:
	bool                                          bIsFilterEnabled;                                  // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UEmporiumBrowserFilterEntry*            Entry;                                             // 0x0008(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EmporiumBrowserFiltersPanel_HandleFilterSelected;

// Function CreativeEmporiumUI.EmporiumBrowserFiltersPanel.HandleSearchTextChanged
// 0x0018 (0x0018 - 0x0000)
struct EmporiumBrowserFiltersPanel_HandleSearchTextChanged final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EmporiumBrowserFiltersPanel_HandleSearchTextChanged;

// Function CreativeEmporiumUI.EmporiumBrowserFiltersPanel.HandleShowAllEnabled
// 0x0010 (0x0010 - 0x0000)
struct EmporiumBrowserFiltersPanel_HandleShowAllEnabled final
{
public:
	bool                                          bShowAllItems;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                ListItemObject;                                    // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EmporiumBrowserFiltersPanel_HandleShowAllEnabled;

// Function CreativeEmporiumUI.EmporiumBrowserFiltersPanel.IncludeItemDetailTag
// 0x0004 (0x0004 - 0x0000)
struct EmporiumBrowserFiltersPanel_IncludeItemDetailTag final
{
public:
	class FName                                   TagID;                                             // 0x0000(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EmporiumBrowserFiltersPanel_IncludeItemDetailTag;

// Function CreativeEmporiumUI.EmporiumBrowserFiltersPanel.NavigateToNextSection
// 0x0010 (0x0010 - 0x0000)
struct EmporiumBrowserFiltersPanel_NavigateToNextSection final
{
public:
	bool                                          bReverse;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                ReturnValue;                                       // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EmporiumBrowserFiltersPanel_NavigateToNextSection;

// Function CreativeEmporiumUI.EmporiumBrowserFiltersPanel.OnSetSearchText
// 0x0018 (0x0018 - 0x0000)
struct EmporiumBrowserFiltersPanel_OnSetSearchText final
{
public:
	class FText                                   NewSearchText;                                     // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EmporiumBrowserFiltersPanel_OnSetSearchText;

// Function CreativeEmporiumUI.EmporiumBrowserFiltersPanel.OnSetSearchVisible
// 0x0001 (0x0001 - 0x0000)
struct EmporiumBrowserFiltersPanel_OnSetSearchVisible final
{
public:
	bool                                          bVisible;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EmporiumBrowserFiltersPanel_OnSetSearchVisible;

// Function CreativeEmporiumUI.EmporiumBrowserFiltersPanel.SetItemDetailTags
// 0x0010 (0x0010 - 0x0000)
struct EmporiumBrowserFiltersPanel_SetItemDetailTags final
{
public:
	TArray<class FName>                           TagIDs;                                            // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EmporiumBrowserFiltersPanel_SetItemDetailTags;

// Function CreativeEmporiumUI.EmporiumBrowserFiltersPanel.GetFilterCount
// 0x0004 (0x0004 - 0x0000)
struct EmporiumBrowserFiltersPanel_GetFilterCount final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EmporiumBrowserFiltersPanel_GetFilterCount;

// Function CreativeEmporiumUI.FortEmporiumFilterCategoryHeader.ActivateCategory
// 0x0001 (0x0001 - 0x0000)
struct FortEmporiumFilterCategoryHeader_ActivateCategory final
{
public:
	bool                                          bExpanded;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortEmporiumFilterCategoryHeader_ActivateCategory;

// Function CreativeEmporiumUI.FortEmporiumFilterCategoryHeader.AddSubcategoryWidget
// 0x0008 (0x0008 - 0x0000)
struct FortEmporiumFilterCategoryHeader_AddSubcategoryWidget final
{
public:
	class UWidget*                                SubcategoryWidget;                                 // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortEmporiumFilterCategoryHeader_AddSubcategoryWidget;

// Function CreativeEmporiumUI.FortEmporiumFilterCategoryHeader.EnableCategoryExpansion
// 0x0001 (0x0001 - 0x0000)
struct FortEmporiumFilterCategoryHeader_EnableCategoryExpansion final
{
public:
	bool                                          bShow;                                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortEmporiumFilterCategoryHeader_EnableCategoryExpansion;

// Function CreativeEmporiumUI.FortEmporiumFilterCategoryHeader.ExpandCategory
// 0x0001 (0x0001 - 0x0000)
struct FortEmporiumFilterCategoryHeader_ExpandCategory final
{
public:
	bool                                          bExpanded;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortEmporiumFilterCategoryHeader_ExpandCategory;

// Function CreativeEmporiumUI.FortEmporiumFilterCategoryHeader.SetCategoryText
// 0x0018 (0x0018 - 0x0000)
struct FortEmporiumFilterCategoryHeader_SetCategoryText final
{
public:
	class FText                                   NewButtonText;                                     // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortEmporiumFilterCategoryHeader_SetCategoryText;

// Function CreativeEmporiumUI.FortEmporiumFilterCategoryHeader.SetSubcategoryCount
// 0x0004 (0x0004 - 0x0000)
struct FortEmporiumFilterCategoryHeader_SetSubcategoryCount final
{
public:
	int32                                         NewCount;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortEmporiumFilterCategoryHeader_SetSubcategoryCount;

// Function CreativeEmporiumUI.FortEmporiumFilterCategoryHeader.ShowCategoryActive
// 0x0001 (0x0001 - 0x0000)
struct FortEmporiumFilterCategoryHeader_ShowCategoryActive final
{
public:
	bool                                          bIsActive;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortEmporiumFilterCategoryHeader_ShowCategoryActive;

// Function CreativeEmporiumUI.FortEmporiumFilterCategoryHeader.UpdateCategoryCount
// 0x0008 (0x0008 - 0x0000)
struct FortEmporiumFilterCategoryHeader_UpdateCategoryCount final
{
public:
	int32                                         NewCount;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHideIfEmpty;                                      // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FortEmporiumFilterCategoryHeader_UpdateCategoryCount;

// Function CreativeEmporiumUI.FortEmporiumFilterCategoryHeader.GetCategoryButton
// 0x0008 (0x0008 - 0x0000)
struct FortEmporiumFilterCategoryHeader_GetCategoryButton final
{
public:
	class UCommonButtonBase*                      ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortEmporiumFilterCategoryHeader_GetCategoryButton;

// Function CreativeEmporiumUI.FortEmporiumFilterCategoryHeader.GetSubcategoryWidgets
// 0x0010 (0x0010 - 0x0000)
struct FortEmporiumFilterCategoryHeader_GetSubcategoryWidgets final
{
public:
	TArray<class UWidget*>                        ReturnValue;                                       // 0x0000(0x0010)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortEmporiumFilterCategoryHeader_GetSubcategoryWidgets;

// Function CreativeEmporiumUI.FortEmporiumHomeListEntry.UpdateWarningMessage
// 0x0001 (0x0001 - 0x0000)
struct FortEmporiumHomeListEntry_UpdateWarningMessage final
{
public:
	bool                                          bShowMessage;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortEmporiumHomeListEntry_UpdateWarningMessage;

// Function CreativeEmporiumUI.FortEmporiumHomeListEntry.GetCardSizeForCategory
// 0x0001 (0x0001 - 0x0000)
struct FortEmporiumHomeListEntry_GetCardSizeForCategory final
{
public:
	EFortItemCardSize                             ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortEmporiumHomeListEntry_GetCardSizeForCategory;

// Function CreativeEmporiumUI.FortEmporiumHomeListEntry.GetCollapseBorderPadFlagForCategory
// 0x0001 (0x0001 - 0x0000)
struct FortEmporiumHomeListEntry_GetCollapseBorderPadFlagForCategory final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortEmporiumHomeListEntry_GetCollapseBorderPadFlagForCategory;

// Function CreativeEmporiumUI.FortEmporiumHomeListView.GetFocusWidget
// 0x0008 (0x0008 - 0x0000)
struct FortEmporiumHomeListView_GetFocusWidget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortEmporiumHomeListView_GetFocusWidget;

// Function CreativeEmporiumUI.FortEmporiumItemDefinition.GetEmporiumItemData
// 0x00E8 (0x00E8 - 0x0000)
struct FortEmporiumItemDefinition_GetEmporiumItemData final
{
public:
	struct FFortEmporiumItemData                  ReturnValue;                                       // 0x0000(0x00E8)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortEmporiumItemDefinition_GetEmporiumItemData;

// Function CreativeEmporiumUI.FortEmporiumItemDetailsPanel.HandleItemTagSelected
// 0x0008 (0x0008 - 0x0000)
struct FortEmporiumItemDetailsPanel_HandleItemTagSelected final
{
public:
	class FName                                   TagID;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSelected;                                         // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FortEmporiumItemDetailsPanel_HandleItemTagSelected;

// Function CreativeEmporiumUI.FortEmporiumItemDetailsPanel.IsShowingAdditionalButtons
// 0x0001 (0x0001 - 0x0000)
struct FortEmporiumItemDetailsPanel_IsShowingAdditionalButtons final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortEmporiumItemDetailsPanel_IsShowingAdditionalButtons;

// Function CreativeEmporiumUI.FortEmporiumItemDetailsPanel.SetActiveItemDetailTags
// 0x0010 (0x0010 - 0x0000)
struct FortEmporiumItemDetailsPanel_SetActiveItemDetailTags final
{
public:
	TArray<class FName>                           ActiveTags;                                        // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortEmporiumItemDetailsPanel_SetActiveItemDetailTags;

// Function CreativeEmporiumUI.FortEmporiumItemDetailsPanel.SetItemDetails
// 0x0010 (0x0010 - 0x0000)
struct FortEmporiumItemDetailsPanel_SetItemDetails final
{
public:
	const class UFortItem*                        FortItem;                                          // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseLargeThumbnail;                                // 0x0008(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAllowInteractiveTags;                             // 0x0009(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FortEmporiumItemDetailsPanel_SetItemDetails;

// Function CreativeEmporiumUI.FortEmporiumItemDetailsPanel.SetItemToDetail
// 0x0010 (0x0010 - 0x0000)
struct FortEmporiumItemDetailsPanel_SetItemToDetail final
{
public:
	const class UFortItem*                        InItemToDetail;                                    // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseLargeThumbnail;                                // 0x0008(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAllowInteractiveTags;                             // 0x0009(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FortEmporiumItemDetailsPanel_SetItemToDetail;

// Function CreativeEmporiumUI.FortEmporiumItemDetailsPanel.SetSpecialItemTagVisibility
// 0x0004 (0x0004 - 0x0000)
struct FortEmporiumItemDetailsPanel_SetSpecialItemTagVisibility final
{
public:
	class FName                                   SpecialItemTag;                                    // 0x0000(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortEmporiumItemDetailsPanel_SetSpecialItemTagVisibility;

// Function CreativeEmporiumUI.FortEmporiumItemDetailsPanel.UpdateItemDetailsDisplay
// 0x0001 (0x0001 - 0x0000)
struct FortEmporiumItemDetailsPanel_UpdateItemDetailsDisplay final
{
public:
	bool                                          bShowItemDetails;                                  // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortEmporiumItemDetailsPanel_UpdateItemDetailsDisplay;

// Function CreativeEmporiumUI.FortEmporiumItemDetailsPanel.BP_GetSpecialItemTags
// 0x0010 (0x0010 - 0x0000)
struct FortEmporiumItemDetailsPanel_BP_GetSpecialItemTags final
{
public:
	TArray<class FName>                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortEmporiumItemDetailsPanel_BP_GetSpecialItemTags;

// Function CreativeEmporiumUI.FortEmporiumItemDetailsPanel.HasLegacyItemDetailsPanel
// 0x0001 (0x0001 - 0x0000)
struct FortEmporiumItemDetailsPanel_HasLegacyItemDetailsPanel final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortEmporiumItemDetailsPanel_HasLegacyItemDetailsPanel;

// Function CreativeEmporiumUI.FortEmporiumItemDetailsPanel.IsShowingExtendedDataPanel
// 0x0001 (0x0001 - 0x0000)
struct FortEmporiumItemDetailsPanel_IsShowingExtendedDataPanel final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortEmporiumItemDetailsPanel_IsShowingExtendedDataPanel;

// Function CreativeEmporiumUI.FortEmporiumItemInfo.SetSelectItemTagsIcon
// 0x00C0 (0x00C0 - 0x0000)
struct FortEmporiumItemInfo_SetSelectItemTagsIcon final
{
public:
	struct FSlateBrush                            SelectItemTagsIcon;                                // 0x0000(0x00C0)(Parm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortEmporiumItemInfo_SetSelectItemTagsIcon;

// Function CreativeEmporiumUI.FortEmporiumItemInfo.SetSelectItemTagsPrompt
// 0x0018 (0x0018 - 0x0000)
struct FortEmporiumItemInfo_SetSelectItemTagsPrompt final
{
public:
	class FText                                   Prompt;                                            // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortEmporiumItemInfo_SetSelectItemTagsPrompt;

// Function CreativeEmporiumUI.FortEmporiumItemInfo.ShowSelectItemTagsPrompt
// 0x0001 (0x0001 - 0x0000)
struct FortEmporiumItemInfo_ShowSelectItemTagsPrompt final
{
public:
	bool                                          bShowPrompt;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortEmporiumItemInfo_ShowSelectItemTagsPrompt;

// Function CreativeEmporiumUI.FortEmporiumItemInfo.UpdateWithFortItem
// 0x0010 (0x0010 - 0x0000)
struct FortEmporiumItemInfo_UpdateWithFortItem final
{
public:
	const class UFortItem*                        Item;                                              // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAllowInteractiveTags;                             // 0x0008(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FortEmporiumItemInfo_UpdateWithFortItem;

// Function CreativeEmporiumUI.FortEmporiumItemInfo.HasFocusableTags
// 0x0001 (0x0001 - 0x0000)
struct FortEmporiumItemInfo_HasFocusableTags final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortEmporiumItemInfo_HasFocusableTags;

// Function CreativeEmporiumUI.FortEmporiumItemListMenu.AddSelectionToQuickBar
// 0x0001 (0x0001 - 0x0000)
struct FortEmporiumItemListMenu_AddSelectionToQuickBar final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortEmporiumItemListMenu_AddSelectionToQuickBar;

// Function CreativeEmporiumUI.FortEmporiumItemListMenu.DropItem
// 0x01A8 (0x01A8 - 0x0000)
struct FortEmporiumItemListMenu_DropItem final
{
public:
	struct FFortItemEntry                         SelectedItem;                                      // 0x0000(0x01A0)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x01A0(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1A1[0x7];                                      // 0x01A1(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FortEmporiumItemListMenu_DropItem;

// Function CreativeEmporiumUI.FortEmporiumItemListMenu.EquipItem
// 0x01A8 (0x01A8 - 0x0000)
struct FortEmporiumItemListMenu_EquipItem final
{
public:
	struct FFortItemEntry                         ItemEntry;                                         // 0x0000(0x01A0)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x01A0(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1A1[0x7];                                      // 0x01A1(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FortEmporiumItemListMenu_EquipItem;

// Function CreativeEmporiumUI.FortEmporiumItemListMenu.EquipSelection
// 0x0001 (0x0001 - 0x0000)
struct FortEmporiumItemListMenu_EquipSelection final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortEmporiumItemListMenu_EquipSelection;

// Function CreativeEmporiumUI.FortEmporiumItemListMenu.HandleCategoryActivated
// 0x0004 (0x0004 - 0x0000)
struct FortEmporiumItemListMenu_HandleCategoryActivated final
{
public:
	class FName                                   CategoryID;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortEmporiumItemListMenu_HandleCategoryActivated;

// Function CreativeEmporiumUI.FortEmporiumItemListMenu.HandleCategoryFocused
// 0x0004 (0x0004 - 0x0000)
struct FortEmporiumItemListMenu_HandleCategoryFocused final
{
public:
	class FName                                   CategoryID;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortEmporiumItemListMenu_HandleCategoryFocused;

// Function CreativeEmporiumUI.FortEmporiumItemListMenu.HandleChestItemCountChanged
// 0x0004 (0x0004 - 0x0000)
struct FortEmporiumItemListMenu_HandleChestItemCountChanged final
{
public:
	int32                                         Count;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortEmporiumItemListMenu_HandleChestItemCountChanged;

// Function CreativeEmporiumUI.FortEmporiumItemListMenu.HandleEquipItem
// 0x01A0 (0x01A0 - 0x0000)
struct FortEmporiumItemListMenu_HandleEquipItem final
{
public:
	struct FFortItemEntry                         ItemEntry;                                         // 0x0000(0x01A0)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortEmporiumItemListMenu_HandleEquipItem;

// Function CreativeEmporiumUI.FortEmporiumItemListMenu.HandleFilterButtonClicked
// 0x0010 (0x0010 - 0x0000)
struct FortEmporiumItemListMenu_HandleFilterButtonClicked final
{
public:
	class FName                                   FilterNameId;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      NewButton;                                         // 0x0008(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortEmporiumItemListMenu_HandleFilterButtonClicked;

// Function CreativeEmporiumUI.FortEmporiumItemListMenu.HandleFilterPanelIsFocused
// 0x0001 (0x0001 - 0x0000)
struct FortEmporiumItemListMenu_HandleFilterPanelIsFocused final
{
public:
	bool                                          bIsFocused;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortEmporiumItemListMenu_HandleFilterPanelIsFocused;

// Function CreativeEmporiumUI.FortEmporiumItemListMenu.HandleItemClicked
// 0x01A0 (0x01A0 - 0x0000)
struct FortEmporiumItemListMenu_HandleItemClicked final
{
public:
	struct FFortItemEntry                         ItemEntry;                                         // 0x0000(0x01A0)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortEmporiumItemListMenu_HandleItemClicked;

// Function CreativeEmporiumUI.FortEmporiumItemListMenu.HandleItemDoubleClicked
// 0x01A0 (0x01A0 - 0x0000)
struct FortEmporiumItemListMenu_HandleItemDoubleClicked final
{
public:
	struct FFortItemEntry                         ItemEntry;                                         // 0x0000(0x01A0)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortEmporiumItemListMenu_HandleItemDoubleClicked;

// Function CreativeEmporiumUI.FortEmporiumItemListMenu.HandleItemTagSelected
// 0x0008 (0x0008 - 0x0000)
struct FortEmporiumItemListMenu_HandleItemTagSelected final
{
public:
	class FName                                   TagID;                                             // 0x0000(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSelected;                                         // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FortEmporiumItemListMenu_HandleItemTagSelected;

// Function CreativeEmporiumUI.FortEmporiumItemListMenu.HandleItemThumbnailDownloaded
// 0x0008 (0x0008 - 0x0000)
struct FortEmporiumItemListMenu_HandleItemThumbnailDownloaded final
{
public:
	class UFortEmporiumItemDefinition*            ItemDefinition;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortEmporiumItemListMenu_HandleItemThumbnailDownloaded;

// Function CreativeEmporiumUI.FortEmporiumItemListMenu.HandleQuickbarPanelIsFocused
// 0x0001 (0x0001 - 0x0000)
struct FortEmporiumItemListMenu_HandleQuickbarPanelIsFocused final
{
public:
	bool                                          bIsFocused;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortEmporiumItemListMenu_HandleQuickbarPanelIsFocused;

// Function CreativeEmporiumUI.FortEmporiumItemListMenu.HandleQuickbarStateChanged
// 0x0001 (0x0001 - 0x0000)
struct FortEmporiumItemListMenu_HandleQuickbarStateChanged final
{
public:
	EFortContentBrowserQuickbarState              State;                                             // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortEmporiumItemListMenu_HandleQuickbarStateChanged;

// Function CreativeEmporiumUI.FortEmporiumItemListMenu.HandleSelectionChanged
// 0x0008 (0x0008 - 0x0000)
struct FortEmporiumItemListMenu_HandleSelectionChanged final
{
public:
	class UFortCreativeContentBrowserTabPanelBase* Tab;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortEmporiumItemListMenu_HandleSelectionChanged;

// Function CreativeEmporiumUI.FortEmporiumItemListMenu.HandleSortButtonClicked
// 0x0010 (0x0010 - 0x0000)
struct FortEmporiumItemListMenu_HandleSortButtonClicked final
{
public:
	class FName                                   SortNameId;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      NewButton;                                         // 0x0008(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortEmporiumItemListMenu_HandleSortButtonClicked;

// Function CreativeEmporiumUI.FortEmporiumItemListMenu.HandleTabItemDetailClicked
// 0x0004 (0x0004 - 0x0000)
struct FortEmporiumItemListMenu_HandleTabItemDetailClicked final
{
public:
	class FName                                   TagID;                                             // 0x0000(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortEmporiumItemListMenu_HandleTabItemDetailClicked;

// Function CreativeEmporiumUI.FortEmporiumItemListMenu.HandleTabSelected
// 0x0008 (0x0008 - 0x0000)
struct FortEmporiumItemListMenu_HandleTabSelected final
{
public:
	class FName                                   TabID;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCaptureFocus;                                     // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FortEmporiumItemListMenu_HandleTabSelected;

// Function CreativeEmporiumUI.FortEmporiumItemListMenu.OnCursorModeChanged
// 0x0010 (0x0010 - 0x0000)
struct FortEmporiumItemListMenu_OnCursorModeChanged final
{
public:
	bool                                          bCursorModeEnabled;                                // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ActionName;                                        // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UUserWidget*                            CursorModeContentWidget;                           // 0x0008(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortEmporiumItemListMenu_OnCursorModeChanged;

// Function CreativeEmporiumUI.FortEmporiumItemListMenu.OnFabCategoryListLoaded
// 0x0018 (0x0018 - 0x0000)
struct FortEmporiumItemListMenu_OnFabCategoryListLoaded final
{
public:
	bool                                          bSuccess;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 JsonString;                                        // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortEmporiumItemListMenu_OnFabCategoryListLoaded;

// Function CreativeEmporiumUI.FortEmporiumItemListMenu.OnFabItemQueryComplete
// 0x0018 (0x0018 - 0x0000)
struct FortEmporiumItemListMenu_OnFabItemQueryComplete final
{
public:
	bool                                          bSuccess;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 JsonString;                                        // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortEmporiumItemListMenu_OnFabItemQueryComplete;

// Function CreativeEmporiumUI.FortEmporiumItemListMenu.OnItemEquipped
// 0x01A0 (0x01A0 - 0x0000)
struct FortEmporiumItemListMenu_OnItemEquipped final
{
public:
	struct FFortItemEntry                         EquippedItemEntry;                                 // 0x0000(0x01A0)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortEmporiumItemListMenu_OnItemEquipped;

// Function CreativeEmporiumUI.FortEmporiumItemListMenu.OnQuickbarStateChanged
// 0x0001 (0x0001 - 0x0000)
struct FortEmporiumItemListMenu_OnQuickbarStateChanged final
{
public:
	EFortContentBrowserQuickbarState              State;                                             // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortEmporiumItemListMenu_OnQuickbarStateChanged;

// Function CreativeEmporiumUI.FortEmporiumItemListMenu.OnSearchFiltersVisibilityChanged
// 0x0001 (0x0001 - 0x0000)
struct FortEmporiumItemListMenu_OnSearchFiltersVisibilityChanged final
{
public:
	bool                                          bIsVisible;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortEmporiumItemListMenu_OnSearchFiltersVisibilityChanged;

// Function CreativeEmporiumUI.FortEmporiumItemListMenu.OnSelectionOpened
// 0x0008 (0x0008 - 0x0000)
struct FortEmporiumItemListMenu_OnSelectionOpened final
{
public:
	const class UItemDefinitionBase*              SelectedItemDefinition;                            // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortEmporiumItemListMenu_OnSelectionOpened;

// Function CreativeEmporiumUI.FortEmporiumItemListMenu.OnShowCategoryModal
// 0x0001 (0x0001 - 0x0000)
struct FortEmporiumItemListMenu_OnShowCategoryModal final
{
public:
	bool                                          bShowModal;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortEmporiumItemListMenu_OnShowCategoryModal;

// Function CreativeEmporiumUI.FortEmporiumItemListMenu.OnUpdateCommandBarVisibility
// 0x0001 (0x0001 - 0x0000)
struct FortEmporiumItemListMenu_OnUpdateCommandBarVisibility final
{
public:
	bool                                          bShowBar;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortEmporiumItemListMenu_OnUpdateCommandBarVisibility;

// Function CreativeEmporiumUI.FortEmporiumItemListMenu.OpenSelection
// 0x0001 (0x0001 - 0x0000)
struct FortEmporiumItemListMenu_OpenSelection final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortEmporiumItemListMenu_OpenSelection;

// Function CreativeEmporiumUI.FortEmporiumItemListMenu.PlaceSelectionInMoveTool
// 0x0001 (0x0001 - 0x0000)
struct FortEmporiumItemListMenu_PlaceSelectionInMoveTool final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortEmporiumItemListMenu_PlaceSelectionInMoveTool;

// Function CreativeEmporiumUI.FortEmporiumItemListMenu.SetIsItemCommandsEnabled
// 0x0001 (0x0001 - 0x0000)
struct FortEmporiumItemListMenu_SetIsItemCommandsEnabled final
{
public:
	bool                                          bInIsItemCommandEnabled;                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortEmporiumItemListMenu_SetIsItemCommandsEnabled;

// Function CreativeEmporiumUI.FortEmporiumItemListMenu.SetSubTabOpened
// 0x0008 (0x0008 - 0x0000)
struct FortEmporiumItemListMenu_SetSubTabOpened final
{
public:
	class UItemDefinitionBase*                    ItemDefinition;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortEmporiumItemListMenu_SetSubTabOpened;

// Function CreativeEmporiumUI.FortEmporiumItemListMenu.SpawnContainer
// 0x0008 (0x0008 - 0x0000)
struct FortEmporiumItemListMenu_SpawnContainer final
{
public:
	TSubclassOf<class AActor>                     SupplyDropClass;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortEmporiumItemListMenu_SpawnContainer;

// Function CreativeEmporiumUI.FortEmporiumItemListMenu.SwitchItemDetailsPanel
// 0x0001 (0x0001 - 0x0000)
struct FortEmporiumItemListMenu_SwitchItemDetailsPanel final
{
public:
	bool                                          bUseLegacy;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortEmporiumItemListMenu_SwitchItemDetailsPanel;

// Function CreativeEmporiumUI.FortEmporiumItemListMenu.UpdateBackButtonText
// 0x0001 (0x0001 - 0x0000)
struct FortEmporiumItemListMenu_UpdateBackButtonText final
{
public:
	bool                                          bFilterFocus;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortEmporiumItemListMenu_UpdateBackButtonText;

// Function CreativeEmporiumUI.FortEmporiumItemListMenu.CanAddToChest
// 0x01A8 (0x01A8 - 0x0000)
struct FortEmporiumItemListMenu_CanAddToChest final
{
public:
	struct FFortItemEntry                         SelectedItem;                                      // 0x0000(0x01A0)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x01A0(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1A1[0x7];                                      // 0x01A1(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FortEmporiumItemListMenu_CanAddToChest;

// Function CreativeEmporiumUI.FortEmporiumItemListMenu.CanDropItem
// 0x01A8 (0x01A8 - 0x0000)
struct FortEmporiumItemListMenu_CanDropItem final
{
public:
	struct FFortItemEntry                         SelectedItem;                                      // 0x0000(0x01A0)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x01A0(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1A1[0x7];                                      // 0x01A1(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FortEmporiumItemListMenu_CanDropItem;

// Function CreativeEmporiumUI.FortEmporiumItemListMenu.CanEquip
// 0x01A8 (0x01A8 - 0x0000)
struct FortEmporiumItemListMenu_CanEquip final
{
public:
	struct FFortItemEntry                         SelectedItem;                                      // 0x0000(0x01A0)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x01A0(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1A1[0x7];                                      // 0x01A1(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FortEmporiumItemListMenu_CanEquip;

// Function CreativeEmporiumUI.FortEmporiumItemListMenu.GetCurrentSelection
// 0x01A0 (0x01A0 - 0x0000)
struct FortEmporiumItemListMenu_GetCurrentSelection final
{
public:
	struct FFortItemEntry                         ReturnValue;                                       // 0x0000(0x01A0)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortEmporiumItemListMenu_GetCurrentSelection;

// Function CreativeEmporiumUI.FortEmporiumItemListMenu.GetCurrentTab
// 0x0008 (0x0008 - 0x0000)
struct FortEmporiumItemListMenu_GetCurrentTab final
{
public:
	class UFortCreativeContentBrowserTabPanelBase* ReturnValue;                                      // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortEmporiumItemListMenu_GetCurrentTab;

// Function CreativeEmporiumUI.FortEmporiumItemListMenu.GetLastSelectedTabName
// 0x0004 (0x0004 - 0x0000)
struct FortEmporiumItemListMenu_GetLastSelectedTabName final
{
public:
	class FName                                   ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortEmporiumItemListMenu_GetLastSelectedTabName;

// Function CreativeEmporiumUI.FortEmporiumItemListMenu.GetSubTabSelectedItemDefinition
// 0x0008 (0x0008 - 0x0000)
struct FortEmporiumItemListMenu_GetSubTabSelectedItemDefinition final
{
public:
	class UItemDefinitionBase*                    ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortEmporiumItemListMenu_GetSubTabSelectedItemDefinition;

// Function CreativeEmporiumUI.FortEmporiumItemListMenu.IsSubTabOpened
// 0x0001 (0x0001 - 0x0000)
struct FortEmporiumItemListMenu_IsSubTabOpened final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortEmporiumItemListMenu_IsSubTabOpened;

// Function CreativeEmporiumUI.FortEmporiumItemListTabPanel.AddItem
// 0x01A0 (0x01A0 - 0x0000)
struct FortEmporiumItemListTabPanel_AddItem final
{
public:
	struct FFortItemEntry                         ItemToAdd;                                         // 0x0000(0x01A0)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortEmporiumItemListTabPanel_AddItem;

// Function CreativeEmporiumUI.FortEmporiumItemListTabPanel.AddItemToSource
// 0x01A0 (0x01A0 - 0x0000)
struct FortEmporiumItemListTabPanel_AddItemToSource final
{
public:
	struct FFortItemEntry                         ItemToAdd;                                         // 0x0000(0x01A0)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortEmporiumItemListTabPanel_AddItemToSource;

// Function CreativeEmporiumUI.FortEmporiumItemListTabPanel.HandleItemDetailTagSelected
// 0x0004 (0x0004 - 0x0000)
struct FortEmporiumItemListTabPanel_HandleItemDetailTagSelected final
{
public:
	class FName                                   TagID;                                             // 0x0000(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortEmporiumItemListTabPanel_HandleItemDetailTagSelected;

// Function CreativeEmporiumUI.FortEmporiumItemListTabPanel.IsEmpty
// 0x0001 (0x0001 - 0x0000)
struct FortEmporiumItemListTabPanel_IsEmpty final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortEmporiumItemListTabPanel_IsEmpty;

// Function CreativeEmporiumUI.FortEmporiumItemListTabPanel.ItemEquipped
// 0x01A0 (0x01A0 - 0x0000)
struct FortEmporiumItemListTabPanel_ItemEquipped final
{
public:
	struct FFortItemEntry                         Item;                                              // 0x0000(0x01A0)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortEmporiumItemListTabPanel_ItemEquipped;

// Function CreativeEmporiumUI.FortEmporiumItemListTabPanel.SetActiveItemDetailTags
// 0x0010 (0x0010 - 0x0000)
struct FortEmporiumItemListTabPanel_SetActiveItemDetailTags final
{
public:
	TArray<class FName>                           TagIDs;                                            // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortEmporiumItemListTabPanel_SetActiveItemDetailTags;

// Function CreativeEmporiumUI.FortEmporiumItemListTabPanel.ShowTopButtonBar
// 0x0001 (0x0001 - 0x0000)
struct FortEmporiumItemListTabPanel_ShowTopButtonBar final
{
public:
	bool                                          bShow;                                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortEmporiumItemListTabPanel_ShowTopButtonBar;

// Function CreativeEmporiumUI.FortEmporiumItemListTabPanel.UpdateSortButton
// 0x0018 (0x0018 - 0x0000)
struct FortEmporiumItemListTabPanel_UpdateSortButton final
{
public:
	class FText                                   SortType;                                          // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortEmporiumItemListTabPanel_UpdateSortButton;

// Function CreativeEmporiumUI.FortEmporiumItemListTabPanel.CanPlayerCreateInVolume
// 0x0001 (0x0001 - 0x0000)
struct FortEmporiumItemListTabPanel_CanPlayerCreateInVolume final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortEmporiumItemListTabPanel_CanPlayerCreateInVolume;

// Function CreativeEmporiumUI.FortEmporiumItemListTabPanel.GetCardSizeForCategory
// 0x0001 (0x0001 - 0x0000)
struct FortEmporiumItemListTabPanel_GetCardSizeForCategory final
{
public:
	EFortItemCardSize                             ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortEmporiumItemListTabPanel_GetCardSizeForCategory;

// Function CreativeEmporiumUI.FortEmporiumItemListTabPanel.GetCollapseBorderPadFlagForCategory
// 0x0001 (0x0001 - 0x0000)
struct FortEmporiumItemListTabPanel_GetCollapseBorderPadFlagForCategory final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortEmporiumItemListTabPanel_GetCollapseBorderPadFlagForCategory;

// Function CreativeEmporiumUI.FortEmporiumItemListTabPanel.GetSubTabSelectedItemDefinition
// 0x0008 (0x0008 - 0x0000)
struct FortEmporiumItemListTabPanel_GetSubTabSelectedItemDefinition final
{
public:
	class UItemDefinitionBase*                    ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortEmporiumItemListTabPanel_GetSubTabSelectedItemDefinition;

// Function CreativeEmporiumUI.FortEmporiumItemListTabPanel.IsSubTabOpened
// 0x0001 (0x0001 - 0x0000)
struct FortEmporiumItemListTabPanel_IsSubTabOpened final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortEmporiumItemListTabPanel_IsSubTabOpened;

// Function CreativeEmporiumUI.FortEmporiumItemListTabPanel.ShowLegacyItemDetailsPanel
// 0x0001 (0x0001 - 0x0000)
struct FortEmporiumItemListTabPanel_ShowLegacyItemDetailsPanel final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortEmporiumItemListTabPanel_ShowLegacyItemDetailsPanel;

// Function CreativeEmporiumUI.FortEmporiumUtilities.GetCategoryDisplayName
