#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CreativeDataChannelTriggerRuntime

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// ScriptStruct CreativeDataChannelTriggerRuntime.CDCInt
// 0x0004 (0x0004 - 0x0000)
struct FCDCInt final
{
public:
	int32                                         Data;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FCDCInt;

// ScriptStruct CreativeDataChannelTriggerRuntime.CDCStringFloatArrayMap
// 0x0050 (0x0050 - 0x0000)
struct FCDCStringFloatArrayMap final
{
public:
	TMap<class FString, struct FVector>           Data;                                              // 0x0000(0x0050)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FCDCStringFloatArrayMap;

// ScriptStruct CreativeDataChannelTriggerRuntime.CDCLargeInt
// 0x0008 (0x0008 - 0x0000)
struct FCDCLargeInt final
{
public:
	int64                                         Data;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FCDCLargeInt;

// ScriptStruct CreativeDataChannelTriggerRuntime.CDCFloatArray
// 0x0010 (0x0010 - 0x0000)
struct FCDCFloatArray final
{
public:
	TArray<float>                                 Data;                                              // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FCDCFloatArray;

// ScriptStruct CreativeDataChannelTriggerRuntime.CDCStringStringMap
// 0x00A0 (0x00A0 - 0x0000)
struct FCDCStringStringMap final
{
public:
	TMap<class FString, class FString>            Data;                                              // 0x0000(0x0050)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	TMap<class FString, int32>                    ExtraData;                                         // 0x0050(0x0050)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FCDCStringStringMap;

// ScriptStruct CreativeDataChannelTriggerRuntime.CDCStringFloatMap
// 0x0050 (0x0050 - 0x0000)
struct FCDCStringFloatMap final
{
public:
	TMap<class FString, float>                    Data;                                              // 0x0000(0x0050)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FCDCStringFloatMap;

// ScriptStruct CreativeDataChannelTriggerRuntime.CDCString
// 0x0010 (0x0010 - 0x0000)
struct FCDCString final
{
public:
	class FString                                 Data;                                              // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FCDCString;

// ScriptStruct CreativeDataChannelTriggerRuntime.CDCStringIntMap
// 0x0050 (0x0050 - 0x0000)
struct FCDCStringIntMap final
{
public:
	TMap<class FString, int32>                    Data;                                              // 0x0000(0x0050)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FCDCStringIntMap;

// ScriptStruct CreativeDataChannelTriggerRuntime.CDCStringArray
// 0x0018 (0x0018 - 0x0000)
struct FCDCStringArray final
{
public:
	TArray<class FString>                         Data;                                              // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                         ExtraData;                                         // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FCDCStringArray;

// ScriptStruct CreativeDataChannelTriggerRuntime.CreativeDataChannelEvent
// 0x000C (0x000C - 0x0000)
struct FCreativeDataChannelEvent final
{
public:
	class FName                                   EventName;                                         // 0x0000(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Parameters;                                        // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   TriggerCondition;                                  // 0x0008(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FCreativeDataChannelEvent;

// ScriptStruct CreativeDataChannelTriggerRuntime.CreativeDataChannelEvents
// 0x0010 (0x0010 - 0x0000)
struct FCreativeDataChannelEvents final
{
public:
	TArray<struct FCreativeDataChannelEvent>      Events;                                            // 0x0000(0x0010)(BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FCreativeDataChannelEvents;

}

