#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CustomControlsRuntime

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function CustomControlsRuntime.CustomControlOptions_Base.GetOwningComponent
// 0x0008 (0x0008 - 0x0000)
struct CustomControlOptions_Base_GetOwningComponent final
{
public:
	class UFortControllerComponent_CustomControls* ReturnValue;                                      // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CustomControlOptions_Base_GetOwningComponent;

// Function CustomControlsRuntime.CustomControlOptions_ThirdPerson.BP_InitAimingTargetingPreset
// 0x0008 (0x0008 - 0x0000)
struct CustomControlOptions_ThirdPerson_BP_InitAimingTargetingPreset final
{
public:
	class UTargetingPreset*                       Preset;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CustomControlOptions_ThirdPerson_BP_InitAimingTargetingPreset;

// Function CustomControlsRuntime.CustomControlOptions_ThirdPerson.BP_InitMeleeTargetingPreset
// 0x0008 (0x0008 - 0x0000)
struct CustomControlOptions_ThirdPerson_BP_InitMeleeTargetingPreset final
{
public:
	class UTargetingPreset*                       Preset;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CustomControlOptions_ThirdPerson_BP_InitMeleeTargetingPreset;

// Function CustomControlsRuntime.CustomControlOptions_ThirdPerson.BP_InitRangedTargetingPreset
// 0x0008 (0x0008 - 0x0000)
struct CustomControlOptions_ThirdPerson_BP_InitRangedTargetingPreset final
{
public:
	class UTargetingPreset*                       Preset;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CustomControlOptions_ThirdPerson_BP_InitRangedTargetingPreset;

// Function CustomControlsRuntime.CustomControlOptions_ThirdPerson.BP_InitRetentionTargetingPreset
// 0x0008 (0x0008 - 0x0000)
struct CustomControlOptions_ThirdPerson_BP_InitRetentionTargetingPreset final
{
public:
	class UTargetingPreset*                       Preset;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CustomControlOptions_ThirdPerson_BP_InitRetentionTargetingPreset;

// Function CustomControlsRuntime.FortControllerComponent_CustomControls.CreateOptionsWithPriority
// 0x0020 (0x0020 - 0x0000)
struct FortControllerComponent_CustomControls_CreateOptionsWithPriority final
{
public:
	const class UObject*                          ContextObject;                                     // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UCustomControlOptions_Base> OptionsClass;                                      // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Priority;                                          // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnabled;                                          // 0x0014(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UCustomControlOptions_Base*             ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortControllerComponent_CustomControls_CreateOptionsWithPriority;

// Function CustomControlsRuntime.FortControllerComponent_CustomControls.GetOptions
// 0x0010 (0x0010 - 0x0000)
struct FortControllerComponent_CustomControls_GetOptions final
{
public:
	const class UObject*                          ContextObject;                                     // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCustomControlOptions_Base*             ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortControllerComponent_CustomControls_GetOptions;

// Function CustomControlsRuntime.FortControllerComponent_CustomControls.NotifyOptionsUpdated
// 0x0008 (0x0008 - 0x0000)
struct FortControllerComponent_CustomControls_NotifyOptionsUpdated final
{
public:
	const class UCustomControlOptions_Base*       Options;                                           // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortControllerComponent_CustomControls_NotifyOptionsUpdated;

// Function CustomControlsRuntime.FortControllerComponent_CustomControls.OnRep_ActiveOptions
// 0x0008 (0x0008 - 0x0000)
struct FortControllerComponent_CustomControls_OnRep_ActiveOptions final
{
public:
	class UCustomControlOptions_Base*             OldOptions;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortControllerComponent_CustomControls_OnRep_ActiveOptions;

// Function CustomControlsRuntime.FortControllerComponent_CustomControls.RemoveOptions
// 0x0008 (0x0008 - 0x0000)
struct FortControllerComponent_CustomControls_RemoveOptions final
{
public:
	const class UObject*                          ContextObject;                                     // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortControllerComponent_CustomControls_RemoveOptions;

// Function CustomControlsRuntime.FortControllerComponent_CustomControls.ServerSetFocusTarget
// 0x0008 (0x0008 - 0x0000)
struct FortControllerComponent_CustomControls_ServerSetFocusTarget final
{
public:
	const class AActor*                           NewFocusTarget;                                    // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortControllerComponent_CustomControls_ServerSetFocusTarget;

// Function CustomControlsRuntime.FortControllerComponent_CustomControls.ServerSetOptionsQueueBlocked
// 0x0001 (0x0001 - 0x0000)
struct FortControllerComponent_CustomControls_ServerSetOptionsQueueBlocked final
{
public:
	bool                                          bIsBlocked;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortControllerComponent_CustomControls_ServerSetOptionsQueueBlocked;

// Function CustomControlsRuntime.FortControllerComponent_CustomControls.SetOptionsEnabled
// 0x0010 (0x0010 - 0x0000)
struct FortControllerComponent_CustomControls_SetOptionsEnabled final
{
public:
	const class UObject*                          ContextObject;                                     // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnabled;                                          // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FortControllerComponent_CustomControls_SetOptionsEnabled;

// Function CustomControlsRuntime.FortControllerComponent_CustomControls.WeaponGetAimRotOverride
// 0x0030 (0x0030 - 0x0000)
struct FortControllerComponent_CustomControls_WeaponGetAimRotOverride final
{
public:
	const class AFortWeapon*                      Weapon;                                            // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EFortAbilityTargetingSource                   TargetingSource;                                   // 0x0008(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               OutOverrideAimRot;                                 // 0x0010(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bOutExecutionResult;                               // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FortControllerComponent_CustomControls_WeaponGetAimRotOverride;

}

