#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CustomControlsRuntime

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"


namespace SDK
{

// Enum CustomControlsRuntime.ECustomControlsAttackType
// NumValues: 0x0005
enum class ECustomControlsAttackType : uint8
{
	None                                     = 0,
	Ranged                                   = 1,
	Melee                                    = 2,
	Throw                                    = 3,
	ECustomControlsAttackType_MAX            = 4,
};

// Enum CustomControlsRuntime.ECustomControlsTargetingType
// NumValues: 0x0005
enum class ECustomControlsTargetingType : uint8
{
	None                                     = 0,
	Aiming                                   = 1,
	Windup                                   = 2,
	MeleeLockOn                              = 3,
	ECustomControlsTargetingType_MAX         = 4,
};

// Enum CustomControlsRuntime.ECustomControlsWeaponType
// NumValues: 0x0005
enum class ECustomControlsWeaponType : uint8
{
	None                                     = 0,
	Ranged                                   = 1,
	Melee                                    = 2,
	Other                                    = 3,
	ECustomControlsWeaponType_MAX            = 4,
};

// Enum CustomControlsRuntime.EPlaceFireMissed
// NumValues: 0x000A
enum class EPlaceFireMissed : uint8
{
	None                                     = 0,
	Left                                     = 1,
	Right                                    = 2,
	Up                                       = 3,
	Down                                     = 4,
	UpLeft                                   = 5,
	UpRight                                  = 6,
	DownLeft                                 = 7,
	DownRight                                = 8,
	EPlaceFireMissed_MAX                     = 9,
};

// Enum CustomControlsRuntime.ECustomControlsFacingMode
// NumValues: 0x0004
enum class ECustomControlsFacingMode : uint8
{
	Movement                                 = 0,
	Maintained                               = 1,
	Fixed                                    = 2,
	ECustomControlsFacingMode_MAX            = 3,
};

// Enum CustomControlsRuntime.ECustomControlsLockOnMode
// NumValues: 0x0006
enum class ECustomControlsLockOnMode : uint8
{
	Never                                    = 0,
	Always                                   = 1,
	Shooting                                 = 2,
	Aiming                                   = 3,
	ShootingOrAiming                         = 4,
	ECustomControlsLockOnMode_MAX            = 5,
};

// ScriptStruct CustomControlsRuntime.CustomControlsState
// 0x0004 (0x0004 - 0x0000)
struct FCustomControlsState final
{
public:
	bool                                          bHasFocusTarget;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECustomControlsAttackType                     AttackType;                                        // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECustomControlsTargetingType                  TargetingType;                                     // 0x0002(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECustomControlsWeaponType                     WeaponType;                                        // 0x0003(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FCustomControlsState;

// ScriptStruct CustomControlsRuntime.InteractionPointOptions
// 0x0010 (0x0010 - 0x0000)
struct FInteractionPointOptions final
{
public:
	EInteractionOrigin                            InteractionOrigin;                                 // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         InteractDistance;                                  // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InteractHighlightDistance;                         // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InteractExtentRadius;                              // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FInteractionPointOptions;

// ScriptStruct CustomControlsRuntime.FortMovementMode_ExtBaseCustomControlsCreationData
// 0x0000 (0x0008 - 0x0008)
struct FFortMovementMode_ExtBaseCustomControlsCreationData : public FFortMovementMode_BaseExtCreationData
{
};
DUMPER7_ASSERTS_FFortMovementMode_ExtBaseCustomControlsCreationData;

// ScriptStruct CustomControlsRuntime.FortMovementMode_ExtCCThirdPersonCreationData
// 0x0018 (0x0020 - 0x0008)
struct FFortMovementMode_ExtCCThirdPersonCreationData final : public FFortMovementMode_ExtBaseCustomControlsCreationData
{
public:
	float                                         RotationRateYaw;                                   // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SpeedMultiplier;                                   // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECustomControlsFacingMode                     FacingMode;                                        // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FixedFacingYaw;                                    // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRotateTowardsTarget;                              // 0x0018(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FFortMovementMode_ExtCCThirdPersonCreationData;

// ScriptStruct CustomControlsRuntime.CustomControlMovementModeData
// 0x0030 (0x0030 - 0x0000)
struct FCustomControlMovementModeData final
{
public:
	bool                                          bEnabled;                                          // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UFortMovementMode_ExtLogicCCThirdPerson> Class;                                // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFortMovementMode_ExtCCThirdPersonCreationData CreationData;                              // 0x0010(0x0020)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FCustomControlMovementModeData;

// ScriptStruct CustomControlsRuntime.FortMovementMode_ExtBaseCustomControlsRuntimeData
// 0x0000 (0x0010 - 0x0010)
struct FFortMovementMode_ExtBaseCustomControlsRuntimeData : public FFortMovementMode_BaseExtRuntimeData
{
};
DUMPER7_ASSERTS_FFortMovementMode_ExtBaseCustomControlsRuntimeData;

// ScriptStruct CustomControlsRuntime.FortMovementMode_ExtCCThirdPersonRuntimeData
// 0x0030 (0x0040 - 0x0010)
struct FFortMovementMode_ExtCCThirdPersonRuntimeData final : public FFortMovementMode_ExtBaseCustomControlsRuntimeData
{
public:
	uint8                                         Pad_10[0x30];                                      // 0x0010(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FFortMovementMode_ExtCCThirdPersonRuntimeData;

}

