#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CustomizableObject

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "CustomizableObject_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function CustomizableObject.CustomizableObjectInstanceUserData.SetAnimationGameplayTags
// 0x0020 (0x0020 - 0x0000)
struct CustomizableObjectInstanceUserData_SetAnimationGameplayTags final
{
public:
	struct FGameplayTagContainer                  InstanceTags;                                      // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CustomizableObjectInstanceUserData_SetAnimationGameplayTags;

// Function CustomizableObject.CustomizableObjectInstanceUserData.GetAnimationGameplayTags
// 0x0020 (0x0020 - 0x0000)
struct CustomizableObjectInstanceUserData_GetAnimationGameplayTags final
{
public:
	struct FGameplayTagContainer                  ReturnValue;                                       // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CustomizableObjectInstanceUserData_GetAnimationGameplayTags;

// Function CustomizableObject.CustomizableObjectInstanceUsage.UpdateSkeletalMeshAsync
// 0x0001 (0x0001 - 0x0000)
struct CustomizableObjectInstanceUsage_UpdateSkeletalMeshAsync final
{
public:
	bool                                          bNeverSkipUpdate;                                  // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CustomizableObjectInstanceUsage_UpdateSkeletalMeshAsync;

// Function CustomizableObject.CustomizableObjectInstanceUsage.UpdateSkeletalMeshAsyncResult
// 0x0010 (0x0010 - 0x0000)
struct CustomizableObjectInstanceUsage_UpdateSkeletalMeshAsyncResult final
{
public:
	TDelegate<void(const struct FUpdateContext& Result)> Callback;                                   // 0x0000(0x000C)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIgnoreCloseDist;                                  // 0x000C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bForceHighPriority;                                // 0x000D(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_CustomizableObjectInstanceUsage_UpdateSkeletalMeshAsyncResult;

// Function CustomizableObject.CustomizableSkeletalComponent.UpdateSkeletalMeshAsync
// 0x0001 (0x0001 - 0x0000)
struct CustomizableSkeletalComponent_UpdateSkeletalMeshAsync final
{
public:
	bool                                          bNeverSkipUpdate;                                  // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CustomizableSkeletalComponent_UpdateSkeletalMeshAsync;

// Function CustomizableObject.CustomizableSkeletalComponent.UpdateSkeletalMeshAsyncResult
// 0x0010 (0x0010 - 0x0000)
struct CustomizableSkeletalComponent_UpdateSkeletalMeshAsyncResult final
{
public:
	TDelegate<void(const struct FUpdateContext& Result)> Callback;                                   // 0x0000(0x000C)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIgnoreCloseDist;                                  // 0x000C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bForceHighPriority;                                // 0x000D(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_CustomizableSkeletalComponent_UpdateSkeletalMeshAsyncResult;

// Function CustomizableObject.CustomizableObject.CreateInstance
// 0x0008 (0x0008 - 0x0000)
struct CustomizableObject_CreateInstance final
{
public:
	class UCustomizableObjectInstance*            ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CustomizableObject_CreateInstance;

// Function CustomizableObject.CustomizableObject.FindParameter
// 0x0018 (0x0018 - 0x0000)
struct CustomizableObject_FindParameter final
{
public:
	class FString                                 Name_0;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_CustomizableObject_FindParameter;

// Function CustomizableObject.CustomizableObject.GetBoolParameterDefaultValue
// 0x0018 (0x0018 - 0x0000)
struct CustomizableObject_GetBoolParameterDefaultValue final
{
public:
	class FString                                 InParameterName;                                   // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_CustomizableObject_GetBoolParameterDefaultValue;

// Function CustomizableObject.CustomizableObject.GetColorParameterDefaultValue
// 0x0020 (0x0020 - 0x0000)
struct CustomizableObject_GetColorParameterDefaultValue final
{
public:
	class FString                                 InParameterName;                                   // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CustomizableObject_GetColorParameterDefaultValue;

// Function CustomizableObject.CustomizableObject.GetComponentCount
// 0x0004 (0x0004 - 0x0000)
struct CustomizableObject_GetComponentCount final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CustomizableObject_GetComponentCount;

// Function CustomizableObject.CustomizableObject.GetFloatParameterDefaultValue
// 0x0018 (0x0018 - 0x0000)
struct CustomizableObject_GetFloatParameterDefaultValue final
{
public:
	class FString                                 InParameterName;                                   // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_CustomizableObject_GetFloatParameterDefaultValue;

// Function CustomizableObject.CustomizableObject.GetIntParameterAvailableOption
// 0x0018 (0x0018 - 0x0000)
struct CustomizableObject_GetIntParameterAvailableOption final
{
public:
	int32                                         ParamIndex;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         K;                                                 // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CustomizableObject_GetIntParameterAvailableOption;

// Function CustomizableObject.CustomizableObject.GetIntParameterDefaultValue
// 0x0018 (0x0018 - 0x0000)
struct CustomizableObject_GetIntParameterDefaultValue final
{
public:
	class FString                                 InParameterName;                                   // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_CustomizableObject_GetIntParameterDefaultValue;

// Function CustomizableObject.CustomizableObject.GetIntParameterNumOptions
// 0x0008 (0x0008 - 0x0000)
struct CustomizableObject_GetIntParameterNumOptions final
{
public:
	int32                                         ParamIndex;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CustomizableObject_GetIntParameterNumOptions;

// Function CustomizableObject.CustomizableObject.GetParameterCount
// 0x0004 (0x0004 - 0x0000)
struct CustomizableObject_GetParameterCount final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CustomizableObject_GetParameterCount;

// Function CustomizableObject.CustomizableObject.GetParameterDescriptionCount
// 0x0018 (0x0018 - 0x0000)
struct CustomizableObject_GetParameterDescriptionCount final
{
public:
	class FString                                 ParamName;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_CustomizableObject_GetParameterDescriptionCount;

// Function CustomizableObject.CustomizableObject.GetParameterName
// 0x0018 (0x0018 - 0x0000)
struct CustomizableObject_GetParameterName final
{
public:
	int32                                         ParamIndex;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CustomizableObject_GetParameterName;

// Function CustomizableObject.CustomizableObject.GetParameterType
// 0x0008 (0x0008 - 0x0000)
struct CustomizableObject_GetParameterType final
{
public:
	int32                                         ParamIndex;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMutableParameterType                         ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_CustomizableObject_GetParameterType;

// Function CustomizableObject.CustomizableObject.GetParameterTypeByName
// 0x0018 (0x0018 - 0x0000)
struct CustomizableObject_GetParameterTypeByName final
{
public:
	class FString                                 Name_0;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMutableParameterType                         ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_CustomizableObject_GetParameterTypeByName;

// Function CustomizableObject.CustomizableObject.GetParameterUIMetadata
// 0x0180 (0x0180 - 0x0000)
struct CustomizableObject_GetParameterUIMetadata final
{
public:
	class FString                                 ParamName;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FParameterUIData                       ReturnValue;                                       // 0x0010(0x0170)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CustomizableObject_GetParameterUIMetadata;

// Function CustomizableObject.CustomizableObject.GetParameterUIMetadataFromIndex
// 0x0178 (0x0178 - 0x0000)
struct CustomizableObject_GetParameterUIMetadataFromIndex final
{
public:
	int32                                         ParamIndex;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FParameterUIData                       ReturnValue;                                       // 0x0008(0x0170)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CustomizableObject_GetParameterUIMetadataFromIndex;

// Function CustomizableObject.CustomizableObject.GetProjectorParameterDefaultValue
// 0x0048 (0x0048 - 0x0000)
struct CustomizableObject_GetProjectorParameterDefaultValue final
{
public:
	class FString                                 InParameterName;                                   // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector3f                              OutPos;                                            // 0x0010(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector3f                              OutDirection;                                      // 0x001C(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector3f                              OutUp;                                             // 0x0028(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector3f                              OutScale;                                          // 0x0034(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OutAngle;                                          // 0x0040(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECustomizableObjectProjectorType              OutType;                                           // 0x0044(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_CustomizableObject_GetProjectorParameterDefaultValue;

// Function CustomizableObject.CustomizableObject.GetStateCount
// 0x0004 (0x0004 - 0x0000)
struct CustomizableObject_GetStateCount final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CustomizableObject_GetStateCount;

// Function CustomizableObject.CustomizableObject.GetStateName
// 0x0018 (0x0018 - 0x0000)
struct CustomizableObject_GetStateName final
{
public:
	int32                                         StateIndex;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CustomizableObject_GetStateName;

// Function CustomizableObject.CustomizableObject.GetStateParameterCount
// 0x0018 (0x0018 - 0x0000)
struct CustomizableObject_GetStateParameterCount final
{
public:
	class FString                                 StateName;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_CustomizableObject_GetStateParameterCount;

// Function CustomizableObject.CustomizableObject.GetStateParameterName
// 0x0028 (0x0028 - 0x0000)
struct CustomizableObject_GetStateParameterName final
{
public:
	class FString                                 StateName;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ParameterIndex;                                    // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ReturnValue;                                       // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CustomizableObject_GetStateParameterName;

// Function CustomizableObject.CustomizableObject.GetStateUIMetadata
// 0x0180 (0x0180 - 0x0000)
struct CustomizableObject_GetStateUIMetadata final
{
public:
	class FString                                 StateName;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FParameterUIData                       ReturnValue;                                       // 0x0010(0x0170)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CustomizableObject_GetStateUIMetadata;

// Function CustomizableObject.CustomizableObject.GetStateUIMetadataFromIndex
// 0x0178 (0x0178 - 0x0000)
struct CustomizableObject_GetStateUIMetadataFromIndex final
{
public:
	int32                                         StateIndex;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FParameterUIData                       ReturnValue;                                       // 0x0008(0x0170)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CustomizableObject_GetStateUIMetadataFromIndex;

// Function CustomizableObject.CustomizableObject.IsCompiled
// 0x0001 (0x0001 - 0x0000)
struct CustomizableObject_IsCompiled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CustomizableObject_IsCompiled;

// Function CustomizableObject.CustomizableObject.IsParameterMultidimensional
// 0x0018 (0x0018 - 0x0000)
struct CustomizableObject_IsParameterMultidimensional final
{
public:
	class FString                                 InParameterName;                                   // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_CustomizableObject_IsParameterMultidimensional;

// Function CustomizableObject.DGGUI.GetCustomizableObjectInstanceUsage
// 0x0008 (0x0008 - 0x0000)
struct DGGUI_GetCustomizableObjectInstanceUsage final
{
public:
	class UCustomizableObjectInstanceUsage*       ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DGGUI_GetCustomizableObjectInstanceUsage;

// Function CustomizableObject.DGGUI.SetCustomizableObjectInstanceUsage
// 0x0008 (0x0008 - 0x0000)
struct DGGUI_SetCustomizableObjectInstanceUsage final
{
public:
	class UCustomizableObjectInstanceUsage*       CustomizableObjectInstanceUsage;                   // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DGGUI_SetCustomizableObjectInstanceUsage;

// Function CustomizableObject.CustomizableObjectInstance.AddValueToFloatRange
// 0x0018 (0x0018 - 0x0000)
struct CustomizableObjectInstance_AddValueToFloatRange final
{
public:
	class FString                                 ParamName;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_CustomizableObjectInstance_AddValueToFloatRange;

// Function CustomizableObject.CustomizableObjectInstance.AddValueToIntRange
// 0x0018 (0x0018 - 0x0000)
struct CustomizableObjectInstance_AddValueToIntRange final
{
public:
	class FString                                 ParamName;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_CustomizableObjectInstance_AddValueToIntRange;

// Function CustomizableObject.CustomizableObjectInstance.AddValueToProjectorRange
// 0x0018 (0x0018 - 0x0000)
struct CustomizableObjectInstance_AddValueToProjectorRange final
{
public:
	class FString                                 ParamName;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_CustomizableObjectInstance_AddValueToProjectorRange;

// Function CustomizableObject.CustomizableObjectInstance.Clone
// 0x0008 (0x0008 - 0x0000)
struct CustomizableObjectInstance_Clone final
{
public:
	class UCustomizableObjectInstance*            ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CustomizableObjectInstance_Clone;

// Function CustomizableObject.CustomizableObjectInstance.CloneStatic
// 0x0010 (0x0010 - 0x0000)
struct CustomizableObjectInstance_CloneStatic final
{
public:
	class UObject*                                Outer_0;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCustomizableObjectInstance*            ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CustomizableObjectInstance_CloneStatic;

// Function CustomizableObject.CustomizableObjectInstance.CreateMultiLayerProjector
// 0x0008 (0x0008 - 0x0000)
struct CustomizableObjectInstance_CreateMultiLayerProjector final
{
public:
	class FName                                   ProjectorParamName;                                // 0x0000(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_CustomizableObjectInstance_CreateMultiLayerProjector;

// Function CustomizableObject.CustomizableObjectInstance.GetBoolParameters
// 0x0010 (0x0010 - 0x0000)
struct CustomizableObjectInstance_GetBoolParameters final
{
public:
	TArray<struct FCustomizableObjectBoolParameterValue> ReturnValue;                                // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CustomizableObjectInstance_GetBoolParameters;

// Function CustomizableObject.CustomizableObjectInstance.GetFloatParameters
// 0x0010 (0x0010 - 0x0000)
struct CustomizableObjectInstance_GetFloatParameters final
{
public:
	TArray<struct FCustomizableObjectFloatParameterValue> ReturnValue;                               // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CustomizableObjectInstance_GetFloatParameters;

// Function CustomizableObject.CustomizableObjectInstance.GetIntParameters
// 0x0010 (0x0010 - 0x0000)
struct CustomizableObjectInstance_GetIntParameters final
{
public:
	TArray<struct FCustomizableObjectIntParameterValue> ReturnValue;                                 // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CustomizableObjectInstance_GetIntParameters;

// Function CustomizableObject.CustomizableObjectInstance.GetParameterDescription
// 0x0020 (0x0020 - 0x0000)
struct CustomizableObjectInstance_GetParameterDescription final
{
public:
	class FString                                 ParamName;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         DescIndex;                                         // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CustomizableObjectInstance_GetParameterDescription;

// Function CustomizableObject.CustomizableObjectInstance.GetProjectorParameters
// 0x0010 (0x0010 - 0x0000)
struct CustomizableObjectInstance_GetProjectorParameters final
{
public:
	TArray<struct FCustomizableObjectProjectorParameterValue> ReturnValue;                           // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CustomizableObjectInstance_GetProjectorParameters;

// Function CustomizableObject.CustomizableObjectInstance.GetTextureParameters
// 0x0010 (0x0010 - 0x0000)
struct CustomizableObjectInstance_GetTextureParameters final
{
public:
	TArray<struct FCustomizableObjectTextureParameterValue> ReturnValue;                             // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CustomizableObjectInstance_GetTextureParameters;

// Function CustomizableObject.CustomizableObjectInstance.GetVectorParameters
// 0x0010 (0x0010 - 0x0000)
struct CustomizableObjectInstance_GetVectorParameters final
{
public:
	TArray<struct FCustomizableObjectVectorParameterValue> ReturnValue;                              // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CustomizableObjectInstance_GetVectorParameters;

// Function CustomizableObject.CustomizableObjectInstance.MultilayerProjectorCreateLayer
// 0x0008 (0x0008 - 0x0000)
struct CustomizableObjectInstance_MultilayerProjectorCreateLayer final
{
public:
	class FName                                   ProjectorParamName;                                // 0x0000(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Index_0;                                           // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CustomizableObjectInstance_MultilayerProjectorCreateLayer;

// Function CustomizableObject.CustomizableObjectInstance.MultilayerProjectorCreateVirtualLayer
// 0x0008 (0x0008 - 0x0000)
struct CustomizableObjectInstance_MultilayerProjectorCreateVirtualLayer final
{
public:
	class FName                                   ProjectorParamName;                                // 0x0000(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ID;                                                // 0x0004(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CustomizableObjectInstance_MultilayerProjectorCreateVirtualLayer;

// Function CustomizableObject.CustomizableObjectInstance.MultilayerProjectorFindOrCreateVirtualLayer
// 0x0090 (0x0090 - 0x0000)
struct CustomizableObjectInstance_MultilayerProjectorFindOrCreateVirtualLayer final
{
public:
	class FName                                   ProjectorParamName;                                // 0x0000(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ID;                                                // 0x0004(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMultilayerProjectorVirtualLayer       ReturnValue;                                       // 0x0008(0x0088)(Parm, OutParm, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CustomizableObjectInstance_MultilayerProjectorFindOrCreateVirtualLayer;

// Function CustomizableObject.CustomizableObjectInstance.MultilayerProjectorRemoveLayerAt
// 0x0008 (0x0008 - 0x0000)
struct CustomizableObjectInstance_MultilayerProjectorRemoveLayerAt final
{
public:
	class FName                                   ProjectorParamName;                                // 0x0000(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Index_0;                                           // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CustomizableObjectInstance_MultilayerProjectorRemoveLayerAt;

// Function CustomizableObject.CustomizableObjectInstance.MultilayerProjectorRemoveVirtualLayer
// 0x0008 (0x0008 - 0x0000)
struct CustomizableObjectInstance_MultilayerProjectorRemoveVirtualLayer final
{
public:
	class FName                                   ProjectorParamName;                                // 0x0000(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ID;                                                // 0x0004(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CustomizableObjectInstance_MultilayerProjectorRemoveVirtualLayer;

// Function CustomizableObject.CustomizableObjectInstance.MultilayerProjectorUpdateLayer
// 0x0088 (0x0088 - 0x0000)
struct CustomizableObjectInstance_MultilayerProjectorUpdateLayer final
{
public:
	class FName                                   ProjectorParamName;                                // 0x0000(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Index_0;                                           // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMultilayerProjectorLayer              Layer;                                             // 0x0008(0x0080)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CustomizableObjectInstance_MultilayerProjectorUpdateLayer;

// Function CustomizableObject.CustomizableObjectInstance.MultilayerProjectorUpdateVirtualLayer
// 0x0090 (0x0090 - 0x0000)
struct CustomizableObjectInstance_MultilayerProjectorUpdateVirtualLayer final
{
public:
	class FName                                   ProjectorParamName;                                // 0x0000(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ID;                                                // 0x0004(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMultilayerProjectorVirtualLayer       Layer;                                             // 0x0008(0x0088)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CustomizableObjectInstance_MultilayerProjectorUpdateVirtualLayer;

// Function CustomizableObject.CustomizableObjectInstance.RemoveMultilayerProjector
// 0x0004 (0x0004 - 0x0000)
struct CustomizableObjectInstance_RemoveMultilayerProjector final
{
public:
	class FName                                   ProjectorParamName;                                // 0x0000(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CustomizableObjectInstance_RemoveMultilayerProjector;

// Function CustomizableObject.CustomizableObjectInstance.RemoveValueFromFloatRange
// 0x0018 (0x0018 - 0x0000)
struct CustomizableObjectInstance_RemoveValueFromFloatRange final
{
public:
	class FString                                 ParamName;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_CustomizableObjectInstance_RemoveValueFromFloatRange;

// Function CustomizableObject.CustomizableObjectInstance.RemoveValueFromIntRange
// 0x0018 (0x0018 - 0x0000)
struct CustomizableObjectInstance_RemoveValueFromIntRange final
{
public:
	class FString                                 ParamName;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_CustomizableObjectInstance_RemoveValueFromIntRange;

// Function CustomizableObject.CustomizableObjectInstance.RemoveValueFromProjectorRange
// 0x0018 (0x0018 - 0x0000)
struct CustomizableObjectInstance_RemoveValueFromProjectorRange final
{
public:
	class FString                                 ParamName;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_CustomizableObjectInstance_RemoveValueFromProjectorRange;

// Function CustomizableObject.CustomizableObjectInstance.SetBoolParameterSelectedOption
// 0x0018 (0x0018 - 0x0000)
struct CustomizableObjectInstance_SetBoolParameterSelectedOption final
{
public:
	class FString                                 BoolParamName;                                     // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          BoolValue;                                         // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_CustomizableObjectInstance_SetBoolParameterSelectedOption;

// Function CustomizableObject.CustomizableObjectInstance.SetBuildParameterDecorations
// 0x0001 (0x0001 - 0x0000)
struct CustomizableObjectInstance_SetBuildParameterDecorations final
{
public:
	bool                                          Value;                                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CustomizableObjectInstance_SetBuildParameterDecorations;

// Function CustomizableObject.CustomizableObjectInstance.SetBuildParameterRelevancy
// 0x0001 (0x0001 - 0x0000)
struct CustomizableObjectInstance_SetBuildParameterRelevancy final
{
public:
	bool                                          Value;                                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CustomizableObjectInstance_SetBuildParameterRelevancy;

// Function CustomizableObject.CustomizableObjectInstance.SetColorParameterSelectedOption
// 0x0020 (0x0020 - 0x0000)
struct CustomizableObjectInstance_SetColorParameterSelectedOption final
{
public:
	class FString                                 ColorParamName;                                    // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           ColorValue;                                        // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CustomizableObjectInstance_SetColorParameterSelectedOption;

// Function CustomizableObject.CustomizableObjectInstance.SetCurrentState
// 0x0010 (0x0010 - 0x0000)
struct CustomizableObjectInstance_SetCurrentState final
{
public:
	class FString                                 StateName;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CustomizableObjectInstance_SetCurrentState;

// Function CustomizableObject.CustomizableObjectInstance.SetFloatParameterSelectedOption
// 0x0018 (0x0018 - 0x0000)
struct CustomizableObjectInstance_SetFloatParameterSelectedOption final
{
public:
	class FString                                 FloatParamName;                                    // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FloatValue;                                        // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         RangeIndex;                                        // 0x0014(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CustomizableObjectInstance_SetFloatParameterSelectedOption;

// Function CustomizableObject.CustomizableObjectInstance.SetIntParameterSelectedOption
// 0x0028 (0x0028 - 0x0000)
struct CustomizableObjectInstance_SetIntParameterSelectedOption final
{
public:
	class FString                                 ParamName;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 SelectedOptionName;                                // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         RangeIndex;                                        // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_CustomizableObjectInstance_SetIntParameterSelectedOption;

// Function CustomizableObject.CustomizableObjectInstance.SetObject
// 0x0008 (0x0008 - 0x0000)
struct CustomizableObjectInstance_SetObject final
{
public:
	class UCustomizableObject*                    InObject;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CustomizableObjectInstance_SetObject;

// Function CustomizableObject.CustomizableObjectInstance.SetProjectorAngle
// 0x0018 (0x0018 - 0x0000)
struct CustomizableObjectInstance_SetProjectorAngle final
{
public:
	class FString                                 ProjectorParamName;                                // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Angle;                                             // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         RangeIndex;                                        // 0x0014(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CustomizableObjectInstance_SetProjectorAngle;

// Function CustomizableObject.CustomizableObjectInstance.SetProjectorDirection
// 0x0030 (0x0030 - 0x0000)
struct CustomizableObjectInstance_SetProjectorDirection final
{
public:
	class FString                                 ProjectorParamName;                                // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Direction;                                         // 0x0010(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         RangeIndex;                                        // 0x0028(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_CustomizableObjectInstance_SetProjectorDirection;

// Function CustomizableObject.CustomizableObjectInstance.SetProjectorPosition
// 0x0020 (0x0020 - 0x0000)
struct CustomizableObjectInstance_SetProjectorPosition final
{
public:
	class FString                                 ProjectorParamName;                                // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector3f                              Pos;                                               // 0x0010(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         RangeIndex;                                        // 0x001C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CustomizableObjectInstance_SetProjectorPosition;

// Function CustomizableObject.CustomizableObjectInstance.SetProjectorScale
// 0x0030 (0x0030 - 0x0000)
struct CustomizableObjectInstance_SetProjectorScale final
{
public:
	class FString                                 ProjectorParamName;                                // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Scale;                                             // 0x0010(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         RangeIndex;                                        // 0x0028(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_CustomizableObjectInstance_SetProjectorScale;

// Function CustomizableObject.CustomizableObjectInstance.SetProjectorUp
// 0x0030 (0x0030 - 0x0000)
struct CustomizableObjectInstance_SetProjectorUp final
{
public:
	class FString                                 ProjectorParamName;                                // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Up;                                                // 0x0010(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         RangeIndex;                                        // 0x0028(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_CustomizableObjectInstance_SetProjectorUp;

// Function CustomizableObject.CustomizableObjectInstance.SetProjectorValue
// 0x0078 (0x0078 - 0x0000)
struct CustomizableObjectInstance_SetProjectorValue final
{
public:
	class FString                                 ProjectorParamName;                                // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                OutPos;                                            // 0x0010(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                OutDirection;                                      // 0x0028(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                OutUp;                                             // 0x0040(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                OutScale;                                          // 0x0058(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OutAngle;                                          // 0x0070(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         RangeIndex;                                        // 0x0074(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CustomizableObjectInstance_SetProjectorValue;

// Function CustomizableObject.CustomizableObjectInstance.SetRandomValuesFromStream
// 0x0008 (0x0008 - 0x0000)
struct CustomizableObjectInstance_SetRandomValuesFromStream final
{
public:
	struct FRandomStream                          InStream;                                          // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CustomizableObjectInstance_SetRandomValuesFromStream;

// Function CustomizableObject.CustomizableObjectInstance.SetReplacePhysicsAssets
// 0x0001 (0x0001 - 0x0000)
struct CustomizableObjectInstance_SetReplacePhysicsAssets final
{
public:
	bool                                          bReplaceEnabled;                                   // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CustomizableObjectInstance_SetReplacePhysicsAssets;

// Function CustomizableObject.CustomizableObjectInstance.SetTextureParameterSelectedOption
// 0x0028 (0x0028 - 0x0000)
struct CustomizableObjectInstance_SetTextureParameterSelectedOption final
{
public:
	class FString                                 TextureParamName;                                  // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 TextureValue;                                      // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         RangeIndex;                                        // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_CustomizableObjectInstance_SetTextureParameterSelectedOption;

// Function CustomizableObject.CustomizableObjectInstance.SetVectorParameterSelectedOption
// 0x0020 (0x0020 - 0x0000)
struct CustomizableObjectInstance_SetVectorParameterSelectedOption final
{
public:
	class FString                                 VectorParamName;                                   // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           VectorValue;                                       // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CustomizableObjectInstance_SetVectorParameterSelectedOption;

// Function CustomizableObject.CustomizableObjectInstance.UpdateSkeletalMeshAsync
// 0x0002 (0x0002 - 0x0000)
struct CustomizableObjectInstance_UpdateSkeletalMeshAsync final
{
public:
	bool                                          bIgnoreCloseDist;                                  // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bForceHighPriority;                                // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CustomizableObjectInstance_UpdateSkeletalMeshAsync;

// Function CustomizableObject.CustomizableObjectInstance.UpdateSkeletalMeshAsyncResult
// 0x0010 (0x0010 - 0x0000)
struct CustomizableObjectInstance_UpdateSkeletalMeshAsyncResult final
{
public:
	TDelegate<void(const struct FUpdateContext& Result)> Callback;                                   // 0x0000(0x000C)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIgnoreCloseDist;                                  // 0x000C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bForceHighPriority;                                // 0x000D(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_CustomizableObjectInstance_UpdateSkeletalMeshAsyncResult;

// Function CustomizableObject.CustomizableObjectInstance.FindBoolParameterNameIndex
// 0x0018 (0x0018 - 0x0000)
struct CustomizableObjectInstance_FindBoolParameterNameIndex final
{
public:
	class FString                                 ParamName;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
