#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DaySequence

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "MovieScene_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function DaySequence.DaySequenceConditionTag.Evaluate
// 0x0001 (0x0001 - 0x0000)
struct DaySequenceConditionTag_Evaluate final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DaySequenceConditionTag_Evaluate;

// Function DaySequence.DaySequenceConditionTag.GetConditionName
// 0x0010 (0x0010 - 0x0000)
struct DaySequenceConditionTag_GetConditionName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DaySequenceConditionTag_GetConditionName;

// Function DaySequence.DaySequenceModifierComponent.AddBoolOverride
// 0x0010 (0x0010 - 0x0000)
struct DaySequenceModifierComponent_AddBoolOverride final
{
public:
	class UObject*                                Object;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   PropertyName;                                      // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bValue;                                            // 0x000C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_DaySequenceModifierComponent_AddBoolOverride;

// Function DaySequence.DaySequenceModifierComponent.AddColorMaterialParameterOverride
// 0x0020 (0x0020 - 0x0000)
struct DaySequenceModifierComponent_AddColorMaterialParameterOverride final
{
public:
	class UObject*                                Object;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaterialIndex;                                     // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ParameterName;                                     // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           Value;                                             // 0x0010(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DaySequenceModifierComponent_AddColorMaterialParameterOverride;

// Function DaySequence.DaySequenceModifierComponent.AddColorOverride
// 0x0020 (0x0020 - 0x0000)
struct DaySequenceModifierComponent_AddColorOverride final
{
public:
	class UObject*                                Object;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   PropertyName;                                      // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           Value;                                             // 0x000C(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_DaySequenceModifierComponent_AddColorOverride;

// Function DaySequence.DaySequenceModifierComponent.AddMaterialOverride
// 0x0018 (0x0018 - 0x0000)
struct DaySequenceModifierComponent_AddMaterialOverride final
{
public:
	class UObject*                                Object;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaterialIndex;                                     // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     Value;                                             // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DaySequenceModifierComponent_AddMaterialOverride;

// Function DaySequence.DaySequenceModifierComponent.AddScalarMaterialParameterOverride
// 0x0018 (0x0018 - 0x0000)
struct DaySequenceModifierComponent_AddScalarMaterialParameterOverride final
{
public:
	class UObject*                                Object;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaterialIndex;                                     // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ParameterName;                                     // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Value;                                             // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_DaySequenceModifierComponent_AddScalarMaterialParameterOverride;

// Function DaySequence.DaySequenceModifierComponent.AddScalarOverride
// 0x0018 (0x0018 - 0x0000)
struct DaySequenceModifierComponent_AddScalarOverride final
{
public:
	class UObject*                                Object;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   PropertyName;                                      // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Value;                                             // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DaySequenceModifierComponent_AddScalarOverride;

// Function DaySequence.DaySequenceModifierComponent.AddStaticTimeOfDayOverride
// 0x0010 (0x0010 - 0x0000)
struct DaySequenceModifierComponent_AddStaticTimeOfDayOverride final
{
public:
	class ADaySequenceActor*                      Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Hours;                                             // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_DaySequenceModifierComponent_AddStaticTimeOfDayOverride;

// Function DaySequence.DaySequenceModifierComponent.AddTransformOverride
// 0x0070 (0x0070 - 0x0000)
struct DaySequenceModifierComponent_AddTransformOverride final
{
public:
	class UObject*                                Object;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Value;                                             // 0x0010(0x0060)(Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DaySequenceModifierComponent_AddTransformOverride;

// Function DaySequence.DaySequenceModifierComponent.AddVectorOverride
// 0x0028 (0x0028 - 0x0000)
struct DaySequenceModifierComponent_AddVectorOverride final
{
public:
	class UObject*                                Object;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   PropertyName;                                      // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Value;                                             // 0x0010(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DaySequenceModifierComponent_AddVectorOverride;

// Function DaySequence.DaySequenceModifierComponent.AddVisibilityOverride
// 0x0010 (0x0010 - 0x0000)
struct DaySequenceModifierComponent_AddVisibilityOverride final
{
public:
	class UObject*                                Object;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bValue;                                            // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_DaySequenceModifierComponent_AddVisibilityOverride;

// Function DaySequence.DaySequenceModifierComponent.BindToDaySequenceActor
// 0x0008 (0x0008 - 0x0000)
struct DaySequenceModifierComponent_BindToDaySequenceActor final
{
public:
	class ADaySequenceActor*                      DaySequenceActor;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DaySequenceModifierComponent_BindToDaySequenceActor;

// Function DaySequence.DaySequenceModifierComponent.EnableDistanceVolumeBlends
// 0x0008 (0x0008 - 0x0000)
struct DaySequenceModifierComponent_EnableDistanceVolumeBlends final
{
public:
	class AActor*                                 InActor;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DaySequenceModifierComponent_EnableDistanceVolumeBlends;

// Function DaySequence.DaySequenceModifierComponent.IsBlendTargetInAnyVolume
// 0x0001 (0x0001 - 0x0000)
struct DaySequenceModifierComponent_IsBlendTargetInAnyVolume final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DaySequenceModifierComponent_IsBlendTargetInAnyVolume;

// Function DaySequence.DaySequenceModifierComponent.MuteNamedSequence
// 0x0008 (0x0008 - 0x0000)
struct DaySequenceModifierComponent_MuteNamedSequence final
{
public:
	class FName                                   SequenceKey;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bState;                                            // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_DaySequenceModifierComponent_MuteNamedSequence;

// Function DaySequence.DaySequenceModifierComponent.OnVolumeOverlapBegin
// 0x0108 (0x0108 - 0x0000)
struct DaySequenceModifierComponent_OnVolumeOverlapBegin final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x00E8)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DaySequenceModifierComponent_OnVolumeOverlapBegin;

// Function DaySequence.DaySequenceModifierComponent.OnVolumeOverlapEnd
// 0x0020 (0x0020 - 0x0000)
struct DaySequenceModifierComponent_OnVolumeOverlapEnd final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_DaySequenceModifierComponent_OnVolumeOverlapEnd;

// Function DaySequence.DaySequenceModifierComponent.SetCustomVolumeBlendWeight
// 0x0004 (0x0004 - 0x0000)
struct DaySequenceModifierComponent_SetCustomVolumeBlendWeight final
{
public:
	float                                         Weight;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DaySequenceModifierComponent_SetCustomVolumeBlendWeight;

// Function DaySequence.DaySequenceModifierComponent.SetUserDaySequence
// 0x0008 (0x0008 - 0x0000)
struct DaySequenceModifierComponent_SetUserDaySequence final
{
public:
	class UDaySequence*                           InDaySequence;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DaySequenceModifierComponent_SetUserDaySequence;

// Function DaySequence.DaySequenceModifierComponent.GetCurrentBlendWeight
// 0x0004 (0x0004 - 0x0000)
struct DaySequenceModifierComponent_GetCurrentBlendWeight final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DaySequenceModifierComponent_GetCurrentBlendWeight;

// Function DaySequence.DaySequenceModifierComponent.IsNamedSequenceMuted
// 0x0008 (0x0008 - 0x0000)
struct DaySequenceModifierComponent_IsNamedSequenceMuted final
{
public:
	class FName                                   SequenceKey;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_DaySequenceModifierComponent_IsNamedSequenceMuted;

// Function DaySequence.DaySequenceModifierComponent.SetVolumeCollisionEnabled
// 0x0001 (0x0001 - 0x0000)
struct DaySequenceModifierComponent_SetVolumeCollisionEnabled final
{
public:
	ECollisionEnabled                             InCollisionType;                                   // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DaySequenceModifierComponent_SetVolumeCollisionEnabled;

// Function DaySequence.DaySequenceActor.ContainsDaySequence
// 0x0010 (0x0010 - 0x0000)
struct DaySequenceActor_ContainsDaySequence final
{
public:
	const class UDaySequence*                     InDaySequence;                                     // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_DaySequenceActor_ContainsDaySequence;

// Function DaySequence.DaySequenceActor.GetBias
// 0x0008 (0x0008 - 0x0000)
struct DaySequenceActor_GetBias final
{
public:
	class FName                                   SequenceKey;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DaySequenceActor_GetBias;

// Function DaySequence.DaySequenceActor.IsMuteSequence
// 0x0008 (0x0008 - 0x0000)
struct DaySequenceActor_IsMuteSequence final
{
public:
	class FName                                   SequenceKey;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_DaySequenceActor_IsMuteSequence;

// Function DaySequence.DaySequenceActor.Multicast_SetTimePerCycle
// 0x0004 (0x0004 - 0x0000)
struct DaySequenceActor_Multicast_SetTimePerCycle final
{
public:
	float                                         InHours;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DaySequenceActor_Multicast_SetTimePerCycle;

// Function DaySequence.DaySequenceActor.MuteSequence
// 0x0008 (0x0008 - 0x0000)
struct DaySequenceActor_MuteSequence final
{
public:
	class FName                                   SequenceKey;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bState;                                            // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_DaySequenceActor_MuteSequence;

// Function DaySequence.DaySequenceActor.RemoveStaticTimeOfDay
// 0x0001 (0x0001 - 0x0000)
struct DaySequenceActor_RemoveStaticTimeOfDay final
{
public:
	bool                                          bResumeFromStaticTime;                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DaySequenceActor_RemoveStaticTimeOfDay;

// Function DaySequence.DaySequenceActor.SetBias
// 0x0008 (0x0008 - 0x0000)
struct DaySequenceActor_SetBias final
{
public:
	class FName                                   SequenceKey;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Bias_0;                                            // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DaySequenceActor_SetBias;

// Function DaySequence.DaySequenceActor.SetDaySequence
// 0x0010 (0x0010 - 0x0000)
struct DaySequenceActor_SetDaySequence final
{
public:
	class FName                                   SequenceName;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UDaySequence*                           InDaySequence;                                     // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DaySequenceActor_SetDaySequence;

// Function DaySequence.DaySequenceActor.SetReplicatePlayback
// 0x0001 (0x0001 - 0x0000)
struct DaySequenceActor_SetReplicatePlayback final
{
public:
	bool                                          ReplicatePlayback;                                 // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DaySequenceActor_SetReplicatePlayback;

// Function DaySequence.DaySequenceActor.SetStaticTimeOfDay
// 0x0004 (0x0004 - 0x0000)
struct DaySequenceActor_SetStaticTimeOfDay final
{
public:
	float                                         InHours;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DaySequenceActor_SetStaticTimeOfDay;

// Function DaySequence.DaySequenceActor.SetTimeOfDay
// 0x0008 (0x0008 - 0x0000)
struct DaySequenceActor_SetTimeOfDay final
{
public:
	float                                         InHours;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_DaySequenceActor_SetTimeOfDay;

// Function DaySequence.DaySequenceActor.SetTimeOfDayPreview
// 0x0004 (0x0004 - 0x0000)
struct DaySequenceActor_SetTimeOfDayPreview final
{
public:
	float                                         InHours;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DaySequenceActor_SetTimeOfDayPreview;

// Function DaySequence.DaySequenceActor.GetDayLength
// 0x0004 (0x0004 - 0x0000)
struct DaySequenceActor_GetDayLength final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DaySequenceActor_GetDayLength;

// Function DaySequence.DaySequenceActor.GetDaySequence
// 0x0010 (0x0010 - 0x0000)
struct DaySequenceActor_GetDaySequence final
{
public:
	class FName                                   SequenceName;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UDaySequence*                           ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DaySequenceActor_GetDaySequence;

// Function DaySequence.DaySequenceActor.GetFirstDaySequence
// 0x0008 (0x0008 - 0x0000)
struct DaySequenceActor_GetFirstDaySequence final
{
public:
	class UDaySequence*                           ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DaySequenceActor_GetFirstDaySequence;

// Function DaySequence.DaySequenceActor.GetInitialTimeOfDay
// 0x0004 (0x0004 - 0x0000)
struct DaySequenceActor_GetInitialTimeOfDay final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DaySequenceActor_GetInitialTimeOfDay;

// Function DaySequence.DaySequenceActor.GetSequencePlayer
// 0x0008 (0x0008 - 0x0000)
struct DaySequenceActor_GetSequencePlayer final
{
public:
	class UDaySequencePlayer*                     ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DaySequenceActor_GetSequencePlayer;

// Function DaySequence.DaySequenceActor.GetStaticTimeOfDay
// 0x0004 (0x0004 - 0x0000)
struct DaySequenceActor_GetStaticTimeOfDay final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DaySequenceActor_GetStaticTimeOfDay;

// Function DaySequence.DaySequenceActor.GetTimeOfDay
// 0x0004 (0x0004 - 0x0000)
struct DaySequenceActor_GetTimeOfDay final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DaySequenceActor_GetTimeOfDay;

// Function DaySequence.DaySequenceActor.GetTimeOfDayPreview
// 0x0004 (0x0004 - 0x0000)
struct DaySequenceActor_GetTimeOfDayPreview final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DaySequenceActor_GetTimeOfDayPreview;

// Function DaySequence.DaySequenceActor.GetTimePerCycle
// 0x0004 (0x0004 - 0x0000)
struct DaySequenceActor_GetTimePerCycle final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DaySequenceActor_GetTimePerCycle;

// Function DaySequence.DaySequenceActor.HasStaticTimeOfDay
// 0x0001 (0x0001 - 0x0000)
struct DaySequenceActor_HasStaticTimeOfDay final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DaySequenceActor_HasStaticTimeOfDay;

// Function DaySequence.DaySequenceActor.IsPaused
// 0x0001 (0x0001 - 0x0000)
struct DaySequenceActor_IsPaused final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DaySequenceActor_IsPaused;

// Function DaySequence.DaySequenceActor.IsPlaying
// 0x0001 (0x0001 - 0x0000)
struct DaySequenceActor_IsPlaying final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DaySequenceActor_IsPlaying;

// Function DaySequence.DaySequenceDirector.GetBoundActor
// 0x0020 (0x0020 - 0x0000)
struct DaySequenceDirector_GetBoundActor final
{
public:
	struct FMovieSceneObjectBindingID             ObjectBinding;                                     // 0x0000(0x0018)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DaySequenceDirector_GetBoundActor;

// Function DaySequence.DaySequenceDirector.GetBoundActors
// 0x0028 (0x0028 - 0x0000)
struct DaySequenceDirector_GetBoundActors final
{
public:
	struct FMovieSceneObjectBindingID             ObjectBinding;                                     // 0x0000(0x0018)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class AActor*>                         ReturnValue;                                       // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DaySequenceDirector_GetBoundActors;

// Function DaySequence.DaySequenceDirector.GetBoundObject
// 0x0020 (0x0020 - 0x0000)
struct DaySequenceDirector_GetBoundObject final
{
public:
	struct FMovieSceneObjectBindingID             ObjectBinding;                                     // 0x0000(0x0018)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DaySequenceDirector_GetBoundObject;

// Function DaySequence.DaySequenceDirector.GetBoundObjects
// 0x0028 (0x0028 - 0x0000)
struct DaySequenceDirector_GetBoundObjects final
{
public:
	struct FMovieSceneObjectBindingID             ObjectBinding;                                     // 0x0000(0x0018)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UObject*>                        ReturnValue;                                       // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DaySequenceDirector_GetBoundObjects;

// Function DaySequence.DaySequenceDirector.GetSequence
// 0x0008 (0x0008 - 0x0000)
struct DaySequenceDirector_GetSequence final
{
public:
	class UMovieSceneSequence*                    ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DaySequenceDirector_GetSequence;

// Function DaySequence.DaySequenceDirector.GetCurrentTime
// 0x0010 (0x0010 - 0x0000)
struct DaySequenceDirector_GetCurrentTime final
{
public:
	struct FQualifiedFrameTime                    ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DaySequenceDirector_GetCurrentTime;

// Function DaySequence.DaySequenceDirector.GetMasterSequenceTime
// 0x0010 (0x0010 - 0x0000)
struct DaySequenceDirector_GetMasterSequenceTime final
{
public:
	struct FQualifiedFrameTime                    ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DaySequenceDirector_GetMasterSequenceTime;

// Function DaySequence.DaySequenceDirector.GetRootSequenceTime
// 0x0010 (0x0010 - 0x0000)
struct DaySequenceDirector_GetRootSequenceTime final
{
public:
	struct FQualifiedFrameTime                    ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DaySequenceDirector_GetRootSequenceTime;

// Function DaySequence.DaySequenceSubsystem.SetDaySequenceActor
// 0x0008 (0x0008 - 0x0000)
struct DaySequenceSubsystem_SetDaySequenceActor final
{
public:
	class ADaySequenceActor*                      InActor;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DaySequenceSubsystem_SetDaySequenceActor;

// Function DaySequence.DaySequenceSubsystem.GetDaySequenceActor
// 0x0008 (0x0008 - 0x0000)
struct DaySequenceSubsystem_GetDaySequenceActor final
{
public:
	class ADaySequenceActor*                      ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DaySequenceSubsystem_GetDaySequenceActor;

}

