#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DelMarTrackRuntime

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "DelMarTrackRuntime_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function DelMarTrackRuntime.DelMarTrackBase.GetAllTrackSegmentActors
// 0x0010 (0x0010 - 0x0000)
struct DelMarTrackBase_GetAllTrackSegmentActors final
{
public:
	TArray<class ADelMarTrackSegmentBase*>        ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DelMarTrackBase_GetAllTrackSegmentActors;

// Function DelMarTrackRuntime.DelMarTrackBase.OnMetadataChanged
// 0x0010 (0x0010 - 0x0000)
struct DelMarTrackBase_OnMetadataChanged final
{
public:
	class UDelMarTrackSplineComponent*            InSpline;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SplineIndex;                                       // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_DelMarTrackBase_OnMetadataChanged;

// Function DelMarTrackRuntime.DelMarTrackBase.OnSplineClosedLoopChanged
// 0x0010 (0x0010 - 0x0000)
struct DelMarTrackBase_OnSplineClosedLoopChanged final
{
public:
	class UDelMarTrackSplineComponent*            InSpline;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SplineIndex;                                       // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_DelMarTrackBase_OnSplineClosedLoopChanged;

// Function DelMarTrackRuntime.DelMarTrackBase.OnSplinePointAdded
// 0x0010 (0x0010 - 0x0000)
struct DelMarTrackBase_OnSplinePointAdded final
{
public:
	class UDelMarTrackSplineComponent*            InSpline;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SplineIndex;                                       // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_DelMarTrackBase_OnSplinePointAdded;

// Function DelMarTrackRuntime.DelMarTrackBase.OnSplinePointChanged
// 0x0010 (0x0010 - 0x0000)
struct DelMarTrackBase_OnSplinePointChanged final
{
public:
	class UDelMarTrackSplineComponent*            InSpline;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SplineIndex;                                       // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_DelMarTrackBase_OnSplinePointChanged;

// Function DelMarTrackRuntime.DelMarTrackBase.OnSplinePointRemoved
// 0x0010 (0x0010 - 0x0000)
struct DelMarTrackBase_OnSplinePointRemoved final
{
public:
	class UDelMarTrackSplineComponent*            InSpline;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SplineIndex;                                       // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_DelMarTrackBase_OnSplinePointRemoved;

// Function DelMarTrackRuntime.DelMarTrackBase.PostSplineSegmentGenerated
// 0x0010 (0x0010 - 0x0000)
struct DelMarTrackBase_PostSplineSegmentGenerated final
{
public:
	class UDelMarTrackSplineComponent*            SplineComp;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PointIndex;                                        // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_DelMarTrackBase_PostSplineSegmentGenerated;

// Function DelMarTrackRuntime.DelMarTrackBase.PreSplineSegmentGenerated
// 0x0010 (0x0010 - 0x0000)
struct DelMarTrackBase_PreSplineSegmentGenerated final
{
public:
	class UDelMarTrackSplineComponent*            SplineComp;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PointIndex;                                        // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_DelMarTrackBase_PreSplineSegmentGenerated;

// Function DelMarTrackRuntime.DelMarTrackBase.SetTrackTypeTagAtIndex
// 0x0008 (0x0008 - 0x0000)
struct DelMarTrackBase_SetTrackTypeTagAtIndex final
{
public:
	int32                                         SplineIndex;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           tag;                                               // 0x0004(0x0004)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DelMarTrackBase_SetTrackTypeTagAtIndex;

// Function DelMarTrackRuntime.DelMarTrackBase.ForceValidOOBTube
// 0x0001 (0x0001 - 0x0000)
struct DelMarTrackBase_ForceValidOOBTube final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DelMarTrackBase_ForceValidOOBTube;

// Function DelMarTrackRuntime.DelMarTrackBase.ForceValidTrack
// 0x0001 (0x0001 - 0x0000)
struct DelMarTrackBase_ForceValidTrack final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DelMarTrackBase_ForceValidTrack;

// Function DelMarTrackRuntime.DelMarTrackBase.GetDistanceRangeFromPointRange
// 0x0010 (0x0010 - 0x0000)
struct DelMarTrackBase_GetDistanceRangeFromPointRange final
{
public:
	struct FDelMarTrackPointIndexRange            InRange;                                           // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FDelMarTrackPointDistanceRange         ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DelMarTrackBase_GetDistanceRangeFromPointRange;

// Function DelMarTrackRuntime.DelMarTrackBase.GetEndCapClass
// 0x0010 (0x0010 - 0x0000)
struct DelMarTrackBase_GetEndCapClass final
{
public:
	int32                                         SplineIndex;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DelMarTrackBase_GetEndCapClass;

// Function DelMarTrackRuntime.DelMarTrackBase.GetForwardDistance
// 0x000C (0x000C - 0x0000)
struct DelMarTrackBase_GetForwardDistance final
{
public:
	float                                         Start;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         End;                                               // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DelMarTrackBase_GetForwardDistance;

// Function DelMarTrackRuntime.DelMarTrackBase.GetLoopDistance
// 0x0008 (0x0008 - 0x0000)
struct DelMarTrackBase_GetLoopDistance final
{
public:
	float                                         InTotalDistance;                                   // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DelMarTrackBase_GetLoopDistance;

// Function DelMarTrackRuntime.DelMarTrackBase.GetMetaDataAtSplinePoint
// 0x0088 (0x0088 - 0x0000)
struct DelMarTrackBase_GetMetaDataAtSplinePoint final
{
public:
	int32                                         SplineIndex;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDelMarSplinePointMetaData             ReturnValue;                                       // 0x0008(0x0080)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DelMarTrackBase_GetMetaDataAtSplinePoint;

// Function DelMarTrackRuntime.DelMarTrackBase.GetNextSplinePoint
// 0x0008 (0x0008 - 0x0000)
struct DelMarTrackBase_GetNextSplinePoint final
{
public:
	int32                                         InSplinePoint;                                     // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DelMarTrackBase_GetNextSplinePoint;

// Function DelMarTrackRuntime.DelMarTrackBase.GetNextSplineSegment
// 0x0008 (0x0008 - 0x0000)
struct DelMarTrackBase_GetNextSplineSegment final
{
public:
	int32                                         InSplineSegmentIndex;                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DelMarTrackBase_GetNextSplineSegment;

// Function DelMarTrackRuntime.DelMarTrackBase.GetPreviousSplinePoint
// 0x0008 (0x0008 - 0x0000)
struct DelMarTrackBase_GetPreviousSplinePoint final
{
public:
	int32                                         InSplinePoint;                                     // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DelMarTrackBase_GetPreviousSplinePoint;

// Function DelMarTrackRuntime.DelMarTrackBase.GetPreviousSplineSegment
// 0x0008 (0x0008 - 0x0000)
struct DelMarTrackBase_GetPreviousSplineSegment final
{
public:
	int32                                         InSplineSegmentIndex;                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DelMarTrackBase_GetPreviousSplineSegment;

// Function DelMarTrackRuntime.DelMarTrackBase.GetSegmentClassAtSplinePoint
// 0x0010 (0x0010 - 0x0000)
struct DelMarTrackBase_GetSegmentClassAtSplinePoint final
{
public:
	int32                                         SplineIndex;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DelMarTrackBase_GetSegmentClassAtSplinePoint;

// Function DelMarTrackRuntime.DelMarTrackBase.GetSegmentTrackTypeTag
// 0x0008 (0x0008 - 0x0000)
struct DelMarTrackBase_GetSegmentTrackTypeTag final
{
public:
	int32                                         SplineIndex;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           ReturnValue;                                       // 0x0004(0x0004)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DelMarTrackBase_GetSegmentTrackTypeTag;

// Function DelMarTrackRuntime.DelMarTrackBase.GetStartCapClass
// 0x0010 (0x0010 - 0x0000)
struct DelMarTrackBase_GetStartCapClass final
{
public:
	int32                                         SplineIndex;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DelMarTrackBase_GetStartCapClass;

// Function DelMarTrackRuntime.DelMarTrackBase.GetTransitionSegmentClass
// 0x0010 (0x0010 - 0x0000)
struct DelMarTrackBase_GetTransitionSegmentClass final
{
public:
	int32                                         FromSplineIndex;                                   // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ToSplineIndex;                                     // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UClass*                                 ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DelMarTrackBase_GetTransitionSegmentClass;

// Function DelMarTrackRuntime.DelMarTrackBase.IsCosmetic
// 0x0001 (0x0001 - 0x0000)
struct DelMarTrackBase_IsCosmetic final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DelMarTrackBase_IsCosmetic;

// Function DelMarTrackRuntime.DelMarTrackBase.IsDistanceWithinRange
// 0x0010 (0x0010 - 0x0000)
struct DelMarTrackBase_IsDistanceWithinRange final
{
public:
	float                                         InDistance;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StartDistance;                                     // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         EndDistance;                                       // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_DelMarTrackBase_IsDistanceWithinRange;

// Function DelMarTrackRuntime.DelMarTrackBase.IsPointInOOBTube
// 0x0020 (0x0020 - 0x0000)
struct DelMarTrackBase_IsPointInOOBTube final
{
public:
	struct FVector                                Point;                                             // 0x0000(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_DelMarTrackBase_IsPointInOOBTube;

// Function DelMarTrackRuntime.DelMarTrackBase.IsPrimary
// 0x0001 (0x0001 - 0x0000)
struct DelMarTrackBase_IsPrimary final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DelMarTrackBase_IsPrimary;

// Function DelMarTrackRuntime.DelMarTrackBase.IsSecondary
// 0x0001 (0x0001 - 0x0000)
struct DelMarTrackBase_IsSecondary final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DelMarTrackBase_IsSecondary;

// Function DelMarTrackRuntime.DelMarTrackBase.IsTrackable
// 0x0001 (0x0001 - 0x0000)
struct DelMarTrackBase_IsTrackable final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DelMarTrackBase_IsTrackable;

// Function DelMarTrackRuntime.DelMarTrack.MergeTrack
// 0x0010 (0x0010 - 0x0000)
struct DelMarTrack_MergeTrack final
{
public:
	class ADelMarTrack*                           OtherTrack;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          MergeToEndPoint;                                   // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          CopyFromStartPoint;                                // 0x0009(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x000A(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B[0x5];                                        // 0x000B(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_DelMarTrack_MergeTrack;

// Function DelMarTrackRuntime.DelMarTrack.SplitTrackAtPoint
// 0x0008 (0x0008 - 0x0000)
struct DelMarTrack_SplitTrackAtPoint final
{
public:
	int32                                         SplitAtPoint;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_DelMarTrack_SplitTrackAtPoint;

// Function DelMarTrackRuntime.DelMarTrack.GetParentEndDistance
// 0x0004 (0x0004 - 0x0000)
struct DelMarTrack_GetParentEndDistance final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DelMarTrack_GetParentEndDistance;

// Function DelMarTrackRuntime.DelMarTrack.GetParentStartDistance
// 0x0004 (0x0004 - 0x0000)
struct DelMarTrack_GetParentStartDistance final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DelMarTrack_GetParentStartDistance;

// Function DelMarTrackRuntime.DelMarTrack.GetPrimaryDistance
// 0x0008 (0x0008 - 0x0000)
struct DelMarTrack_GetPrimaryDistance final
{
public:
	float                                         DistanceOnThisTrack;                               // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DelMarTrack_GetPrimaryDistance;

// Function DelMarTrackRuntime.DelMarTrack.GetPrimaryEndDistance
// 0x0004 (0x0004 - 0x0000)
struct DelMarTrack_GetPrimaryEndDistance final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DelMarTrack_GetPrimaryEndDistance;

// Function DelMarTrackRuntime.DelMarTrack.GetPrimaryStartDistance
// 0x0004 (0x0004 - 0x0000)
struct DelMarTrack_GetPrimaryStartDistance final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DelMarTrack_GetPrimaryStartDistance;

// Function DelMarTrackRuntime.DelMarTrack.GetSecondaryEndTrack
// 0x0008 (0x0008 - 0x0000)
struct DelMarTrack_GetSecondaryEndTrack final
{
public:
	class ADelMarTrack*                           ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DelMarTrack_GetSecondaryEndTrack;

// Function DelMarTrackRuntime.DelMarTrack.GetSecondaryStartTrack
// 0x0008 (0x0008 - 0x0000)
struct DelMarTrack_GetSecondaryStartTrack final
{
public:
	class ADelMarTrack*                           ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DelMarTrack_GetSecondaryStartTrack;

// Function DelMarTrackRuntime.DelMarTrackBlueprintFunctionLibrary.IsTrackRadiusCheckDisabled
// 0x0001 (0x0001 - 0x0000)
struct DelMarTrackBlueprintFunctionLibrary_IsTrackRadiusCheckDisabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DelMarTrackBlueprintFunctionLibrary_IsTrackRadiusCheckDisabled;

// Function DelMarTrackRuntime.DelMarTrackBlueprintFunctionLibrary.TrackPositionDebugDrawEnabled
// 0x0001 (0x0001 - 0x0000)
struct DelMarTrackBlueprintFunctionLibrary_TrackPositionDebugDrawEnabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DelMarTrackBlueprintFunctionLibrary_TrackPositionDebugDrawEnabled;

// Function DelMarTrackRuntime.DelMarTrackSegmentBase.ContainsDistanceAlongSpline
// 0x0008 (0x0008 - 0x0000)
struct DelMarTrackSegmentBase_ContainsDistanceAlongSpline final
{
public:
	float                                         DistanceAlongSpline;                               // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_DelMarTrackSegmentBase_ContainsDistanceAlongSpline;

// Function DelMarTrackRuntime.DelMarTrackSegmentBase.GetSplineDistanceRange
// 0x0008 (0x0008 - 0x0000)
struct DelMarTrackSegmentBase_GetSplineDistanceRange final
{
public:
	struct FDelMarTrackPointDistanceRange         ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DelMarTrackSegmentBase_GetSplineDistanceRange;

// Function DelMarTrackRuntime.DelMarTrackSegmentBase.GetSplineMeshComponent
// 0x0008 (0x0008 - 0x0000)
struct DelMarTrackSegmentBase_GetSplineMeshComponent final
{
public:
	class USplineMeshComponent*                   ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DelMarTrackSegmentBase_GetSplineMeshComponent;

// Function DelMarTrackRuntime.DelMarTrackOobTube.OnAttachedTrackPointAdded
// 0x0010 (0x0010 - 0x0000)
struct DelMarTrackOobTube_OnAttachedTrackPointAdded final
{
public:
	class UDelMarTrackSplineComponent*            InSpline;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PointIndex;                                        // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_DelMarTrackOobTube_OnAttachedTrackPointAdded;

// Function DelMarTrackRuntime.DelMarTrackOobTube.OnAttachedTrackPointChanged
// 0x0010 (0x0010 - 0x0000)
struct DelMarTrackOobTube_OnAttachedTrackPointChanged final
{
public:
	class UDelMarTrackSplineComponent*            InSpline;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PointIndex;                                        // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_DelMarTrackOobTube_OnAttachedTrackPointChanged;

// Function DelMarTrackRuntime.DelMarTrackOobTube.OnAttachedTrackPointRemoved
// 0x0010 (0x0010 - 0x0000)
struct DelMarTrackOobTube_OnAttachedTrackPointRemoved final
{
public:
	class UDelMarTrackSplineComponent*            InSpline;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PointIndex;                                        // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_DelMarTrackOobTube_OnAttachedTrackPointRemoved;

// Function DelMarTrackRuntime.DelMarTrackOobTube.OnConstructTubeMesh
// 0x0010 (0x0010 - 0x0000)
struct DelMarTrackOobTube_OnConstructTubeMesh final
{
public:
	class USplineMeshComponent*                   TubeMeshComponent;                                 // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsTransitionMesh;                                 // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsTransitionIn;                                   // 0x0009(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_DelMarTrackOobTube_OnConstructTubeMesh;

// Function DelMarTrackRuntime.DelMarTrackOobTube.DetermineTubeMeshTransitionType
// 0x000C (0x000C - 0x0000)
struct DelMarTrackOobTube_DetermineTubeMeshTransitionType final
{
public:
	int32                                         CurrentPointIndex;                                 // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NextPointIndex;                                    // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDelMarTrackOobTubeTransitionType             ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_DelMarTrackOobTube_DetermineTubeMeshTransitionType;

// Function DelMarTrackRuntime.DelMarTrackOobTube.GetSplinePointTagAtIndex
// 0x0008 (0x0008 - 0x0000)
struct DelMarTrackOobTube_GetSplinePointTagAtIndex final
{
public:
	int32                                         PointIndex;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           ReturnValue;                                       // 0x0004(0x0004)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DelMarTrackOobTube_GetSplinePointTagAtIndex;

// Function DelMarTrackRuntime.DelMarTrackOobTube.HasTubeMeshAtDistance
// 0x0008 (0x0008 - 0x0000)
struct DelMarTrackOobTube_HasTubeMeshAtDistance final
{
public:
	float                                         InDistance;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_DelMarTrackOobTube_HasTubeMeshAtDistance;

// Function DelMarTrackRuntime.DelMarTrackOobTube.IsAttachedToPrimaryTrack
// 0x0001 (0x0001 - 0x0000)
struct DelMarTrackOobTube_IsAttachedToPrimaryTrack final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DelMarTrackOobTube_IsAttachedToPrimaryTrack;

// Function DelMarTrackRuntime.DelMarTrackOobTube.IsAttachedToSecondaryTrack
// 0x0001 (0x0001 - 0x0000)
struct DelMarTrackOobTube_IsAttachedToSecondaryTrack final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DelMarTrackOobTube_IsAttachedToSecondaryTrack;

// Function DelMarTrackRuntime.DelMarTrackOobTube.IsSplinePointOffset
// 0x0008 (0x0008 - 0x0000)
struct DelMarTrackOobTube_IsSplinePointOffset final
{
public:
	int32                                         PointIndex;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_DelMarTrackOobTube_IsSplinePointOffset;

// Function DelMarTrackRuntime.DelMarTrackOobTubeProxy.GetAttachedTrack
// 0x0008 (0x0008 - 0x0000)
struct DelMarTrackOobTubeProxy_GetAttachedTrack final
{
public:
	class ADelMarTrack*                           ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DelMarTrackOobTubeProxy_GetAttachedTrack;

// Function DelMarTrackRuntime.DelMarTrackOobTubeProxy.GetDefaultSubsectionCount
// 0x0004 (0x0004 - 0x0000)
struct DelMarTrackOobTubeProxy_GetDefaultSubsectionCount final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DelMarTrackOobTubeProxy_GetDefaultSubsectionCount;

// Function DelMarTrackRuntime.DelMarTrackOobTubeProxy.GetDefaultTransitionMeshLength
// 0x0008 (0x0008 - 0x0000)
struct DelMarTrackOobTubeProxy_GetDefaultTransitionMeshLength final
{
public:
	double                                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DelMarTrackOobTubeProxy_GetDefaultTransitionMeshLength;

// Function DelMarTrackRuntime.DelMarTrackOobTubeProxy.GetMinimumMeshScale
// 0x0008 (0x0008 - 0x0000)
struct DelMarTrackOobTubeProxy_GetMinimumMeshScale final
{
public:
	double                                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DelMarTrackOobTubeProxy_GetMinimumMeshScale;

// Function DelMarTrackRuntime.DelMarTrackOobTubeProxy.GetOobTubeActor
// 0x0008 (0x0008 - 0x0000)
struct DelMarTrackOobTubeProxy_GetOobTubeActor final
{
public:
	class AActor*                                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DelMarTrackOobTubeProxy_GetOobTubeActor;

// Function DelMarTrackRuntime.DelMarTrackOobTubeProxy.GetSmallestSubsectionLength
// 0x0008 (0x0008 - 0x0000)
struct DelMarTrackOobTubeProxy_GetSmallestSubsectionLength final
{
public:
	double                                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DelMarTrackOobTubeProxy_GetSmallestSubsectionLength;

// Function DelMarTrackRuntime.DelMarTrackOobTubeProxy.GetSplineComponent
// 0x0008 (0x0008 - 0x0000)
struct DelMarTrackOobTubeProxy_GetSplineComponent final
{
public:
	class USplineComponent*                       ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DelMarTrackOobTubeProxy_GetSplineComponent;

// Function DelMarTrackRuntime.DelMarTrackOobTubeProxy.GetSplineMetadata
// 0x0030 (0x0030 - 0x0000)
struct DelMarTrackOobTubeProxy_GetSplineMetadata final
{
public:
	int32                                         PointIndex;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDelMarTrackOobTubePointMetaData       ReturnValue;                                       // 0x0008(0x0028)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DelMarTrackOobTubeProxy_GetSplineMetadata;

// Function DelMarTrackRuntime.DelMarTrackOobTubeProxy.GetSplineVisualizationOffset
// 0x0008 (0x0008 - 0x0000)
struct DelMarTrackOobTubeProxy_GetSplineVisualizationOffset final
{
public:
	double                                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DelMarTrackOobTubeProxy_GetSplineVisualizationOffset;

// Function DelMarTrackRuntime.DelMarTrackOobTubeCollectionProxy.GetOobTubeProxy
// 0x0010 (0x0010 - 0x0000)
struct DelMarTrackOobTubeCollectionProxy_GetOobTubeProxy final
{
public:
	int32                                         OobTubeIndex;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UDelMarTrackOobTubeProxy*               ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DelMarTrackOobTubeCollectionProxy_GetOobTubeProxy;

// Function DelMarTrackRuntime.DelMarTrackOobTubeCollectionProxy.RegisterOobTube
// 0x0008 (0x0008 - 0x0000)
struct DelMarTrackOobTubeCollectionProxy_RegisterOobTube final
{
public:
	class AActor*                                 OobTubeActor;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DelMarTrackOobTubeCollectionProxy_RegisterOobTube;

// Function DelMarTrackRuntime.DelMarTrackOobTubeCollectionProxy.GetNumOobTubeProxies
// 0x0004 (0x0004 - 0x0000)
struct DelMarTrackOobTubeCollectionProxy_GetNumOobTubeProxies final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DelMarTrackOobTubeCollectionProxy_GetNumOobTubeProxies;

// Function DelMarTrackRuntime.DelMarTrackPaletteTrackType.AddSegmentClassActorToStyle
// 0x0010 (0x0010 - 0x0000)
struct DelMarTrackPaletteTrackType_AddSegmentClassActorToStyle final
{
public:
	struct FGameplayTag                           StyleTag;                                          // 0x0000(0x0004)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 SegmentClass;                                      // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DelMarTrackPaletteTrackType_AddSegmentClassActorToStyle;

// Function DelMarTrackRuntime.DelMarTrackPerformanceScrubber.TimelineTickFloatCallback
// 0x0004 (0x0004 - 0x0000)
struct DelMarTrackPerformanceScrubber_TimelineTickFloatCallback final
{
public:
	float                                         Progress;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DelMarTrackPerformanceScrubber_TimelineTickFloatCallback;

// Function DelMarTrackRuntime.DelMarTrackPerformanceScrubber.UpdateSplines
// 0x0010 (0x0010 - 0x0000)
struct DelMarTrackPerformanceScrubber_UpdateSplines final
{
public:
	TArray<class FString>                         ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DelMarTrackPerformanceScrubber_UpdateSplines;

// Function DelMarTrackRuntime.DelMarTrackPositionComponent.SetActiveTrack
// 0x0010 (0x0010 - 0x0000)
struct DelMarTrackPositionComponent_SetActiveTrack final
{
public:
	class ADelMarTrackBase*                       Track;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TrackSegmentIndex;                                 // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bForce;                                            // 0x000C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_DelMarTrackPositionComponent_SetActiveTrack;

// Function DelMarTrackRuntime.DelMarTrackPositionComponent.GetActiveSegmentIndex
// 0x0004 (0x0004 - 0x0000)
struct DelMarTrackPositionComponent_GetActiveSegmentIndex final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DelMarTrackPositionComponent_GetActiveSegmentIndex;

// Function DelMarTrackRuntime.DelMarTrackPositionComponent.GetActiveTrack
// 0x0008 (0x0008 - 0x0000)
struct DelMarTrackPositionComponent_GetActiveTrack final
{
public:
	class ADelMarTrackBase*                       ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DelMarTrackPositionComponent_GetActiveTrack;

// Function DelMarTrackRuntime.DelMarTrackPositionComponent.GetActiveTrackDistance
// 0x0004 (0x0004 - 0x0000)
struct DelMarTrackPositionComponent_GetActiveTrackDistance final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DelMarTrackPositionComponent_GetActiveTrackDistance;

// Function DelMarTrackRuntime.DelMarTrackPositionComponent.GetActiveTrackPosition
// 0x0020 (0x0020 - 0x0000)
struct DelMarTrackPositionComponent_GetActiveTrackPosition final
{
public:
	struct FTrackPosition                         ReturnValue;                                       // 0x0000(0x0020)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DelMarTrackPositionComponent_GetActiveTrackPosition;

// Function DelMarTrackRuntime.DelMarTrackPositionComponent.GetActiveTrackRadius
// 0x0004 (0x0004 - 0x0000)
struct DelMarTrackPositionComponent_GetActiveTrackRadius final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DelMarTrackPositionComponent_GetActiveTrackRadius;

// Function DelMarTrackRuntime.DelMarTrackPositionComponent.GetDistanceAlongSpline
// 0x0004 (0x0004 - 0x0000)
struct DelMarTrackPositionComponent_GetDistanceAlongSpline final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DelMarTrackPositionComponent_GetDistanceAlongSpline;

// Function DelMarTrackRuntime.DelMarTrackPositionComponent.GetLastKnowGoodSplineLocation
// 0x0018 (0x0018 - 0x0000)
struct DelMarTrackPositionComponent_GetLastKnowGoodSplineLocation final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DelMarTrackPositionComponent_GetLastKnowGoodSplineLocation;

// Function DelMarTrackRuntime.DelMarTrackPositionComponent.GetPrimaryDistance
// 0x0004 (0x0004 - 0x0000)
struct DelMarTrackPositionComponent_GetPrimaryDistance final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DelMarTrackPositionComponent_GetPrimaryDistance;

// Function DelMarTrackRuntime.DelMarTrackPositionComponent.GetPrimaryTrack
// 0x0008 (0x0008 - 0x0000)
struct DelMarTrackPositionComponent_GetPrimaryTrack final
{
public:
	class ADelMarTrackBase*                       ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DelMarTrackPositionComponent_GetPrimaryTrack;

// Function DelMarTrackRuntime.DelMarTrackPositionComponent.GetPrimaryWorldLocationAlongSpline
// 0x0018 (0x0018 - 0x0000)
struct DelMarTrackPositionComponent_GetPrimaryWorldLocationAlongSpline final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DelMarTrackPositionComponent_GetPrimaryWorldLocationAlongSpline;

// Function DelMarTrackRuntime.DelMarTrackPositionComponent.GetRawClosestSplineLocation
// 0x0018 (0x0018 - 0x0000)
struct DelMarTrackPositionComponent_GetRawClosestSplineLocation final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DelMarTrackPositionComponent_GetRawClosestSplineLocation;

// Function DelMarTrackRuntime.DelMarTrackPositionComponent.GetRawDistanceAlongSpline
// 0x0004 (0x0004 - 0x0000)
struct DelMarTrackPositionComponent_GetRawDistanceAlongSpline final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DelMarTrackPositionComponent_GetRawDistanceAlongSpline;

// Function DelMarTrackRuntime.DelMarTrackPositionComponent.GetTrackRadius
// 0x0010 (0x0010 - 0x0000)
struct DelMarTrackPositionComponent_GetTrackRadius final
{
public:
	const class ADelMarTrackBase*                 InTrack;                                           // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InDistanceAlongTrack;                              // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x000C(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DelMarTrackPositionComponent_GetTrackRadius;

// Function DelMarTrackRuntime.DelMarTrackPositionComponent.GetWorldDirectionAlongSpline
// 0x0018 (0x0018 - 0x0000)
struct DelMarTrackPositionComponent_GetWorldDirectionAlongSpline final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DelMarTrackPositionComponent_GetWorldDirectionAlongSpline;

// Function DelMarTrackRuntime.DelMarTrackPositionComponent.GetWorldLocationAlongSpline
// 0x0018 (0x0018 - 0x0000)
struct DelMarTrackPositionComponent_GetWorldLocationAlongSpline final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DelMarTrackPositionComponent_GetWorldLocationAlongSpline;

// Function DelMarTrackRuntime.DelMarTrackPositionComponent.GetWorldRightVectorAlongSpline
// 0x0018 (0x0018 - 0x0000)
struct DelMarTrackPositionComponent_GetWorldRightVectorAlongSpline final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DelMarTrackPositionComponent_GetWorldRightVectorAlongSpline;

// Function DelMarTrackRuntime.DelMarTrackPositionComponent.GetWorldTransformAlongSpline
// 0x0060 (0x0060 - 0x0000)
struct DelMarTrackPositionComponent_GetWorldTransformAlongSpline final
{
public:
	struct FTransform                             ReturnValue;                                       // 0x0000(0x0060)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DelMarTrackPositionComponent_GetWorldTransformAlongSpline;

// Function DelMarTrackRuntime.DelMarTrackPositionComponent.GetWorldUpVectorAlongSpline
// 0x0018 (0x0018 - 0x0000)
struct DelMarTrackPositionComponent_GetWorldUpVectorAlongSpline final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DelMarTrackPositionComponent_GetWorldUpVectorAlongSpline;

// Function DelMarTrackRuntime.DelMarTrackPositionComponent.HasValidPosition
// 0x0001 (0x0001 - 0x0000)
struct DelMarTrackPositionComponent_HasValidPosition final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DelMarTrackPositionComponent_HasValidPosition;

// Function DelMarTrackRuntime.DelMarTrackPositionComponent.IsOnPrimaryTrack
// 0x0001 (0x0001 - 0x0000)
struct DelMarTrackPositionComponent_IsOnPrimaryTrack final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DelMarTrackPositionComponent_IsOnPrimaryTrack;

// Function DelMarTrackRuntime.DelMarTrackPositionComponent.IsTouchingTrack
// 0x0001 (0x0001 - 0x0000)
struct DelMarTrackPositionComponent_IsTouchingTrack final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DelMarTrackPositionComponent_IsTouchingTrack;

// Function DelMarTrackRuntime.DelMarTrackPrefabSegment.GetSockets
// 0x0010 (0x0010 - 0x0000)
struct DelMarTrackPrefabSegment_GetSockets final
{
public:
	TArray<class FString>                         ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DelMarTrackPrefabSegment_GetSockets;

// Function DelMarTrackRuntime.DelMarTrackSplineComponent.FindClosestLocationForSegmentToWorldPlane
// 0x0058 (0x0058 - 0x0000)
struct DelMarTrackSplineComponent_FindClosestLocationForSegmentToWorldPlane final
{
public:
	struct FVector                                WorldPlaneOrigin;                                  // 0x0000(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
