#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DeltaFileSystem

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Engine_classes.hpp"
#include "DeltaFileSystem_structs.hpp"


namespace SDK
{

// Class DeltaFileSystem.DeltaFileSaveHandlerTestContext
// 0x0008 (0x0030 - 0x0028)
class UDeltaFileSaveHandlerTestContext final : public UObject
{
public:
	class UDeltaFileSaveHandler*                  SaveHandler;                                       // 0x0028(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DeltaFileSaveHandlerTestContext")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DeltaFileSaveHandlerTestContext")
	}
	static class UDeltaFileSaveHandlerTestContext* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDeltaFileSaveHandlerTestContext>();
	}
};
DUMPER7_ASSERTS_UDeltaFileSaveHandlerTestContext;

// Class DeltaFileSystem.DeltaFile
// 0x0000 (0x0000 - 0x0000)
class IDeltaFile final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DeltaFile")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DeltaFile")
	}
	static class IDeltaFile* GetDefaultObj()
	{
		return GetDefaultObjImpl<IDeltaFile>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IDeltaFile;

// Class DeltaFileSystem.DeltaFileApplier
// 0x0000 (0x0000 - 0x0000)
class IDeltaFileApplier final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DeltaFileApplier")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DeltaFileApplier")
	}
	static class IDeltaFileApplier* GetDefaultObj()
	{
		return GetDefaultObjImpl<IDeltaFileApplier>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IDeltaFileApplier;

// Class DeltaFileSystem.DeltaComponent
// 0x0010 (0x00B0 - 0x00A0)
class UDeltaComponent final : public UActorComponent
{
public:
	uint8                                         Pad_A0[0x10];                                      // 0x00A0(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DeltaComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DeltaComponent")
	}
	static class UDeltaComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDeltaComponent>();
	}
};
DUMPER7_ASSERTS_UDeltaComponent;

// Class DeltaFileSystem.DeltaFileSaveHandler
// 0x0118 (0x0140 - 0x0028)
class UDeltaFileSaveHandler final : public UObject
{
public:
	uint8                                         Pad_28[0x118];                                     // 0x0028(0x0118)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DeltaFileSaveHandler")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DeltaFileSaveHandler")
	}
	static class UDeltaFileSaveHandler* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDeltaFileSaveHandler>();
	}
};
DUMPER7_ASSERTS_UDeltaFileSaveHandler;

// Class DeltaFileSystem.DeltaFileSubsystem
// 0x00B8 (0x00E8 - 0x0030)
class UDeltaFileSubsystem final : public UEngineSubsystem
{
public:
	TMap<class UWorld*, struct FDeltaTrackingHandles> WorldToTrackingHandles;                        // 0x0030(0x0050)(Transient, NativeAccessSpecifierPrivate)
	TMap<class FName, class UObject*>             DeltaFiles;                                        // 0x0080(0x0050)(Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	struct FSoftClassPath                         DefaultDeltaFileClass;                             // 0x00D0(0x0018)(ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DeltaFileSubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DeltaFileSubsystem")
	}
	static class UDeltaFileSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDeltaFileSubsystem>();
	}
};
DUMPER7_ASSERTS_UDeltaFileSubsystem;

// Class DeltaFileSystem.MapDelta
// 0x00C8 (0x00F0 - 0x0028)
class UMapDelta final : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 PackageToApplyTo;                                  // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<struct FGuid, struct FAddAction>         AddActions;                                        // 0x0040(0x0050)(NativeAccessSpecifierPublic)
	TArray<struct FUpdateAction>                  UpdateActions;                                     // 0x0090(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TMap<struct FGuid, struct FDeleteAction>      DeleteActions;                                     // 0x00A0(0x0050)(NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MapDelta")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MapDelta")
	}
	static class UMapDelta* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMapDelta>();
	}
};
DUMPER7_ASSERTS_UMapDelta;

// Class DeltaFileSystem.MapDeltaApplier
// 0x00C8 (0x00F0 - 0x0028)
class UMapDeltaApplier final : public UObject
{
public:
	uint8                                         Pad_28[0xC8];                                      // 0x0028(0x00C8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MapDeltaApplier")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MapDeltaApplier")
	}
	static class UMapDeltaApplier* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMapDeltaApplier>();
	}
};
DUMPER7_ASSERTS_UMapDeltaApplier;

}

