#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DFX_MaterialParamsStruct

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct DFX_MaterialParamsStruct.DFX_MaterialParamsStruct
// 0x00A8 (0x00A8 - 0x0000)
struct FDFX_MaterialParamsStruct final
{
public:
	class UTexture2D*                             Texture_8_367F09C249DB49B23753F695EAFEDEC6;        // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Matrix_X_9_863869604343F3CDFF972AAD5F2F3E0C;       // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Matrix_Y_10_3A617E204C378484BB53C39A363D47F7;      // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Matrix_Z_11_7EC280B140C8E9A69AA9E69AA8F5880C;      // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           ForwardVector_13_CD800E244085CC820C672EBE67112B8D; // 0x0038(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           TintColor_39_0E2067244504B0A20A9527AD96E915BC;     // 0x0048(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           PanningSpeed_42_4402686B48249213219AFD9C82DADF67;  // 0x0058(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        AngleBlend_18_66E99DE84FCA3617B0730793456181F0;    // 0x0068(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        AngleBlendHardness_19_1E0491B342DE0831EF95A0B645357C86; // 0x0070(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Perspective_22_EB3E14F249E79424BED54799CB192106;   // 0x0078(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        FixedTexture_25_7973695749F65934722AA48DAC6090EC;  // 0x0080(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Tiling_27_6DD3D5834DA01BBA73D945ACF2C6F0E5;        // 0x0088(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Intensity_30_87A506F949AC6FA6DF2B40944DE9EC5B;     // 0x0090(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Falloff_35_B4677D51444BC62AF1E9D88CA9F0283C;       // 0x0098(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        FalloffRadius_36_6BC0BCF84F1463D127628F923FAC0A08; // 0x00A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FDFX_MaterialParamsStruct;

}

