#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DiscoveryBrowserUI

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "DiscoveryBrowserUI_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function DiscoveryBrowserUI.FortDiscoverHomespace.OnPeekPushPercentMobileCVarChanged
// 0x0004 (0x0004 - 0x0000)
struct FortDiscoverHomespace_OnPeekPushPercentMobileCVarChanged final
{
public:
	float                                         PeekPushPercent;                                   // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortDiscoverHomespace_OnPeekPushPercentMobileCVarChanged;

// Function DiscoveryBrowserUI.FortActivityBrowserListView.NavigateToActivityInFirstRow
// 0x0004 (0x0004 - 0x0000)
struct FortActivityBrowserListView_NavigateToActivityInFirstRow final
{
public:
	int32                                         ActivityItemIndex;                                 // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortActivityBrowserListView_NavigateToActivityInFirstRow;

// Function DiscoveryBrowserUI.FortActivityBrowserPlayWithFriendsTile.BP_PartyInformationUpdated
// 0x0001 (0x0001 - 0x0000)
struct FortActivityBrowserPlayWithFriendsTile_BP_PartyInformationUpdated final
{
public:
	bool                                          bInIsTileSelected;                                 // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortActivityBrowserPlayWithFriendsTile_BP_PartyInformationUpdated;

// Function DiscoveryBrowserUI.FortActivityBrowserPlayWithFriendsTile.GetCTAButtonText
// 0x0018 (0x0018 - 0x0000)
struct FortActivityBrowserPlayWithFriendsTile_GetCTAButtonText final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortActivityBrowserPlayWithFriendsTile_GetCTAButtonText;

// Function DiscoveryBrowserUI.FortActivityBrowserPlayWithFriendsTile.OnGameActivityChanged
// 0x0008 (0x0008 - 0x0000)
struct FortActivityBrowserPlayWithFriendsTile_OnGameActivityChanged final
{
public:
	class UFortGameActivity*                      GameActivity;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortActivityBrowserPlayWithFriendsTile_OnGameActivityChanged;

// Function DiscoveryBrowserUI.FortActivityBrowserPlayWithFriendsTile.OnTextureLoadingComplete
// 0x0008 (0x0008 - 0x0000)
struct FortActivityBrowserPlayWithFriendsTile_OnTextureLoadingComplete final
{
public:
	const class UTexture*                         ThumbnailTexture;                                  // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortActivityBrowserPlayWithFriendsTile_OnTextureLoadingComplete;

// Function DiscoveryBrowserUI.FortActivityBrowserPlayWithFriendsTile.OnTileActiveChanged
// 0x0001 (0x0001 - 0x0000)
struct FortActivityBrowserPlayWithFriendsTile_OnTileActiveChanged final
{
public:
	bool                                          bIsTileActive;                                     // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortActivityBrowserPlayWithFriendsTile_OnTileActiveChanged;

// Function DiscoveryBrowserUI.FortActivityBrowserPlayWithFriendsTile.OnUpdateColumnSize
// 0x0004 (0x0004 - 0x0000)
struct FortActivityBrowserPlayWithFriendsTile_OnUpdateColumnSize final
{
public:
	int32                                         NewColumnSize;                                     // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortActivityBrowserPlayWithFriendsTile_OnUpdateColumnSize;

// Function DiscoveryBrowserUI.FortActivityBrowserPlayWithFriendsTile.UpdateCTAButtonInfo
// 0x0020 (0x0020 - 0x0000)
struct FortActivityBrowserPlayWithFriendsTile_UpdateCTAButtonInfo final
{
public:
	class FText                                   InteractionText;                                   // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          bInteractionFound;                                 // 0x0018(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FortActivityBrowserPlayWithFriendsTile_UpdateCTAButtonInfo;

// Function DiscoveryBrowserUI.FortActivityBrowserPlayWithFriendsTile.UpdateCTAButtonInteraction
// 0x0001 (0x0001 - 0x0000)
struct FortActivityBrowserPlayWithFriendsTile_UpdateCTAButtonInteraction final
{
public:
	bool                                          bIsInteractionEnabled;                             // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortActivityBrowserPlayWithFriendsTile_UpdateCTAButtonInteraction;

// Function DiscoveryBrowserUI.FortActivityBrowserPlayWithFriendsTile.UpdateIslandThumbnail
// 0x0008 (0x0008 - 0x0000)
struct FortActivityBrowserPlayWithFriendsTile_UpdateIslandThumbnail final
{
public:
	const class UTexture*                         ThumbnailTexture;                                  // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortActivityBrowserPlayWithFriendsTile_UpdateIslandThumbnail;

// Function DiscoveryBrowserUI.FortActivityBrowserPlayWithFriendsTile.UpdateLastInteraction
// 0x0018 (0x0018 - 0x0000)
struct FortActivityBrowserPlayWithFriendsTile_UpdateLastInteraction final
{
public:
	class FText                                   LastInteraction;                                   // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortActivityBrowserPlayWithFriendsTile_UpdateLastInteraction;

// Function DiscoveryBrowserUI.FortActivityBrowserPlayWithFriendsTile.UpdateOtherPlayersSubText
// 0x0018 (0x0018 - 0x0000)
struct FortActivityBrowserPlayWithFriendsTile_UpdateOtherPlayersSubText final
{
public:
	class FText                                   OtherPlayersSubText;                               // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortActivityBrowserPlayWithFriendsTile_UpdateOtherPlayersSubText;

// Function DiscoveryBrowserUI.FortActivityBrowserPlayWithFriendsTile.UpdatePartyMemberNames
// 0x0018 (0x0018 - 0x0000)
struct FortActivityBrowserPlayWithFriendsTile_UpdatePartyMemberNames final
{
public:
	class FText                                   Names;                                             // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortActivityBrowserPlayWithFriendsTile_UpdatePartyMemberNames;

// Function DiscoveryBrowserUI.FortActivityBrowserPlayWithFriendsTile.UpdateRichPresence
// 0x0018 (0x0018 - 0x0000)
struct FortActivityBrowserPlayWithFriendsTile_UpdateRichPresence final
{
public:
	class FText                                   RichPresence;                                      // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortActivityBrowserPlayWithFriendsTile_UpdateRichPresence;

// Function DiscoveryBrowserUI.FortActivityBrowserPlayWithFriendsTile.UpdateSingleFriendName
// 0x0018 (0x0018 - 0x0000)
struct FortActivityBrowserPlayWithFriendsTile_UpdateSingleFriendName final
{
public:
	class FText                                   SingleFriendName;                                  // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortActivityBrowserPlayWithFriendsTile_UpdateSingleFriendName;

// Function DiscoveryBrowserUI.FortActivityBrowserPlayWithFriendsTile.GetMaxPartySize
// 0x0004 (0x0004 - 0x0000)
struct FortActivityBrowserPlayWithFriendsTile_GetMaxPartySize final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortActivityBrowserPlayWithFriendsTile_GetMaxPartySize;

// Function DiscoveryBrowserUI.FortActivityBrowserRow.OnCategoryItemChanged
// 0x0001 (0x0001 - 0x0000)
struct FortActivityBrowserRow_OnCategoryItemChanged final
{
public:
	bool                                          bPlayAnimation;                                    // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortActivityBrowserRow_OnCategoryItemChanged;

// Function DiscoveryBrowserUI.FortActivityBrowserRow.OnRowIsActiveChanged
// 0x0001 (0x0001 - 0x0000)
struct FortActivityBrowserRow_OnRowIsActiveChanged final
{
public:
	bool                                          bIsActive;                                         // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortActivityBrowserRow_OnRowIsActiveChanged;

// Function DiscoveryBrowserUI.FortActivityBrowserRow.OnRowIsSelectedChanged
// 0x0001 (0x0001 - 0x0000)
struct FortActivityBrowserRow_OnRowIsSelectedChanged final
{
public:
	bool                                          bIsSelected;                                       // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortActivityBrowserRow_OnRowIsSelectedChanged;

// Function DiscoveryBrowserUI.FortActivityBrowserRow.OnRowMoveDown
// 0x0001 (0x0001 - 0x0000)
struct FortActivityBrowserRow_OnRowMoveDown final
{
public:
	bool                                          bMovingOffscreen;                                  // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortActivityBrowserRow_OnRowMoveDown;

// Function DiscoveryBrowserUI.FortActivityBrowserRow.OnRowMoveUp
// 0x0001 (0x0001 - 0x0000)
struct FortActivityBrowserRow_OnRowMoveUp final
{
public:
	bool                                          bMovingOffscreen;                                  // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortActivityBrowserRow_OnRowMoveUp;

// Function DiscoveryBrowserUI.FortActivityBrowserRow.OnRowPeekStateChanged
// 0x0001 (0x0001 - 0x0000)
struct FortActivityBrowserRow_OnRowPeekStateChanged final
{
public:
	bool                                          bIsInPeekState;                                    // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortActivityBrowserRow_OnRowPeekStateChanged;

// Function DiscoveryBrowserUI.FortActivityBrowserRow.GetIsActive
// 0x0001 (0x0001 - 0x0000)
struct FortActivityBrowserRow_GetIsActive final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortActivityBrowserRow_GetIsActive;

// Function DiscoveryBrowserUI.FortActivityBrowserRow.GetIsInPeekState
// 0x0001 (0x0001 - 0x0000)
struct FortActivityBrowserRow_GetIsInPeekState final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortActivityBrowserRow_GetIsInPeekState;

// Function DiscoveryBrowserUI.FortActivityBrowserRow.GetIsSelected
// 0x0001 (0x0001 - 0x0000)
struct FortActivityBrowserRow_GetIsSelected final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortActivityBrowserRow_GetIsSelected;

// Function DiscoveryBrowserUI.FortActivityBrowserRowList.OnQueryStatusChanged
// 0x0001 (0x0001 - 0x0000)
struct FortActivityBrowserRowList_OnQueryStatusChanged final
{
public:
	bool                                          bIsActive;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortActivityBrowserRowList_OnQueryStatusChanged;

// Function DiscoveryBrowserUI.FortActivityBrowserView.GetInvalidActivityReason
// 0x0001 (0x0001 - 0x0000)
struct FortActivityBrowserView_GetInvalidActivityReason final
{
public:
	EFortInvalidActivityReason                    ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortActivityBrowserView_GetInvalidActivityReason;

// Function DiscoveryBrowserUI.FortActivityBrowserRowView.HandleVerticalSwipe
// 0x0004 (0x0004 - 0x0000)
struct FortActivityBrowserRowView_HandleVerticalSwipe final
{
public:
	int32                                         Direction;                                         // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortActivityBrowserRowView_HandleVerticalSwipe;

// Function DiscoveryBrowserUI.FortActivityBrowserRowView.OnListViewScrolled
// 0x0008 (0x0008 - 0x0000)
struct FortActivityBrowserRowView_OnListViewScrolled final
{
public:
	float                                         ItemOffset;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DistanceRemaining;                                 // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortActivityBrowserRowView_OnListViewScrolled;

// Function DiscoveryBrowserUI.FortActivityBrowserRowView.OnRowChanged
// 0x0004 (0x0004 - 0x0000)
struct FortActivityBrowserRowView_OnRowChanged final
{
public:
	int32                                         NewCategoryIndex;                                  // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortActivityBrowserRowView_OnRowChanged;

// Function DiscoveryBrowserUI.FortActivityBrowserTile.HandleDisplayTileDetailsHoldTriggered
// 0x0008 (0x0008 - 0x0000)
struct FortActivityBrowserTile_HandleDisplayTileDetailsHoldTriggered final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortActivityBrowserTile_HandleDisplayTileDetailsHoldTriggered;

// Function DiscoveryBrowserUI.FortActivityCategoryTile.OnTileActiveSet
// 0x0001 (0x0001 - 0x0000)
struct FortActivityCategoryTile_OnTileActiveSet final
{
public:
	bool                                          bIsTileActive;                                     // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortActivityCategoryTile_OnTileActiveSet;

// Function DiscoveryBrowserUI.FortActivityCategoryView.NavigateFromPanel
// 0x0018 (0x0018 - 0x0000)
struct FortActivityCategoryView_NavigateFromPanel final
{
public:
	EUINavigation                                 Direction;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortActivityCategoryTilePanel*         NavigatingPanel;                                   // 0x0008(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortActivityCategoryTilePanel*         ReturnValue;                                       // 0x0010(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortActivityCategoryView_NavigateFromPanel;

// Function DiscoveryBrowserUI.FortActivityCategoryView.OnCategoryTilePanelSelected
// 0x0008 (0x0008 - 0x0000)
struct FortActivityCategoryView_OnCategoryTilePanelSelected final
{
public:
	const class UFortActivityCategoryTilePanel*   SelectedPanel;                                     // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortActivityCategoryView_OnCategoryTilePanelSelected;

// Function DiscoveryBrowserUI.FortActivityCategoryView.GetCurrentSelectedPanel
// 0x0008 (0x0008 - 0x0000)
struct FortActivityCategoryView_GetCurrentSelectedPanel final
{
public:
	const class UFortActivityCategoryTilePanel*   ReturnValue;                                       // 0x0000(0x0008)(ConstParm, ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortActivityCategoryView_GetCurrentSelectedPanel;

// Function DiscoveryBrowserUI.FortActivityCategoryView.GetTopMostVisiblePanel
// 0x0008 (0x0008 - 0x0000)
struct FortActivityCategoryView_GetTopMostVisiblePanel final
{
public:
	class UFortActivityCategoryTilePanel*         ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortActivityCategoryView_GetTopMostVisiblePanel;

// Function DiscoveryBrowserUI.FortActivityDiscoverView.OnMoviePlayingChanged
// 0x0001 (0x0001 - 0x0000)
struct FortActivityDiscoverView_OnMoviePlayingChanged final
{
public:
	bool                                          bIsPlaying;                                        // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortActivityDiscoverView_OnMoviePlayingChanged;

// Function DiscoveryBrowserUI.FortActivityDiscoverView.OnPreviewImageChanged
// 0x0010 (0x0010 - 0x0000)
struct FortActivityDiscoverView_OnPreviewImageChanged final
{
public:
	bool                                          bIsLoading;                                        // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class UTexture*                         Texture;                                           // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortActivityDiscoverView_OnPreviewImageChanged;

// Function DiscoveryBrowserUI.FortActivityDiscoverView.GetCurrentTexture
// 0x0008 (0x0008 - 0x0000)
struct FortActivityDiscoverView_GetCurrentTexture final
{
public:
	const class UTexture*                         ReturnValue;                                       // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortActivityDiscoverView_GetCurrentTexture;

// Function DiscoveryBrowserUI.FortActivityDiscoverView.GetKeyArtOutroAnimation
// 0x0008 (0x0008 - 0x0000)
struct FortActivityDiscoverView_GetKeyArtOutroAnimation final
{
public:
	class UWidgetAnimation*                       ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortActivityDiscoverView_GetKeyArtOutroAnimation;

// Function DiscoveryBrowserUI.FortActivityDiscoverView.GetMovieWidget
// 0x0008 (0x0008 - 0x0000)
struct FortActivityDiscoverView_GetMovieWidget final
{
public:
	class UFortActivatableMovieWidget*            ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortActivityDiscoverView_GetMovieWidget;

// Function DiscoveryBrowserUI.FortActivityDiscoverView.GetPromotedMovieWidget
// 0x0008 (0x0008 - 0x0000)
struct FortActivityDiscoverView_GetPromotedMovieWidget final
{
public:
	class UFortActivatableMovieWidget*            ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortActivityDiscoverView_GetPromotedMovieWidget;

// Function DiscoveryBrowserUI.FortActivityDiscoverView.IsImageLoading
// 0x0001 (0x0001 - 0x0000)
struct FortActivityDiscoverView_IsImageLoading final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortActivityDiscoverView_IsImageLoading;

// Function DiscoveryBrowserUI.FortActivityDiscoverView.IsInOutroState
// 0x0001 (0x0001 - 0x0000)
struct FortActivityDiscoverView_IsInOutroState final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortActivityDiscoverView_IsInOutroState;

// Function DiscoveryBrowserUI.FortActivityDiscoverView.IsShowingPromotedContent
// 0x0001 (0x0001 - 0x0000)
struct FortActivityDiscoverView_IsShowingPromotedContent final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortActivityDiscoverView_IsShowingPromotedContent;

// Function DiscoveryBrowserUI.FortActivityDiscoverView.IsShowingSeasonalContent
// 0x0001 (0x0001 - 0x0000)
struct FortActivityDiscoverView_IsShowingSeasonalContent final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortActivityDiscoverView_IsShowingSeasonalContent;

// Function DiscoveryBrowserUI.FortActivityDiscoverViewV2.UpdateMiscActionBindingVisibility
// 0x0001 (0x0001 - 0x0000)
struct FortActivityDiscoverViewV2_UpdateMiscActionBindingVisibility final
{
public:
	bool                                          bVisible;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortActivityDiscoverViewV2_UpdateMiscActionBindingVisibility;

// Function DiscoveryBrowserUI.FortActivityDiscoverViewV2.IsShowingPromotedContent
// 0x0001 (0x0001 - 0x0000)
struct FortActivityDiscoverViewV2_IsShowingPromotedContent final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortActivityDiscoverViewV2_IsShowingPromotedContent;

// Function DiscoveryBrowserUI.FortActivityDiscoverViewV2.IsShowingSeasonalContent
// 0x0001 (0x0001 - 0x0000)
struct FortActivityDiscoverViewV2_IsShowingSeasonalContent final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortActivityDiscoverViewV2_IsShowingSeasonalContent;

// Function DiscoveryBrowserUI.FortActivityListView.AddTileType
// 0x0010 (0x0010 - 0x0000)
struct FortActivityListView_AddTileType final
{
public:
	EActivityBrowserTileStyle                     style;                                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UFortActivityBrowserTileBase> WidgetClass;                                     // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortActivityListView_AddTileType;

// Function DiscoveryBrowserUI.FortActivityListView.GetInViewCount
// 0x0004 (0x0004 - 0x0000)
struct FortActivityListView_GetInViewCount final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortActivityListView_GetInViewCount;

// Function DiscoveryBrowserUI.FortActivityLobbyTile.OnPreviewImageChanged
// 0x0010 (0x0010 - 0x0000)
struct FortActivityLobbyTile_OnPreviewImageChanged final
{
public:
	bool                                          bIsLoading;                                        // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class UTexture*                         Texture;                                           // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortActivityLobbyTile_OnPreviewImageChanged;

// Function DiscoveryBrowserUI.FortActivityLobbyTile.GetChildActivityDisplayName
// 0x0018 (0x0018 - 0x0000)
struct FortActivityLobbyTile_GetChildActivityDisplayName final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortActivityLobbyTile_GetChildActivityDisplayName;

// Function DiscoveryBrowserUI.FortActivityLobbyTile.IsActivityEpicCreated
// 0x0001 (0x0001 - 0x0000)
struct FortActivityLobbyTile_IsActivityEpicCreated final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortActivityLobbyTile_IsActivityEpicCreated;

// Function DiscoveryBrowserUI.FortActivityLobbyTile.ShouldShowSubmodeSelectButton
// 0x0001 (0x0001 - 0x0000)
struct FortActivityLobbyTile_ShouldShowSubmodeSelectButton final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortActivityLobbyTile_ShouldShowSubmodeSelectButton;

// Function DiscoveryBrowserUI.FortActivityModeSetSelectionModal.OnActivityChanged
// 0x0018 (0x0018 - 0x0000)
struct FortActivityModeSetSelectionModal_OnActivityChanged final
{
public:
	const class UFortGameActivity*                GameActivity;                                      // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 StartingSelectedMnemonic;                          // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortActivityModeSetSelectionModal_OnActivityChanged;

// Function DiscoveryBrowserUI.FortActivityModeSetSelectionModal.OnPreviewImageChanged
// 0x0010 (0x0010 - 0x0000)
struct FortActivityModeSetSelectionModal_OnPreviewImageChanged final
{
public:
	bool                                          bIsLoading;                                        // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class UTexture*                         Texture;                                           // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortActivityModeSetSelectionModal_OnPreviewImageChanged;

// Function DiscoveryBrowserUI.FortActivityModeSetSelectionModal.SetHabaneroValues
// 0x0002 (0x0002 - 0x0000)
struct FortActivityModeSetSelectionModal_SetHabaneroValues final
{
public:
	bool                                          bHabaneroEnabled;                                  // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHabaneroExists;                                   // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortActivityModeSetSelectionModal_SetHabaneroValues;

// Function DiscoveryBrowserUI.FortActivityModeSetSelectionModal.SetIsRankedSwitchAvailable
// 0x0001 (0x0001 - 0x0000)
struct FortActivityModeSetSelectionModal_SetIsRankedSwitchAvailable final
{
public:
	bool                                          bIsRankedSwitchAvailable;                          // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortActivityModeSetSelectionModal_SetIsRankedSwitchAvailable;

// Function DiscoveryBrowserUI.FortActivityModeSetSelectionModal.IsCreativeModeSetActivity
// 0x0001 (0x0001 - 0x0000)
struct FortActivityModeSetSelectionModal_IsCreativeModeSetActivity final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortActivityModeSetSelectionModal_IsCreativeModeSetActivity;

// Function DiscoveryBrowserUI.FortActivitySelector.OnEnableColorScheme
// 0x0001 (0x0001 - 0x0000)
struct FortActivitySelector_OnEnableColorScheme final
{
public:
	bool                                          bIsColorSchemeActive;                              // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortActivitySelector_OnEnableColorScheme;

// Function DiscoveryBrowserUI.FortActivitySelector.OnSwapColorScheme
// 0x0001 (0x0001 - 0x0000)
struct FortActivitySelector_OnSwapColorScheme final
{
public:
	bool                                          bInIsUsingAlternateColorScheme;                    // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortActivitySelector_OnSwapColorScheme;

// Function DiscoveryBrowserUI.FortActivityTileDetailsDisplay.OnFriendsPlayingChanged
// 0x0004 (0x0004 - 0x0000)
struct FortActivityTileDetailsDisplay_OnFriendsPlayingChanged final
{
public:
	int32                                         NumPlaying;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortActivityTileDetailsDisplay_OnFriendsPlayingChanged;

// Function DiscoveryBrowserUI.FortActivityTileDetailsDisplay.OnIsFavoriteChanged
// 0x0001 (0x0001 - 0x0000)
struct FortActivityTileDetailsDisplay_OnIsFavoriteChanged final
{
public:
	bool                                          bIsFavorite;                                       // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortActivityTileDetailsDisplay_OnIsFavoriteChanged;

// Function DiscoveryBrowserUI.FortActivityTileDetailsDisplay.OnLogoImageChanged
// 0x0010 (0x0010 - 0x0000)
struct FortActivityTileDetailsDisplay_OnLogoImageChanged final
{
public:
	bool                                          bIsLoading;                                        // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class UTexture*                         Texture;                                           // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortActivityTileDetailsDisplay_OnLogoImageChanged;

// Function DiscoveryBrowserUI.FortActivityTileDetailsDisplay.OnPartySizeChanged
// 0x0004 (0x0004 - 0x0000)
struct FortActivityTileDetailsDisplay_OnPartySizeChanged final
{
public:
	int32                                         PartySize;                                         // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortActivityTileDetailsDisplay_OnPartySizeChanged;

// Function DiscoveryBrowserUI.FortActivityTileDetailsDisplay.OnPreviewImageChanged
// 0x0010 (0x0010 - 0x0000)
struct FortActivityTileDetailsDisplay_OnPreviewImageChanged final
{
public:
	bool                                          bIsLoading;                                        // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class UTexture*                         Texture;                                           // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortActivityTileDetailsDisplay_OnPreviewImageChanged;

// Function DiscoveryBrowserUI.FortActivityTileDetailsDisplay.OnRequiresPurchaseChanged
// 0x0001 (0x0001 - 0x0000)
struct FortActivityTileDetailsDisplay_OnRequiresPurchaseChanged final
{
public:
	bool                                          bRequiresPurchase;                                 // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortActivityTileDetailsDisplay_OnRequiresPurchaseChanged;

// Function DiscoveryBrowserUI.FortActivityTileDetailsDisplay.OnRespondToTileViewVisibilityChange
// 0x0001 (0x0001 - 0x0000)
struct FortActivityTileDetailsDisplay_OnRespondToTileViewVisibilityChange final
{
public:
	bool                                          bIsVisible;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortActivityTileDetailsDisplay_OnRespondToTileViewVisibilityChange;

// Function DiscoveryBrowserUI.FortActivityTileDetailsDisplay.OnTileActiveSet
// 0x0001 (0x0001 - 0x0000)
struct FortActivityTileDetailsDisplay_OnTileActiveSet final
{
public:
	bool                                          bIsTileActive;                                     // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortActivityTileDetailsDisplay_OnTileActiveSet;

// Function DiscoveryBrowserUI.FortActivityTileDetailsDisplay.ShouldPlayTileVideo
// 0x0001 (0x0001 - 0x0000)
struct FortActivityTileDetailsDisplay_ShouldPlayTileVideo final
{
public:
	bool                                          bOutResult;                                        // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortActivityTileDetailsDisplay_ShouldPlayTileVideo;

// Function DiscoveryBrowserUI.FortActivityTileDetailsDisplay.UpdateCCU
// 0x0004 (0x0004 - 0x0000)
struct FortActivityTileDetailsDisplay_UpdateCCU final
{
public:
	int32                                         CCUCount;                                          // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortActivityTileDetailsDisplay_UpdateCCU;

// Function DiscoveryBrowserUI.FortActivityTileDetailsDisplay.UpdateSqueegeeWidgets
// 0x0008 (0x0008 - 0x0000)
struct FortActivityTileDetailsDisplay_UpdateSqueegeeWidgets final
{
public:
	class UFortGameActivity*                      GameActivity;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortActivityTileDetailsDisplay_UpdateSqueegeeWidgets;

// Function DiscoveryBrowserUI.FortActivityTileDetailsDisplay.DoesActivityRequirePurchase
// 0x0001 (0x0001 - 0x0000)
struct FortActivityTileDetailsDisplay_DoesActivityRequirePurchase final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortActivityTileDetailsDisplay_DoesActivityRequirePurchase;

// Function DiscoveryBrowserUI.FortActivityTileDetailsDisplay.GetActivityCreatorDisplayText
// 0x0010 (0x0010 - 0x0000)
struct FortActivityTileDetailsDisplay_GetActivityCreatorDisplayText final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortActivityTileDetailsDisplay_GetActivityCreatorDisplayText;

// Function DiscoveryBrowserUI.FortActivityTileDetailsDisplay.GetActivitySelector
// 0x0008 (0x0008 - 0x0000)
struct FortActivityTileDetailsDisplay_GetActivitySelector final
{
public:
	class UFortActivitySelector*                  ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortActivityTileDetailsDisplay_GetActivitySelector;

// Function DiscoveryBrowserUI.FortActivityTileDetailsDisplay.GetInvalidActivityReason
// 0x0001 (0x0001 - 0x0000)
struct FortActivityTileDetailsDisplay_GetInvalidActivityReason final
{
public:
	EFortInvalidActivityReason                    ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortActivityTileDetailsDisplay_GetInvalidActivityReason;

// Function DiscoveryBrowserUI.FortActivityTileDetailsDisplay.GetIsActivityLockedReason
// 0x0001 (0x0001 - 0x0000)
struct FortActivityTileDetailsDisplay_GetIsActivityLockedReason final
{
public:
	EFortActivityIsLockedReason                   ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortActivityTileDetailsDisplay_GetIsActivityLockedReason;

// Function DiscoveryBrowserUI.FortActivityTileDetailsDisplay.IsActivityFavorited
// 0x0001 (0x0001 - 0x0000)
struct FortActivityTileDetailsDisplay_IsActivityFavorited final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortActivityTileDetailsDisplay_IsActivityFavorited;

// Function DiscoveryBrowserUI.FortActivityTileDetailsDisplay.IsActivityLocked
// 0x0001 (0x0001 - 0x0000)
struct FortActivityTileDetailsDisplay_IsActivityLocked final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortActivityTileDetailsDisplay_IsActivityLocked;

// Function DiscoveryBrowserUI.FortActivityTileDetailsDisplay.IsModeSetActivity
// 0x0001 (0x0001 - 0x0000)
struct FortActivityTileDetailsDisplay_IsModeSetActivity final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortActivityTileDetailsDisplay_IsModeSetActivity;

// Function DiscoveryBrowserUI.FortActivityTileView.RespondToVisibilityChange
// 0x0001 (0x0001 - 0x0000)
struct FortActivityTileView_RespondToVisibilityChange final
{
public:
	bool                                          bIsVisible;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortActivityTileView_RespondToVisibilityChange;

// Function DiscoveryBrowserUI.FortActivityTileView.SetListenForMouseWheelInput
// 0x0001 (0x0001 - 0x0000)
struct FortActivityTileView_SetListenForMouseWheelInput final
{
public:
	bool                                          bListenForInput;                                   // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortActivityTileView_SetListenForMouseWheelInput;

// Function DiscoveryBrowserUI.FortDiscoverItemListView.GetInViewCount
// 0x0004 (0x0004 - 0x0000)
struct FortDiscoverItemListView_GetInViewCount final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortDiscoverItemListView_GetInViewCount;

}

