#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DiscoveryBrowserUI

#include "Basic.hpp"

#include "ModelViewViewModel_classes.hpp"
#include "UMG_classes.hpp"
#include "DiscoveryBrowserUI_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "CoreUObject_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CommonUI_classes.hpp"
#include "FortniteGame_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CommonUILegacy_classes.hpp"


namespace SDK
{

// Class DiscoveryBrowserUI.DiscoverSelectedActivityViewModel
// 0x0030 (0x0098 - 0x0068)
class UDiscoverSelectedActivityViewModel final : public UMVVMViewModelBase
{
public:
	bool                                          bLoading;                                          // 0x0068(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bHasPartyData;                                     // 0x0069(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsActiveInvite;                                   // 0x006A(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsPartyPrivate;                                   // 0x006B(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         CurrentPartySize;                                  // 0x006C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FText                                   RichPresenceText;                                  // 0x0070(0x0018)(BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	class UFortActivityViewModel*                 ActivityVM;                                        // 0x0088(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_90[0x8];                                       // 0x0090(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DiscoverSelectedActivityViewModel")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DiscoverSelectedActivityViewModel")
	}
	static class UDiscoverSelectedActivityViewModel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDiscoverSelectedActivityViewModel>();
	}
};
DUMPER7_ASSERTS_UDiscoverSelectedActivityViewModel;

// Class DiscoveryBrowserUI.FortActivityListItemWrapper
// 0x0010 (0x0038 - 0x0028)
class UFortActivityListItemWrapper final : public UObject
{
public:
	uint8                                         Pad_28[0x10];                                      // 0x0028(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortActivityListItemWrapper")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortActivityListItemWrapper")
	}
	static class UFortActivityListItemWrapper* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortActivityListItemWrapper>();
	}
};
DUMPER7_ASSERTS_UFortActivityListItemWrapper;

// Class DiscoveryBrowserUI.FortDiscoverHomespace
// 0x0000 (0x0420 - 0x0420)
class UFortDiscoverHomespace final : public UScrollableActivatableWidget
{
public:
	void OnPeekPushPercentMobileCVarChanged(float PeekPushPercent);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortDiscoverHomespace")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortDiscoverHomespace")
	}
	static class UFortDiscoverHomespace* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortDiscoverHomespace>();
	}
};
DUMPER7_ASSERTS_UFortDiscoverHomespace;

// Class DiscoveryBrowserUI.FortDiscoverPreviewManager
// 0x00C8 (0x00F0 - 0x0028)
class UFortDiscoverPreviewManager final : public UObject
{
public:
	uint8                                         Pad_28[0xC8];                                      // 0x0028(0x00C8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortDiscoverPreviewManager")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortDiscoverPreviewManager")
	}
	static class UFortDiscoverPreviewManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortDiscoverPreviewManager>();
	}
};
DUMPER7_ASSERTS_UFortDiscoverPreviewManager;

// Class DiscoveryBrowserUI.FortActivityBrowserColorSchemeAsset
// 0x0050 (0x0080 - 0x0030)
class UFortActivityBrowserColorSchemeAsset final : public UDataAsset
{
public:
	TMap<class UMaterialParameterCollection*, struct FColorSchemeParamaterValues> MaterialCollectionOverrides; // 0x0030(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortActivityBrowserColorSchemeAsset")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortActivityBrowserColorSchemeAsset")
	}
	static class UFortActivityBrowserColorSchemeAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortActivityBrowserColorSchemeAsset>();
	}
};
DUMPER7_ASSERTS_UFortActivityBrowserColorSchemeAsset;

// Class DiscoveryBrowserUI.FortActivityBrowserListView
// 0x0238 (0x04D0 - 0x0298)
class UFortActivityBrowserListView final : public UListViewBase
{
public:
	uint8                                         Pad_298[0xE8];                                     // 0x0298(0x00E8)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DirectionalNavigationTimeThreshold;                // 0x0380(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_384[0x4];                                      // 0x0384(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortHabaneroDisplayData*               HabaneroDisplayData;                               // 0x0388(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UFortActivityBrowserRow>    DiscoverItemRowClass;                              // 0x0390(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UFortActivityBrowserRow>    HomebarItemRowClass;                               // 0x0398(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TMap<class FName, TSubclassOf<class UFortActivityBrowserRow>> RowTypes;                          // 0x03A0(0x0050)(Edit, UObjectWrapper, NativeAccessSpecifierPrivate)
	bool                                          bUseTinyOffsetWhenScrollingIntoView;               // 0x03F0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3F1[0xDF];                                     // 0x03F1(0x00DF)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void NavigateToActivityInFirstRow(int32 ActivityItemIndex);

	void HandleVisibleEntriesChanged() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortActivityBrowserListView")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortActivityBrowserListView")
	}
	static class UFortActivityBrowserListView* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortActivityBrowserListView>();
	}
};
DUMPER7_ASSERTS_UFortActivityBrowserListView;

// Class DiscoveryBrowserUI.FortActivityBrowserTileBase
// 0x0060 (0x14F0 - 0x1490)
class UFortActivityBrowserTileBase : public UCommonButtonBase
{
public:
	uint8                                         Pad_1490[0x60];                                    // 0x1490(0x0060)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortActivityBrowserTileBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortActivityBrowserTileBase")
	}
	static class UFortActivityBrowserTileBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortActivityBrowserTileBase>();
	}
};
DUMPER7_ASSERTS_UFortActivityBrowserTileBase;

// Class DiscoveryBrowserUI.FortActivityBrowserPlayWithFriendsTile
// 0x00E0 (0x15D0 - 0x14F0)
class UFortActivityBrowserPlayWithFriendsTile final : public UFortActivityBrowserTileBase
{
public:
	int32                                         MaxNamesToDisplay;                                 // 0x14F0(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         MaxPortraitsToDisplay;                             // 0x14F4(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_14F8[0x10];                                    // 0x14F8(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortJoinablePartyPortraitsDisplay*     PartyMembersAvatarsDisplay;                        // 0x1508(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bIsActiveInvite;                                   // 0x1510(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1511[0x3];                                     // 0x1511(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CurrentPartySize;                                  // 0x1514(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bIsPartyPrivate;                                   // 0x1518(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1519[0x7];                                     // 0x1519(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGameActivity*                      CachedGameActivity;                                // 0x1520(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1528[0x10];                                    // 0x1528(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TWeakObjectPtr<class USocialUser>             CachedTargetSocialUser;                            // 0x1538(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FText                                   CurrentCTAButtonText;                              // 0x1540(0x0018)(Transient, NativeAccessSpecifierPrivate)
	class FText                                   JoinPartyText;                                     // 0x1558(0x0018)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	class FText                                   RequestToJoinText;                                 // 0x1570(0x0018)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                    JoinFriendInputAction_Touch;                       // 0x1588(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1598[0x38];                                    // 0x1598(0x0038)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BP_PartyInformationUpdated(bool bInIsTileSelected);
	class FText GetCTAButtonText();
	void HandleCTAButtonClicked();
	void OnGameActivityChanged(class UFortGameActivity* GameActivity);
	void OnTextureBeginLoading();
	void OnTextureLoadingComplete(const class UTexture* ThumbnailTexture);
	void OnTileActiveChanged(const bool bIsTileActive);
	void OnUpdateColumnSize(int32 NewColumnSize);
	void OpenSidebar();
	void UpdateCTAButtonInfo(const class FText& InteractionText, const bool bInteractionFound);
	void UpdateCTAButtonInteraction(const bool bIsInteractionEnabled);
	void UpdateIslandThumbnail(const class UTexture* ThumbnailTexture);
	void UpdateLastInteraction(const class FText& LastInteraction);
	void UpdateOtherPlayersSubText(const class FText& OtherPlayersSubText);
	void UpdatePartyMemberNames(const class FText& Names);
	void UpdateRichPresence(const class FText& RichPresence);
	void UpdateSingleFriendName(const class FText& SingleFriendName);

	const int32 GetMaxPartySize() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortActivityBrowserPlayWithFriendsTile")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortActivityBrowserPlayWithFriendsTile")
	}
	static class UFortActivityBrowserPlayWithFriendsTile* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortActivityBrowserPlayWithFriendsTile>();
	}
};
DUMPER7_ASSERTS_UFortActivityBrowserPlayWithFriendsTile;

// Class DiscoveryBrowserUI.FortActivityBrowserRow
// 0x00C0 (0x03A8 - 0x02E8)
class UFortActivityBrowserRow : public UCommonUserWidget
{
public:
	uint8                                         Pad_2E8[0xB0];                                     // 0x02E8(0x00B0)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonTextBlock*                       Text_CategoryName;                                 // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         MinimumVisibilityPercentageForRowActivation;       // 0x03A0(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3A4[0x4];                                      // 0x03A4(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnCategoryItemChanged(const bool bPlayAnimation);
	void OnRowIsActiveChanged(const bool bIsActive);
	void OnRowIsSelectedChanged(const bool bIsSelected);
	void OnRowMoveDown(const bool bMovingOffscreen);
	void OnRowMoveUp(const bool bMovingOffscreen);
	void OnRowPeekStateChanged(const bool bIsInPeekState);

	bool GetIsActive() const;
	bool GetIsInPeekState() const;
	bool GetIsSelected() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortActivityBrowserRow")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortActivityBrowserRow")
	}
	static class UFortActivityBrowserRow* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortActivityBrowserRow>();
	}
};
DUMPER7_ASSERTS_UFortActivityBrowserRow;

// Class DiscoveryBrowserUI.FortActivityBrowserRowList
// 0x0020 (0x03C8 - 0x03A8)
class UFortActivityBrowserRowList final : public UFortActivityBrowserRow
{
public:
	class UFortActivityListView*                  ListView_Activities;                               // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_PageLeft;                                   // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_PageRight;                                  // 0x03B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3C0[0x8];                                      // 0x03C0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnQueryStatusChanged(bool bIsActive);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortActivityBrowserRowList")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortActivityBrowserRowList")
	}
	static class UFortActivityBrowserRowList* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortActivityBrowserRowList>();
	}
};
DUMPER7_ASSERTS_UFortActivityBrowserRowList;

// Class DiscoveryBrowserUI.FortActivityBrowserView
// 0x00B8 (0x0508 - 0x0450)
class UFortActivityBrowserView : public UFortActivityView
{
public:
	bool                                          bShowCustomMatchmakingModalButton;                 // 0x0450(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bShowSpectateMatchModalButton;                     // 0x0451(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bShowMobileGameDetailsButton;                      // 0x0452(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bShowMobileAcceptButton;                           // 0x0453(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bShowBackToTopButton;                              // 0x0454(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_455[0x3];                                      // 0x0455(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   DiscoverySurfaceName;                              // 0x0458(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_45C[0xAC];                                     // 0x045C(0x00AC)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnSurfaceDataDirty();

	EFortInvalidActivityReason GetInvalidActivityReason() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortActivityBrowserView")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortActivityBrowserView")
	}
	static class UFortActivityBrowserView* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortActivityBrowserView>();
	}
};
DUMPER7_ASSERTS_UFortActivityBrowserView;

// Class DiscoveryBrowserUI.FortActivityBrowserRowView
// 0x01B8 (0x06C0 - 0x0508)
class UFortActivityBrowserRowView : public UFortActivityBrowserView
{
public:
	uint8                                         Pad_508[0x8];                                      // 0x0508(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MouseWheelScrollTimeThreshold;                     // 0x0510(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_514[0x4];                                      // 0x0514(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortActivityBrowserListView*           BrowserList_Activities;                            // 0x0518(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_520[0x60];                                     // 0x0520(0x0060)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   TabNameID;                                         // 0x0580(0x0004)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_584[0xC];                                      // 0x0584(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortTabButtonLabelInfo                TabButtonLabelInfo;                                // 0x0590(0x0110)(Edit, DisableEditOnTemplate, NativeAccessSpecifierPrivate)
	class UFortSwipePanel*                        SwipePanel_Navigation;                             // 0x06A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_6A8[0x18];                                     // 0x06A8(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleVerticalSwipe(const int32 Direction);
	void OnActivityUpdated();
	void OnListViewScrolled(float ItemOffset, float DistanceRemaining);
	void OnQueryActivitiesFinished();
	void OnRowChanged(const int32 NewCategoryIndex);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortActivityBrowserRowView")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortActivityBrowserRowView")
	}
	static class UFortActivityBrowserRowView* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortActivityBrowserRowView>();
	}
};
DUMPER7_ASSERTS_UFortActivityBrowserRowView;

// Class DiscoveryBrowserUI.FortActivityBrowserTile
// 0x0060 (0x1550 - 0x14F0)
class UFortActivityBrowserTile final : public UFortActivityBrowserTileBase
{
public:
	class UFortActivityTileDetailsDisplay*        Display_TileDetails;                               // 0x14F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_14F8[0x58];                                    // 0x14F8(0x0058)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleActivitySelected();
	void HandleDisplayTileDetailsHoldTriggered(class UCommonButtonBase* Button);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortActivityBrowserTile")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortActivityBrowserTile")
	}
	static class UFortActivityBrowserTile* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortActivityBrowserTile>();
	}
};
DUMPER7_ASSERTS_UFortActivityBrowserTile;

// Class DiscoveryBrowserUI.FortActivityPlayerBrowserView
// 0x0158 (0x0660 - 0x0508)
class UFortActivityPlayerBrowserView : public UFortActivityBrowserView
{
public:
	uint8                                         Pad_508[0x8];                                      // 0x0508(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGameActivityProvider*              ActivityProvider;                                  // 0x0510(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortActivityTileView*                  TileView_PlayerActivities;                         // 0x0518(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   TabNameID;                                         // 0x0520(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_524[0xC];                                      // 0x0524(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortTabButtonLabelInfo                TabButtonLabelInfo;                                // 0x0530(0x0110)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	EFortCreativeDiscoveryPlayHistoryType         PlayHistoryProviderType;                           // 0x0640(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_641[0x1F];                                     // 0x0641(0x001F)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BP_OnTileViewUpdated();
	void OnPlayViewIntro();
	void OnQueryActivitiesComplete();
	void OnQueryActivitiesStarted();
	void PlayViewIntro();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortActivityPlayerBrowserView")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortActivityPlayerBrowserView")
	}
	static class UFortActivityPlayerBrowserView* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortActivityPlayerBrowserView>();
	}
};
DUMPER7_ASSERTS_UFortActivityPlayerBrowserView;

// Class DiscoveryBrowserUI.FortActivityCategoryPageView
// 0x0040 (0x06A0 - 0x0660)
class UFortActivityCategoryPageView : public UFortActivityPlayerBrowserView
{
public:
	uint8                                         Pad_660[0x8];                                      // 0x0660(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonRichTextBlock*                   Text_CategoryTitle;                                // 0x0668(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                      Button_BackToTop;                                  // 0x0670(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                      Button_CloseTouch;                                 // 0x0678(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                      Button_Back;                                       // 0x0680(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                      Button_MobileAccept;                               // 0x0688(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                      Button_MobileShowGameDetails;                      // 0x0690(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_698[0x8];                                      // 0x0698(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortActivityCategoryPageView")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortActivityCategoryPageView")
	}
	static class UFortActivityCategoryPageView* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortActivityCategoryPageView>();
	}
};
DUMPER7_ASSERTS_UFortActivityCategoryPageView;

// Class DiscoveryBrowserUI.FortActivityTileViewTileBase
// 0x0090 (0x1520 - 0x1490)
class UFortActivityTileViewTileBase : public UCommonButtonBase
{
public:
	uint8                                         Pad_1490[0x90];                                    // 0x1490(0x0090)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortActivityTileViewTileBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortActivityTileViewTileBase")
	}
	static class UFortActivityTileViewTileBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortActivityTileViewTileBase>();
	}
};
DUMPER7_ASSERTS_UFortActivityTileViewTileBase;

// Class DiscoveryBrowserUI.FortActivityCategoryTile
// 0x0010 (0x1530 - 0x1520)
class UFortActivityCategoryTile final : public UFortActivityTileViewTileBase
{
public:
	class UCommonTextBlock*                       Text_CategoryTitle;                                // 0x1520(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1528[0x8];                                     // 0x1528(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnTileActiveSet(const bool bIsTileActive);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortActivityCategoryTile")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortActivityCategoryTile")
	}
	static class UFortActivityCategoryTile* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortActivityCategoryTile>();
	}
};
DUMPER7_ASSERTS_UFortActivityCategoryTile;

// Class DiscoveryBrowserUI.FortActivityCategoryTilePanel
// 0x0070 (0x0358 - 0x02E8)
class UFortActivityCategoryTilePanel final : public UCommonUserWidget
{
public:
	class UFortActivityTileView*                  TileView_Categories;                               // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_Title;                                        // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         TileViewQueryThreshold;                            // 0x02F8(0x0004)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2FC[0x4];                                      // 0x02FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortCreativeDiscoveryActivityProvider* CachedActivityProvider;                            // 0x0300(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_308[0x50];                                     // 0x0308(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortActivityCategoryTilePanel")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortActivityCategoryTilePanel")
	}
	static class UFortActivityCategoryTilePanel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortActivityCategoryTilePanel>();
	}
};
DUMPER7_ASSERTS_UFortActivityCategoryTilePanel;

// Class DiscoveryBrowserUI.FortActivityCategoryView
// 0x0148 (0x0650 - 0x0508)
class UFortActivityCategoryView final : public UFortActivityBrowserView
{
public:
	uint8                                         Pad_508[0x8];                                      // 0x0508(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   TabNameID;                                         // 0x0510(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_514[0xC];                                      // 0x0514(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortTabButtonLabelInfo                TabButtonLabelInfo;                                // 0x0520(0x0110)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	class UFortActivityCategoryTilePanel*         TilePanel_Featured;                                // 0x0630(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortActivityCategoryTilePanel*         TilePanel_All;                                     // 0x0638(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortActivityCategoryTilePanel*         CurrentSelectedPanel;                              // 0x0640(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_648[0x8];                                      // 0x0648(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class UFortActivityCategoryTilePanel* NavigateFromPanel(EUINavigation Direction, class UFortActivityCategoryTilePanel* NavigatingPanel);
	void OnCategoryTilePanelSelected(const class UFortActivityCategoryTilePanel* SelectedPanel);
	void OnSurfaceDataReady();

	const class UFortActivityCategoryTilePanel* GetCurrentSelectedPanel() const;
	class UFortActivityCategoryTilePanel* GetTopMostVisiblePanel() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortActivityCategoryView")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortActivityCategoryView")
	}
	static class UFortActivityCategoryView* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortActivityCategoryView>();
	}
};
DUMPER7_ASSERTS_UFortActivityCategoryView;

// Class DiscoveryBrowserUI.FortActivityCreatorPageView
// 0x0080 (0x0720 - 0x06A0)
class UFortActivityCreatorPageView final : public UFortActivityCategoryPageView
{
public:
	uint8                                         Pad_6A0[0x28];                                     // 0x06A0(0x0028)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         AmountOfCreatorLinkEntriesQueried;                 // 0x06C8(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         ProcessedCreatorLinkEntries;                       // 0x06CC(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         AmountOfEntriesQueried;                            // 0x06D0(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_6D4[0x4C];                                     // 0x06D4(0x004C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnCreatorActivitiesQueryFinished();
	void OnNoContentFoundForCreator();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortActivityCreatorPageView")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortActivityCreatorPageView")
	}
	static class UFortActivityCreatorPageView* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortActivityCreatorPageView>();
	}
};
DUMPER7_ASSERTS_UFortActivityCreatorPageView;

// Class DiscoveryBrowserUI.FortActivityDiscoverView
// 0x00A0 (0x0760 - 0x06C0)
class UFortActivityDiscoverView final : public UFortActivityBrowserRowView
{
public:
	bool                                          bPlayDetailsAnimationOnScreenOpen;                 // 0x06C0(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_6C1[0x3];                                      // 0x06C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DetailsDisplayUpdateDelay;                         // 0x06C4(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UFortActivatableMovieWidget> MovieWidgetClass;                                 // 0x06C8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortActivityDetailsDisplay*            DetailsDisplay_SelectedActivity;                   // 0x06D0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortActivityDetailsDisplay*            DetailsDisplay_PromotedActivity;                   // 0x06D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPanelWidget*                           Panel_VideoSlot;                                   // 0x06E0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPanelWidget*                           Panel_PromotedVideoSlot;                           // 0x06E8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortActivatableMovieWidget*            ActivityMovieWidget;                               // 0x06F0(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortActivatableMovieWidget*            PromotedActivityMovieWidget;                       // 0x06F8(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_700[0x48];                                     // 0x0700(0x0048)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetAnimation*                       BoundKeyArtOutroAnimation;                         // 0x0748(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_750[0x10];                                     // 0x0750(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void CheckUpdateDetailsDelay();
	void HandleMovieWidgetMediaPreEndEvent();
	void HandleMovieWidgetMediaStarted();
	void OnMoviePlayingChanged(const bool bIsPlaying);
	void OnMoviePreEndEvent();
	void OnPlayKeyArtIntro();
	void OnPlayKeyArtOutro();
	void OnPreviewImageChanged(const bool bIsLoading, const class UTexture* Texture);
	void OnUpdateDetailsDisplay();

	const class UTexture* GetCurrentTexture() const;
	class UWidgetAnimation* GetKeyArtOutroAnimation() const;
	class UFortActivatableMovieWidget* GetMovieWidget() const;
	class UFortActivatableMovieWidget* GetPromotedMovieWidget() const;
	bool IsImageLoading() const;
	bool IsInOutroState() const;
	bool IsShowingPromotedContent() const;
	bool IsShowingSeasonalContent() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortActivityDiscoverView")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortActivityDiscoverView")
	}
	static class UFortActivityDiscoverView* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortActivityDiscoverView>();
	}
};
DUMPER7_ASSERTS_UFortActivityDiscoverView;

// Class DiscoveryBrowserUI.FortActivityDiscoverViewV2
// 0x0150 (0x0810 - 0x06C0)
class UFortActivityDiscoverViewV2 final : public UFortActivityBrowserRowView
{
public:
	TMulticastInlineDelegate<void()>              OnActivityRequested;                               // 0x06C0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UFortDiscoverPreviewManager*            DiscoverPreviewManager;                            // 0x06D0(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_6D8[0x28];                                     // 0x06D8(0x0028)(Fixing Size After Last Property [ Dumper-7 ])
	class UDiscoverSelectedActivityViewModel*     SelectedActivityVM;                                // 0x0700(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftClassPtr<class UClass>                   SoftCustomMatchmakingModalClass;                   // 0x0708(0x0020)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftClassPtr<class UClass>                   SoftSpectateMatchModalClass;                       // 0x0728(0x0020)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_748[0x8];                                      // 0x0748(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableRowHandle                    BackToTopInputAction;                              // 0x0750(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_760[0x8];                                      // 0x0760(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableRowHandle                    CustomKeyInputAction;                              // 0x0768(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_778[0x8];                                      // 0x0778(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableRowHandle                    ShowSpectateMatchModalInputAction;                 // 0x0780(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_790[0x8];                                      // 0x0790(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableRowHandle                    JoinAsSpectatorInputAction;                        // 0x0798(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_7A8[0x8];                                      // 0x07A8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableRowHandle                    JoinAsPlayerInputAction;                           // 0x07B0(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_7C0[0x8];                                      // 0x07C0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableRowHandle                    SelectActivityInputAction_Touch;                   // 0x07C8(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_7D8[0x38];                                     // 0x07D8(0x0038)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void DeactivationTransitionCompleted();
	void FireDiscoverExitedAnalyticEvent();
	void StartDiscoverAnalyticSession();
	void UpdateMiscActionBindingVisibility(bool bVisible);

	bool IsShowingPromotedContent() const;
	bool IsShowingSeasonalContent() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortActivityDiscoverViewV2")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortActivityDiscoverViewV2")
	}
	static class UFortActivityDiscoverViewV2* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortActivityDiscoverViewV2>();
	}
};
DUMPER7_ASSERTS_UFortActivityDiscoverViewV2;

// Class DiscoveryBrowserUI.FortActivityListView
// 0x0190 (0x0428 - 0x0298)
class UFortActivityListView final : public UListViewBase
{
public:
	uint8                                         Pad_298[0xE8];                                     // 0x0298(0x00E8)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DirectionalNavigationTimeThreshold;                // 0x0380(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EOrientation                                  orientation;                                       // 0x0384(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_385[0x3];                                      // 0x0385(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         EntrySpacing;                                      // 0x0388(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bCircularNavigationEnabled;                        // 0x038C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_38D[0x3];                                      // 0x038D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<EActivityBrowserTileStyle, TSubclassOf<class UFortActivityBrowserTileBase>> TileTypes;      // 0x0390(0x0050)(Edit, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3E0[0x48];                                     // 0x03E0(0x0048)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AddTileType(EActivityBrowserTileStyle style, TSubclassOf<class UFortActivityBrowserTileBase> WidgetClass);

	int32 GetInViewCount() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortActivityListView")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortActivityListView")
	}
	static class UFortActivityListView* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortActivityListView>();
	}
};
DUMPER7_ASSERTS_UFortActivityListView;

// Class DiscoveryBrowserUI.FortActivityLobbyTile
// 0x0080 (0x1560 - 0x14E0)
class UFortActivityLobbyTile final : public UCommonButtonLegacy
{
public:
	class UCommonTextBlock*                       Text_ActivityName;                                 // 0x14E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortActivityBrowserTag*                ActivityBrowserTag_EpicOriginal;                   // 0x14E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UFortActivityModeSetSelectionModalBase> ActivityModeSetSelectionModalClass;    // 0x14F0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortGameActivityProvider*              ActivityProvider;                                  // 0x14F8(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1500[0x60];                                    // 0x1500(0x0060)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnDetailsUpdated();
	void OnPreviewImageChanged(const bool bIsLoading, const class UTexture* Texture);
	void ShowModeSetSelectionModal();

	class FText GetChildActivityDisplayName() const;
	bool IsActivityEpicCreated() const;
	bool ShouldShowSubmodeSelectButton() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortActivityLobbyTile")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortActivityLobbyTile")
	}
	static class UFortActivityLobbyTile* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortActivityLobbyTile>();
	}
};
DUMPER7_ASSERTS_UFortActivityLobbyTile;

// Class DiscoveryBrowserUI.FortActivityModeSetSelectionModal
// 0x0068 (0x0480 - 0x0418)
class UFortActivityModeSetSelectionModal final : public UFortActivityModeSetSelectionModalBase
{
public:
	class UCommonTextBlock*                       Text_ActivityName;                                 // 0x0418(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_420[0x28];                                     // 0x0420(0x0028)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      Button_Back;                                       // 0x0448(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_BackBoard;                                  // 0x0450(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortActivityModeSetSelection*          List_SubModeList;                                  // 0x0458(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortActivitySquadFillButton*           Button_ActivitySquadFill;                          // 0x0460(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortActivityPrivacyButton*             Button_ActivityPrivacy;                            // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortActivityHabaneroButton*            Button_Activity_Habanero;                          // 0x0470(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_478[0x8];                                      // 0x0478(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnActivityChanged(const class UFortGameActivity* GameActivity, const class FString& StartingSelectedMnemonic);
	void OnPreviewImageChanged(const bool bIsLoading, const class UTexture* Texture);
	void OnSubModeSelected();
	void OnSubModeSelectionChanged();
	void SaveSelectionAndClose();
	void SetHabaneroValues(bool bHabaneroEnabled, bool bHabaneroExists);
	void SetIsRankedSwitchAvailable(const bool bIsRankedSwitchAvailable);

	bool IsCreativeModeSetActivity() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortActivityModeSetSelectionModal")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortActivityModeSetSelectionModal")
	}
	static class UFortActivityModeSetSelectionModal* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortActivityModeSetSelectionModal>();
	}
};
DUMPER7_ASSERTS_UFortActivityModeSetSelectionModal;

// Class DiscoveryBrowserUI.FortActivityPlayerBrowserTile
// 0x0060 (0x1580 - 0x1520)
class UFortActivityPlayerBrowserTile final : public UFortActivityTileViewTileBase
{
public:
	class UFortActivityTileDetailsDisplay*        Display_TileDetails;                               // 0x1520(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_LastPlayedDate;                               // 0x1528(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1530[0x50];                                    // 0x1530(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleActivitySelected();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortActivityPlayerBrowserTile")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortActivityPlayerBrowserTile")
	}
	static class UFortActivityPlayerBrowserTile* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortActivityPlayerBrowserTile>();
	}
};
DUMPER7_ASSERTS_UFortActivityPlayerBrowserTile;

// Class DiscoveryBrowserUI.FortActivitySelector
// 0x00E8 (0x0110 - 0x0028)
class UFortActivitySelector final : public UObject
{
public:
	uint8                                         Pad_28[0x10];                                      // 0x0028(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            SelectedContextWidget;                             // 0x0038(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_40[0x20];                                      // 0x0040(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortActivityCreatorPageView*           CachedCreatorPageView;                             // 0x0060(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_68[0x10];                                      // 0x0068(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FName, class UFortActivityBrowserColorSchemeAsset*> ColorSchemes;                     // 0x0078(0x0050)(Edit, DisableEditOnInstance, UObjectWrapper, NativeAccessSpecifierPrivate)
	class UFortActivityBrowserColorSchemeAsset*   CurrentColorScheme;                                // 0x00C8(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_D0[0x40];                                      // 0x00D0(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ConfirmSelectedActivity();
	void HandleShowActivityDetails();
	void OnEnableColorScheme(const bool bIsColorSchemeActive);
	void OnSwapColorScheme(const bool bInIsUsingAlternateColorScheme);
	void OpenCreatorPage();
	void ToggleFavorite();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortActivitySelector")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortActivitySelector")
	}
	static class UFortActivitySelector* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortActivitySelector>();
	}
};
DUMPER7_ASSERTS_UFortActivitySelector;

// Class DiscoveryBrowserUI.FortActivityTileDetailsDisplay
// 0x0180 (0x1710 - 0x1590)
class UFortActivityTileDetailsDisplay final : public UUIKitHoldableModularButton
{
public:
	TMulticastInlineDelegate<void()>              OnActivitySelectedDelegate;                        // 0x1588(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	TMulticastInlineDelegate<void()>              OnActivityUnSelectedDelegate;                      // 0x1598(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	bool                                          bShowDetailsButton;                                // 0x15A8(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_15A9[0x3];                                     // 0x15A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         DefaultColumnSize;                                 // 0x15AC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonTextBlock*                       Text_ActivityName;                                 // 0x15B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_PlayerCount;                                  // 0x15B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_Favorite;                                   // 0x15C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_Details;                                    // 0x15C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortActivityBrowserTag*                ActivityBrowserTag_EpicOriginal;                   // 0x15D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
