#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DSA_BR_Ch5_Parent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass DSA_BR_Ch5_Parent.DSA_BR_Ch5_Parent_C
// 0x0120 (0x0790 - 0x0670)
class ADSA_BR_Ch5_Parent_C : public AFortDaySequenceActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0670(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UPostProcessComponent*                  PostProcess;                                       // 0x0678(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        PostProcessMain;                                   // 0x0680(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPostProcessComponent*                  One20fpsMotionBlurPostProcess;                     // 0x0688(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPostProcessComponent*                  ExposureLowEndPostProcess;                         // 0x0690(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SkyCubeGroundMesh;                                 // 0x0698(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPostProcessComponent*                  BloomConvoutionHighEndPostProcess;                 // 0x06A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        PostProcessScalability;                            // 0x06A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UMaterialInterface>      VolumetricCloudMaterial;                           // 0x06B0(0x0020)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              Convolution_Kernel;                                // 0x06D0(0x0020)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash)
	struct FVector                                CameraPosition;                                    // 0x06F0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UMaterialInterface>      HorizonCloudMaterial;                              // 0x0708(0x0020)(Edit, BlueprintVisible, HasGetValueTypeHash)
	int32                                         InvalidateDirectional;                             // 0x0728(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_72C[0x4];                                      // 0x072C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UStaticMesh>             Horizon2DCloudMesh;                                // 0x0730(0x0020)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class UMaterialInterface>      VolumetricCloudMaterialAdvanced;                   // 0x0750(0x0020)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class UMaterialInterface>      VolumetricCloudMaterialApplied;                    // 0x0770(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void UserConstructionScript();
	void UpdateScalabilitySequences();
	void UpdateScalability();
	void Update_Component_Visibility();
	void ToggleStormMeshVisibility(bool Visibility);
	void SetVolumetricCloudMaterial();
	void SetStormPhaseCount(int32 StormPhaseCount);
	void SetStormPhase(double StormPhase);
	void SetShadowMPC();
	void SetReflectionMPC();
	void SetMotionBlurAmount();
	void SetLowEndExposure();
	void SetGlobalIlluminationMPC();
	void SetCustomBloom();
	void SetCloudsCustomTime(double customTime);
	void RotateTimeOfDay(double Angle);
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void ReceiveBeginPlay();
	void OnTimeOfDayManagerVisibilitySet(bool bVisible);
	void OnShadowQualityChanged();
	void OnReflectionQualityChanged();
	void OnPostProcessQualityChanged();
	void OnLoaded_8D1256FF465F601B332439A46C8FEFB1(class UObject* Loaded);
	void OnLoaded_1DB8FE3943333C5CD99D63B0C6633F8C(class UObject* Loaded);
	void OnGlobalIlluminationQualityChanged();
	void OnEffectsQualityChanged();
	void OnDataDrivenCVarDelegate(const class FString& CVarName);
	void IsExposureCvar(const class FString& CVar, bool* IsExposureCvar_0);
	void ExecuteUbergraph_DSA_BR_Ch5_Parent(int32 EntryPoint);
	void EventSetVolCloudMaterial();
	void EventSetCustomBloom();
	void Compute_Cube_Map_Blend(double Val);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("DSA_BR_Ch5_Parent_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DSA_BR_Ch5_Parent_C")
	}
	static class ADSA_BR_Ch5_Parent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADSA_BR_Ch5_Parent_C>();
	}
};
DUMPER7_ASSERTS_ADSA_BR_Ch5_Parent_C;

}

