#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DSCT_Erebus

#include "Basic.hpp"


namespace SDK::Params
{

// Function DSCT_Erebus.DSCT_Erebus_C.GetConditionName
// 0x0010 (0x0010 - 0x0000)
struct DSCT_Erebus_C_GetConditionName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_DSCT_Erebus_C_GetConditionName;

// Function DSCT_Erebus.DSCT_Erebus_C.Evaluate
// 0x0028 (0x0028 - 0x0000)
struct DSCT_Erebus_C_Evaluate final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsNintendoSwitchOrNintendoSwitchPreview_ReturnValue; // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_BoolToString_ReturnValue;            // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_DSCT_Erebus_C_Evaluate;

}

