#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ElectraDataChannelRuntime

#include "Basic.hpp"


namespace SDK::Params
{

// Function ElectraDataChannelRuntime.ElectraDataChannelPlayer.PlayFromFile
// 0x0010 (0x0010 - 0x0000)
struct ElectraDataChannelPlayer_PlayFromFile final
{
public:
	class FString                                 InFilename;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ElectraDataChannelPlayer_PlayFromFile;

// Function ElectraDataChannelRuntime.ElectraDataChannelPlayer.PlayFromMediaPlayer
// 0x0008 (0x0008 - 0x0000)
struct ElectraDataChannelPlayer_PlayFromMediaPlayer final
{
public:
	class UMediaPlayer*                           InMediaPlayer;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ElectraDataChannelPlayer_PlayFromMediaPlayer;

// Function ElectraDataChannelRuntime.ElectraDataChannelPlayer.PlayFromStateStreamServer
// 0x0010 (0x0010 - 0x0000)
struct ElectraDataChannelPlayer_PlayFromStateStreamServer final
{
public:
	class FString                                 InStatePlaylistURL;                                // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ElectraDataChannelPlayer_PlayFromStateStreamServer;

// Function ElectraDataChannelRuntime.ElectraDataChannelPlayer.UseTimeFromMediaPlayer
// 0x0008 (0x0008 - 0x0000)
struct ElectraDataChannelPlayer_UseTimeFromMediaPlayer final
{
public:
	class UMediaPlayer*                           InMediaPlayer;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ElectraDataChannelPlayer_UseTimeFromMediaPlayer;

// Function ElectraDataChannelRuntime.ElectraDataChannelRecorder.RecordToFile
// 0x0010 (0x0010 - 0x0000)
struct ElectraDataChannelRecorder_RecordToFile final
{
public:
	class FString                                 InFilename;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ElectraDataChannelRecorder_RecordToFile;

// Function ElectraDataChannelRuntime.ElectraDataChannelRecorder.UseTimeFromMediaPlayer
// 0x0008 (0x0008 - 0x0000)
struct ElectraDataChannelRecorder_UseTimeFromMediaPlayer final
{
public:
	class UMediaPlayer*                           InMediaPlayer;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ElectraDataChannelRecorder_UseTimeFromMediaPlayer;

// Function ElectraDataChannelRuntime.ElectraDataChannelTarget.SetTargetAlias
// 0x0010 (0x0010 - 0x0000)
struct ElectraDataChannelTarget_SetTargetAlias final
{
public:
	class FString                                 InAlias;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ElectraDataChannelTarget_SetTargetAlias;

// Function ElectraDataChannelRuntime.ElectraDataChannelTarget.GetTargetAlias
// 0x0010 (0x0010 - 0x0000)
struct ElectraDataChannelTarget_GetTargetAlias final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ElectraDataChannelTarget_GetTargetAlias;

}

