#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EntityTestSuite

#include "Basic.hpp"

#include "EntityTestSuite_structs.hpp"


namespace SDK::Params
{

// Function EntityTestSuite.EntityTestSuite_init_test_component._L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcore__entity__component_N_RInitialize
// 0x0001 (0x0001 - 0x0000)
struct EntityTestSuite_init_test_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcore__entity__component_N_RInitialize final
{
public:
	struct EntityTestSuite::Ftuple_L_R            __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_EntityTestSuite_init_test_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcore__entity__component_N_RInitialize;

// Function EntityTestSuite.EntityTestSuite_lambda_test_component._L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcore__entity__component_N_RAddedToWorld
// 0x0001 (0x0001 - 0x0000)
struct EntityTestSuite_lambda_test_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcore__entity__component_N_RAddedToWorld final
{
public:
	struct EntityTestSuite::Ftuple_L_R            __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_EntityTestSuite_lambda_test_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcore__entity__component_N_RAddedToWorld;

// Function EntityTestSuite.EntityTestSuite_lambda_test_component._L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcore__entity__component_N_RBeginPlay
// 0x0001 (0x0001 - 0x0000)
struct EntityTestSuite_lambda_test_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcore__entity__component_N_RBeginPlay final
{
public:
	struct EntityTestSuite::Ftuple_L_R            __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_EntityTestSuite_lambda_test_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcore__entity__component_N_RBeginPlay;

// Function EntityTestSuite.EntityTestSuite_lambda_test_component._L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcore__entity__component_N_REndPlay
// 0x0001 (0x0001 - 0x0000)
struct EntityTestSuite_lambda_test_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcore__entity__component_N_REndPlay final
{
public:
	struct EntityTestSuite::Ftuple_L_R            __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_EntityTestSuite_lambda_test_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcore__entity__component_N_REndPlay;

// Function EntityTestSuite.EntityTestSuite_lambda_test_component._L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcore__entity__component_N_RInitialize
// 0x0001 (0x0001 - 0x0000)
struct EntityTestSuite_lambda_test_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcore__entity__component_N_RInitialize final
{
public:
	struct EntityTestSuite::Ftuple_L_R            __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_EntityTestSuite_lambda_test_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcore__entity__component_N_RInitialize;

// Function EntityTestSuite.EntityTestSuite_lambda_test_component._L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcore__entity__component_N_RRemovingFromWorld
// 0x0001 (0x0001 - 0x0000)
struct EntityTestSuite_lambda_test_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcore__entity__component_N_RRemovingFromWorld final
{
public:
	struct EntityTestSuite::Ftuple_L_R            __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_EntityTestSuite_lambda_test_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcore__entity__component_N_RRemovingFromWorld;

// Function EntityTestSuite.EntityTestSuite_lambda_test_component._L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcore__entity__component_N_RUninitialize
// 0x0001 (0x0001 - 0x0000)
struct EntityTestSuite_lambda_test_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcore__entity__component_N_RUninitialize final
{
public:
	struct EntityTestSuite::Ftuple_L_R            __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_EntityTestSuite_lambda_test_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcore__entity__component_N_RUninitialize;

}

