#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Entity_0

#include "Basic.hpp"

#include "VerseNative_structs.hpp"
#include "Entity_0_structs.hpp"
#include "EpicGamesTemporary_structs.hpp"


namespace SDK::Params
{

// Function Entity.Entity_core_entity_initializer._L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcore__entity__initializer_N_RInitializeDependency_L_Ncore__entity_M_NComponentType_M_Nmode_20where_20ComponentType_R
// 0x0020 (0x0020 - 0x0000)
struct Entity_core_entity_initializer__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcore__entity__initializer_N_RInitializeDependency_L_Ncore__entity_M_NComponentType_M_Nmode_20where_20ComponentType_R final
{
public:
	struct Ftuple_Lcore__entity_Mcore__entity__component_Mmode_R __verse_0xB2CDDD72_Argument;        // 0x0000(0x0018)(Parm, HasGetValueTypeHash)
	TOptional<class UEntity_core_entity_component*, true> RetVal;                                    // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Entity_core_entity_initializer__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcore__entity__initializer_N_RInitializeDependency_L_Ncore__entity_M_NComponentType_M_Nmode_20where_20ComponentType_R;

// Function Entity.Entity_core_entity.$InitCDO
// 0x0090 (0x0090 - 0x0000)
struct Entity_core_entity__InitCDO final
{
public:
	TArray<class UEntity_core_entity*>            _ExprResult_0;                                     // 0x0000(0x0010)(ContainsInstancedReference)
	TArray<EVerseFalse>                           __verse_0xFFC68BC5_Array_1;                        // 0x0010(0x0010)(ContainsInstancedReference)
	TArray<class UEntity_core_entity*>            _ForResult_1;                                      // 0x0020(0x0010)(ContainsInstancedReference)
	int64                                         _ForIndex_2;                                       // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         _ForLength_3;                                      // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseFalse                                   __verse_0xFB88B569_Item_3;                         // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_4 : 1;                                 // 0x0041(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_42[0x6];                                       // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UEntity_core_entity*>            _ExprResult_5;                                     // 0x0048(0x0010)(ContainsInstancedReference)
	TArray<EVerseFalse>                           __verse_0xFFC68BC5_Array_5;                        // 0x0058(0x0010)(ContainsInstancedReference)
	TArray<class UEntity_core_entity*>            _ForResult_6;                                      // 0x0068(0x0010)(ContainsInstancedReference)
	int64                                         _ForIndex_7;                                       // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         _ForLength_8;                                      // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseFalse                                   __verse_0xFB88B569_Item_7;                         // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_9 : 1;                                 // 0x0089(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
};
DUMPER7_ASSERTS_Entity_core_entity__InitCDO;

// Function Entity.Entity_core_entity._L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcore__entity_N_RAddComponent_L_Ncore__entity__component_R
// 0x0010 (0x0010 - 0x0000)
struct Entity_core_entity__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcore__entity_N_RAddComponent_L_Ncore__entity__component_R final
{
public:
	class UEntity_core_entity_component*          __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<EVerseTrue>                         RetVal;                                            // 0x0008(0x0002)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Entity_core_entity__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcore__entity_N_RAddComponent_L_Ncore__entity__component_R;

// Function Entity.Entity_core_entity._L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcore__entity_N_RAddEntity_L_Ncore__entity_R
// 0x0010 (0x0010 - 0x0000)
struct Entity_core_entity__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcore__entity_N_RAddEntity_L_Ncore__entity_R final
{
public:
	class UEntity_core_entity*                    __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<EVerseTrue>                         RetVal;                                            // 0x0008(0x0002)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Entity_core_entity__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcore__entity_N_RAddEntity_L_Ncore__entity_R;

// Function Entity.Entity_core_entity._L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcore__entity_N_RCreateComponent_L_NComponentType_20where_20ComponentType_R
// 0x0010 (0x0010 - 0x0000)
struct Entity_core_entity__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcore__entity_N_RCreateComponent_L_NComponentType_20where_20ComponentType_R final
{
public:
	class UClass*                                 __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UEntity_core_entity_component*, true> RetVal;                                    // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Entity_core_entity__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcore__entity_N_RCreateComponent_L_NComponentType_20where_20ComponentType_R;

// Function Entity.Entity_core_entity._L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcore__entity_N_RCreateEntity_L_NEntityType_20where_20EntityType_R
// 0x0010 (0x0010 - 0x0000)
struct Entity_core_entity__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcore__entity_N_RCreateEntity_L_NEntityType_20where_20EntityType_R final
{
public:
	class UClass*                                 __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEntity_core_entity*                    RetVal;                                            // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Entity_core_entity__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcore__entity_N_RCreateEntity_L_NEntityType_20where_20EntityType_R;

// Function Entity.Entity_core_entity._L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcore__entity_N_RDispose
// 0x0001 (0x0001 - 0x0000)
struct Entity_core_entity__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcore__entity_N_RDispose final
{
public:
	struct Entity_0::Ftuple_L_R                   __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Entity_core_entity__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcore__entity_N_RDispose;

// Function Entity.Entity_core_entity._L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcore__entity_N_RGetComponentByType_L_NComponentType_20where_20ComponentType_R
// 0x0010 (0x0010 - 0x0000)
struct Entity_core_entity__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcore__entity_N_RGetComponentByType_L_NComponentType_20where_20ComponentType_R final
{
public:
	class UClass*                                 __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UEntity_core_entity_component*, true> RetVal;                                    // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Entity_core_entity__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcore__entity_N_RGetComponentByType_L_NComponentType_20where_20ComponentType_R;

// Function Entity.Entity_core_entity._L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcore__entity_N_RGetEntities
// 0x0018 (0x0018 - 0x0000)
struct Entity_core_entity__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcore__entity_N_RGetEntities final
{
public:
	struct Entity_0::Ftuple_L_R                   __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UEntity_core_entity*>            RetVal;                                            // 0x0008(0x0010)(Parm, OutParm, ReturnParm, ContainsInstancedReference)
};
DUMPER7_ASSERTS_Entity_core_entity__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcore__entity_N_RGetEntities;

// Function Entity.Entity_core_entity._L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcore__entity_N_RGetOwner
// 0x0010 (0x0010 - 0x0000)
struct Entity_core_entity__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcore__entity_N_RGetOwner final
{
public:
	struct Entity_0::Ftuple_L_R                   __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TOptional<class UEntity_core_entity*, true>   RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Entity_core_entity__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcore__entity_N_RGetOwner;

// Function Entity.Entity_core_entity._L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcore__entity_N_RIsDisposed
// 0x0003 (0x0003 - 0x0000)
struct Entity_core_entity__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcore__entity_N_RIsDisposed final
{
public:
	struct Entity_0::Ftuple_L_R                   __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	TOptional<EVerseTrue>                         RetVal;                                            // 0x0001(0x0002)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Entity_core_entity__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcore__entity_N_RIsDisposed;

// Function Entity.Entity_core_entity._L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcore__entity_N_RRemoveComponent_L_Ncore__entity__component_R
// 0x0010 (0x0010 - 0x0000)
struct Entity_core_entity__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcore__entity_N_RRemoveComponent_L_Ncore__entity__component_R final
{
public:
	class UEntity_core_entity_component*          __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<EVerseTrue>                         RetVal;                                            // 0x0008(0x0002)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Entity_core_entity__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcore__entity_N_RRemoveComponent_L_Ncore__entity__component_R;

// Function Entity.Entity_core_entity._L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcore__entity_N_RRemoveEntity_L_Ncore__entity_R
// 0x0010 (0x0010 - 0x0000)
struct Entity_core_entity__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcore__entity_N_RRemoveEntity_L_Ncore__entity_R final
{
public:
	class UEntity_core_entity*                    __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<EVerseTrue>                         RetVal;                                            // 0x0008(0x0002)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Entity_core_entity__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcore__entity_N_RRemoveEntity_L_Ncore__entity_R;

// Function Entity.Entity_core_entity_component._L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcore__entity__component_N_RAddedToWorld
// 0x0001 (0x0001 - 0x0000)
struct Entity_core_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcore__entity__component_N_RAddedToWorld final
{
public:
	struct Entity_0::Ftuple_L_R                   __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Entity_core_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcore__entity__component_N_RAddedToWorld;

// Function Entity.Entity_core_entity_component._L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcore__entity__component_N_RBeginPlay
// 0x0001 (0x0001 - 0x0000)
struct Entity_core_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcore__entity__component_N_RBeginPlay final
{
public:
	struct Entity_0::Ftuple_L_R                   __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Entity_core_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcore__entity__component_N_RBeginPlay;

// Function Entity.Entity_core_entity_component._L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcore__entity__component_N_REndPlay
// 0x0001 (0x0001 - 0x0000)
struct Entity_core_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcore__entity__component_N_REndPlay final
{
public:
	struct Entity_0::Ftuple_L_R                   __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Entity_core_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcore__entity__component_N_REndPlay;

// Function Entity.Entity_core_entity_component._L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcore__entity__component_N_RGetOwner
// 0x0010 (0x0010 - 0x0000)
struct Entity_core_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcore__entity__component_N_RGetOwner final
{
public:
	struct Entity_0::Ftuple_L_R                   __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TOptional<class UEntity_core_entity*, true>   RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Entity_core_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcore__entity__component_N_RGetOwner;

// Function Entity.Entity_core_entity_component._L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcore__entity__component_N_RInitialize
// 0x0001 (0x0001 - 0x0000)
struct Entity_core_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcore__entity__component_N_RInitialize final
{
public:
	struct Entity_0::Ftuple_L_R                   __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Entity_core_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcore__entity__component_N_RInitialize;

// Function Entity.Entity_core_entity_component._L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcore__entity__component_N_RIsAllowedOnClient
// 0x0002 (0x0002 - 0x0000)
struct Entity_core_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcore__entity__component_N_RIsAllowedOnClient final
{
public:
	struct Entity_0::Ftuple_L_R                   __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         RetVal : 1;                                        // 0x0001(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash))
};
DUMPER7_ASSERTS_Entity_core_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcore__entity__component_N_RIsAllowedOnClient;

// Function Entity.Entity_core_entity_component._L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcore__entity__component_N_RRemovingFromWorld
// 0x0001 (0x0001 - 0x0000)
struct Entity_core_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcore__entity__component_N_RRemovingFromWorld final
{
public:
	struct Entity_0::Ftuple_L_R                   __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Entity_core_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcore__entity__component_N_RRemovingFromWorld;

// Function Entity.Entity_core_entity_component._L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcore__entity__component_N_RUninitialize
// 0x0001 (0x0001 - 0x0000)
struct Entity_core_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcore__entity__component_N_RUninitialize final
{
public:
	struct Entity_0::Ftuple_L_R                   __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Entity_core_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcore__entity__component_N_RUninitialize;

// Function Entity.Entity_engine_execution._L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fengine__execution_N_RGetSubscribables_L_Ncore__entity_R
// 0x0010 (0x0010 - 0x0000)
struct Entity_engine_execution__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fengine__execution_N_RGetSubscribables_L_Ncore__entity_R final
{
public:
	class UEntity_core_entity*                    __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEntity_engine_execution_subscribables* RetVal;                                            // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Entity_engine_execution__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fengine__execution_N_RGetSubscribables_L_Ncore__entity_R;

// Function Entity.Entity_engine_execution_subscribables.$InitCDO
// 0x00C0 (0x00C0 - 0x0000)
struct Entity_engine_execution_subscribables__InitCDO final
{
public:
	class UExecution_execution_subscribable*      _ExprResult_0;                                     // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_1;                                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UExecution_execution_subscribable*      _ExprResult_2;                                     // 0x0010(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_3;                                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UExecution_execution_subscribable*      _ExprResult_4;                                     // 0x0020(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_5;                                // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UExecution_execution_subscribable*      _ExprResult_6;                                     // 0x0030(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_7;                                // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UExecution_execution_subscribable*      _ExprResult_8;                                     // 0x0040(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_9;                                // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UExecution_execution_subscribable*      _ExprResult_10;                                    // 0x0050(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_11;                               // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UExecution_execution_subscribable*      _ExprResult_12;                                    // 0x0060(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_13;                               // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UExecution_execution_subscribable*      _ExprResult_14;                                    // 0x0070(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_15;                               // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UExecution_execution_subscribable*      _ExprResult_16;                                    // 0x0080(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_17;                               // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UExecution_execution_subscribable*      _ExprResult_18;                                    // 0x0090(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_19;                               // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UExecution_execution_subscribable*      _ExprResult_20;                                    // 0x00A0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_21;                               // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UExecution_execution_subscribable*      _ExprResult_22;                                    // 0x00B0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_23;                               // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Entity_engine_execution_subscribables__InitCDO;

// Function Entity.Entity_replication_component._L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcore__entity__component_N_RAddedToWorld
// 0x0001 (0x0001 - 0x0000)
struct Entity_replication_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcore__entity__component_N_RAddedToWorld final
{
public:
	struct Entity_0::Ftuple_L_R                   __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Entity_replication_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcore__entity__component_N_RAddedToWorld;

// Function Entity.Entity_replication_component._L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcore__entity__component_N_RIsAllowedOnClient
// 0x0002 (0x0002 - 0x0000)
struct Entity_replication_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcore__entity__component_N_RIsAllowedOnClient final
{
public:
	struct Entity_0::Ftuple_L_R                   __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         RetVal : 1;                                        // 0x0001(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash))
};
DUMPER7_ASSERTS_Entity_replication_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcore__entity__component_N_RIsAllowedOnClient;

// Function Entity.Entity_replication_component._L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcore__entity__component_N_RRemovingFromWorld
// 0x0001 (0x0001 - 0x0000)
struct Entity_replication_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcore__entity__component_N_RRemovingFromWorld final
{
public:
	struct Entity_0::Ftuple_L_R                   __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Entity_replication_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcore__entity__component_N_RRemovingFromWorld;

// Function Entity.Entity_transform_component.$InitCDO
// 0x0180 (0x0180 - 0x0000)
struct Entity_transform_component__InitCDO final
{
public:
	struct FSpatialMath_transform                 _ExprResult_0;                                     // 0x0000(0x0060)(NoDestructor)
	struct FSpatialMath_transform                 _ExprResult_1;                                     // 0x0060(0x0060)(NoDestructor)
	struct FSpatialMath_transform                 _ExprResult_2;                                     // 0x00C0(0x0060)(NoDestructor)
	struct FSpatialMath_transform                 _ExprResult_3;                                     // 0x0120(0x0060)(NoDestructor)
};
DUMPER7_ASSERTS_Entity_transform_component__InitCDO;

// Function Entity.Entity_transform_component._L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcore__entity__component_N_RInitialize
// 0x0001 (0x0001 - 0x0000)
struct Entity_transform_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcore__entity__component_N_RInitialize final
{
public:
	struct Entity_0::Ftuple_L_R                   __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Entity_transform_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcore__entity__component_N_RInitialize;

// Function Entity.Entity_transform_component._L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcore__entity__component_N_RIsAllowedOnClient
// 0x0002 (0x0002 - 0x0000)
struct Entity_transform_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcore__entity__component_N_RIsAllowedOnClient final
{
public:
	struct Entity_0::Ftuple_L_R                   __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         RetVal : 1;                                        // 0x0001(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash))
};
DUMPER7_ASSERTS_Entity_transform_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcore__entity__component_N_RIsAllowedOnClient;

// Function Entity.Entity_transform_component._L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcore__entity__component_N_RUninitialize
// 0x0001 (0x0001 - 0x0000)
struct Entity_transform_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcore__entity__component_N_RUninitialize final
{
public:
	struct Entity_0::Ftuple_L_R                   __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Entity_transform_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcore__entity__component_N_RUninitialize;

// Function Entity.Entity_transform_component._L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2ftransform__component_N_ROnRep__Transform
// 0x0001 (0x0001 - 0x0000)
struct Entity_transform_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2ftransform__component_N_ROnRep__Transform final
{
public:
	struct Entity_0::Ftuple_L_R                   __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Entity_transform_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2ftransform__component_N_ROnRep__Transform;

// Function Entity.Entity_transform_component._L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2ftransform__component_N_RSetTransform_L_Ntransform_R
// 0x0060 (0x0060 - 0x0000)
struct Entity_transform_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2ftransform__component_N_RSetTransform_L_Ntransform_R final
{
public:
	struct FSpatialMath_transform                 __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0060)(Parm, NoDestructor)
};
DUMPER7_ASSERTS_Entity_transform_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2ftransform__component_N_RSetTransform_L_Ntransform_R;

}

