#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ENV_CustomHeightCeilingProp_Pointlight

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "BP_Lightsource_CH5_GlobalProp_PointLight_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass ENV_CustomHeightCeilingProp_Pointlight.ENV_CustomHeightCeilingProp_Pointlight_C
// 0x0078 (0x0C58 - 0x0BE0)
class AENV_CustomHeightCeilingProp_Pointlight_C : public ABP_Lightsource_CH5_GlobalProp_PointLight_C
{
public:
	class UStaticMeshComponent*                   DownRod;                                           // 0x0BE0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   LightFixture;                                      // 0x0BE8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        FixtureLength;                                     // 0x0BF0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           TintColor;                                         // 0x0BF8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HasTextureData;                                    // 0x0C08(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C09[0x7];                                      // 0x0C09(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        BaseZBounds;                                       // 0x0C10(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        FixtureZBounds;                                    // 0x0C18(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        RodZBounds;                                        // 0x0C20(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        RodScale;                                          // 0x0C28(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCapsuleComponent*                      CapsuleCollision;                                  // 0x0C30(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          UseCustomLight;                                    // 0x0C38(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseMeshCollision;                                  // 0x0C39(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C3A[0x2];                                      // 0x0C3A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   LightSocketName;                                   // 0x0C3C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LightOffset;                                       // 0x0C40(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ValidateBuildingTextureData();
	void UserConstructionScript();
	void SetTintColorOnMeshParts();
	void SetRodPosition();
	void SetLightPosition();
	void SetFixturePosition();
	void SetDownRodMaterial();
	void GetTintColorFromTextureData();
	void GetMeshBounds();
	void GetMaterialFromRootMesh();
	void EnableCollisionOnMeshParts();
	void AddCapsuleCollision();

	class UPrimitiveComponent* GetCurieCollisionComponentOverride() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ENV_CustomHeightCeilingProp_Pointlight_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ENV_CustomHeightCeilingProp_Pointlight_C")
	}
	static class AENV_CustomHeightCeilingProp_Pointlight_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AENV_CustomHeightCeilingProp_Pointlight_C>();
	}
};
DUMPER7_ASSERTS_AENV_CustomHeightCeilingProp_Pointlight_C;

}

