#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EventScreenBase

#include "Basic.hpp"

#include "EventScreenBase_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "UMG_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Engine_classes.hpp"
#include "CommonUI_classes.hpp"
#include "FortniteUI_classes.hpp"
#include "CommonInput_structs.hpp"


namespace SDK
{

// Class EventScreenBase.FortEventScreenData
// 0x0670 (0x06A0 - 0x0030)
class UFortEventScreenData final : public UDataAsset
{
public:
	class FString                                 EventCMSId;                                        // 0x0030(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 AccountResourceName;                               // 0x0040(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 LevelOfferId;                                      // 0x0050(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 PremiumTrackOfferId;                               // 0x0060(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortTokenType*                         PremiumTrackPurchasedToken;                        // 0x0070(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           VaultWorldTag;                                     // 0x0078(0x0004)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVaultWorldBackgroundData              PreviewScreenBackgroundData;                       // 0x0080(0x0058)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UFortChallengeBundleItemDefinition> QuestBundle;                            // 0x00D8(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UFortItemDefinition>     SpecialRewardItem;                                 // 0x00F8(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UFortItemDefinition>     SpecialPremiumRewardItem;                          // 0x0118(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FEventItemOverride>             ItemOverrides;                                     // 0x0138(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FEventScreenTrackData                  FreeTrackData;                                     // 0x0148(0x0030)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FEventScreenTrackData                  PremiumTrackData;                                  // 0x0178(0x0030)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FGameplayTag                           QuestCategoryTag;                                  // 0x01A8(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1AC[0x4];                                      // 0x01AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TSubclassOf<class URichTextBlockDecorator>> RichTextDecorators;                           // 0x01B0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, UObjectWrapper, NativeAccessSpecifierPublic)
	class UMaterialInterface*                     EventBackgroundMaterial;                           // 0x01C0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInterface*                     ProgressBarMaterial;                               // 0x01C8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSlateBrush                            CurrencyBrush;                                     // 0x01D0(0x00C0)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FSlateBrush                            CompletionBannerBrush;                             // 0x0290(0x00C0)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FSlateBrush                            GlowForeground;                                    // 0x0350(0x00C0)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FSlateBrush                            GlowBackground;                                    // 0x0410(0x00C0)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FLinearColor                           EventBackgroundColor1;                             // 0x04D0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           EventBackgroundColor2;                             // 0x04E0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           RewardBackgroundColor1;                            // 0x04F0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           RewardBackgroundColor2;                            // 0x0500(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           RewardBackgroundColor3;                            // 0x0510(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           AccentColor;                                       // 0x0520(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FName, struct FLinearColor>        RewardTileBackgroundColors;                        // 0x0530(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	class FText                                   TimeRemainingFormat;                               // 0x0580(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	class FText                                   CurrencyFormat;                                    // 0x0598(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<struct FEventScreenMoreInfoGroup>      MoreInfoGroups;                                    // 0x05B0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	class USoundBase*                             DefaultHoveredSound;                               // 0x05C0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USoundBase*                             DefaultPressedSound;                               // 0x05C8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USoundBase*                             BuyPressedSound;                                   // 0x05D0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USoundBase*                             BuyHoldStartedSound;                               // 0x05D8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USoundBase*                             BuyHoldCompletedSound;                             // 0x05E0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USoundBase*                             BuyHoldAbortedSound;                               // 0x05E8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USoundBase*                             BackPressedSound;                                  // 0x05F0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USoundBase*                             AddPressedSound;                                   // 0x05F8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USoundBase*                             SubtractPressedSound;                              // 0x0600(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USoundBase*                             ProgressStartedSound;                              // 0x0608(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USoundBase*                             ProgressEndedSound;                                // 0x0610(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USoundBase*                             ProgressInterruptedSound;                          // 0x0618(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RewardPreviewZoomLevel;                            // 0x0620(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseWidgetCameraFraming;                           // 0x0624(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_625[0x3];                                      // 0x0625(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftClassPtr<class UClass>                   MoreInfoModalClass;                                // 0x0628(0x0020)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UClass>                   PurchaseLevelsModalClass;                          // 0x0648(0x0020)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UClass>                   PurchasePremiumTrackModalClass;                    // 0x0668(0x0020)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         CalendarEvents;                                    // 0x0688(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	uint8                                         Pad_698[0x8];                                      // 0x0698(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortEventScreenData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortEventScreenData")
	}
	static class UFortEventScreenData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortEventScreenData>();
	}
};
DUMPER7_ASSERTS_UFortEventScreenData;

// Class EventScreenBase.FortEventModalBase
// 0x0008 (0x0408 - 0x0400)
class UFortEventModalBase : public UCommonActivatableWidget
{
public:
	uint8                                         Pad_400[0x8];                                      // 0x0400(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void CloseModal();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortEventModalBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortEventModalBase")
	}
	static class UFortEventModalBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortEventModalBase>();
	}
};
DUMPER7_ASSERTS_UFortEventModalBase;

// Class EventScreenBase.FortEventMoreInfoGroup
// 0x0000 (0x02C0 - 0x02C0)
class UFortEventMoreInfoGroup final : public UUserWidget
{
public:
	void OnEventScreenDataSet(const class UFortEventScreenData* InEventScreenData);
	void OnIconLoaded(const class UObject* Icon);
	void OnSetGroupText(const class FText& Header, const class FText& Body);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortEventMoreInfoGroup")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortEventMoreInfoGroup")
	}
	static class UFortEventMoreInfoGroup* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortEventMoreInfoGroup>();
	}
};
DUMPER7_ASSERTS_UFortEventMoreInfoGroup;

// Class EventScreenBase.FortEventMoreInfoModal
// 0x0028 (0x0430 - 0x0408)
class UFortEventMoreInfoModal final : public UFortEventModalBase
{
public:
	class UDynamicEntryBox*                       DynamicEntryBox_Groups;                            // 0x0408(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                      Button_Back;                                       // 0x0410(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                      Button_CloseTouch;                                 // 0x0418(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_420[0x8];                                      // 0x0420(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UScrollBox*                             SB_Vertical;                                       // 0x0428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnEventScreenDataSet(const class UFortEventScreenData* InEventScreenData);
	void OnModalBackout();
	void SetModalText(const class FText& Header, const class FText& SubHeader, const class FText& Legal);

	const class UFortEventScreenData* GetEventScreenData() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortEventMoreInfoModal")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortEventMoreInfoModal")
	}
	static class UFortEventMoreInfoModal* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortEventMoreInfoModal>();
	}
};
DUMPER7_ASSERTS_UFortEventMoreInfoModal;

// Class EventScreenBase.FortEventPurchaseLevelsModal
// 0x0070 (0x0478 - 0x0408)
class UFortEventPurchaseLevelsModal final : public UFortEventModalBase
{
public:
	class UCommonButtonBase*                      Button_Addition;                                   // 0x0408(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                      Button_Subtraction;                                // 0x0410(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                      Button_Purchase;                                   // 0x0418(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                      Button_GetVBucks;                                  // 0x0420(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                      Button_Back;                                       // 0x0428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                      Button_CloseTouch;                                 // 0x0430(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UEventScreenListView*                   ListView_RewardPreview;                            // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         CurrentResourceValue;                              // 0x0440(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         MaxResourceValue;                                  // 0x0444(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         CurrentVBucks;                                     // 0x0448(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         OfferResourceQuantity;                             // 0x044C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bAnimateListViewFromEmpty;                         // 0x0450(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_451[0x27];                                     // 0x0451(0x0027)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandlePurchaseComplete(bool bSuccess, const TArray<struct FPurchasedItemInfo>& PurchasedItems, const class FString& InOfferId);
	void OnAmountChangeButtonClicked();
	void OnCMSTextApplied(const class FText& LegalText);
	void OnEventScreenDataSet(const class UFortEventScreenData* InEventScreenData);
	void OnPurchaseAmountChanged(const int32 TotalPrice, const int32 LevelQuantity, const int32 PurchaseQuantity, const int32 ResourceQuantity);

	const class UFortEventScreenData* GetEventScreenData() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortEventPurchaseLevelsModal")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortEventPurchaseLevelsModal")
	}
	static class UFortEventPurchaseLevelsModal* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortEventPurchaseLevelsModal>();
	}
};
DUMPER7_ASSERTS_UFortEventPurchaseLevelsModal;

// Class EventScreenBase.FortPurchasePremiumTrackBody
// 0x0000 (0x02C0 - 0x02C0)
class UFortPurchasePremiumTrackBody final : public UUserWidget
{
public:
	void OnPopulate(const int32 BodyIndex, const class FText& BodyText);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortPurchasePremiumTrackBody")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortPurchasePremiumTrackBody")
	}
	static class UFortPurchasePremiumTrackBody* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortPurchasePremiumTrackBody>();
	}
};
DUMPER7_ASSERTS_UFortPurchasePremiumTrackBody;

// Class EventScreenBase.FortEventPurchasePremiumTrackModal
// 0x0070 (0x0478 - 0x0408)
class UFortEventPurchasePremiumTrackModal final : public UFortEventModalBase
{
public:
	class UDynamicEntryBox*                       DynamicEntryBox_Body;                              // 0x0408(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UScrollBox*                             ScrollBox_Body;                                    // 0x0410(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortCTAButton*                         Button_Purchase;                                   // 0x0418(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                      Button_GetVBucks;                                  // 0x0420(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                      Button_Back;                                       // 0x0428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                      Button_CloseTouch;                                 // 0x0430(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                      Button_PreviewReward;                              // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         CurrentVBucks;                                     // 0x0440(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_444[0x34];                                     // 0x0444(0x0034)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandlePurchaseComplete(bool bSuccess, const TArray<struct FPurchasedItemInfo>& PurchasedItems, const class FString& InOfferId);
	void OnCMSTextApplied(const class FText& HeaderText, const class FText& LegalText);
	void OnEventScreenDataSet(const class UFortEventScreenData* InEventScreenData);
	void OnPriceSet(const int32 Price);

	const class UFortEventScreenData* GetEventScreenData() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortEventPurchasePremiumTrackModal")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortEventPurchasePremiumTrackModal")
	}
	static class UFortEventPurchasePremiumTrackModal* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortEventPurchasePremiumTrackModal>();
	}
};
DUMPER7_ASSERTS_UFortEventPurchasePremiumTrackModal;

// Class EventScreenBase.FortEventListViewWidgetBase
// 0x0008 (0x02C8 - 0x02C0)
class UFortEventListViewWidgetBase : public UUserWidget
{
public:
	uint8                                         Pad_2C0[0x8];                                      // 0x02C0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortEventListViewWidgetBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortEventListViewWidgetBase")
	}
	static class UFortEventListViewWidgetBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortEventListViewWidgetBase>();
	}
};
DUMPER7_ASSERTS_UFortEventListViewWidgetBase;

// Class EventScreenBase.FortEventRewardTracksWidget
// 0x0050 (0x0318 - 0x02C8)
class UFortEventRewardTracksWidget final : public UFortEventListViewWidgetBase
{
public:
	class UDynamicEntryBox*                       DynamicEntryBox_RewardTracks;                      // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bPreviewMode;                                      // 0x02D0(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2D1[0x47];                                     // 0x02D1(0x0047)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BPOnEventScreenDataSet(const class UFortEventScreenData* InEventScreenData);
	void BPOnSetRewardItem(const int32 RequiredProgress, const int32 RemainingProgress, const float RewardProgressPercent, const float PreviewProgressPercent, const float OverallProgressPercent, const bool bInPreviewMode);
	void BPSetAllRewardsCollected(const bool bAllCollected);
	void BPSetProgressPercent(const float Percent);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortEventRewardTracksWidget")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortEventRewardTracksWidget")
	}
	static class UFortEventRewardTracksWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortEventRewardTracksWidget>();
	}
};
DUMPER7_ASSERTS_UFortEventRewardTracksWidget;

// Class EventScreenBase.FortEventSpacerWidget
// 0x0000 (0x02C8 - 0x02C8)
class UFortEventSpacerWidget final : public UFortEventListViewWidgetBase
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortEventSpacerWidget")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortEventSpacerWidget")
	}
	static class UFortEventSpacerWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortEventSpacerWidget>();
	}
};
DUMPER7_ASSERTS_UFortEventSpacerWidget;

// Class EventScreenBase.FortEventRewardWidget
// 0x0090 (0x0350 - 0x02C0)
class UFortEventRewardWidget final : public UUserWidget
{
public:
	uint8                                         Pad_2C0[0x8];                                      // 0x02C0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      Button_RewardPreview;                              // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortCosmeticItemCard*                  UserWidget_ItemCard;                               // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsTrackOwned;                                     // 0x02D8(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bPreviewMode;                                      // 0x02D9(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bInPreviewSelectedState;                           // 0x02DA(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bInPremiumUpgradeState;                            // 0x02DB(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2DC[0x74];                                     // 0x02DC(0x0074)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnEventScreenDataSet(const class UFortEventScreenData* InEventScreenData);
	void OnInputMethodChanged(const ECommonInputType NewInputType);
	void OnRewardWidgetReset();
	void OnSetRewardItem(const int32 RequiredProgress, const int32 RemainingProgress, const float RewardProgressPercent, const float PreviewProgressPercent, const float OverallProgressPercent, const bool bInPreviewMode);
	void SetAllRewardsCollected(const bool bAllCollected);
	void SetCustomItemIcon(const class UTexture2D* CustomItemIcon);
	void SetDoubleWidth(const bool bDoubleWidth);
	void SetInPremiumUpgradeState(const bool bHighlighted);
	void SetInPreviewedState(const bool bPreviewed);
	void SetInPreviewSelectedState(const bool bSelected);
	void SetInSelectedState(const bool bSelected);
	void SetIsBannerItem(const bool bIsBanner);
	void SetProgressPercent(const float Percent);
	void SetTrackData(const struct FEventScreenTrackData& TrackData, const bool bIsOwned);

	const class UFortEventScreenData* GetEventScreenData() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortEventRewardWidget")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortEventRewardWidget")
	}
	static class UFortEventRewardWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortEventRewardWidget>();
	}
};
DUMPER7_ASSERTS_UFortEventRewardWidget;

// Class EventScreenBase.FortEventScreenBase
// 0x0428 (0x0B58 - 0x0730)
class UFortEventScreenBase final : public UFortItemPreviewScreen
{
public:
	uint8                                         Pad_730[0x8];                                      // 0x0730(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UNamedSlot*>                     LayoutTemplateSlots;                               // 0x0738(0x0010)(BlueprintVisible, ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	class UFortLazyImage*                         LazyImage_KeyArt;                                  // 0x0748(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                      Button_ViewQuests;                                 // 0x0750(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                      Button_MoreInfo;                                   // 0x0758(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                      Button_PurchaseLevels;                             // 0x0760(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                      Button_Preview;                                    // 0x0768(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                      Button_ShowInItemShop;                             // 0x0770(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                      Button_Previous;                                   // 0x0778(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                      Button_Next;                                       // 0x0780(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortEventTrackerModule_CustomText*     CustomText_InspectItem;                            // 0x0788(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UPanelWidget*                           Panel_LoadError;                                   // 0x0790(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                      Button_Close;                                      // 0x0798(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                      Button_CloseTouch;                                 // 0x07A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortEventScreenData*                   EventScreenData;                                   // 0x07A8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EEventScreenRewardPreviewType                 ActiveRewardPreviewType;                           // 0x07B0(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_7B1[0x7];                                      // 0x07B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortChallengeBundleItemDefinition*     LoadedQuestBundle;                                 // 0x07B8(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class AFortItemPreviewWorld*                  CachedVaultWorld;                                  // 0x07C0(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_7C8[0x10];                                     // 0x07C8(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         TimeBetweenVariantsRestart;                        // 0x07D8(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         TimeBetweenVariants;                               // 0x07DC(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortItemVM*                            CachedItemVM;                                      // 0x07E0(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<struct FFortCosmeticVariantPreview>    CachedVariantPreviews;                             // 0x07E8(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	uint8                                         Pad_7F8[0x360];                                    // 0x07F8(0x0360)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleActiveSeasonDataChanged(const TArray<class FString>& ActiveEventFlags);
	void HandleGiftBoxClosed();
	void HandleItemShown(const class UFortAccountItemDefinition* AccountItemDef);
	class UWidget* HandleRewardListNavigateRightEvent(EUINavigation InNavigation);
	class UWidget* HandleRewardListNavigateUpEvent(EUINavigation InNavigation);
	void HandleToggleFullscreenMap(bool bVisible);
	class UWidget* HandleUpsellPromptNavigateUpEvent(EUINavigation InNavigation);
	void OnCalendarEventEnded(const class FString& EventName);
	void OnCalendarEventStarted(const class FString& EventName);
	void OnFirstViewAfterCompletion();
	void OnRewardPreviewItemChanged(const class UFortAccountItemDefinition* Item, const bool bFreeTrack);
	void OnRewardTrackReady();
	void OnScreenViewChanged(const EEventScreenView PrevScreenView, const EEventScreenView NewScreenView);
	void OnSetBonusInfo(const struct FBonusInfoMiniTagData& BonusInfo);
	void RegisterLayoutSlots();
	void SetItemShopCallout(const class FText& ItemShopCalloutText);
	void SetItemShopOfferInfoVisibility(bool bIsVisible);
	void SetRewardTrackLegal(const class FText& LegalText);
	void UpdateVariantCounter(int32 CurrentVariantIndex, int32 TotalNumVariants);

	class UFortEventModalBase* GetActiveModal() const;
	struct FTimespan GetEventTimeRemaining() const;
	class UMaterialInstanceDynamic* GetVaultWorldBackgroundMID() const;
	class UMaterialInstanceDynamic* GetVaultWorldFloorMID() const;
	bool HasAllRewardsCollected() const;
	bool HasPurchasedPremiumTrack() const;
	bool IsCalendarEventActive(const class FString& EventName) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortEventScreenBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortEventScreenBase")
	}
	static class UFortEventScreenBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortEventScreenBase>();
	}
};
DUMPER7_ASSERTS_UFortEventScreenBase;

// Class EventScreenBase.EventScreenListView
// 0x01E8 (0x0480 - 0x0298)
class UEventScreenListView final : public UListViewBase
{
public:
	uint8                                         Pad_298[0xE8];                                     // 0x0298(0x00E8)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              OnProgressBarAnimationStartedEvent;                // 0x0380(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnProgressBarAnimationCompletedEvent;              // 0x0390(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnProgressBarAnimationInterruptedEvent;            // 0x03A0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FMargin& Margin)> OnResourcePreviewOffsetAnimationEvent; // 0x03B0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C0[0x20];                                     // 0x03C0(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UFortEventRewardTracksWidget> RewardTrackWidgetClass;                          // 0x03E0(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UFortEventSpacerWidget>     SpacerWidgetClass;                                 // 0x03E8(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         EntrySpacing;                                      // 0x03F0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bCenterSelection;                                  // 0x03F4(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3F5[0x3];                                      // 0x03F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MaxItemsInView;                                    // 0x03F8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bPreviewMode;                                      // 0x03FC(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3FD[0x3];                                      // 0x03FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UCurveFloat*                            ProgressAnimationCurve;                            // 0x0400(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bCanAnimateOnceComplete;                           // 0x0408(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_409[0x77];                                     // 0x0409(0x0077)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetNativeTickAllowed(const bool bAllowed);

	const class UFortEventScreenData* GetEventScreenData() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EventScreenListView")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EventScreenListView")
	}
	static class UEventScreenListView* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEventScreenListView>();
	}
};
DUMPER7_ASSERTS_UEventScreenListView;

// Class EventScreenBase.FortEventScreenTeaser
// 0x0040 (0x05B0 - 0x0570)
class UFortEventScreenTeaser final : public UFortActivatablePanel
{
public:
	class FString                                 CountdownCalendarEventFlag;                        // 0x0570(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class FString>                         CalendarEvents;                                    // 0x0580(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTag                           QuestCategoryTag;                                  // 0x0590(0x0004)(Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_594[0x4];                                      // 0x0594(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      Button_ViewQuests;                                 // 0x0598(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_5A0[0x10];                                     // 0x05A0(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BP_SetCountdownTimeRemaining(const struct FTimespan& TimeRemaining);
	void HandleActiveSeasonDataChanged(const TArray<class FString>& ActiveEventFlags);
	void OnCalendarEventEnded(const class FString& EventName);
	void OnCalendarEventStarted(const class FString& EventName);

	bool IsCalendarEventActive(const class FString& EventName) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortEventScreenTeaser")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortEventScreenTeaser")
	}
	static class UFortEventScreenTeaser* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortEventScreenTeaser>();
	}
};
DUMPER7_ASSERTS_UFortEventScreenTeaser;

// Class EventScreenBase.FortEventTokenCollectionWidget
// 0x0060 (0x0320 - 0x02C0)
class UFortEventTokenCollectionWidget final : public UUserWidget
{
public:
	class UCommonLazyImage*                       LazyImage_GhostIcon;                               // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonLazyImage*                       LazyImage_CompletedIcon;                           // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UImage*                                 Image_Glow;                                        // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UTexture2D>              FallbackBrush;                                     // 0x02D8(0x0020)(Edit, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UFortTokenType>          TokenDefinition;                                   // 0x02F8(0x0020)(Edit, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_318[0x8];                                      // 0x0318(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnRefreshIcon(const bool IsCollected, const bool bIsFirstViewAfterCollection);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortEventTokenCollectionWidget")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortEventTokenCollectionWidget")
	}
	static class UFortEventTokenCollectionWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortEventTokenCollectionWidget>();
	}
};
DUMPER7_ASSERTS_UFortEventTokenCollectionWidget;

// Class EventScreenBase.FortEventTrackerModule
// 0x0008 (0x02C8 - 0x02C0)
class UFortEventTrackerModule : public UUserWidget
{
public:
	uint8                                         Pad_2C0[0x8];                                      // 0x02C0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnModuleInitialized(const class UFortEventScreenData* InEventScreenData);

	const class UFortEventScreenData* GetEventScreenData() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortEventTrackerModule")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortEventTrackerModule")
	}
	static class UFortEventTrackerModule* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortEventTrackerModule>();
	}
};
DUMPER7_ASSERTS_UFortEventTrackerModule;

// Class EventScreenBase.FortEventTrackerModule_EventDetails
// 0x0000 (0x02C8 - 0x02C8)
class UFortEventTrackerModule_EventDetails final : public UFortEventTrackerModule
{
public:
	void OnPopulateEventDetailsText(const class FText& OutEventName, const class FText& OutEventDescription);
	void UpdateEventTimeRemaining(const class FText& EventTimeRemainingText, const struct FTimespan& TimeRemaining);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortEventTrackerModule_EventDetails")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortEventTrackerModule_EventDetails")
	}
	static class UFortEventTrackerModule_EventDetails* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortEventTrackerModule_EventDetails>();
	}
};
DUMPER7_ASSERTS_UFortEventTrackerModule_EventDetails;

// Class EventScreenBase.FortEventTrackerModule_Header
// 0x0000 (0x02C8 - 0x02C8)
class UFortEventTrackerModule_Header final : public UFortEventTrackerModule
{
public:
	void OnPopulateEventResourceHeader(const class FText& Header, const int32 ResourceValue);
	void OnPopulateEventResourceStarterHeader(const class FText& Header);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortEventTrackerModule_Header")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortEventTrackerModule_Header")
	}
	static class UFortEventTrackerModule_Header* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortEventTrackerModule_Header>();
	}
};
DUMPER7_ASSERTS_UFortEventTrackerModule_Header;

// Class EventScreenBase.FortEventTrackerModule_RewardDetails
// 0x0008 (0x02D0 - 0x02C8)
class UFortEventTrackerModule_RewardDetails final : public UFortEventTrackerModule
{
public:
	uint8                                         Pad_2C8[0x8];                                      // 0x02C8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnPopulateCompletedReward(const TArray<class FText>& RewardNames);
	void OnPopulateNextRewardDetails(const TArray<class FText>& RewardNames, const int32 ResourceNeeded);

	bool IsPremiumTrackOwned() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortEventTrackerModule_RewardDetails")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortEventTrackerModule_RewardDetails")
	}
	static class UFortEventTrackerModule_RewardDetails* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortEventTrackerModule_RewardDetails>();
	}
};
DUMPER7_ASSERTS_UFortEventTrackerModule_RewardDetails;

// Class EventScreenBase.FortEventTrackerModule_RewardRemaining
// 0x0020 (0x02E8 - 0x02C8)
class UFortEventTrackerModule_RewardRemaining final : public UFortEventTrackerModule
{
public:
	class UCommonButtonBase*                      Button_PurchasePremium;                            // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2D0[0x18];                                     // 0x02D0(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnPopulateRemaining(const int32 ResourceNeeded, const int32 TotalResourceRequired, const bool bRequiresPremiumTrackPurchase);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortEventTrackerModule_RewardRemaining")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortEventTrackerModule_RewardRemaining")
	}
	static class UFortEventTrackerModule_RewardRemaining* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortEventTrackerModule_RewardRemaining>();
	}
};
DUMPER7_ASSERTS_UFortEventTrackerModule_RewardRemaining;

// Class EventScreenBase.FortEventTrackerModule_ProgressiveRewards
// 0x0008 (0x02D0 - 0x02C8)
class UFortEventTrackerModule_ProgressiveRewards final : public UFortEventTrackerModule
{
public:
	class UEventScreenListView*                   ListView_Rewards;                                  // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	void OnPopulateCompletionMessage(const bool bIsComplete, const class FText& CompletionText);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortEventTrackerModule_ProgressiveRewards")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortEventTrackerModule_ProgressiveRewards")
	}
	static class UFortEventTrackerModule_ProgressiveRewards* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortEventTrackerModule_ProgressiveRewards>();
	}
};
DUMPER7_ASSERTS_UFortEventTrackerModule_ProgressiveRewards;

// Class EventScreenBase.FortEventTrackerModule_Collection
// 0x0000 (0x02C8 - 0x02C8)
class UFortEventTrackerModule_Collection final : public UFortEventTrackerModule
{
public:
	void OnGatherTokenCollectionWidgets(TArray<class UFortEventTokenCollectionWidget*>* OutCollectionWidgets) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortEventTrackerModule_Collection")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortEventTrackerModule_Collection")
	}
	static class UFortEventTrackerModule_Collection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortEventTrackerModule_Collection>();
	}
};
DUMPER7_ASSERTS_UFortEventTrackerModule_Collection;

// Class EventScreenBase.FortEventTrackerModule_Banner
// 0x0008 (0x02D0 - 0x02C8)
class UFortEventTrackerModule_Banner final : public UFortEventTrackerModule
{
public:
	class UFortLazyImage*                         LazyImage_BannerArt;                               // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void OnCTACompleted(const bool bIsComplete);
	void OnPopulateBannerText(const class FText& BannerText);
	void OnPopulateHeaderCTAText(const class FText& HeaderCTAText);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortEventTrackerModule_Banner")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortEventTrackerModule_Banner")
	}
	static class UFortEventTrackerModule_Banner* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortEventTrackerModule_Banner>();
	}
};
DUMPER7_ASSERTS_UFortEventTrackerModule_Banner;

// Class EventScreenBase.FortEventTrackerModule_PremiumUpsell
// 0x0070 (0x0338 - 0x02C8)
class UFortEventTrackerModule_PremiumUpsell final : public UFortEventTrackerModule
{
public:
	class UFortCTAButton*                         Button_Prompt;                                     // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FText                                   PromptTextUnowned;                                 // 0x02D0(0x0018)(Edit, Protected, NativeAccessSpecifierProtected)
	class FText                                   PromptTextOwned;                                   // 0x02E8(0x0018)(Edit, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_300[0x38];                                     // 0x0300(0x0038)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnIconLoaded(const class UTexture* LoadedTexture);
	void OnPopulateText(const class FText& HeaderText, const class FText& BodyText);

	bool IsPremiumTrackOwned() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortEventTrackerModule_PremiumUpsell")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortEventTrackerModule_PremiumUpsell")
	}
	static class UFortEventTrackerModule_PremiumUpsell* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortEventTrackerModule_PremiumUpsell>();
	}
};
DUMPER7_ASSERTS_UFortEventTrackerModule_PremiumUpsell;

// Class EventScreenBase.FortEventTrackerModule_CustomText
// 0x0000 (0x02C8 - 0x02C8)
class UFortEventTrackerModule_CustomText final : public UFortEventTrackerModule
{
public:
	void OnPopulateText(const class FText& CustomText);

public:
	static class UClass* StaticClass()
	{
