#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Event_CentralPicnic_Thumper

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Event_CentralPicnic_Thumper.Event_CentralPicnic_Thumper_C
// 0x0800 (0x0A90 - 0x0290)
class AEvent_CentralPicnic_Thumper_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      Niagara;                                           // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       Sphere;                                            // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_MainTrack_C14B4EAA46D7111A82439190E382C889; // 0x02B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline__Direction_C14B4EAA46D7111A82439190E382C889; // 0x02B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B5[0x3];                                      // 0x02B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline;                                          // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           ThumpTimer;                                        // 0x02C0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class FString                                 CH5S1_Crater_Event;                                // 0x02C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	struct FScalableFloat                         ThumpTimerFloat;                                   // 0x02D8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FTimerHandle                           ThumpTimerHandle;                                  // 0x0300(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<TSubclassOf<class UGameplayEffect>>    Gameplay_Effects_to_Apply;                         // 0x0308(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TSubclassOf<class UGameplayEffect>            GE_Knock;                                          // 0x0318(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UNiagaraSystem*                         Niagara_Thump;                                     // 0x0320(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class FString                                 CH5S1_Thump_Event;                                 // 0x0328(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	struct FScalableFloat                         Bus_Phase_Delay_01;                                // 0x0338(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         Bus_Phase_Delay_02;                                // 0x0360(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FString                                 CH5S1_Final_Hour_Event;                            // 0x0388(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	struct FScalableFloat                         Bus_Phase_Delay_03;                                // 0x0398(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         Thump_Hours;                                       // 0x03C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C4[0x4];                                      // 0x03C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<int32, double>                           ThumpMapEarthQuakeDuration;                        // 0x03C8(0x0050)(Edit, BlueprintVisible)
	TMap<int32, double>                           ThumpMapMilkshakeRadius;                           // 0x0418(0x0050)(Edit, BlueprintVisible)
	TMap<int32, class UCurveFloat*>               ThumpMapLinearMilkshakeSeismicActivity;            // 0x0468(0x0050)(Edit, BlueprintVisible)
	class UCurveFloat*                            MilkshakeIntensity;                                // 0x04B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         Enabled;                                           // 0x04C0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          bUseMilkshakeDurationOverride;                     // 0x04E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E9[0x7];                                      // 0x04E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         MilkshakeDurationMultiplier;                       // 0x04F0(0x0028)(Edit, BlueprintVisible)
	bool                                          bMilkshakeRadiusOverride;                          // 0x0518(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_519[0x7];                                      // 0x0519(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         MilkshakeRadiusOverride;                           // 0x0520(0x0028)(Edit, BlueprintVisible)
	bool                                          LinearOrExponentialIntensity;                      // 0x0548(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_549[0x7];                                      // 0x0549(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<int32, class UCurveFloat*>               ThumpMapExponentialMilkshakeSeismicActivity;       // 0x0550(0x0050)(Edit, BlueprintVisible)
	TMap<int32, int32>                            Steam_Vents;                                       // 0x05A0(0x0050)(Edit, BlueprintVisible)
	TMap<int32, double>                           ThumpMapMilkshakeDamageMin;                        // 0x05F0(0x0050)(Edit, BlueprintVisible)
	TMap<int32, double>                           ThumpMapMilkshakeDamageMax;                        // 0x0640(0x0050)(Edit, BlueprintVisible)
	bool                                          OverrideDamage_Min_and_Max;                        // 0x0690(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_691[0x7];                                      // 0x0691(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        OverrideDamageMin;                                 // 0x0698(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        OverrideDamageMax;                                 // 0x06A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         Phase_Steam_1;                                     // 0x06A8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         Phase_Steam_2;                                     // 0x06D0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         Phase_Steam_3;                                     // 0x06F8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         Phase_Steam_4;                                     // 0x0720(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         Phase_Steam_5;                                     // 0x0748(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<int32, class AActor*>                    Cracks;                                            // 0x0770(0x0050)(Edit, BlueprintVisible)
	class ABP_CentralPicnic_Caldera_a_C*          Caldera;                                           // 0x07C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	int32                                         Current_Laval_Phase;                               // 0x07C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7CC[0x4];                                      // 0x07CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         Pushback_Radius;                                   // 0x07D0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UNiagaraSystem*                         Dust_Niagara;                                      // 0x07F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         Earthquake_Duration;                               // 0x0800(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         Earthquake_Radius;                                 // 0x0828(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UCurveFloat*                            First_Quake_Strength_Curve;                        // 0x0850(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         Thump_Cracks_Update_Timer;                         // 0x0858(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FTimerHandle                           MaterialLerpTimerHandle;                           // 0x0880(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         FistPumpTimetolerance;                             // 0x0888(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FString                                 CH5S1_Emergence_Event;                             // 0x08B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	struct FScalableFloat                         ThumpCracksHoursPerCrack;                          // 0x08C0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FString                                 FortShippingLog_Error_String;                      // 0x08E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	TArray<struct FScalableFloat>                 Hour_Phase_Array;                                  // 0x08F8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<bool>                                  EnabledStormPhases;                                // 0x0908(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UNiagaraSystem*                         Eruption_Niagara;                                  // 0x0918(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           Arm_Sequence;                                      // 0x0920(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         Demo_Duration;                                     // 0x0928(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         DemoHours;                                         // 0x092C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           DemoTimerHandle;                                   // 0x0930(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        CalderaScaleModifier;                              // 0x0938(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         CalderaNiagaraDust;                                // 0x0940(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         FistPumpRadius;                                    // 0x0948(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          UseDemo;                                           // 0x0970(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_971[0x7];                                      // 0x0971(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDataLayerAsset*                        Anim1_Data_Layer;                                  // 0x0978(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UDataLayerAsset*                        Constant_1_Data_Layer;                             // 0x0980(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UDataLayerAsset*                        Constant_2_Data_Layer;                             // 0x0988(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UDataLayerAsset*                        Primary_Data_Layer;                                // 0x0990(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UDataLayerAsset*                        Pre_Status_Data_Layer;                             // 0x0998(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ANiagaraActor*                          NiagaraSteam;                                      // 0x09A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         BusNiagaraDust;                                    // 0x09A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         Caldera_NiagaraBurst;                              // 0x09B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         ThumpEventTolerance;                               // 0x09B8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	class ASafeZoneIndicator_C*                   CachedSafeZoneInidcator;                           // 0x09E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         Final_Storm_Phase;                                 // 0x09E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9EC[0x4];                                      // 0x09EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraSystem*                         EmergenceExplosionNiagara;                         // 0x09F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         SteamExplosionNiagara;                             // 0x09F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Death_Reason;                                      // 0x0A00(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A04[0x4];                                      // 0x0A04(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        NiagaraSet;                                        // 0x0A08(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	int32                                         RepSteamVent;                                      // 0x0A10(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A14[0x4];                                      // 0x0A14(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         KillRadius;                                        // 0x0A18(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         SafetyKickRadius;                                  // 0x0A40(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         Backup_Safety_Kick_Radius;                         // 0x0A68(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void UpdateEventStatus();
	void Turn_On_Vents(class AActor* Vent);
	void Timeline__UpdateFunc();
	void Timeline__FinishedFunc();
	void Stop_All_Shake_Events();
	void StartShakingMilk(int32 ThumpHours);
	void ShowPreviousEffects();
	void Set_Crack_Material_Scalar();
	void ReceiveBeginPlay();
	void OnSyncComplete_6AB4A5384B514DFF13D10ABDE58D9DE0();
	void OnSavedEventStateExists_E01166C04291407CB8FC298D064D4B96(class UAsyncAction_StartListeningToStatefulEvent* ProxyObject);
	void OnRep_RepSteamVent();
	void OnRep_NiagaraSet();
	void OnReady_F50CA174430AB639FC3CEF8CDEB798D8(class AFortGameStateAthena* GameState, const class UFortPlaylist* Playlist, const struct FGameplayTagContainer& PlaylistContextTags);
	void OnEventStateCleared_E01166C04291407CB8FC298D064D4B96(class UAsyncAction_StartListeningToStatefulEvent* ProxyObject);
	void OnEventReceived_E01166C04291407CB8FC298D064D4B96(class UAsyncAction_StartListeningToStatefulEvent* ProxyObject);
	void MulticastMilkShaker(int32 ThumpHours);
	void MulticastLerpHeatOn(class UPrimitiveComponent* Primitive_Component, double Milkshake_Duration);
	void MulticastFistpump();
	void MulticastDemoStarter(double FirstWaitInSeconds);
	void MulticastCraterShake();
	void MulticastCondensedStarter(double FirstInWaitSeconds);
	void MulticastBusThump();
	void Lerp_Heat_On(class UObject* Object, double Milkshake_Duration);
	void GetMilkshakeIntensity(int32 Hours_In, class UCurveFloat** Intensity);
	void GetMilkshakeDuration(const int32& Hours_In, struct FVector2D* duration);
	void GetMilkshakeDamagePercentage(int32 Hours_In, struct FVector2D* Damage);
	void Get_Thump_Total_Hours(int32 Time_in_Days, int32 Time_in_Hours);
	void Get_MilkshakeRadius(const int32& Hours_In, struct FVector2D* Radius);
	void Get_Milkshake_Info(int32 ThumpHours, struct FMilkshakeEarthquakeInfoStruct* MilkshakeEarthquakeInfoStruct);
	void FistPump();
	void Expand_Caldera(const struct FVector& NiagaraLocation, const struct FVector& NewScale3D, bool UseNiagara);
	void ExecuteUbergraph_Event_CentralPicnic_Thumper(int32 EntryPoint);
	void Destroy_Player_Built_Structures(double Seconds);
	void DemoTimer();
	void DemoStarter(double FirstWaitInSeconds);
	void Deactivate_Static_Mesh_Collision();
	void CraterShake();
	void CondenseStart();
	void Check_is_Hour_Time_on_the_Dot(bool IsEventActive, const struct FTimespan& InTimespan, bool* EventPassed);
	void CentralPicnic_CondensedStart(double FirstInWaitSeconds);
	void CanSpawnNewVent(bool* Can_Spawn_New_Niagara);
	void Call_Bus_Thump();
	void CacheAndGetSafeZoneIndicator(class ASafeZoneIndicator_C** SafeZoneIndicator);
	void BusThump();
	void ApplyGEsToPlayersInRadius(const struct FVector& Location, float Radius_Size, int32 Hours_In);
	void Activate_SM_Collision_And_Visibility(class ABP_CentralPicnic_Caldera_a_C* Caldera_0, int32 Thump_Hours_0);
	void Activate_Data_Layer(const class UDataLayerAsset* InDataLayerAsset);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Event_CentralPicnic_Thumper_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Event_CentralPicnic_Thumper_C")
	}
	static class AEvent_CentralPicnic_Thumper_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AEvent_CentralPicnic_Thumper_C>();
	}
};
DUMPER7_ASSERTS_AEvent_CentralPicnic_Thumper_C;

}

