#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ExecutionTestSuite_0

#include "Basic.hpp"


namespace SDK
{

// VerseStruct ExecutionTestSuite.tuple_L_R
// 0x0001 (0x0001 - 0x0000)
struct ExecutionTestSuite_0::Ftuple_L_R final
{
public:
	uint8                                         _StructPaddingDummy;                               // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ExecutionTestSuite_0__Ftuple_L_R;

// VerseStruct ExecutionTestSuite.tuple_Lexecution__subscribable_Mlogic_R
// 0x0010 (0x0010 - 0x0000)
struct Ftuple_Lexecution__subscribable_Mlogic_R final
{
public:
	class UExecution_execution_subscribable*      __verse_0x18E3F084_Elem0;                          // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint8                                         __verse_0x7D844C3C_Elem1 : 1;                      // 0x0008(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (InstancedReference, NoDestructor, HasGetValueTypeHash))
};
DUMPER7_ASSERTS_Ftuple_Lexecution__subscribable_Mlogic_R;

// VerseStruct ExecutionTestSuite.tuple_Lfloat_Tvoid_M_QInterval_Nfloat_20_3d_20_2e_2e_2e_R
// 0x0020 (0x0020 - 0x0000)
struct ExecutionTestSuite_0::Ftuple_Lfloat_Tvoid_M_QInterval_Nfloat_20_3d_20_2e_2e_2e_R final
{
public:
	FVerseFunctionProperty_                       __verse_0x18E3F084_Elem0;                          // 0x0000(0x0010)(InstancedReference, HasGetValueTypeHash)
	TOptional<double>                             __verse_0x7D844C3C_Elem1;                          // 0x0010(0x0010)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ExecutionTestSuite_0__Ftuple_Lfloat_Tvoid_M_QInterval_Nfloat_20_3d_20_2e_2e_2e_R;

// VerseStruct ExecutionTestSuite.tuple_Ltuple_L_R_Tvoid_M_QInterval_Nfloat_20_3d_20_2e_2e_2e_R
// 0x0020 (0x0020 - 0x0000)
struct ExecutionTestSuite_0::Ftuple_Ltuple_L_R_Tvoid_M_QInterval_Nfloat_20_3d_20_2e_2e_2e_R final
{
public:
	FVerseFunctionProperty_                       __verse_0x18E3F084_Elem0;                          // 0x0000(0x0010)(InstancedReference, HasGetValueTypeHash)
	TOptional<double>                             __verse_0x7D844C3C_Elem1;                          // 0x0010(0x0010)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ExecutionTestSuite_0__Ftuple_Ltuple_L_R_Tvoid_M_QInterval_Nfloat_20_3d_20_2e_2e_2e_R;

}

