#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ExecutionTestSuite_0

#include "Basic.hpp"

#include "VerseNative_structs.hpp"
#include "ExecutionTestSuite_0_structs.hpp"


namespace SDK::Params
{

// Function ExecutionTestSuite.ExecutionTestSuite_test_phase_user.$InitCDO
// 0x0070 (0x0070 - 0x0000)
struct ExecutionTestSuite_test_phase_user__InitCDO final
{
public:
	int64                                         _ExprResult_0;                                     // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        _ExprResult_1;                                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TOptional<class UExecution_execution_subscription*, true> _ExprResult_2;                         // 0x0010(0x0008)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<EVerseFalse>                        __verse_0x00000000__1;                             // 0x0018(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_3 : 1;                                 // 0x001A(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	TOptional<EVerseFalse>                        _ExprResultStack_4;                                // 0x001B(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UExecution_execution_subscription*      _ExprResult_5;                                     // 0x0020(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_6;                                // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         _ExprResult_7;                                     // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         _ExprResult_8;                                     // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        _ExprResult_9;                                     // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TOptional<class UExecution_execution_subscription*, true> _ExprResult_10;                        // 0x0048(0x0008)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<EVerseFalse>                        __verse_0x00000000__3;                             // 0x0050(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_11 : 1;                                // 0x0052(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	TOptional<EVerseFalse>                        _ExprResultStack_12;                               // 0x0053(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UExecution_execution_subscription*      _ExprResult_13;                                    // 0x0058(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_14;                               // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         _ExprResult_15;                                    // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ExecutionTestSuite_test_phase_user__InitCDO;

// Function ExecutionTestSuite.ExecutionTestSuite_test_phase_user._L_2fUnrealEngine_2ecom_2fExecutionTestSuite_2ftest__phase__user_N_RCancel
// 0x0078 (0x0078 - 0x0000)
struct ExecutionTestSuite_test_phase_user__L_2fUnrealEngine_2ecom_2fExecutionTestSuite_2ftest__phase__user_N_RCancel final
{
public:
	struct ExecutionTestSuite_0::Ftuple_L_R       __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UExecution_execution_subscription*      __verse_0x7E090ADF_Connected_1;                    // 0x0008(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UExecution_execution_subscription*, true> _ExprResultStack_0;                    // 0x0010(0x0008)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class UExecution_execution_subscription*      __verse_0x00000000__2;                             // 0x0018(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_1;                          // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_2;                                         // 0x0028(0x0010)(HasGetValueTypeHash)
	struct ExecutionTestSuite_0::Ftuple_L_R       _ExprResult_3;                                     // 0x0038(0x0001)(HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UExecution_execution_subscription*      __verse_0x7E090ADF_Connected_3;                    // 0x0040(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UExecution_execution_subscription*, true> _ExprResultStack_4;                    // 0x0048(0x0008)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class UExecution_execution_subscription*      __verse_0x00000000__4;                             // 0x0050(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_5;                          // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_6;                                         // 0x0060(0x0010)(HasGetValueTypeHash)
	struct ExecutionTestSuite_0::Ftuple_L_R       _ExprResult_7;                                     // 0x0070(0x0001)(HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ExecutionTestSuite_test_phase_user__L_2fUnrealEngine_2ecom_2fExecutionTestSuite_2ftest__phase__user_N_RCancel;

// Function ExecutionTestSuite.ExecutionTestSuite_test_phase_user._L_2fUnrealEngine_2ecom_2fExecutionTestSuite_2ftest__phase__user_N_RCountNext
// 0x0001 (0x0001 - 0x0000)
struct ExecutionTestSuite_test_phase_user__L_2fUnrealEngine_2ecom_2fExecutionTestSuite_2ftest__phase__user_N_RCountNext final
{
public:
	struct ExecutionTestSuite_0::Ftuple_L_R       __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ExecutionTestSuite_test_phase_user__L_2fUnrealEngine_2ecom_2fExecutionTestSuite_2ftest__phase__user_N_RCountNext;

// Function ExecutionTestSuite.ExecutionTestSuite_test_phase_user._L_2fUnrealEngine_2ecom_2fExecutionTestSuite_2ftest__phase__user_N_RInit_L_Nexecution__subscribable_M_Nlogic_R
// 0x0200 (0x0200 - 0x0000)
struct ExecutionTestSuite_test_phase_user__L_2fUnrealEngine_2ecom_2fExecutionTestSuite_2ftest__phase__user_N_RInit_L_Nexecution__subscribable_M_Nlogic_R final
{
public:
	struct Ftuple_Lexecution__subscribable_Mlogic_R __verse_0xB2CDDD72_Argument;                     // 0x0000(0x0010)(Parm, HasGetValueTypeHash)
	class UExecution_execution_subscription*      __verse_0x7E090ADF_Connected_3;                    // 0x0010(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UExecution_execution_subscription*, true> _ExprResultStack_0;                    // 0x0018(0x0008)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class UExecution_execution_subscription*      __verse_0x00000000__4;                             // 0x0020(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_1;                          // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_2;                                         // 0x0030(0x0010)(HasGetValueTypeHash)
	struct ExecutionTestSuite_0::Ftuple_L_R       _ExprResult_3;                                     // 0x0040(0x0001)(HasGetValueTypeHash)
	TOptional<uint8>                              _ExprResultStack_4;                                // 0x0041(0x0002)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_43[0x5];                                       // 0x0043(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TOptional<class UExecution_execution_subscription*, true> _AssignmentScratch_5;                  // 0x0048(0x0008)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class UExecution_execution_subscription*, true> _ExprResult_6;                         // 0x0050(0x0008)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class UExecution_execution_subscription*      _ExprResult_7;                                     // 0x0058(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UExecution_execution_subscribable*      __verse_0x00000000__6;                             // 0x0060(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_8;                                         // 0x0068(0x0010)(HasGetValueTypeHash)
	struct ExecutionTestSuite_0::Ftuple_Lfloat_Tvoid_M_QInterval_Nfloat_20_3d_20_2e_2e_2e_R _ExprResult_9; // 0x0078(0x0020)(HasGetValueTypeHash)
	TOptional<double>                             _ExprResult_10;                                    // 0x0098(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TOptional<class UExecution_execution_subscription*, true> _AssignmentScratch_11;                 // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class UExecution_execution_subscription*, true> _ExprResult_12;                        // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class UExecution_execution_subscription*      _ExprResult_13;                                    // 0x00B8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UExecution_execution_subscribable*      __verse_0x00000000__8;                             // 0x00C0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_14;                                        // 0x00C8(0x0010)(HasGetValueTypeHash)
	struct ExecutionTestSuite_0::Ftuple_Ltuple_L_R_Tvoid_M_QInterval_Nfloat_20_3d_20_2e_2e_2e_R _ExprResult_15; // 0x00D8(0x0020)(HasGetValueTypeHash)
	TOptional<double>                             _ExprResult_16;                                    // 0x00F8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UExecution_execution_subscription*      __verse_0x7E090ADF_Connected_11;                   // 0x0108(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UExecution_execution_subscription*, true> _ExprResultStack_17;                   // 0x0110(0x0008)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class UExecution_execution_subscription*      __verse_0x00000000__12;                            // 0x0118(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_18;                         // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_19;                                        // 0x0128(0x0010)(HasGetValueTypeHash)
	struct ExecutionTestSuite_0::Ftuple_L_R       _ExprResult_20;                                    // 0x0138(0x0001)(HasGetValueTypeHash)
	TOptional<uint8>                              _ExprResultStack_21;                               // 0x0139(0x0002)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13B[0x5];                                      // 0x013B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TOptional<class UExecution_execution_subscription*, true> _AssignmentScratch_22;                 // 0x0140(0x0008)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class UExecution_execution_subscription*, true> _ExprResult_23;                        // 0x0148(0x0008)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class UExecution_execution_subscription*      _ExprResult_24;                                    // 0x0150(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UExecution_execution_subscribable*      __verse_0x00000000__14;                            // 0x0158(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_25;                                        // 0x0160(0x0010)(HasGetValueTypeHash)
	struct ExecutionTestSuite_0::Ftuple_Lfloat_Tvoid_M_QInterval_Nfloat_20_3d_20_2e_2e_2e_R _ExprResult_26; // 0x0170(0x0020)(HasGetValueTypeHash)
	TOptional<double>                             _ExprResult_27;                                    // 0x0190(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TOptional<class UExecution_execution_subscription*, true> _AssignmentScratch_28;                 // 0x01A0(0x0008)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class UExecution_execution_subscription*, true> _ExprResult_29;                        // 0x01A8(0x0008)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class UExecution_execution_subscription*      _ExprResult_30;                                    // 0x01B0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UExecution_execution_subscribable*      __verse_0x00000000__16;                            // 0x01B8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_31;                                        // 0x01C0(0x0010)(HasGetValueTypeHash)
	struct ExecutionTestSuite_0::Ftuple_Ltuple_L_R_Tvoid_M_QInterval_Nfloat_20_3d_20_2e_2e_2e_R _ExprResult_32; // 0x01D0(0x0020)(HasGetValueTypeHash)
	TOptional<double>                             _ExprResult_33;                                    // 0x01F0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ExecutionTestSuite_test_phase_user__L_2fUnrealEngine_2ecom_2fExecutionTestSuite_2ftest__phase__user_N_RInit_L_Nexecution__subscribable_M_Nlogic_R;

// Function ExecutionTestSuite.ExecutionTestSuite_test_phase_user._L_2fUnrealEngine_2ecom_2fExecutionTestSuite_2ftest__phase__user_N_ROnExecute
// 0x0038 (0x0038 - 0x0000)
struct ExecutionTestSuite_test_phase_user__L_2fUnrealEngine_2ecom_2fExecutionTestSuite_2ftest__phase__user_N_ROnExecute final
{
public:
	struct ExecutionTestSuite_0::Ftuple_L_R       __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_0;                          // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_1;                                         // 0x0008(0x0010)(HasGetValueTypeHash)
	struct ExecutionTestSuite_0::Ftuple_L_R       _ExprResult_2;                                     // 0x0018(0x0001)(HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_3;                          // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_4;                                         // 0x0020(0x0010)(HasGetValueTypeHash)
	struct ExecutionTestSuite_0::Ftuple_L_R       _ExprResult_5;                                     // 0x0030(0x0001)(HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ExecutionTestSuite_test_phase_user__L_2fUnrealEngine_2ecom_2fExecutionTestSuite_2ftest__phase__user_N_ROnExecute;

// Function ExecutionTestSuite.ExecutionTestSuite_test_phase_user._L_2fUnrealEngine_2ecom_2fExecutionTestSuite_2ftest__phase__user_N_ROnExecute2
// 0x0018 (0x0018 - 0x0000)
struct ExecutionTestSuite_test_phase_user__L_2fUnrealEngine_2ecom_2fExecutionTestSuite_2ftest__phase__user_N_ROnExecute2 final
{
public:
	struct ExecutionTestSuite_0::Ftuple_L_R       __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         _AssignmentScratch_0;                              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         _AssignmentScratch_1;                              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ExecutionTestSuite_test_phase_user__L_2fUnrealEngine_2ecom_2fExecutionTestSuite_2ftest__phase__user_N_ROnExecute2;

// Function ExecutionTestSuite.ExecutionTestSuite_test_phase_user._L_2fUnrealEngine_2ecom_2fExecutionTestSuite_2ftest__phase__user_N_ROnExecuteWithTime_L_Nfloat_R
// 0x0058 (0x0058 - 0x0000)
struct ExecutionTestSuite_test_phase_user__L_2fUnrealEngine_2ecom_2fExecutionTestSuite_2ftest__phase__user_N_ROnExecuteWithTime_L_Nfloat_R final
{
public:
	double                                        __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_0;                          // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_1;                                         // 0x0010(0x0010)(HasGetValueTypeHash)
	struct ExecutionTestSuite_0::Ftuple_L_R       _ExprResult_2;                                     // 0x0020(0x0001)(HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        _AssignmentScratch_3;                              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_4;                          // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_5;                                         // 0x0038(0x0010)(HasGetValueTypeHash)
	struct ExecutionTestSuite_0::Ftuple_L_R       _ExprResult_6;                                     // 0x0048(0x0001)(HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        _AssignmentScratch_7;                              // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ExecutionTestSuite_test_phase_user__L_2fUnrealEngine_2ecom_2fExecutionTestSuite_2ftest__phase__user_N_ROnExecuteWithTime_L_Nfloat_R;

// Function ExecutionTestSuite.ExecutionTestSuite_test_phase_user._L_2fUnrealEngine_2ecom_2fExecutionTestSuite_2ftest__phase__user_N_ROrderAfter_L_Ntest__phase__user_R
// 0x0088 (0x0088 - 0x0000)
struct ExecutionTestSuite_test_phase_user__L_2fUnrealEngine_2ecom_2fExecutionTestSuite_2ftest__phase__user_N_ROrderAfter_L_Ntest__phase__user_R final
{
public:
	class UExecutionTestSuite_test_phase_user*    __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UExecution_execution_subscription*      __verse_0xCF28E5A8_C_1;                            // 0x0008(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UExecution_execution_subscription*, true> _ExprResultStack_0;                    // 0x0010(0x0008)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class UExecution_execution_subscription*      __verse_0xC2BD6D73_AfterC_1;                       // 0x0018(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UExecution_execution_subscription*, true> _ExprResultStack_1;                    // 0x0020(0x0008)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class UExecution_execution_subscription*      __verse_0x00000000__2;                             // 0x0028(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_2;                          // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_3;                                         // 0x0038(0x0010)(HasGetValueTypeHash)
	class UExecution_execution_subscription*      __verse_0xCF28E5A8_C_3;                            // 0x0048(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UExecution_execution_subscription*, true> _ExprResultStack_4;                    // 0x0050(0x0008)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class UExecution_execution_subscription*      __verse_0xC2BD6D73_AfterC_3;                       // 0x0058(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UExecution_execution_subscription*, true> _ExprResultStack_5;                    // 0x0060(0x0008)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class UExecution_execution_subscription*      __verse_0x00000000__4;                             // 0x0068(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_6;                          // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_7;                                         // 0x0078(0x0010)(HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ExecutionTestSuite_test_phase_user__L_2fUnrealEngine_2ecom_2fExecutionTestSuite_2ftest__phase__user_N_ROrderAfter_L_Ntest__phase__user_R;

// Function ExecutionTestSuite.ExecutionTestSuite_test_phase_user._L_2fUnrealEngine_2ecom_2fExecutionTestSuite_2ftest__phase__user_N_ROrderBefore_L_Ntest__phase__user_R
// 0x0088 (0x0088 - 0x0000)
struct ExecutionTestSuite_test_phase_user__L_2fUnrealEngine_2ecom_2fExecutionTestSuite_2ftest__phase__user_N_ROrderBefore_L_Ntest__phase__user_R final
{
public:
	class UExecutionTestSuite_test_phase_user*    __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UExecution_execution_subscription*      __verse_0xCF28E5A8_C_1;                            // 0x0008(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UExecution_execution_subscription*, true> _ExprResultStack_0;                    // 0x0010(0x0008)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class UExecution_execution_subscription*      __verse_0x36F41A1B_BeforeC_1;                      // 0x0018(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UExecution_execution_subscription*, true> _ExprResultStack_1;                    // 0x0020(0x0008)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class UExecution_execution_subscription*      __verse_0x00000000__2;                             // 0x0028(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_2;                          // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_3;                                         // 0x0038(0x0010)(HasGetValueTypeHash)
	class UExecution_execution_subscription*      __verse_0xCF28E5A8_C_3;                            // 0x0048(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UExecution_execution_subscription*, true> _ExprResultStack_4;                    // 0x0050(0x0008)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class UExecution_execution_subscription*      __verse_0x36F41A1B_BeforeC_3;                      // 0x0058(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UExecution_execution_subscription*, true> _ExprResultStack_5;                    // 0x0060(0x0008)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class UExecution_execution_subscription*      __verse_0x00000000__4;                             // 0x0068(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_6;                          // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_7;                                         // 0x0078(0x0010)(HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ExecutionTestSuite_test_phase_user__L_2fUnrealEngine_2ecom_2fExecutionTestSuite_2ftest__phase__user_N_ROrderBefore_L_Ntest__phase__user_R;

// Function ExecutionTestSuite.ExecutionTestSuite_test_phases.$InitCDO
// 0x0070 (0x0070 - 0x0000)
struct ExecutionTestSuite_test_phases__InitCDO final
{
public:
	TOptional<class UExecution_execution_subscribable*, true> _ExprResult_0;                         // 0x0000(0x0008)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<EVerseFalse>                        __verse_0x00000000__1;                             // 0x0008(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_1 : 1;                                 // 0x000A(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	TOptional<EVerseFalse>                        _ExprResultStack_2;                                // 0x000B(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TOptional<class UExecution_execution_subscribable*, true> _ExprResult_3;                         // 0x0010(0x0008)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<EVerseFalse>                        __verse_0x00000000__3;                             // 0x0018(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_4 : 1;                                 // 0x001A(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	TOptional<EVerseFalse>                        _ExprResultStack_5;                                // 0x001B(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TOptional<class UExecution_execution_subscribable*, true> _ExprResult_6;                         // 0x0020(0x0008)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<EVerseFalse>                        __verse_0x00000000__5;                             // 0x0028(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_7 : 1;                                 // 0x002A(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	TOptional<EVerseFalse>                        _ExprResultStack_8;                                // 0x002B(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         _ExprResult_9;                                     // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TOptional<class UExecution_execution_subscribable*, true> _ExprResult_10;                        // 0x0038(0x0008)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<EVerseFalse>                        __verse_0x00000000__7;                             // 0x0040(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_11 : 1;                                // 0x0042(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	TOptional<EVerseFalse>                        _ExprResultStack_12;                               // 0x0043(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TOptional<class UExecution_execution_subscribable*, true> _ExprResult_13;                        // 0x0048(0x0008)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<EVerseFalse>                        __verse_0x00000000__9;                             // 0x0050(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_14 : 1;                                // 0x0052(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	TOptional<EVerseFalse>                        _ExprResultStack_15;                               // 0x0053(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TOptional<class UExecution_execution_subscribable*, true> _ExprResult_16;                        // 0x0058(0x0008)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<EVerseFalse>                        __verse_0x00000000__11;                            // 0x0060(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_17 : 1;                                // 0x0062(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	TOptional<EVerseFalse>                        _ExprResultStack_18;                               // 0x0063(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         _ExprResult_19;                                    // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ExecutionTestSuite_test_phases__InitCDO;

}

