#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FabricRuntime

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "MetasoundEngine_structs.hpp"
#include "Engine_classes.hpp"
#include "FabricRuntime_structs.hpp"
#include "PlayspaceSystem_classes.hpp"
#include "FortniteGame_classes.hpp"
#include "HarmonixDsp_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "FMCoreRuntime_structs.hpp"
#include "HarmonixMetasound_structs.hpp"
#include "HarmonixMidi_structs.hpp"


namespace SDK
{

// Class FabricRuntime.FabricAnimatableButtonInterface
// 0x0000 (0x0000 - 0x0000)
class IFabricAnimatableButtonInterface final
{
public:
	void PlayCloseAnimation();
	void PlayOpenAnimation();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FabricAnimatableButtonInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FabricAnimatableButtonInterface")
	}
	static class IFabricAnimatableButtonInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IFabricAnimatableButtonInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IFabricAnimatableButtonInterface;

// Class FabricRuntime.FabricButtonBase
// 0x0078 (0x0308 - 0x0290)
class AFabricButtonBase final : public AActor
{
public:
	uint8                                         Pad_290[0x10];                                     // 0x0290(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(class APlayerController* InteractingController, bool IsToggle)> ToggleStateChanged; // 0x02A0(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	double                                        OpenTimeSeconds;                                   // 0x02B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	double                                        CloseTimeSeconds;                                  // 0x02B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bHasToggle;                                        // 0x02C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EButtonPressMethod                            ClickMethod;                                       // 0x02C1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2C2[0x6];                                      // 0x02C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      InteractingController;                             // 0x02C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                 ButtonId;                                          // 0x02D0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FText                                   ButtonLabel;                                       // 0x02E0(0x0018)(Edit, BlueprintVisible, Protected, NativeAccessSpecifierProtected)
	bool                                          bEnabled;                                          // 0x02F8(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bHovered;                                          // 0x02F9(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bPressed;                                          // 0x02FA(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	ECheckBoxState                                ToggleState;                                       // 0x02FB(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2FC[0x4];                                      // 0x02FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFabricInteractableViewModel*           WidgetViewModel;                                   // 0x0300(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	class UTimelineComponent* GetCloseTimeline();
	class UTimelineComponent* GetOpenTimeline();
	void HandleButtonClicked();
	void HandleButtonDoubleClicked();
	void HandleButtonHovered();
	void HandleButtonPressed();
	void HandleButtonReleased();
	void HandleButtonUnhovered();
	bool IsEnabled();
	bool IsHovered();
	bool IsPressed();
	bool IsToggledOn();
	void OnButtonClicked();
	void OnButtonDoubleClicked();
	void OnButtonPressed();
	void OnButtonReleased();
	void OnDisabled();
	void OnEnabled();
	void OnHovered();
	void OnToggleStateChanged(bool bIsToggled);
	void OnUnhovered();
	void SetEnabled(bool bNewEnabled);
	void SetToggleState(bool bNewToggleState, bool bBroadcast, bool bForce);
	void SetWidgetViewModel(class UFabricInteractableViewModel* ViewModel);
	void SwapToggle();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FabricButtonBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FabricButtonBase")
	}
	static class AFabricButtonBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFabricButtonBase>();
	}
};
DUMPER7_ASSERTS_AFabricButtonBase;

// Class FabricRuntime.FabricButtonComponentBase
// 0x0090 (0x0650 - 0x05C0)
class UFabricButtonComponentBase final : public UStaticMeshComponent
{
public:
	uint8                                         Pad_5C0[0x10];                                     // 0x05C0(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(class APlayerController* InteractingController, bool IsToggle)> ToggleStateChanged; // 0x05D0(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	double                                        OpenTimeSeconds;                                   // 0x05E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	double                                        CloseTimeSeconds;                                  // 0x05E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bHasToggle;                                        // 0x05F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EButtonPressMethod                            ClickMethod;                                       // 0x05F1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_5F2[0x6];                                      // 0x05F2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      InteractingController;                             // 0x05F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                 ButtonId;                                          // 0x0600(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FText                                   ButtonLabel;                                       // 0x0610(0x0018)(Edit, BlueprintVisible, Protected, NativeAccessSpecifierProtected)
	bool                                          bUseScreenGrid;                                    // 0x0628(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_629[0x7];                                      // 0x0629(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              ScreenGridPosition;                                // 0x0630(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bEnabled;                                          // 0x0640(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bHovered;                                          // 0x0641(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bPressed;                                          // 0x0642(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	ECheckBoxState                                ToggleState;                                       // 0x0643(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_644[0x4];                                      // 0x0644(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFabricInteractableViewModel*           WidgetViewModel;                                   // 0x0648(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void ConstructButton();
	class UTimelineComponent* GetCloseTimeline();
	class UTimelineComponent* GetOpenTimeline();
	void HandleButtonClicked();
	void HandleButtonDoubleClicked();
	void HandleButtonHovered();
	void HandleButtonPressed();
	void HandleButtonReleased();
	void HandleButtonUnhovered();
	bool IsEnabled();
	bool IsHovered();
	bool IsPressed();
	bool IsToggledOn();
	void OnButtonClicked();
	void OnButtonDoubleClicked();
	void OnButtonPressed();
	void OnButtonReleased();
	void OnDisabled();
	void OnEnabled();
	void OnHovered();
	void OnToggleStateChanged(bool bIsToggled);
	void OnUnhovered();
	void SetEnabled(bool bNewEnabled);
	void SetToggleState(bool bNewToggleState, bool bBroadcast, bool bForce);
	void SetWidgetViewModel(class UFabricInteractableViewModel* ViewModel);
	void SwapToggle();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FabricButtonComponentBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FabricButtonComponentBase")
	}
	static class UFabricButtonComponentBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFabricButtonComponentBase>();
	}
};
DUMPER7_ASSERTS_UFabricButtonComponentBase;

// Class FabricRuntime.FabricDevice
// 0x0000 (0x0000 - 0x0000)
class IFabricDevice final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FabricDevice")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FabricDevice")
	}
	static class IFabricDevice* GetDefaultObj()
	{
		return GetDefaultObjImpl<IFabricDevice>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IFabricDevice;

// Class FabricRuntime.FabricMetaSoundPatchOwner
// 0x0000 (0x0000 - 0x0000)
class IFabricMetaSoundPatchOwner final
{
public:
	class UFabricMetaSoundPatchWrapper* GetMetaSoundPatchWrapper();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FabricMetaSoundPatchOwner")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FabricMetaSoundPatchOwner")
	}
	static class IFabricMetaSoundPatchOwner* GetDefaultObj()
	{
		return GetDefaultObjImpl<IFabricMetaSoundPatchOwner>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IFabricMetaSoundPatchOwner;

// Class FabricRuntime.FabricAudioGenerator
// 0x0000 (0x0000 - 0x0000)
class IFabricAudioGenerator final
{
public:
	struct FSourceEffectChainEntry GetAudioAnalyzer();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FabricAudioGenerator")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FabricAudioGenerator")
	}
	static class IFabricAudioGenerator* GetDefaultObj()
	{
		return GetDefaultObjImpl<IFabricAudioGenerator>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IFabricAudioGenerator;

// Class FabricRuntime.FabricAudioModifier
// 0x0000 (0x0000 - 0x0000)
class IFabricAudioModifier final
{
public:
	TArray<struct FSourceEffectChainEntry> GetSourceEffectChainEntries();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FabricAudioModifier")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FabricAudioModifier")
	}
	static class IFabricAudioModifier* GetDefaultObj()
	{
		return GetDefaultObjImpl<IFabricAudioModifier>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IFabricAudioModifier;

// Class FabricRuntime.FabricAudioReceiver
// 0x0000 (0x0000 - 0x0000)
class IFabricAudioReceiver final
{
public:
	class USoundSourceBus* GetSoundSourceBus();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FabricAudioReceiver")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FabricAudioReceiver")
	}
	static class IFabricAudioReceiver* GetDefaultObj()
	{
		return GetDefaultObjImpl<IFabricAudioReceiver>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IFabricAudioReceiver;

// Class FabricRuntime.FabricFloatGenerator
// 0x0000 (0x0000 - 0x0000)
class IFabricFloatGenerator final
{
public:
	class UFabricFloatProviderBase* GetFloatProvider();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FabricFloatGenerator")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FabricFloatGenerator")
	}
	static class IFabricFloatGenerator* GetDefaultObj()
	{
		return GetDefaultObjImpl<IFabricFloatGenerator>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IFabricFloatGenerator;

// Class FabricRuntime.FabricFloatReceiver
// 0x0000 (0x0000 - 0x0000)
class IFabricFloatReceiver final
{
public:
	void SetFloatProviders(const TArray<class UFabricFloatProviderBase*>& FloatProvider);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FabricFloatReceiver")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FabricFloatReceiver")
	}
	static class IFabricFloatReceiver* GetDefaultObj()
	{
		return GetDefaultObjImpl<IFabricFloatReceiver>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IFabricFloatReceiver;

// Class FabricRuntime.FabricTextureGenerator
// 0x0000 (0x0000 - 0x0000)
class IFabricTextureGenerator final
{
public:
	class UFabricTextureProviderBase* GetTextureProvider();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FabricTextureGenerator")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FabricTextureGenerator")
	}
	static class IFabricTextureGenerator* GetDefaultObj()
	{
		return GetDefaultObjImpl<IFabricTextureGenerator>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IFabricTextureGenerator;

// Class FabricRuntime.FabricTextureModifier
// 0x0000 (0x0000 - 0x0000)
class IFabricTextureModifier final
{
public:
	class UFabricTextureModifierBase* GetTextureModifier();

	bool IsShowingTexturePreview() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FabricTextureModifier")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FabricTextureModifier")
	}
	static class IFabricTextureModifier* GetDefaultObj()
	{
		return GetDefaultObjImpl<IFabricTextureModifier>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IFabricTextureModifier;

// Class FabricRuntime.FabricTextureReceiver
// 0x0000 (0x0000 - 0x0000)
class IFabricTextureReceiver final
{
public:
	void OnTexturesChanged(const TArray<struct FFabricTextureProviderTexture>& Texture);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FabricTextureReceiver")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FabricTextureReceiver")
	}
	static class IFabricTextureReceiver* GetDefaultObj()
	{
		return GetDefaultObjImpl<IFabricTextureReceiver>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IFabricTextureReceiver;

// Class FabricRuntime.FabricMeshGenerator
// 0x0000 (0x0000 - 0x0000)
class IFabricMeshGenerator final
{
public:
	class UFabricMeshProviderBase* GetMeshProvider();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FabricMeshGenerator")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FabricMeshGenerator")
	}
	static class IFabricMeshGenerator* GetDefaultObj()
	{
		return GetDefaultObjImpl<IFabricMeshGenerator>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IFabricMeshGenerator;

// Class FabricRuntime.FabricMeshModifier
// 0x0000 (0x0000 - 0x0000)
class IFabricMeshModifier final
{
public:
	void OnMeshesChanged(const TArray<struct FFabricMeshInstanceReference>& InstanceMeshReferences, bool bInstancesChanged);

	class UFabricMeshModifierBase* GetMeshModifier() const;
	bool IsShowingMeshPreview() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FabricMeshModifier")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FabricMeshModifier")
	}
	static class IFabricMeshModifier* GetDefaultObj()
	{
		return GetDefaultObjImpl<IFabricMeshModifier>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IFabricMeshModifier;

// Class FabricRuntime.FabricMeshReceiver
// 0x0000 (0x0000 - 0x0000)
class IFabricMeshReceiver final
{
public:
	void OnMeshInstanceReferencesChanged(const TArray<struct FFabricMeshInstanceReference>& MeshInstanceReferences, bool bMeshChanged, bool bInstancesChanged);
	void OnMeshInstancesChanged(const TArray<struct FTransform>& Meshes);
	void OnMeshReferenceChanged(const struct FFabricMeshProviderMeshReference& ReferenceMesh);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FabricMeshReceiver")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FabricMeshReceiver")
	}
	static class IFabricMeshReceiver* GetDefaultObj()
	{
		return GetDefaultObjImpl<IFabricMeshReceiver>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IFabricMeshReceiver;

// Class FabricRuntime.FabricModulationNode
// 0x0020 (0x0048 - 0x0028)
class UFabricModulationNode final : public UObject
{
public:
	TArray<class UFabricFloatProviderBase*>       FloatProviders;                                    // 0x0028(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPublic)
	uint8                                         Pad_38[0x10];                                      // 0x0038(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FabricModulationNode")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FabricModulationNode")
	}
	static class UFabricModulationNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFabricModulationNode>();
	}
};
DUMPER7_ASSERTS_UFabricModulationNode;

// Class FabricRuntime.FabricModulatable
// 0x0300 (0x0328 - 0x0028)
class UFabricModulatable : public UObject
{
public:
	uint8                                         Pad_28[0x4];                                       // 0x0028(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TWeakObjectPtr<class AActor>                  ModulatedActor;                                    // 0x002C(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         ModulatorParams;                                   // 0x0038(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	TSet<class FName>                             NonModulatedParamsWithCallbacks;                   // 0x0048(0x0050)(Transient, NativeAccessSpecifierPrivate)
	TMap<class FString, TWeakObjectPtr<class UObject>> Modulators;                                   // 0x0098(0x0050)(Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	TMap<class FName, class FName>                LastBroadcastedValues;                             // 0x00E8(0x0050)(Transient, NativeAccessSpecifierPrivate)
	TArray<TWeakObjectPtr<class UObject>>         ModulatorSources;                                  // 0x0138(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                         Pad_148[0x1E0];                                    // 0x0148(0x01E0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnAnyOptionUpdated();
	void OnModulatedPropertyChanged(const class FString& Value, class UObject* ModulatorObject);
	void OnModulatorFloatProviderConnectionChanged(bool bConnected, class UObject* ModulatorObject);
	void OnOptionsLoaded();

	class AActor* GetModulatedActor() const;
	bool GetModulatedBool(const class FString& Param, const struct FMidiSongPos& SongPos, bool* OutBool) const;
	bool GetModulatedEnum(const class FString& Param, const struct FMidiSongPos& SongPos, uint8* OutEnum) const;
	bool GetModulatedFloat(const class FString& Param, const struct FMidiSongPos& SongPos, float* OutFloat) const;
	bool GetModulatedInt(const class FString& Param, const struct FMidiSongPos& SongPos, int32* OutInt) const;
	bool GetModulatedString(const class FString& Param, const struct FMidiSongPos& SongPos, class FString* OutString) const;
	bool IsParamModulated(const class FString& Param) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FabricModulatable")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FabricModulatable")
	}
	static class UFabricModulatable* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFabricModulatable>();
	}
};
DUMPER7_ASSERTS_UFabricModulatable;

// Class FabricRuntime.FabricFloatProviderBase
// 0x0048 (0x0370 - 0x0328)
class UFabricFloatProviderBase : public UFabricModulatable
{
public:
	uint8                                         Pad_328[0x8];                                      // 0x0328(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(float float)>   OnFloatChanged;                                    // 0x0330(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	float                                         CurrentFloat;                                      // 0x0340(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class UMusicClockComponent>    MusicClock;                                        // 0x0344(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_34C[0x4];                                      // 0x034C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFabricMetaSoundModulatorPatchWrapper*  AssociatedPatchWrapper;                            // 0x0350(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                 EnabledParam;                                      // 0x0358(0x0010)(Edit, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bAlwaysModulates;                                  // 0x0368(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bBindBlueprintOnFloatChanged;                      // 0x0369(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsEnabled;                                        // 0x036A(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bModulatorValueChanged;                            // 0x036B(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_36C[0x4];                                      // 0x036C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ReceiveTick(float DeltaSeconds);
	void SetAssociatedPatchWrapper(class UFabricMetaSoundModulatorPatchWrapper* PatchWrapper);
	void SetMusicClock(class UMusicClockComponent* NewMusicClock);
	void SetProviderEnabled(bool bInIsEnabled);

	class UFabricMetaSoundModulatorPatchWrapper* GetAssociatedPatchWrapper() const;
	float GetCurrentFloat() const;
	struct FMidiSongPos GetCurrentSongPos() const;
	struct FMidiSongPos GetCurrentSongPosWithOffset(float OffsetSeconds) const;
	float GetFloatAtSongPos(const struct FMidiSongPos& SongPos) const;
	EFabricFloatProviderType GetFloatProviderType() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FabricFloatProviderBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FabricFloatProviderBase")
	}
	static class UFabricFloatProviderBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFabricFloatProviderBase>();
	}
};
DUMPER7_ASSERTS_UFabricFloatProviderBase;

// Class FabricRuntime.FabricFloatProviderWave
// 0x0150 (0x04C0 - 0x0370)
class UFabricFloatProviderWave final : public UFabricFloatProviderBase
{
public:
	class FString                                 WaveShapeParam;                                    // 0x0370(0x0010)(Edit, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                 FreeHzParam;                                       // 0x0380(0x0010)(Edit, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                 MinParam;                                          // 0x0390(0x0010)(Edit, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                 MaxParam;                                          // 0x03A0(0x0010)(Edit, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                 BeatDurationParam;                                 // 0x03B0(0x0010)(Edit, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                 BeatOffsetParam;                                   // 0x03C0(0x0010)(Edit, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                 ShapeParam;                                        // 0x03D0(0x0010)(Edit, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                 StyleParam;                                        // 0x03E0(0x0010)(Edit, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         PhaseCPDIndex;                                     // 0x03F0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         ValueCPDIndex;                                     // 0x03F4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3F8[0x78];                                     // 0x03F8(0x0078)(Fixing Size After Last Property [ Dumper-7 ])
	TSet<TWeakObjectPtr<class UStaticMeshComponent>> PreviewDisplayMeshes;                           // 0x0470(0x0050)(ExportObject, Transient, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPrivate)

public:
	void AddPreviewDisplayMesh(class UStaticMeshComponent* Mesh);
	void ClearPreviewDisplayMeshes();
	TArray<class UStaticMeshComponent*> GetPreviewDisplayMeshes();
	void RemovePreviewDisplayMesh(class UStaticMeshComponent* Mesh);
	void SetFreePhase(float InFreePhase);
	void SetRandomSeedByGuid(const struct FGuid& InRandomGuid);

	float GetCurrentFreePhase() const;
	float GetCurrentPhase() const;
	int32 GetRandomSeed() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FabricFloatProviderWave")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FabricFloatProviderWave")
	}
	static class UFabricFloatProviderWave* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFabricFloatProviderWave>();
	}
};
DUMPER7_ASSERTS_UFabricFloatProviderWave;

// Class FabricRuntime.FabricFloatProviderStep
// 0x0078 (0x03E8 - 0x0370)
class UFabricFloatProviderStep final : public UFabricFloatProviderBase
{
public:
	class FString                                 StepRateParam;                                     // 0x0370(0x0010)(Edit, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                 ActiveStepsParam;                                  // 0x0380(0x0010)(Edit, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                 StepParamBase;                                     // 0x0390(0x0010)(Edit, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         MaxSteps;                                          // 0x03A0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3A4[0x4];                                      // 0x03A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFabricStepGenerator                   RuntimeGenerator;                                  // 0x03A8(0x0020)(BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	TMulticastInlineDelegate<void()>              OnFloatProviderStepInitialized;                    // 0x03C8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_3D8[0x10];                                     // 0x03D8(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	float GetStepLengthBeats() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FabricFloatProviderStep")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FabricFloatProviderStep")
	}
	static class UFabricFloatProviderStep* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFabricFloatProviderStep>();
	}
};
DUMPER7_ASSERTS_UFabricFloatProviderStep;

// Class FabricRuntime.FabricFloatProviderValueSetter
// 0x0080 (0x03F0 - 0x0370)
class UFabricFloatProviderValueSetter final : public UFabricFloatProviderBase
{
public:
	class FString                                 ValueParam;                                        // 0x0370(0x0010)(Edit, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                 TransitionTimingParam;                             // 0x0380(0x0010)(Edit, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_390[0x60];                                     // 0x0390(0x0060)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	float BroadcastCurrentValue(float OverriddenBeat);

	float CalculateTransitionTiming() const;
	bool CanUsePredictiveBeatBroadcasting() const;
	float GetUpdateBeat() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FabricFloatProviderValueSetter")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FabricFloatProviderValueSetter")
	}
	static class UFabricFloatProviderValueSetter* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFabricFloatProviderValueSetter>();
	}
};
DUMPER7_ASSERTS_UFabricFloatProviderValueSetter;

// Class FabricRuntime.FabricHoldable
// 0x0000 (0x0000 - 0x0000)
class IFabricHoldable final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FabricHoldable")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FabricHoldable")
	}
	static class IFabricHoldable* GetDefaultObj()
	{
		return GetDefaultObjImpl<IFabricHoldable>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IFabricHoldable;

// Class FabricRuntime.FabricInteractableControllerComponent
// 0x0078 (0x0118 - 0x00A0)
class UFabricInteractableControllerComponent final : public UActorComponent
{
public:
	uint8                                         Pad_A0[0x8];                                       // 0x00A0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              OnNoInteractablesHit;                              // 0x00A8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class AFortPlayerController*                  PlayerController;                                  // 0x00B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class AFortPlayerPawn*                        PlayerPawn;                                        // 0x00C0(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UFortGadgetItemDefinition> FabricInteractionToolItemDefSoftPtr;             // 0x00C8(0x0020)(Edit, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortGadgetItemDefinition*              FabricInteractionToolItemDef;                      // 0x00E8(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_F0[0x8];                                       // 0x00F0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftClassPtr<class UClass>                   SoftFabricDeviceBaseClass;                         // 0x00F8(0x0020)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void ClientReceiveDoesIslandContainFabricDevices(const bool bIslandContainsFabricDevices);
	void EnsurePlayerHasInteractionTool();
	void GiveBackInteractionTool();
	void OnCreativeModeEnabledChangedDelegate(bool bCreativeEnabled);
	void ServerGivePlayerFabricInteractionTool();
	void ServerRequestDoesIslandContainFabricDevices();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FabricInteractableControllerComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FabricInteractableControllerComponent")
	}
	static class UFabricInteractableControllerComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFabricInteractableControllerComponent>();
	}
};
DUMPER7_ASSERTS_UFabricInteractableControllerComponent;

// Class FabricRuntime.FabricInteractable
// 0x0000 (0x0000 - 0x0000)
class IFabricInteractable final
{
public:
	bool CanInteractWithHoldable(const TScriptInterface<class IFabricHoldable>& Holdable);
	void EndInteraction(class APlayerController* PlayerController, bool bWasDragAndDropInteraction);
	EFabricContinuousInteractionDirection GetContinuousInteractableDirection();
	float GetContinuousInteractableValueNormalized();
	struct FVector GetInteractableComponentLocation(class USceneComponent* Interactable);
	struct FVector GetInteractableForwardVector(class USceneComponent* Interactable);
	EFabricInteractableType GetInteractableType();
	class UAudioComponent* GetInteractionSFX();
	class UObject* GetLinkedInteractable();
	bool IsFocusDependentOnInteractionContext(class APlayerController* Controller);
	bool IsValidToInteractWith(class APlayerController* Controller);
	void OnInteractionFocusTargetChanged(class APlayerController* Controller, class UObject* FocusTarget, bool bIsFocused);
	void SetFocused(bool bIsFocused);
	void SetHitComponent(class USceneComponent* HitComponent);
	void SetInteractable(bool bInteractable);
	bool ShouldPassInteractionToComponent(class AFabricInteractionTool* InteractionTool);
	void StartInteraction(class APlayerController* Controller);
	void StartSpecialInteraction(class APlayerController* Controller);

	bool DoesInteractionRequireHoldable() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FabricInteractable")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FabricInteractable")
	}
	static class IFabricInteractable* GetDefaultObj()
	{
		return GetDefaultObjImpl<IFabricInteractable>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IFabricInteractable;

// Class FabricRuntime.FabricInteractablePlayspaceComponent
// 0x0050 (0x00F0 - 0x00A0)
class UFabricInteractablePlayspaceComponent final : public UPlayspaceComponent
{
public:
	uint8                                         Pad_A0[0x50];                                      // 0x00A0(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnDownloadOnDemandCompleteIndividualClient(const struct FEventMessageTag& Channel, const struct FClientFinishedDownloadOnDemand& Context);
	void OnPlayspaceUserAdded(const struct FPlayspaceUser& PlayspaceUser);
	void SetFabricDeviceExistsInPlayspace();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FabricInteractablePlayspaceComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FabricInteractablePlayspaceComponent")
	}
	static class UFabricInteractablePlayspaceComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFabricInteractablePlayspaceComponent>();
	}
};
DUMPER7_ASSERTS_UFabricInteractablePlayspaceComponent;

// Class FabricRuntime.FabricInteractionTool
// 0x0198 (0x16B0 - 0x1518)
class AFabricInteractionTool final : public AFortWeapon
{
public:
	TMulticastInlineDelegate<void(EFabricInteractionToolStates NewState, class AFortCreativeDeviceProp* Device)> OnInteractionStateChanged; // 0x1518(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class AFortCreativeDeviceProp* Device)> OnCablesGrabbed;           // 0x1528(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class AFortCreativeDeviceProp* Device)> OnCablesDropped;           // 0x1538(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(float CrossfadeSeconds)> OnMetasoundGeneratorCrossfadeStarted;     // 0x1548(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class USplineComponent*                       SplineComponent;                                   // 0x1558(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         MaxRange;                                          // 0x1560(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         MinDragAndDropTriggerTime;                         // 0x1564(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         FiringRate;                                        // 0x1568(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         SplineEndForwardMultiplier;                        // 0x156C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         SplineStartForwardMultiplier;                      // 0x1570(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1574[0x4];                                     // 0x1574(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                HoveredInteractable;                               // 0x1578(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USceneComponent*                        HoveredInteractableHitComponent;                   // 0x1580(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UObject*                                PressedInteractable;                               // 0x1588(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TWeakObjectPtr<class UObject>                 LastPressedInteractable;                           // 0x1590(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USceneComponent*                        PressedInteractableHitComponent;                   // 0x1598(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TWeakObjectPtr<class AFortCreativeDeviceProp> InteractableOwnerDevice;                           // 0x15A0(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         AccumulatedDragAndDropTriggerTime;                 // 0x15A8(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FInteractionData                       ServerInteractionData;                             // 0x15AC(0x000C)(Net, Transient, RepNotify, NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_15B8[0x11];                                    // 0x15B8(0x0011)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bServerTriggerPressed;                             // 0x15C9(0x0001)(Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_15CA[0x1];                                     // 0x15CA(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bServerIsHoldingCable;                             // 0x15CB(0x0001)(Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_15CC[0x14];                                    // 0x15CC(0x0014)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInteractionSplinePoints               ServerSplinePoints;                                // 0x15E0(0x0060)(Net, Transient, NoDestructor, NativeAccessSpecifierPrivate)
	float                                         ServerContinuousInteractableValue;                 // 0x1640(0x0004)(Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1644[0x6C];                                    // 0x1644(0x006C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ClientDeactiveWeaponAndState();
	void ClientStopInteracting();
	void DeactiveWeaponAndState();
	float GetContinuousInteractableValueNormalized();
	EFabricContinuousInteractionDirection GetContinuousInteractionDirection();
	float GetContinuousMovementValue();
	int32 GetContinuousStateValue();
	EFabricInteractionToolStates GetFabricInteractionToolState();
	class USceneComponent* GetHoveredInteractableHitComponent();
	EFabricInteractableType GetHoveredInteractableType();
	class UObject* GetPressedInteractable();
	void HandleMetasoundGeneratorCrossfade(float CrossfadeSeconds);
	bool IsHoldingCables();
	void OnRep_ServerContinuousInteractableValue();
	void OnRep_ServerInteractionData();
	void OnRep_ServerIsHoldingCable();
	void OnRep_ServerTriggerPressed();
	void OnSplineUpdated(EFabricInteractionToolStates NewInteractionState);
	void ServerHandleFITFired();
	void ServerSetContinuousInteractableValue(float Value);
	void ServerSetInteractionData(const struct FInteractionData& NewData);
	void ServerSetIsHoldingCable(bool bHoldingCable);
	void ServerSetSplinePoints(const struct FInteractionSplinePoints& SplinePoints);
	void ServerSetTriggerPressed(bool bPressed);
	void UnholsterWeapon();

	bool IsRunningOnOwningClient() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FabricInteractionTool")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FabricInteractionTool")
	}
	static class AFabricInteractionTool* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFabricInteractionTool>();
	}
};
DUMPER7_ASSERTS_AFabricInteractionTool;

// Class FabricRuntime.FabricMeshModifierBase
// 0x0008 (0x0330 - 0x0328)
class UFabricMeshModifierBase : public UFabricModulatable
{
public:
	EFabricCloneTransformBehavior                 CloneBehavior;                                     // 0x0328(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_329[0x7];                                      // 0x0329(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FabricMeshModifierBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FabricMeshModifierBase")
	}
	static class UFabricMeshModifierBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFabricMeshModifierBase>();
	}
};
DUMPER7_ASSERTS_UFabricMeshModifierBase;

// Class FabricRuntime.FabricMeshModifierTranslate
// 0x0018 (0x0348 - 0x0330)
class UFabricMeshModifierTranslate final : public UFabricMeshModifierBase
{
public:
	struct FVector                                PositionOffset;                                    // 0x0330(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FabricMeshModifierTranslate")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FabricMeshModifierTranslate")
	}
	static class UFabricMeshModifierTranslate* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFabricMeshModifierTranslate>();
	}
};
DUMPER7_ASSERTS_UFabricMeshModifierTranslate;

// Class FabricRuntime.FabricMeshModifierRotate
// 0x0018 (0x0348 - 0x0330)
class UFabricMeshModifierRotate final : public UFabricMeshModifierBase
{
public:
	struct FRotator                               RotationAmount;                                    // 0x0330(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FabricMeshModifierRotate")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FabricMeshModifierRotate")
	}
	static class UFabricMeshModifierRotate* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFabricMeshModifierRotate>();
	}
};
DUMPER7_ASSERTS_UFabricMeshModifierRotate;

// Class FabricRuntime.FabricMeshModifierScale
// 0x0018 (0x0348 - 0x0330)
class UFabricMeshModifierScale final : public UFabricMeshModifierBase
{
public:
	struct FVector                                ScaleFactor;                                       // 0x0330(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FabricMeshModifierScale")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FabricMeshModifierScale")
	}
	static class UFabricMeshModifierScale* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFabricMeshModifierScale>();
	}
};
DUMPER7_ASSERTS_UFabricMeshModifierScale;

// Class FabricRuntime.FabricMeshModifierClone
// 0x0028 (0x0358 - 0x0330)
class UFabricMeshModifierClone final : public UFabricMeshModifierBase
{
public:
	int32                                         CloneCount;                                        // 0x0330(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_334[0x4];                                      // 0x0334(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                PerCloneTranslation;                               // 0x0338(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCentered;                                         // 0x0350(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_351[0x7];                                      // 0x0351(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FabricMeshModifierClone")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FabricMeshModifierClone")
	}
	static class UFabricMeshModifierClone* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFabricMeshModifierClone>();
	}
};
DUMPER7_ASSERTS_UFabricMeshModifierClone;

// Class FabricRuntime.FabricMeshModifierRandomize
// 0x0068 (0x0398 - 0x0330)
class UFabricMeshModifierRandomize final : public UFabricMeshModifierBase
{
public:
	float                                         LocationRandLimit;                                 // 0x0330(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RotationRandLimit;                                 // 0x0334(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ScaleRandLimit;                                    // 0x0338(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_33C[0x4];                                      // 0x033C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                LocationRandRange;                                 // 0x0340(0x0018)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                RotationRandRange;                                 // 0x0358(0x0018)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ScaleRandRangeAdditive;                            // 0x0370(0x0018)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ScaleRandRangeRangeBase;                           // 0x0388(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUniformScale;                                     // 0x038C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_38D[0x3];                                      // 0x038D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRandomStream                          RandomStream;                                      // 0x0390(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FabricMeshModifierRandomize")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FabricMeshModifierRandomize")
	}
	static class UFabricMeshModifierRandomize* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFabricMeshModifierRandomize>();
	}
};
DUMPER7_ASSERTS_UFabricMeshModifierRandomize;

// Class FabricRuntime.FabricMeshTreeNode
// 0x0080 (0x00A8 - 0x0028)
class UFabricMeshTreeNode final : public UObject
{
public:
	class UFabricMeshModifierBase*                MeshModifier;                                      // 0x0028(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFabricMeshProviderMeshReferenceParams Params_0;                                          // 0x0030(0x0028)(BlueprintVisible, NativeAccessSpecifierPublic)
	struct FFabricMeshProviderMeshReference       MeshProviderReference;                             // 0x0058(0x0038)(BlueprintVisible, BlueprintReadOnly, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UFabricMeshTreeNode*>            Children;                                          // 0x0090(0x0010)(BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	uint32                                        LastCalculatedChecksum;                            // 0x00A0(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAllowChecksumCalculation;                         // 0x00A4(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A5[0x3];                                       // 0x00A5(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
