#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FirstPlaceHighlightActor

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function FirstPlaceHighlightActor.FirstPlaceHighlightActor_C.UserConstructionScript
// 0x0008 (0x0008 - 0x0000)
struct FirstPlaceHighlightActor_C_UserConstructionScript final
{
public:
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FirstPlaceHighlightActor_C_UserConstructionScript;

// Function FirstPlaceHighlightActor.FirstPlaceHighlightActor_C.SpectatorCameraTypeChanged
// 0x0001 (0x0001 - 0x0000)
struct FirstPlaceHighlightActor_C_SpectatorCameraTypeChanged final
{
public:
	ESpectatorCameraType                          NewCameraType;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FirstPlaceHighlightActor_C_SpectatorCameraTypeChanged;

// Function FirstPlaceHighlightActor.FirstPlaceHighlightActor_C.PlayerTeamColorChanged
// 0x0010 (0x0010 - 0x0000)
struct FirstPlaceHighlightActor_C_PlayerTeamColorChanged final
{
public:
	struct FLinearColor                           TeamColor;                                         // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FirstPlaceHighlightActor_C_PlayerTeamColorChanged;

// Function FirstPlaceHighlightActor.FirstPlaceHighlightActor_C.FirstPlaceHighlightEnabledChanged
// 0x0001 (0x0001 - 0x0000)
struct FirstPlaceHighlightActor_C_FirstPlaceHighlightEnabledChanged final
{
public:
	bool                                          bInFirstPlaceHighlightEnabled;                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FirstPlaceHighlightActor_C_FirstPlaceHighlightEnabledChanged;

// Function FirstPlaceHighlightActor.FirstPlaceHighlightActor_C.ExecuteUbergraph_FirstPlaceHighlightActor
// 0x0030 (0x0030 - 0x0000)
struct FirstPlaceHighlightActor_C_ExecuteUbergraph_FirstPlaceHighlightActor final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInFirstPlaceHighlightEnabled;        // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Event_TeamColor;                            // 0x0014(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldBeVisible_ReturnValue;              // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESpectatorCameraType                          K2Node_Event_NewCameraType;                        // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldBeVisible_ReturnValue_1;            // 0x0026(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInBeingFollowedBySpectatorCam;       // 0x0027(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldBeVisible_ReturnValue_2;            // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FirstPlaceHighlightActor_C_ExecuteUbergraph_FirstPlaceHighlightActor;

// Function FirstPlaceHighlightActor.FirstPlaceHighlightActor_C.BeingFollowedBySpectatorCamChanged
// 0x0001 (0x0001 - 0x0000)
struct FirstPlaceHighlightActor_C_BeingFollowedBySpectatorCamChanged final
{
public:
	bool                                          bInBeingFollowedBySpectatorCam;                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FirstPlaceHighlightActor_C_BeingFollowedBySpectatorCamChanged;

}

