#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FMCalibrationRuntime

#include "Basic.hpp"

#include "FMCalibrationRuntime_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function FMCalibrationRuntime.BeatmatchCalibrationHelper.CalcCalibrationResult
// 0x0020 (0x0020 - 0x0000)
struct BeatmatchCalibrationHelper_CalcCalibrationResult final
{
public:
	TArray<float>                                 Samples;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	float                                         BPS;                                               // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECalibrationState                             ResultingState;                                    // 0x0014(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ResultMs;                                          // 0x0018(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_BeatmatchCalibrationHelper_CalcCalibrationResult;

// Function FMCalibrationRuntime.FMCalibrationControllerComponent.SendToggleModalMessage
// 0x0010 (0x0010 - 0x0000)
struct FMCalibrationControllerComponent_SendToggleModalMessage final
{
public:
	class AActor*                                 ContextActor;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          UsePreamble;                                       // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsAutoLaunch;                                     // 0x0009(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FMCalibrationControllerComponent_SendToggleModalMessage;

// Function FMCalibrationRuntime.FMCalibrationControllerComponent.SetAudioLatencyMs
// 0x0004 (0x0004 - 0x0000)
struct FMCalibrationControllerComponent_SetAudioLatencyMs final
{
public:
	float                                         LatencyMs;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FMCalibrationControllerComponent_SetAudioLatencyMs;

// Function FMCalibrationRuntime.FMCalibrationControllerComponent.SetHasTalkedWithRoadie
// 0x0001 (0x0001 - 0x0000)
struct FMCalibrationControllerComponent_SetHasTalkedWithRoadie final
{
public:
	bool                                          bHasTalkedWithRoadie;                              // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FMCalibrationControllerComponent_SetHasTalkedWithRoadie;

// Function FMCalibrationRuntime.FMCalibrationControllerComponent.SetIsAutolaunchDisabled
// 0x0001 (0x0001 - 0x0000)
struct FMCalibrationControllerComponent_SetIsAutolaunchDisabled final
{
public:
	bool                                          bAutolaunchDisabled;                               // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FMCalibrationControllerComponent_SetIsAutolaunchDisabled;

// Function FMCalibrationRuntime.FMCalibrationControllerComponent.SetIsCalibrated
// 0x0001 (0x0001 - 0x0000)
struct FMCalibrationControllerComponent_SetIsCalibrated final
{
public:
	bool                                          bCalibrated;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FMCalibrationControllerComponent_SetIsCalibrated;

// Function FMCalibrationRuntime.FMCalibrationControllerComponent.SetIsCalibrationDebugEnabled
// 0x0001 (0x0001 - 0x0000)
struct FMCalibrationControllerComponent_SetIsCalibrationDebugEnabled final
{
public:
	bool                                          bCalibrationDebugEnabled;                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FMCalibrationControllerComponent_SetIsCalibrationDebugEnabled;

// Function FMCalibrationRuntime.FMCalibrationControllerComponent.SetIsPreambleDisabled
// 0x0001 (0x0001 - 0x0000)
struct FMCalibrationControllerComponent_SetIsPreambleDisabled final
{
public:
	bool                                          bPreambleDisabled;                                 // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FMCalibrationControllerComponent_SetIsPreambleDisabled;

// Function FMCalibrationRuntime.FMCalibrationControllerComponent.SetVideoLatencyMs
// 0x0004 (0x0004 - 0x0000)
struct FMCalibrationControllerComponent_SetVideoLatencyMs final
{
public:
	float                                         LatencyMs;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FMCalibrationControllerComponent_SetVideoLatencyMs;

// Function FMCalibrationRuntime.FMCalibrationControllerComponent.GetAudioLatencyMs
// 0x0004 (0x0004 - 0x0000)
struct FMCalibrationControllerComponent_GetAudioLatencyMs final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FMCalibrationControllerComponent_GetAudioLatencyMs;

// Function FMCalibrationRuntime.FMCalibrationControllerComponent.GetHasTalkedWithRoadie
// 0x0001 (0x0001 - 0x0000)
struct FMCalibrationControllerComponent_GetHasTalkedWithRoadie final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FMCalibrationControllerComponent_GetHasTalkedWithRoadie;

// Function FMCalibrationRuntime.FMCalibrationControllerComponent.GetIsAutolaunchDisabled
// 0x0001 (0x0001 - 0x0000)
struct FMCalibrationControllerComponent_GetIsAutolaunchDisabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FMCalibrationControllerComponent_GetIsAutolaunchDisabled;

// Function FMCalibrationRuntime.FMCalibrationControllerComponent.GetIsCalibrated
// 0x0001 (0x0001 - 0x0000)
struct FMCalibrationControllerComponent_GetIsCalibrated final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FMCalibrationControllerComponent_GetIsCalibrated;

// Function FMCalibrationRuntime.FMCalibrationControllerComponent.GetIsCalibrationDebugEnabled
// 0x0001 (0x0001 - 0x0000)
struct FMCalibrationControllerComponent_GetIsCalibrationDebugEnabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FMCalibrationControllerComponent_GetIsCalibrationDebugEnabled;

// Function FMCalibrationRuntime.FMCalibrationControllerComponent.GetIsPreambleDisabled
// 0x0001 (0x0001 - 0x0000)
struct FMCalibrationControllerComponent_GetIsPreambleDisabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FMCalibrationControllerComponent_GetIsPreambleDisabled;

// Function FMCalibrationRuntime.FMCalibrationControllerComponent.GetVideoLatencyMs
// 0x0004 (0x0004 - 0x0000)
struct FMCalibrationControllerComponent_GetVideoLatencyMs final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FMCalibrationControllerComponent_GetVideoLatencyMs;

// Function FMCalibrationRuntime.FMCalibrationControllerComponent.IsCalibrationDataLoaded
// 0x0001 (0x0001 - 0x0000)
struct FMCalibrationControllerComponent_IsCalibrationDataLoaded final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FMCalibrationControllerComponent_IsCalibrationDataLoaded;

// Function FMCalibrationRuntime.FMCalibrationControllerComponent.IsCalibrationDataOnLatestVersion
// 0x0001 (0x0001 - 0x0000)
struct FMCalibrationControllerComponent_IsCalibrationDataOnLatestVersion final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FMCalibrationControllerComponent_IsCalibrationDataOnLatestVersion;

}

