#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FMJamPlayspaceRuntime

#include "Basic.hpp"

#include "FMJamCoreRuntime_structs.hpp"
#include "FMCoreRuntime_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// ScriptStruct FMJamPlayspaceRuntime.JamPlayParams
// 0x0038 (0x0038 - 0x0000)
struct alignas(0x08) FJamPlayParams final
{
public:
	class FName                                   SongShortName;                                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EFMJamLoopType                                LoopType;                                          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TWeakObjectPtr<class APlayerState>            PlayerState;                                       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         LoopInstanceId;                                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsAutoJammer;                                     // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TWeakObjectPtr<class UCatalogData>            CMSCatalogEntry;                                   // 0x0018(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TWeakObjectPtr<class UFMJamSong>              Song;                                              // 0x0020(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_28[0x10];                                      // 0x0028(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FJamPlayParams;

// ScriptStruct FMJamPlayspaceRuntime.JamLoadResult
// 0x0020 (0x0020 - 0x0000)
struct FJamLoadResult final
{
public:
	class UJamMusicSlot*                          Slot;                                              // 0x0000(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFusionPatch*                           FusionPatch;                                       // 0x0008(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMidiFile*                              MidiFile;                                          // 0x0010(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMusicKeyMode                                 Mode;                                              // 0x0018(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSuccess;                                          // 0x0019(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bWasCancelled;                                     // 0x001A(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1B[0x5];                                       // 0x001B(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FJamLoadResult;

// ScriptStruct FMJamPlayspaceRuntime.JamEvent_JamLoopBase
// 0x0040 (0x0040 - 0x0000)
struct FJamEvent_JamLoopBase
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   SongShortName;                                     // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCatalogData*                           CatalogEntry;                                      // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EFMJamLoopType                                LoopType;                                          // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerState*                           PlayerState;                                       // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         LoopInstanceId;                                    // 0x0028(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsAutoJammer;                                     // 0x002C(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class USparksInstrumentAnimations*            Animations;                                        // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bChangedLoop;                                      // 0x0038(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FJamEvent_JamLoopBase;

// ScriptStruct FMJamPlayspaceRuntime.JamEvent_JamLoopStarted
// 0x0000 (0x0040 - 0x0040)
struct FJamEvent_JamLoopStarted final : public FJamEvent_JamLoopBase
{
};
DUMPER7_ASSERTS_FJamEvent_JamLoopStarted;

// ScriptStruct FMJamPlayspaceRuntime.JamEvent_JamLoopStopped
// 0x0000 (0x0040 - 0x0040)
struct FJamEvent_JamLoopStopped final : public FJamEvent_JamLoopBase
{
};
DUMPER7_ASSERTS_FJamEvent_JamLoopStopped;

// ScriptStruct FMJamPlayspaceRuntime.JamEvent_LoopsChangedThisFrame
// 0x0001 (0x0001 - 0x0000)
struct FJamEvent_LoopsChangedThisFrame final
{
public:
	uint8                                         Pad_0[0x1];                                        // 0x0000(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FJamEvent_LoopsChangedThisFrame;

// ScriptStruct FMJamPlayspaceRuntime.JamEvent_OnPrimaryPlayerPresenceChanged
// 0x0001 (0x0001 - 0x0000)
struct FJamEvent_OnPrimaryPlayerPresenceChanged final
{
public:
	bool                                          bPrimaryPlayerInPlayspace;                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FJamEvent_OnPrimaryPlayerPresenceChanged;

// ScriptStruct FMJamPlayspaceRuntime.JamReactiveFXState
// 0x0028 (0x0028 - 0x0000)
struct FJamReactiveFXState final
{
public:
	float                                         OverallAmplitude;                                  // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 LoopAmplitudes;                                    // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FVector4f>                      LoopBandValues;                                    // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FJamReactiveFXState;

// ScriptStruct FMJamPlayspaceRuntime.JamLoopReactiveFX
// 0x0010 (0x0010 - 0x0000)
struct FJamLoopReactiveFX final
{
public:
	TArray<TWeakObjectPtr<class UNiagaraComponent>> NiagaraComponents;                               // 0x0000(0x0010)(Edit, ExportObject, ZeroConstructor, EditConst, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FJamLoopReactiveFX;

}

