#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FMJamSystemRuntime

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "ModularGameplay_classes.hpp"
#include "GameplayAbilities_structs.hpp"
#include "CommonUI_classes.hpp"
#include "GameplayEventRouter_structs.hpp"
#include "PlayspaceSystem_classes.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class FMJamSystemRuntime.JamControllerComponent
// 0x0028 (0x00C8 - 0x00A0)
class UJamControllerComponent final : public UControllerComponent
{
public:
	uint8                                         Pad_A0[0x8];                                       // 0x00A0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  AdditionalTags;                                    // 0x00A8(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)

public:
	class AController* GetControllerOfClass(TSubclassOf<class AController> ControllerType, bool bMatchChildTypes);
	void UpdateJamUI();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JamControllerComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JamControllerComponent")
	}
	static class UJamControllerComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJamControllerComponent>();
	}
};
DUMPER7_ASSERTS_UJamControllerComponent;

// Class FMJamSystemRuntime.JamControllerComponent_LoopOptions
// 0x0058 (0x00F8 - 0x00A0)
class UJamControllerComponent_LoopOptions final : public UControllerComponent
{
public:
	class FName                                   CategoryNameLocker;                                // 0x00A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   CategoryNameAll;                                   // 0x00A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   CategoryTitleLocker;                               // 0x00A8(0x0018)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	class FText                                   CategoryTitleAll;                                  // 0x00C0(0x0018)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UClass>                   EmoteWheelOverlay;                                 // 0x00D8(0x0020)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	void AddJamCategories(bool bPostLockerCategory);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JamControllerComponent_LoopOptions")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JamControllerComponent_LoopOptions")
	}
	static class UJamControllerComponent_LoopOptions* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJamControllerComponent_LoopOptions>();
	}
};
DUMPER7_ASSERTS_UJamControllerComponent_LoopOptions;

// Class FMJamSystemRuntime.JamControllerComponent_LoopPreloader
// 0x0058 (0x00F8 - 0x00A0)
class UJamControllerComponent_LoopPreloader final : public UControllerComponent
{
public:
	bool                                          bHaveRegisteredForOnLoadoutFilled;                 // 0x00A0(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_A1[0x57];                                      // 0x00A1(0x0057)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnLoadoutFilled();
	void OnPawnSet(class APlayerState* Player, class APawn* NewPawn, class APawn* OldPawn);
	void OnSongCatalogRetrieved(bool bSuccess);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JamControllerComponent_LoopPreloader")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JamControllerComponent_LoopPreloader")
	}
	static class UJamControllerComponent_LoopPreloader* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJamControllerComponent_LoopPreloader>();
	}
};
DUMPER7_ASSERTS_UJamControllerComponent_LoopPreloader;

// Class FMJamSystemRuntime.JamGlobalControlsWidget
// 0x0008 (0x0408 - 0x0400)
class UJamGlobalControlsWidget final : public UCommonActivatableWidget
{
public:
	class UCommonButtonBase*                      Button_Close;                                      // 0x0400(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void Close();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JamGlobalControlsWidget")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JamGlobalControlsWidget")
	}
	static class UJamGlobalControlsWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJamGlobalControlsWidget>();
	}
};
DUMPER7_ASSERTS_UJamGlobalControlsWidget;

// Class FMJamSystemRuntime.JamOnOffSwitchComponent
// 0x0100 (0x01A0 - 0x00A0)
class UJamOnOffSwitchComponent final : public UPlayerStateComponent
{
public:
	struct FScalableFloat                         bEnableJam;                                        // 0x00A0(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	uint8                                         Pad_C8[0x8];                                       // 0x00C8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UGameplayEffect>            JamBlockerEffect;                                  // 0x00D0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FActiveGameplayEffectHandle            JamBlockerEffectHandle;                            // 0x00D8(0x0008)(Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FGameplayEventListenerHandle           GamePhaseUpdatedEventHandle;                       // 0x00E0(0x001C)(Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_FC[0x4];                                       // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGlobalMemoryRequestHandle             GlobalMemoryRequestHandle;                         // 0x0100(0x0008)(Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_108[0x98];                                     // 0x0108(0x0098)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static bool ShouldApplyJamOnSplitscreenLogic(class UObject* WorldContextObject, class APlayerController* ReferenceController);

	void OnMutatorUpdated();
	void OnPlayerStatePawnSet(class APlayerState* Player, class APawn* NewPawn, class APawn* OldPawn);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JamOnOffSwitchComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JamOnOffSwitchComponent")
	}
	static class UJamOnOffSwitchComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJamOnOffSwitchComponent>();
	}
};
DUMPER7_ASSERTS_UJamOnOffSwitchComponent;

// Class FMJamSystemRuntime.JamPlayerPawnComponent
// 0x0028 (0x00C8 - 0x00A0)
class UJamPlayerPawnComponent final : public UPawnComponent
{
public:
	uint8                                         Pad_A0[0x8];                                       // 0x00A0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  AdditionalTags;                                    // 0x00A8(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)

public:
	class APawn* GetPawnOfClass(TSubclassOf<class APawn> PawnType, bool bMatchChildTypes);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JamPlayerPawnComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JamPlayerPawnComponent")
	}
	static class UJamPlayerPawnComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJamPlayerPawnComponent>();
	}
};
DUMPER7_ASSERTS_UJamPlayerPawnComponent;

// Class FMJamSystemRuntime.JamQuestComponent
// 0x0048 (0x00E8 - 0x00A0)
class UJamQuestComponent final : public UPlayspaceComponent
{
public:
	uint8                                         Pad_A0[0x48];                                      // 0x00A0(0x0048)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JamQuestComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JamQuestComponent")
	}
	static class UJamQuestComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJamQuestComponent>();
	}
};
DUMPER7_ASSERTS_UJamQuestComponent;

// Class FMJamSystemRuntime.JamSystemEmoteBPFL
// 0x0000 (0x0028 - 0x0028)
class UJamSystemEmoteBPFL final : public UBlueprintFunctionLibrary
{
public:
	static void GetEmoteActionBinding(const class FString& EmoteTemplateID, struct FEmoteActionBinding* OutCreatedEmote);
	static bool IsJamDebugDisplayEnabled();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JamSystemEmoteBPFL")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JamSystemEmoteBPFL")
	}
	static class UJamSystemEmoteBPFL* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJamSystemEmoteBPFL>();
	}
};
DUMPER7_ASSERTS_UJamSystemEmoteBPFL;

// Class FMJamSystemRuntime.JamVerbProcessor_Jam
// 0x0000 (0x0098 - 0x0098)
class UJamVerbProcessor_Jam final : public UObjectiveProcessor
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JamVerbProcessor_Jam")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JamVerbProcessor_Jam")
	}
	static class UJamVerbProcessor_Jam* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJamVerbProcessor_Jam>();
	}
};
DUMPER7_ASSERTS_UJamVerbProcessor_Jam;

}

