#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FN_NiagaraNotify

#include "Basic.hpp"

#include "NiagaraAnimNotifies_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass FN_NiagaraNotify.FN_NiagaraNotify_C
// 0x0010 (0x00E0 - 0x00D0)
class UFN_NiagaraNotify_C final : public UAnimNotify_PlayNiagaraEffect
{
public:
	uint8                                         Pad_C8[0x8];                                       // 0x00C8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          Set_in_Water_Niagara_Variable;                     // 0x00D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Print_Debug;                                       // 0x00D1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          is_Glider_Deploy_Notify;                           // 0x00D2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsLargeBodyPawn;                                   // 0x00D3(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Add_to_Pawn_Highlight_Set;                         // 0x00D4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Apply_Water_Parameters(class AFortPlayerPawnAthena* PlayerPawn, class UNiagaraComponent* NiagaraSystem) const;
	bool Received_Notify(class USkeletalMeshComponent* MeshComp, class UAnimSequenceBase* Animation, const struct FAnimNotifyEventReference& EventReference) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("FN_NiagaraNotify_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FN_NiagaraNotify_C")
	}
	static class UFN_NiagaraNotify_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFN_NiagaraNotify_C>();
	}
};
DUMPER7_ASSERTS_UFN_NiagaraNotify_C;

}

