#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FortSidebarCheckbox

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass FortSidebarCheckbox.FortSidebarCheckbox_C
// 0x0030 (0x0340 - 0x0310)
class UFortSidebarCheckbox_C final : public UFortSidebarCheckboxWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0310(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_Checked;                                     // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Unchecked;                                   // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bIsSelected;                                       // 0x0328(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_329[0x7];                                      // 0x0329(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              OnClicked;                                         // 0x0330(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ToggleCheckbox();
	void SetSelected(bool NewSelected);
	void Refresh();
	void ExecuteUbergraph_FortSidebarCheckbox(int32 EntryPoint);
	void Construct();
	void BP_ToggleCheckbox();
	void BndEvt__CheckButton_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("FortSidebarCheckbox_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortSidebarCheckbox_C")
	}
	static class UFortSidebarCheckbox_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortSidebarCheckbox_C>();
	}
};
DUMPER7_ASSERTS_UFortSidebarCheckbox_C;

}

