#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FortReplayLensSettingsTab

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass FortReplayLensSettingsTab.FortReplayLensSettingsTab_C
// 0x0070 (0x05D8 - 0x0568)
class UFortReplayLensSettingsTab_C final : public UFortSpectatorLensSettingsTab
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0568(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class URotatorSelectorReplaySettings_C*       ApertureSelector;                                  // 0x0570(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URotatorSelectorReplaySettings_C*       AutoFocusSelector;                                 // 0x0578(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOptionsMenuSliderReplay_C*             ExposureSlider;                                    // 0x0580(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URotatorSelectorReplaySettings_C*       FocalLengthSelector;                               // 0x0588(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOptionsMenuSliderReplay_C*             FocusDistanceSlider;                               // 0x0590(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox;                                       // 0x0598(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_DOFSettings;                           // 0x05A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   OnText;                                            // 0x05A8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   OffText;                                           // 0x05C0(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void RefreshDOFSettings();
	void PreConstruct(bool IsDesignTime);
	void OnManualFocusDistanceChanged(float ManualFocusDistance);
	void OnManualExposureBiasChanged(float ManualExposureBias);
	void OnFocalLengthChanged(const TArray<class FText>& FocalLengthTexts, int32 PresetFocalLengthIdx);
	void OnAutoFocusEnabledChanged(bool bAutoFocusEnabled);
	void OnAutoExposureEnabledChanged(bool bAutoExposureEnabled);
	void OnApertureChanged(int32 PresetApertureIdx);
	void InitializeWidgets();
	void ExecuteUbergraph_FortReplayLensSettingsTab(int32 EntryPoint);
	void CenterOnTab();
	void BP_OnActivated();
	void BndEvt__FocusDistanceSlider_K2Node_ComponentBoundEvent_1_SliderChanged__DelegateSignature(double Slider_Value);
	void BndEvt__FocalLengthSelector_K2Node_ComponentBoundEvent_3_Selection_Changed__DelegateSignature(int32 Selected_Index);
	void BndEvt__ExposureSlider_K2Node_ComponentBoundEvent_4_SliderChanged__DelegateSignature(double Slider_Value);
	void BndEvt__AutoFocusSelector_K2Node_ComponentBoundEvent_8_Selection_Changed__DelegateSignature(int32 Selected_Index);
	void BndEvt__AutoExposureSelector_K2Node_ComponentBoundEvent_0_Selection_Changed__DelegateSignature(int32 Selected_Index);
	void BndEvt__ApertureSelector_K2Node_ComponentBoundEvent_7_Selection_Changed__DelegateSignature(int32 Selected_Index);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("FortReplayLensSettingsTab_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortReplayLensSettingsTab_C")
	}
	static class UFortReplayLensSettingsTab_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortReplayLensSettingsTab_C>();
	}
};
DUMPER7_ASSERTS_UFortReplayLensSettingsTab_C;

}

