#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FortPostGameScreenRoot

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass FortPostGameScreenRoot.FortPostGameScreenRoot_C
// 0x0058 (0x04E0 - 0x0488)
class UFortPostGameScreenRoot_C final : public UFortPostGameScreenRoot
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0488(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UPostGameSpectatingPlayerName_C*        PostGameSpectatingPlayerName;                      // 0x0490(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_Placement;                                // 0x0498(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_PostMatchContent;                         // 0x04A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                              ScaleBox_MobileOverlay;                            // 0x04A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              OnToggleBlurRequested;                             // 0x04B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TSoftClassPtr<class UClass>                   MobileOverlay;                                     // 0x04C0(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void ToggleBlur();
	void SetPlacementZOrder(const bool bIsPlacementAboveContent);
	void OnPostGameScreenConfigUpdated(const struct FFortPostGameScreenConfig& NewPostGameConfig);
	void OnLoaded_39EC339E46A42D75F3C0AA8469032F77(TSubclassOf<class UObject> Loaded);
	void OnInitialized();
	void ExecuteUbergraph_FortPostGameScreenRoot(int32 EntryPoint);
	void Construct();
	void AnimateCinematicBars();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("FortPostGameScreenRoot_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortPostGameScreenRoot_C")
	}
	static class UFortPostGameScreenRoot_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortPostGameScreenRoot_C>();
	}
};
DUMPER7_ASSERTS_UFortPostGameScreenRoot_C;

}

