#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FortniteAIServer

#include "Basic.hpp"

#include "FortniteAI_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "AIModule_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function FortniteAIServer.FortAthenaAIBotEvaluator_Harvest.HandleConverted
// 0x0010 (0x0010 - 0x0000)
struct FortAthenaAIBotEvaluator_Harvest_HandleConverted final
{
public:
	const class AFortPawn*                        InstigatorPawn;                                    // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class AFortPawn*                        ConvertedPawn;                                     // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaAIBotEvaluator_Harvest_HandleConverted;

// Function FortniteAIServer.FortAthenaAIBotEvaluator_Harvest.HandleUnconverted
// 0x0010 (0x0010 - 0x0000)
struct FortAthenaAIBotEvaluator_Harvest_HandleUnconverted final
{
public:
	const class AFortPawn*                        UnconvertedPawn;                                   // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EUnconvertReason                              UnconvertReason;                                   // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FortAthenaAIBotEvaluator_Harvest_HandleUnconverted;

// Function FortniteAIServer.FortAthenaPlayMontageStateTreeTask.HandleMontageEnded
// 0x0010 (0x0010 - 0x0000)
struct FortAthenaPlayMontageStateTreeTask_HandleMontageEnded final
{
public:
	const class UAnimMontage*                     EndedMontage;                                      // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInterrupted;                                      // 0x0008(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FortAthenaPlayMontageStateTreeTask_HandleMontageEnded;

// Function FortniteAIServer.FortAthenaPlayMontageStateTreeTask.HandleNotifyBeginReceived
// 0x0028 (0x0028 - 0x0000)
struct FortAthenaPlayMontageStateTreeTask_HandleNotifyBeginReceived final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBranchingPointNotifyPayload           BranchingPointNotifyPayload;                       // 0x0008(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaPlayMontageStateTreeTask_HandleNotifyBeginReceived;

// Function FortniteAIServer.FortAthenaPlayInteractionStateTreeTask.OnMontageEnded
// 0x0010 (0x0010 - 0x0000)
struct FortAthenaPlayInteractionStateTreeTask_OnMontageEnded final
{
public:
	const class UAnimMontage*                     EndedMontage;                                      // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInterrupted;                                      // 0x0008(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FortAthenaPlayInteractionStateTreeTask_OnMontageEnded;

// Function FortniteAIServer.FortAthenaPlayInteractionStateTreeTask.OnNotifyBeginReceived
// 0x0028 (0x0028 - 0x0000)
struct FortAthenaPlayInteractionStateTreeTask_OnNotifyBeginReceived final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBranchingPointNotifyPayload           BranchingPointNotifyPayload;                       // 0x0008(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaPlayInteractionStateTreeTask_OnNotifyBeginReceived;

// Function FortniteAIServer.FortWorldConditionTimeOfDayState.HandleTimeOfDayPhaseChange
// 0x0003 (0x0003 - 0x0000)
struct FortWorldConditionTimeOfDayState_HandleTimeOfDayPhaseChange final
{
public:
	EFortDayPhase                                 CurrentDayPhase;                                   // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EFortDayPhase                                 PreviousDayPhase;                                  // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAtCreation;                                       // 0x0002(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortWorldConditionTimeOfDayState_HandleTimeOfDayPhaseChange;

// Function FortniteAIServer.FortEQSPrevisActor.SetQueryTemplate
// 0x0008 (0x0008 - 0x0000)
struct FortEQSPrevisActor_SetQueryTemplate final
{
public:
	class UEnvQuery*                              InPrevisQueryTemplate;                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortEQSPrevisActor_SetQueryTemplate;

// Function FortniteAIServer.FortAthenaAIBotEvaluator_CharacterLaunched.OnCharacterLaunchChanged
// 0x0020 (0x0020 - 0x0000)
struct FortAthenaAIBotEvaluator_CharacterLaunched_OnCharacterLaunchChanged final
{
public:
	class UFortMovementComp_Character*            MovementComponent;                                 // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                LaunchVelocity;                                    // 0x0008(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaAIBotEvaluator_CharacterLaunched_OnCharacterLaunchChanged;

// Function FortniteAIServer.FortAthenaAIBotEvaluator_CharacterLaunched.OnZiplineStateChanged
// 0x0010 (0x0010 - 0x0000)
struct FortAthenaAIBotEvaluator_CharacterLaunched_OnZiplineStateChanged final
{
public:
	bool                                          bIsZiplining;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        FortPlayerPawn;                                    // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaAIBotEvaluator_CharacterLaunched_OnZiplineStateChanged;

// Function FortniteAIServer.FortAthenaAIBotEvaluator_Conversation.OnPlayerPawnSpawned
// 0x0010 (0x0010 - 0x0000)
struct FortAthenaAIBotEvaluator_Conversation_OnPlayerPawnSpawned final
{
public:
	class AAIController*                          Controller;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFortPawn*                              Pawn;                                              // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaAIBotEvaluator_Conversation_OnPlayerPawnSpawned;

// Function FortniteAIServer.FortAthenaAIBotEvaluator_Converted.OnConvertedEvent
// 0x0010 (0x0010 - 0x0000)
struct FortAthenaAIBotEvaluator_Converted_OnConvertedEvent final
{
public:
	class AFortPawn*                              InstigatorPawn;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFortPawn*                              ConvertedPawn;                                     // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaAIBotEvaluator_Converted_OnConvertedEvent;

// Function FortniteAIServer.FortAthenaAIBotEvaluator_Converted.OnUnconvertedEvent
// 0x0010 (0x0010 - 0x0000)
struct FortAthenaAIBotEvaluator_Converted_OnUnconvertedEvent final
{
public:
	class AFortPawn*                              UnconvertedPawn;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EUnconvertReason                              UnconvertReason;                                   // 0x0008(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FortAthenaAIBotEvaluator_Converted_OnUnconvertedEvent;

// Function FortniteAIServer.FortAthenaAIBotEvaluator_DBNO.OnAllyPawnDBNOStateChanged
// 0x0010 (0x0010 - 0x0000)
struct FortAthenaAIBotEvaluator_DBNO_OnAllyPawnDBNOStateChanged final
{
public:
	class AFortPawn*                              InPlayer;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInIsDBNO;                                         // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FortAthenaAIBotEvaluator_DBNO_OnAllyPawnDBNOStateChanged;

// Function FortniteAIServer.FortAthenaAIBotEvaluator_EvasiveManeuvers.OnMoveCompleted
// 0x0008 (0x0008 - 0x0000)
struct FortAthenaAIBotEvaluator_EvasiveManeuvers_OnMoveCompleted final
{
public:
	struct FAIRequestID                           RequestID;                                         // 0x0000(0x0004)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	EPathFollowingResult                          MovementResult;                                    // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FortAthenaAIBotEvaluator_EvasiveManeuvers_OnMoveCompleted;

// Function FortniteAIServer.FortAthenaPlayContextualAnimTaskInstanceData.OnMontageEnded
// 0x0010 (0x0010 - 0x0000)
struct FortAthenaPlayContextualAnimTaskInstanceData_OnMontageEnded final
{
public:
	const class UAnimMontage*                     EndedMontage;                                      // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInterrupted;                                      // 0x0008(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FortAthenaPlayContextualAnimTaskInstanceData_OnMontageEnded;

// Function FortniteAIServer.FortAthenaPlayContextualAnimTaskInstanceData.OnNotifyBeginReceived
// 0x0028 (0x0028 - 0x0000)
struct FortAthenaPlayContextualAnimTaskInstanceData_OnNotifyBeginReceived final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBranchingPointNotifyPayload           BranchingPointNotifyPayload;                       // 0x0008(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaPlayContextualAnimTaskInstanceData_OnNotifyBeginReceived;

// Function FortniteAIServer.FortAthenaAIBotEvaluator_RangeAttack.FindShootingPosition_Async
// 0x0028 (0x0028 - 0x0000)
struct FortAthenaAIBotEvaluator_RangeAttack_FindShootingPosition_Async final
{
public:
	int32                                         RequestID;                                         // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DistanceFromTarget;                                // 0x0004(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         WeaponIdealAttackRange;                            // 0x0008(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                TargetPosition;                                    // 0x0010(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaAIBotEvaluator_RangeAttack_FindShootingPosition_Async;

// Function FortniteAIServer.FortAthenaAIBotEvaluator_ReactToVerb.HandlePawnStartedEmote
// 0x0010 (0x0010 - 0x0000)
struct FortAthenaAIBotEvaluator_ReactToVerb_HandlePawnStartedEmote final
{
public:
	const class UFortItemDefinition*              MontageItemDef;                                    // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFortPawn*                              PawnEmoting;                                       // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaAIBotEvaluator_ReactToVerb_HandlePawnStartedEmote;

// Function FortniteAIServer.FortAthenaAIBotEvaluator_ReactToVerb.HandlePawnStoppedEmote
// 0x0010 (0x0010 - 0x0000)
struct FortAthenaAIBotEvaluator_ReactToVerb_HandlePawnStoppedEmote final
{
public:
	const class UFortItemDefinition*              MontageItemDef;                                    // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFortPawn*                              PawnEmoting;                                       // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaAIBotEvaluator_ReactToVerb_HandlePawnStoppedEmote;

// Function FortniteAIServer.FortAthenaAIBotEvaluator_Revive.OnCurrentTargetRevived
// 0x0008 (0x0008 - 0x0000)
struct FortAthenaAIBotEvaluator_Revive_OnCurrentTargetRevived final
{
public:
	class AFortPlayerPawn*                        RevivedPawn;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaAIBotEvaluator_Revive_OnCurrentTargetRevived;

// Function FortniteAIServer.FortAthenaAIBotEvaluator_SandTunnel.OnBotControllerAlertLevelChanged
// 0x0010 (0x0010 - 0x0000)
struct FortAthenaAIBotEvaluator_SandTunnel_OnBotControllerAlertLevelChanged final
{
public:
	class AFortAthenaAIBotController*             BotController;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAlertLevel                                   OldAlertLevel;                                     // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAlertLevel                                   NewAlertLevel;                                     // 0x0009(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FortAthenaAIBotEvaluator_SandTunnel_OnBotControllerAlertLevelChanged;

// Function FortniteAIServer.FortAthenaAIBotEvaluator_SelectNextDynamicPOI.OnAgentDied
// 0x0010 (0x0010 - 0x0000)
struct FortAthenaAIBotEvaluator_SelectNextDynamicPOI_OnAgentDied final
{
public:
	class AFortAthenaAIBotController*             BotController;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFortPawn*                              FortPawn;                                          // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaAIBotEvaluator_SelectNextDynamicPOI_OnAgentDied;

// Function FortniteAIServer.FortAthenaAIBotEvaluator_SelectNextDynamicPOI.OnGamePhaseLogicReady
// 0x0008 (0x0008 - 0x0000)
struct FortAthenaAIBotEvaluator_SelectNextDynamicPOI_OnGamePhaseLogicReady final
{
public:
	struct FFortBattleRoyaleGamePhaseLogicComponentReadyEvent Event;                                 // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaAIBotEvaluator_SelectNextDynamicPOI_OnGamePhaseLogicReady;

// Function FortniteAIServer.FortAthenaAIBotEvaluator_SelectNextDynamicPOI.OnSafeZonePhaseChanged
// 0x0008 (0x0008 - 0x0000)
struct FortAthenaAIBotEvaluator_SelectNextDynamicPOI_OnSafeZonePhaseChanged final
{
public:
	struct FFortSafeZonePhaseUpdatedEvent         Event;                                             // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaAIBotEvaluator_SelectNextDynamicPOI_OnSafeZonePhaseChanged;

// Function FortniteAIServer.FortAthenaAIBotEvaluator_SelectNextDynamicPOI.ReachingPositionFail_Async
// 0x0004 (0x0004 - 0x0000)
struct FortAthenaAIBotEvaluator_SelectNextDynamicPOI_ReachingPositionFail_Async final
{
public:
	int32                                         RequestID;                                         // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaAIBotEvaluator_SelectNextDynamicPOI_ReachingPositionFail_Async;

// Function FortniteAIServer.FortAthenaAIBotEvaluator_Storm.OnSafeZoneStateChanged
// 0x0001 (0x0001 - 0x0000)
struct FortAthenaAIBotEvaluator_Storm_OnSafeZoneStateChanged final
{
public:
	EFortSafeZoneState                            NewState;                                          // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaAIBotEvaluator_Storm_OnSafeZoneStateChanged;

// Function FortniteAIServer.FortAthenaAIBotEvaluator_Zipline.OnZiplineStateChanged
// 0x0010 (0x0010 - 0x0000)
struct FortAthenaAIBotEvaluator_Zipline_OnZiplineStateChanged final
{
public:
	bool                                          bIsZiplining;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        FortPlayerPawn;                                    // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaAIBotEvaluator_Zipline_OnZiplineStateChanged;

// Function FortniteAIServer.FortAthenaAIEvaluator_BlueprintBase.OnEnter
// 0x0008 (0x0008 - 0x0000)
struct FortAthenaAIEvaluator_BlueprintBase_OnEnter final
{
public:
	class UBehaviorTreeComponent*                 OwnerComp;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaAIEvaluator_BlueprintBase_OnEnter;

// Function FortniteAIServer.FortAthenaAIEvaluator_BlueprintBase.OnExit
// 0x0008 (0x0008 - 0x0000)
struct FortAthenaAIEvaluator_BlueprintBase_OnExit final
{
public:
	class UBehaviorTreeComponent*                 OwnerComp;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaAIEvaluator_BlueprintBase_OnExit;

// Function FortniteAIServer.FortAthenaAIEvaluator_BlueprintBase.EvaluateOngoingConditions
// 0x0010 (0x0010 - 0x0000)
struct FortAthenaAIEvaluator_BlueprintBase_EvaluateOngoingConditions final
{
public:
	class UBehaviorTreeComponent*                 OwnerComp;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FortAthenaAIEvaluator_BlueprintBase_EvaluateOngoingConditions;

// Function FortniteAIServer.FortAthenaAIEvaluator_BlueprintBase.EvaluateStartingConditions
// 0x0010 (0x0010 - 0x0000)
struct FortAthenaAIEvaluator_BlueprintBase_EvaluateStartingConditions final
{
public:
	class UBehaviorTreeComponent*                 OwnerComp;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FortAthenaAIEvaluator_BlueprintBase_EvaluateStartingConditions;

// Function FortniteAIServer.FortAthenaBTTask_Zipline.OnZiplineStateChanged
// 0x0010 (0x0010 - 0x0000)
struct FortAthenaBTTask_Zipline_OnZiplineStateChanged final
{
public:
	bool                                          bIsZiplining;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        FortPlayerPawn;                                    // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaBTTask_Zipline_OnZiplineStateChanged;

// Function FortniteAIServer.FortAthenaBTService_ManageWeapon.ManageWeaponTargeting
// 0x0008 (0x0008 - 0x0000)
struct FortAthenaBTService_ManageWeapon_ManageWeaponTargeting final
{
public:
	class UBehaviorTreeComponent*                 OwnerComp;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaBTService_ManageWeapon_ManageWeaponTargeting;

// Function FortniteAIServer.FortAthenaBTService_Slide.OnStopSliding
// 0x0008 (0x0008 - 0x0000)
struct FortAthenaBTService_Slide_OnStopSliding final
{
public:
	class AFortPlayerPawn*                        Pawn;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaBTService_Slide_OnStopSliding;

}

