#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FortniteAI

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "FortniteAI_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "SlateCore_structs.hpp"
#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "NavigationSystem_classes.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GameFeatures_classes.hpp"
#include "ModularGameplay_classes.hpp"
#include "AnimPresetsRuntime_structs.hpp"
#include "GameplayInteractionsModule_classes.hpp"


namespace SDK
{

// Class FortniteAI.AthenaAIService
// 0x0050 (0x0078 - 0x0028)
class UAthenaAIService : public UObject
{
public:
	class AFortGameModeAthena*                    CachedGameMode;                                    // 0x0028(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class AFortGameStateAthena*                   CachedGameState;                                   // 0x0030(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_38[0x30];                                      // 0x0038(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaAIServiceManager*                AIServiceManager;                                  // 0x0068(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_70[0x8];                                       // 0x0070(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AthenaAIService")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AthenaAIService")
	}
	static class UAthenaAIService* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaAIService>();
	}
};
DUMPER7_ASSERTS_UAthenaAIService;

// Class FortniteAI.AthenaAIServiceLoot
// 0x0558 (0x05D0 - 0x0078)
class alignas(0x10) UAthenaAIServiceLoot final : public UAthenaAIService
{
public:
	struct FVector                                LootOctreeCenter;                                  // 0x0078(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         LootOctreeRadius;                                  // 0x0090(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         SupplyDropStatusUpdateRate;                        // 0x00B8(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         RemoveInvalidChestFromOctreeProbability;           // 0x00E0(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         MovingLootTrackingEnabled;                         // 0x0108(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         MovingLootUpdateRate;                              // 0x0130(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         MovingLootOctreeUpdateDistanceThreshold;           // 0x0158(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	TArray<TSubclassOf<class ABuildingProp>>      HarvestableActorClassList;                         // 0x0180(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, UObjectWrapper, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         LootClusteringEnabled;                             // 0x0190(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         LootClusteringNeighborDistanceMax;                 // 0x01B8(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         LootClusteringNeighborhoodCountMin;                // 0x01E0(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	class UDataRegistry*                          LootClusteringItemWeightDataRegistry;              // 0x0208(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         LootClusteringDefaultWeight;                       // 0x0210(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         LootClusteringExpandByBoxX;                        // 0x0238(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         LootClusteringExpandByBoxY;                        // 0x0260(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         LootClusteringExpandByBoxZ;                        // 0x0288(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2B0[0x210];                                    // 0x02B0(0x0210)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<TWeakObjectPtr<class AFortPickup>, struct FMovingLootInfo> MovingLoots;                     // 0x04C0(0x0050)(Transient, NativeAccessSpecifierPrivate)
	uint8                                         Pad_510[0x8];                                      // 0x0510(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FCachedSupplyDrop>              CachedSupplyDrops;                                 // 0x0518(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	class UFortWorldItem*                         CachedWorldItem;                                   // 0x0528(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UDataTable*                             BotBuildingContainerExcludeListDataTable;          // 0x0530(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	EAthenaGamePhaseStep                          LootClusterCalculationGamePhase;                   // 0x0538(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_539[0x5F];                                     // 0x0539(0x005F)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFortBotClusterLootWeightDataTableRow> CachedLootClusteringItemWeightTable;        // 0x0598(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	uint8                                         Pad_5A8[0x28];                                     // 0x05A8(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void K2_AddGameplayTagToLoot(const class AActor* LootActor, const struct FGameplayTag& GameplayTag);
	void K2_RemoveGameplayTagFromLoot(const class AActor* LootActor, const struct FGameplayTag& GameplayTag);
	void UpdateMovingLoots();
	void UpdateSupplyDropStatus();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AthenaAIServiceLoot")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AthenaAIServiceLoot")
	}
	static class UAthenaAIServiceLoot* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaAIServiceLoot>();
	}
};
DUMPER7_ASSERTS_UAthenaAIServiceLoot;

// Class FortniteAI.FortQueryContext_ConverterPawn
// 0x0000 (0x0028 - 0x0028)
class UFortQueryContext_ConverterPawn final : public UEnvQueryContext
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortQueryContext_ConverterPawn")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortQueryContext_ConverterPawn")
	}
	static class UFortQueryContext_ConverterPawn* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortQueryContext_ConverterPawn>();
	}
};
DUMPER7_ASSERTS_UFortQueryContext_ConverterPawn;

// Class FortniteAI.FortNavModifierVolume
// 0x0010 (0x02F0 - 0x02E0)
class AFortNavModifierVolume final : public ANavModifierVolume
{
public:
	TArray<TSubclassOf<class ANavigationData>>    EnableOnlyForNavmeshClasses;                       // 0x02E0(0x0010)(Edit, ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortNavModifierVolume")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortNavModifierVolume")
	}
	static class AFortNavModifierVolume* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFortNavModifierVolume>();
	}
};
DUMPER7_ASSERTS_AFortNavModifierVolume;

// Class FortniteAI.FortAITask_Move
// 0x0048 (0x0160 - 0x0118)
class UFortAITask_Move : public UAITask_MoveTo
{
public:
	struct FFortMoveConfig                        MoveConfig;                                        // 0x0118(0x0038)(NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_150[0x10];                                     // 0x0150(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortAITask_Move")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortAITask_Move")
	}
	static class UFortAITask_Move* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAITask_Move>();
	}
};
DUMPER7_ASSERTS_UFortAITask_Move;

// Class FortniteAI.FortAthenaAISpawnerDataComponent
// 0x0008 (0x0030 - 0x0028)
class UFortAthenaAISpawnerDataComponent : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortAthenaAISpawnerDataComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortAthenaAISpawnerDataComponent")
	}
	static class UFortAthenaAISpawnerDataComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAthenaAISpawnerDataComponent>();
	}
};
DUMPER7_ASSERTS_UFortAthenaAISpawnerDataComponent;

// Class FortniteAI.FortAthenaAISpawnerDataComponent_CoverBase
// 0x0028 (0x0058 - 0x0030)
class UFortAthenaAISpawnerDataComponent_CoverBase final : public UFortAthenaAISpawnerDataComponent
{
public:
	TSubclassOf<class UNavigationQueryFilter>     CoverPositionFilterClass;                          // 0x0030(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                                CoverBoxExtent;                                    // 0x0038(0x0018)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         CoverOffset;                                       // 0x0050(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortAthenaAISpawnerDataComponent_CoverBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortAthenaAISpawnerDataComponent_CoverBase")
	}
	static class UFortAthenaAISpawnerDataComponent_CoverBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAthenaAISpawnerDataComponent_CoverBase>();
	}
};
DUMPER7_ASSERTS_UFortAthenaAISpawnerDataComponent_CoverBase;

// Class FortniteAI.FortAIEnvironmentalDangerSourceInterface
// 0x0000 (0x0000 - 0x0000)
class IFortAIEnvironmentalDangerSourceInterface final
{
public:
	float GetDangerAtLocation(const struct FVector& Location) const;
	bool GetDangerSourceActive() const;
	struct FBox GetDangerSourceBounds() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortAIEnvironmentalDangerSourceInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortAIEnvironmentalDangerSourceInterface")
	}
	static class IFortAIEnvironmentalDangerSourceInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IFortAIEnvironmentalDangerSourceInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IFortAIEnvironmentalDangerSourceInterface;

// Class FortniteAI.FortAthenaAIRuntimeParameters
// 0x0008 (0x0030 - 0x0028)
class UFortAthenaAIRuntimeParameters : public UObject
{
public:
	int32                                         ExtractedLevel;                                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortAthenaAIRuntimeParameters")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortAthenaAIRuntimeParameters")
	}
	static class UFortAthenaAIRuntimeParameters* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAthenaAIRuntimeParameters>();
	}
};
DUMPER7_ASSERTS_UFortAthenaAIRuntimeParameters;

// Class FortniteAI.FortAthenaAIBotDigestedSkillSet
// 0x0000 (0x0030 - 0x0030)
class UFortAthenaAIBotDigestedSkillSet : public UFortAthenaAIRuntimeParameters
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortAthenaAIBotDigestedSkillSet")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortAthenaAIBotDigestedSkillSet")
	}
	static class UFortAthenaAIBotDigestedSkillSet* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAthenaAIBotDigestedSkillSet>();
	}
};
DUMPER7_ASSERTS_UFortAthenaAIBotDigestedSkillSet;

// Class FortniteAI.FortAthenaAILODComponent
// 0x0048 (0x00E8 - 0x00A0)
class UFortAthenaAILODComponent final : public UActorComponent
{
public:
	EFortAILODLevel                               CurrentFortAILODLevel;                             // 0x00A0(0x0001)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_A1[0x2];                                       // 0x00A1(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	uint8                                         BitPad_A3_0 : 1;                                   // 0x00A3(0x0001)(Fixing Bit-Field Size Between Bits [ Dumper-7 ])
	uint8                                         bCouldBeVisibleToPlayers : 1;                      // 0x00A3(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Net, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate))
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              CachedFortPawn;                                    // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortAthenaAILODSettingsContainer*      AILODSettingsContainer;                            // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_B8[0x30];                                      // 0x00B8(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnRep_CurrentFortAILODLevel();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortAthenaAILODComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortAthenaAILODComponent")
	}
	static class UFortAthenaAILODComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAthenaAILODComponent>();
	}
};
DUMPER7_ASSERTS_UFortAthenaAILODComponent;

// Class FortniteAI.FortNavModifierComponent
// 0x00A0 (0x0230 - 0x0190)
class UFortNavModifierComponent : public UNavModifierComponent
{
public:
	float                                         LowSpeedSquareThreshold;                           // 0x0190(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         LowSpeedSquareDistanceThreshold;                   // 0x0194(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         LowSpeedRotationThreshold;                         // 0x0198(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         LowSpeedScaleThreshold;                            // 0x019C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         bAutomaticNavBoundComputation : 1;                 // 0x01A0(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bForceFailSafeExtent : 1;                          // 0x01A0(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         Pad_1A1[0x3];                                      // 0x01A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ExtrapolationMultiplierForFailsafeExtent;          // 0x01A4(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<TSubclassOf<class ANavigationData>>    DisableForNavmeshClasses;                          // 0x01A8(0x0010)(Edit, ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	class UPrimitiveComponent*                    PrimCompAffectingNavMesh;                          // 0x01B8(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1C0[0x70];                                     // 0x01C0(0x0070)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetComponentAffectingNavMesh(class UPrimitiveComponent* InComponentAffectingNavMesh);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortNavModifierComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortNavModifierComponent")
	}
	static class UFortNavModifierComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortNavModifierComponent>();
	}
};
DUMPER7_ASSERTS_UFortNavModifierComponent;

// Class FortniteAI.FortAISmartObjectUserComponent
// 0x01A0 (0x0248 - 0x00A8)
class UFortAISmartObjectUserComponent : public TObjectBasedCycleFixup<class UFortSmartObjectUserComponent, 0x0080, 0x08>
{
public:
	float                                         BaseRunningEvaluationTickInterval;                 // 0x00A8(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortAISmartObjectEvaluationRequestInternalData RunningQueryInternalData;                 // 0x00B0(0x00C0)(Transient, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	TMap<struct FGameplayTag, struct FFortSmartObjectEvaluationResult> ResultsPerEvaluationTag;      // 0x0170(0x0050)(Transient, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	class USmartObjectSubsystem*                  SmartObjectSubsystem;                              // 0x01C0(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FSmartObjectBanned>             SmartObjectsBannedList;                            // 0x01C8(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	float                                         GlobalDelayToDisableSmartObjectUsage;              // 0x01D8(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1DC[0x4];                                      // 0x01DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSmartObjectRecentlyUsed>       SmartObjectsMostRecentlyUsed;                      // 0x01E0(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	TArray<struct FAIRuntimeParametersSmartObjectActivity> SmartObjectActivities;                    // 0x01F0(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	int32                                         ActivitiesIDCount;                                 // 0x0200(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_204[0x4];                                      // 0x0204(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          CachedController;                                  // 0x0208(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class AFortPawn*                              CachedPawn;                                        // 0x0210(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FFortAIActiveCommandSOUsageData        ActiveCommandSOUsageData;                          // 0x0218(0x0010)(Transient, NoDestructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_228[0x10];                                     // 0x0228(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IFortAthenaAILODSettings> CachedLODSettingsManager;                       // 0x0238(0x0010)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	bool CommandAIToUseSO(const struct FFortAICommandSOUsageData& CommandSOUsageData);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortAISmartObjectUserComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortAISmartObjectUserComponent")
	}
	static class UFortAISmartObjectUserComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAISmartObjectUserComponent>();
	}
};
DUMPER7_ASSERTS_UFortAISmartObjectUserComponent;

// Class FortniteAI.FortAIBotSmartObjectUserComponent
// 0x0048 (0x0290 - 0x0248)
class UFortAIBotSmartObjectUserComponent final : public UFortAISmartObjectUserComponent
{
public:
	class AFortAthenaAIBotController*             CachedBotController;                               // 0x0248(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_250[0x40];                                     // 0x0250(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortAIBotSmartObjectUserComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortAIBotSmartObjectUserComponent")
	}
	static class UFortAIBotSmartObjectUserComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAIBotSmartObjectUserComponent>();
	}
};
DUMPER7_ASSERTS_UFortAIBotSmartObjectUserComponent;

// Class FortniteAI.FortAthenaAILODSettings_CharacterMovement
// 0x0948 (0x0970 - 0x0028)
class UFortAthenaAILODSettings_CharacterMovement final : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TSubclassOf<class UFortMovementComp_Character>> SystemClasses;                            // 0x0030(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, UObjectWrapper, NativeAccessSpecifierPrivate)
	struct FFortAILODSetting_CharacterMovement    BelowLowerLODSettings;                             // 0x0040(0x0188)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FFortAILODSetting_CharacterMovement    LowerLODSettings;                                  // 0x01C8(0x0188)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FFortAILODSetting_CharacterMovement    AboveLowerLODSettings;                             // 0x0350(0x0188)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FFortAILODSetting_CharacterMovement    BelowNormalLODSettings;                            // 0x04D8(0x0188)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FFortAILODSetting_CharacterMovement    NormalLODSettings;                                 // 0x0660(0x0188)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FFortAILODSetting_CharacterMovement    AboveNormalLODSettings;                            // 0x07E8(0x0188)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortAthenaAILODSettings_CharacterMovement")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortAthenaAILODSettings_CharacterMovement")
	}
	static class UFortAthenaAILODSettings_CharacterMovement* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAthenaAILODSettings_CharacterMovement>();
	}
};
DUMPER7_ASSERTS_UFortAthenaAILODSettings_CharacterMovement;

// Class FortniteAI.ThreatCloud
// 0x0240 (0x04D0 - 0x0290)
class AThreatCloud final : public AActor
{
public:
	TArray<class UBoxComponent*>                  LightningSourceAreas;                              // 0x0290(0x0010)(BlueprintVisible, ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	struct FSlateBrush                            MiniMapIconBrush;                                  // 0x02A0(0x00C0)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	float                                         MiniMapIconPercent;                                // 0x0360(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_364[0xC];                                      // 0x0364(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            MiniMapFarOffIconBrush;                            // 0x0370(0x00C0)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FLinearColor                           ActiveTint;                                        // 0x0430(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FLinearColor                           InActiveTint;                                      // 0x0440(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         ActiveTransitionTime;                              // 0x0450(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         DeathTimerDuration;                                // 0x0454(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         CloudMiniMapTickInterval;                          // 0x0458(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_45C[0x14];                                     // 0x045C(0x0014)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MiniMapFarOffIconDegreesOfArc;                     // 0x0470(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_474[0xC];                                      // 0x0474(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBox                                   ThreatBoxVolume;                                   // 0x0480(0x0038)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, NativeAccessSpecifierPrivate)
	float                                         GroundLevelUnderCloud;                             // 0x04B8(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_4BC[0x4];                                      // 0x04BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FVector>                        GoalActorLocations;                                // 0x04C0(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)

public:
	void ManualLightningFlash();
	void OnBeginDeath();
	void OnCloudActivated();
	void OnCloudDeactivated(EFortThreatDeactivationType DeactivationType);
	void OnCloudHiddenChange(bool bCloudsAreHidden);
	void OnCloudStart();
	void OnLightningStrike(const struct FVector& StartLocation, const struct FVector& EndLocation, class ABuildingRift* Rift, bool bLightningStruckRift);
	void OnThreatVolumeChanged();

	struct FBox GetThreatVolume() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ThreatCloud")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ThreatCloud")
	}
	static class AThreatCloud* GetDefaultObj()
	{
		return GetDefaultObjImpl<AThreatCloud>();
	}
};
DUMPER7_ASSERTS_AThreatCloud;

// Class FortniteAI.FortNavArea
// 0x0008 (0x0050 - 0x0048)
class UFortNavArea : public UNavArea
{
public:
	uint8                                         bObstacle : 1;                                     // 0x0048(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bSmashable : 1;                                    // 0x0048(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortNavArea")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortNavArea")
	}
	static class UFortNavArea* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortNavArea>();
	}
};
DUMPER7_ASSERTS_UFortNavArea;

// Class FortniteAI.FortNavArea_TakerOnly
// 0x0000 (0x0050 - 0x0050)
class UFortNavArea_TakerOnly final : public UFortNavArea
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortNavArea_TakerOnly")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortNavArea_TakerOnly")
	}
	static class UFortNavArea_TakerOnly* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortNavArea_TakerOnly>();
	}
};
DUMPER7_ASSERTS_UFortNavArea_TakerOnly;

// Class FortniteAI.FortPhysicsObjectNavigationComponent
// 0x0010 (0x0240 - 0x0230)
class UFortPhysicsObjectNavigationComponent : public UFortNavModifierComponent
{
public:
	class UFortPhysicsObjectComponent*            PhysicsObjectComponent;                            // 0x0230(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_238[0x8];                                      // 0x0238(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnSleepStateChanged(class UPrimitiveComponent* SimulatingComponent, bool bIsAwake);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortPhysicsObjectNavigationComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortPhysicsObjectNavigationComponent")
	}
	static class UFortPhysicsObjectNavigationComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortPhysicsObjectNavigationComponent>();
	}
};
DUMPER7_ASSERTS_UFortPhysicsObjectNavigationComponent;

// Class FortniteAI.FortAthenaAISpawnerDataComponent_OptimBase
// 0x0000 (0x0030 - 0x0030)
class UFortAthenaAISpawnerDataComponent_OptimBase : public UFortAthenaAISpawnerDataComponent
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortAthenaAISpawnerDataComponent_OptimBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortAthenaAISpawnerDataComponent_OptimBase")
	}
	static class UFortAthenaAISpawnerDataComponent_OptimBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAthenaAISpawnerDataComponent_OptimBase>();
	}
};
DUMPER7_ASSERTS_UFortAthenaAISpawnerDataComponent_OptimBase;

// Class FortniteAI.FortAthenaAISpawnerDataComponent_AIPawnOptim
// 0x0008 (0x0038 - 0x0030)
class UFortAthenaAISpawnerDataComponent_AIPawnOptim final : public UFortAthenaAISpawnerDataComponent_OptimBase
{
public:
	uint8                                         bRegisterToAIDropper : 1;                          // 0x0030(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate))
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortAthenaAISpawnerDataComponent_AIPawnOptim")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortAthenaAISpawnerDataComponent_AIPawnOptim")
	}
	static class UFortAthenaAISpawnerDataComponent_AIPawnOptim* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAthenaAISpawnerDataComponent_AIPawnOptim>();
	}
};
DUMPER7_ASSERTS_UFortAthenaAISpawnerDataComponent_AIPawnOptim;

// Class FortniteAI.FortAIAimingInterface
// 0x0000 (0x0000 - 0x0000)
class IFortAIAimingInterface final
{
public:
	void GetAimingRotation(struct FRotator* OutRotation);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortAIAimingInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortAIAimingInterface")
	}
	static class IFortAIAimingInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IFortAIAimingInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IFortAIAimingInterface;

// Class FortniteAI.FortAIAimingManagerInterface
// 0x0000 (0x0000 - 0x0000)
class IFortAIAimingManagerInterface final
{
public:
	void ComputeAimingRotations();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortAIAimingManagerInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortAIAimingManagerInterface")
	}
	static class IFortAIAimingManagerInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IFortAIAimingManagerInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IFortAIAimingManagerInterface;

// Class FortniteAI.FortAthenaAISpawnerDataComponent_ScriptBase
// 0x0000 (0x0030 - 0x0030)
class UFortAthenaAISpawnerDataComponent_ScriptBase : public UFortAthenaAISpawnerDataComponent
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortAthenaAISpawnerDataComponent_ScriptBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortAthenaAISpawnerDataComponent_ScriptBase")
	}
	static class UFortAthenaAISpawnerDataComponent_ScriptBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAthenaAISpawnerDataComponent_ScriptBase>();
	}
};
DUMPER7_ASSERTS_UFortAthenaAISpawnerDataComponent_ScriptBase;

// Class FortniteAI.FortAIInjectedBehaviorComponent
// 0x0050 (0x00F0 - 0x00A0)
class UFortAIInjectedBehaviorComponent final : public UActorComponent
{
public:
	uint8                                         Pad_A0[0x50];                                      // 0x00A0(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortAIInjectedBehaviorComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortAIInjectedBehaviorComponent")
	}
	static class UFortAIInjectedBehaviorComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAIInjectedBehaviorComponent>();
	}
};
DUMPER7_ASSERTS_UFortAIInjectedBehaviorComponent;

// Class FortniteAI.FortAthenaAISpawnerDataComponent_CosmeticBase
// 0x0000 (0x0030 - 0x0030)
class UFortAthenaAISpawnerDataComponent_CosmeticBase : public UFortAthenaAISpawnerDataComponent
{
public:
	void GetFallbackTag(struct FGameplayTag* OutFallbackTag);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortAthenaAISpawnerDataComponent_CosmeticBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortAthenaAISpawnerDataComponent_CosmeticBase")
	}
	static class UFortAthenaAISpawnerDataComponent_CosmeticBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAthenaAISpawnerDataComponent_CosmeticBase>();
	}
};
DUMPER7_ASSERTS_UFortAthenaAISpawnerDataComponent_CosmeticBase;

// Class FortniteAI.FortAthenaAISpawnerDataComponent_AIPawnCosmeticBase
// 0x0000 (0x0030 - 0x0030)
class UFortAthenaAISpawnerDataComponent_AIPawnCosmeticBase : public UFortAthenaAISpawnerDataComponent_CosmeticBase
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortAthenaAISpawnerDataComponent_AIPawnCosmeticBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortAthenaAISpawnerDataComponent_AIPawnCosmeticBase")
	}
	static class UFortAthenaAISpawnerDataComponent_AIPawnCosmeticBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAthenaAISpawnerDataComponent_AIPawnCosmeticBase>();
	}
};
DUMPER7_ASSERTS_UFortAthenaAISpawnerDataComponent_AIPawnCosmeticBase;

// Class FortniteAI.FortAthenaAISpawnerDataComponent_AIPawnCosmeticCustomization
// 0x0018 (0x0048 - 0x0030)
class UFortAthenaAISpawnerDataComponent_AIPawnCosmeticCustomization final : public UFortAthenaAISpawnerDataComponent_AIPawnCosmeticBase
{
public:
	struct FGameplayTag                           FallbackTag;                                       // 0x0030(0x0004)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAIPawnCustomizationDefinition*     CustomizationDefinition;                           // 0x0038(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bCanUnloadCustomization;                           // 0x0040(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortAthenaAISpawnerDataComponent_AIPawnCosmeticCustomization")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortAthenaAISpawnerDataComponent_AIPawnCosmeticCustomization")
	}
	static class UFortAthenaAISpawnerDataComponent_AIPawnCosmeticCustomization* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAthenaAISpawnerDataComponent_AIPawnCosmeticCustomization>();
	}
};
DUMPER7_ASSERTS_UFortAthenaAISpawnerDataComponent_AIPawnCosmeticCustomization;

// Class FortniteAI.FortAIPawnSmartObjectUserComponent
// 0x0000 (0x0248 - 0x0248)
class UFortAIPawnSmartObjectUserComponent final : public UFortAISmartObjectUserComponent
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortAIPawnSmartObjectUserComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortAIPawnSmartObjectUserComponent")
	}
	static class UFortAIPawnSmartObjectUserComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAIPawnSmartObjectUserComponent>();
	}
};
DUMPER7_ASSERTS_UFortAIPawnSmartObjectUserComponent;

// Class FortniteAI.FortAIPerceptionSystem
// 0x0000 (0x0130 - 0x0130)
class UFortAIPerceptionSystem final : public UAIPerceptionSystem
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortAIPerceptionSystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortAIPerceptionSystem")
	}
	static class UFortAIPerceptionSystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAIPerceptionSystem>();
	}
};
DUMPER7_ASSERTS_UFortAIPerceptionSystem;

// Class FortniteAI.FortAthenaAISpawnerDataComponent_PerksBase
// 0x0010 (0x0040 - 0x0030)
class UFortAthenaAISpawnerDataComponent_PerksBase final : public UFortAthenaAISpawnerDataComponent
{
public:
	TArray<struct FPerkAvailabilityContainer>     PerksContainers;                                   // 0x0030(0x0010)(Edit, ZeroConstructor, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortAthenaAISpawnerDataComponent_PerksBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortAthenaAISpawnerDataComponent_PerksBase")
	}
	static class UFortAthenaAISpawnerDataComponent_PerksBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAthenaAISpawnerDataComponent_PerksBase>();
	}
};
DUMPER7_ASSERTS_UFortAthenaAISpawnerDataComponent_PerksBase;

// Class FortniteAI.FortAsyncAction_IsInitialNavSystemBuildLockCompleted
// 0x0018 (0x0048 - 0x0030)
class UFortAsyncAction_IsInitialNavSystemBuildLockCompleted final : public UBlueprintAsyncActionBase
{
public:
	TMulticastInlineDelegate<void()>              OnInitialNavSystemBuildLockCompleted;              // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UWorld*                                 World;                                             // 0x0040(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UFortAsyncAction_IsInitialNavSystemBuildLockCompleted* InitialNavSystemBuildLockCompleted(class UObject* WorldContextObject);

	void HandleInitialNavigationLockReleased();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortAsyncAction_IsInitialNavSystemBuildLockCompleted")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortAsyncAction_IsInitialNavSystemBuildLockCompleted")
	}
	static class UFortAsyncAction_IsInitialNavSystemBuildLockCompleted* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAsyncAction_IsInitialNavSystemBuildLockCompleted>();
	}
};
DUMPER7_ASSERTS_UFortAsyncAction_IsInitialNavSystemBuildLockCompleted;

// Class FortniteAI.FortAthenaAIBotCharacterCustomization
// 0x0170 (0x0198 - 0x0028)
class UFortAthenaAIBotCharacterCustomization final : public UObject
{
public:
	TStructCycleFixup<struct FFortAthenaLoadout, 0x0170, 0x08> CustomizationLoadout;                 // 0x0028(0x0170)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortAthenaAIBotCharacterCustomization")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortAthenaAIBotCharacterCustomization")
	}
	static class UFortAthenaAIBotCharacterCustomization* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAthenaAIBotCharacterCustomization>();
	}
};
DUMPER7_ASSERTS_UFortAthenaAIBotCharacterCustomization;

// Class FortniteAI.FortAthenaAIBotInventoryItems
// 0x0010 (0x0038 - 0x0028)
class UFortAthenaAIBotInventoryItems final : public UObject
{
public:
	TArray<struct FItemAndCount>                  Items;                                             // 0x0028(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortAthenaAIBotInventoryItems")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortAthenaAIBotInventoryItems")
	}
	static class UFortAthenaAIBotInventoryItems* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAthenaAIBotInventoryItems>();
	}
};
DUMPER7_ASSERTS_UFortAthenaAIBotInventoryItems;

// Class FortniteAI.FortAthenaAIBotReactToVerbDigestedSkillSet
// 0x0008 (0x0038 - 0x0030)
class UFortAthenaAIBotReactToVerbDigestedSkillSet final : public UFortAthenaAIBotDigestedSkillSet
{
public:
	float                                         OverriddenReactionDistance;                        // 0x0030(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         OverriddenHighPriorityReactionDistance;            // 0x0034(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortAthenaAIBotReactToVerbDigestedSkillSet")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortAthenaAIBotReactToVerbDigestedSkillSet")
	}
	static class UFortAthenaAIBotReactToVerbDigestedSkillSet* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAthenaAIBotReactToVerbDigestedSkillSet>();
	}
};
DUMPER7_ASSERTS_UFortAthenaAIBotReactToVerbDigestedSkillSet;

// Class FortniteAI.FortAthenaAIRuntimeParameters_Hearing
// 0x0030 (0x0060 - 0x0030)
class UFortAthenaAIRuntimeParameters_Hearing final : public UFortAthenaAIRuntimeParameters
{
public:
	bool                                          bOverrideHearingRange;                             // 0x0030(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  OverrideHearingRangeConditionTag;                  // 0x0038(0x0020)(Transient, NativeAccessSpecifierPrivate)
	float                                         HearingRadius;                                     // 0x0058(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bRestrictOverrideToUnaware;                        // 0x005C(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortAthenaAIRuntimeParameters_Hearing")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortAthenaAIRuntimeParameters_Hearing")
	}
	static class UFortAthenaAIRuntimeParameters_Hearing* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAthenaAIRuntimeParameters_Hearing>();
	}
};
DUMPER7_ASSERTS_UFortAthenaAIRuntimeParameters_Hearing;

// Class FortniteAI.FortAthenaAIBotSkillSet
// 0x0008 (0x0030 - 0x0028)
class UFortAthenaAIBotSkillSet : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortAthenaAIBotSkillSet")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortAthenaAIBotSkillSet")
	}
	static class UFortAthenaAIBotSkillSet* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAthenaAIBotSkillSet>();
	}
};
DUMPER7_ASSERTS_UFortAthenaAIBotSkillSet;

// Class FortniteAI.FortAthenaAIBotReactToVerbSkillSet
// 0x0050 (0x0080 - 0x0030)
class UFortAthenaAIBotReactToVerbSkillSet final : public UFortAthenaAIBotSkillSet
{
public:
	struct FScalableFloat                         OverriddenReactionDistance;                        // 0x0030(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         OverriddenHighPriorityReactionDistance;            // 0x0058(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortAthenaAIBotReactToVerbSkillSet")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortAthenaAIBotReactToVerbSkillSet")
	}
	static class UFortAthenaAIBotReactToVerbSkillSet* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAthenaAIBotReactToVerbSkillSet>();
	}
};
DUMPER7_ASSERTS_UFortAthenaAIBotReactToVerbSkillSet;

// Class FortniteAI.FortAthenaAIControllerInterface
// 0x0000 (0x0000 - 0x0000)
class IFortAthenaAIControllerInterface final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortAthenaAIControllerInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortAthenaAIControllerInterface")
	}
	static class IFortAthenaAIControllerInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IFortAthenaAIControllerInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IFortAthenaAIControllerInterface;

// Class FortniteAI.FortAthenaAILODSettings
// 0x0000 (0x0000 - 0x0000)
class IFortAthenaAILODSettings final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortAthenaAILODSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortAthenaAILODSettings")
	}
	static class IFortAthenaAILODSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<IFortAthenaAILODSettings>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IFortAthenaAILODSettings;

// Class FortniteAI.FortAthenaNpcPatrollingComponent
// 0x0058 (0x00F8 - 0x00A0)
class UFortAthenaNpcPatrollingComponent final : public UActorComponent
{
public:
	class AAIController*                          CachedAIController;                                // 0x00A0(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TMulticastInlineDelegate<void()>              OnStartPatrollingEvent;                            // 0x00A8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPrivate)
	TMulticastInlineDelegate<void()>              OnStopPatrollingEvent;                             // 0x00B8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPrivate)
	class AFortAthenaPatrolPath*                  PatrolPath;                                        // 0x00C8(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_D0[0x28];                                      // 0x00D0(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool FindAndSetDynamicPatrolPath(const struct FFortAthenaAIObjectTrackerQuery& FindQuery, const bool bOrientationAlreadyRandomized, const bool bExcludeCurrentlyUsedPatrolPath);
	void OnPatrolPathStatusChanged(const bool bEnableState);
	void RemovePatrolPath();
	void SelectNextPatrolPoint();
	void SetPatrolPath(class AFortAthenaPatrolPath* NewPatrolPath, const bool bOrientationAlreadyRandomized);
	void UpdateCurrentDestinationToNearestNextPoint();

	class AFortAthenaPatrolPoint* GetCurrentPatrolPoint() const;
	const class AFortAthenaPatrolPath* GetPatrolPath() const;
	int32 GetPatrolPointsCount() const;
	bool IsCurrentPatrolPointAnEndPoint() const;
	bool IsPatrollingEnable() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortAthenaNpcPatrollingComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortAthenaNpcPatrollingComponent")
	}
	static class UFortAthenaNpcPatrollingComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAthenaNpcPatrollingComponent>();
	}
};
DUMPER7_ASSERTS_UFortAthenaNpcPatrollingComponent;

// Class FortniteAI.FortAthenaAILODSettings_AIEvaluator
// 0x0288 (0x02B0 - 0x0028)
class UFortAthenaAILODSettings_AIEvaluator final : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TSubclassOf<class UFortAthenaAIEvaluator>> SystemClasses;                                 // 0x0030(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, UObjectWrapper, NativeAccessSpecifierPrivate)
	struct FFortAILODSetting_AIEvaluator          BelowLowerLODSettings;                             // 0x0040(0x0068)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FFortAILODSetting_AIEvaluator          LowerLODSettings;                                  // 0x00A8(0x0068)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FFortAILODSetting_AIEvaluator          AboveLowerLODSettings;                             // 0x0110(0x0068)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FFortAILODSetting_AIEvaluator          BelowNormalLODSettings;                            // 0x0178(0x0068)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FFortAILODSetting_AIEvaluator          NormalLODSettings;                                 // 0x01E0(0x0068)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FFortAILODSetting_AIEvaluator          AboveNormalLODSettings;                            // 0x0248(0x0068)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortAthenaAILODSettings_AIEvaluator")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortAthenaAILODSettings_AIEvaluator")
	}
	static class UFortAthenaAILODSettings_AIEvaluator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAthenaAILODSettings_AIEvaluator>();
	}
};
DUMPER7_ASSERTS_UFortAthenaAILODSettings_AIEvaluator;

// Class FortniteAI.FortAthenaBTTask_DynamicBlueprint
// 0x0010 (0x0080 - 0x0070)
class UFortAthenaBTTask_DynamicBlueprint final : public UBTTaskNode
{
public:
	class FName                                   DynamicBlueprintStatusKeyName;                     // 0x0070(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   DynamicBlueprintActorKeyName;                      // 0x0074(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_78[0x8];                                       // 0x0078(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortAthenaBTTask_DynamicBlueprint")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortAthenaBTTask_DynamicBlueprint")
	}
	static class UFortAthenaBTTask_DynamicBlueprint* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAthenaBTTask_DynamicBlueprint>();
	}
};
DUMPER7_ASSERTS_UFortAthenaBTTask_DynamicBlueprint;

// Class FortniteAI.FortAthenaAILODSettings_FortWeaponRanged
// 0x0288 (0x02B0 - 0x0028)
class UFortAthenaAILODSettings_FortWeaponRanged final : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TSubclassOf<class AFortWeaponRanged>>  SystemClasses;                                     // 0x0030(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, UObjectWrapper, NativeAccessSpecifierPrivate)
	struct FFortAILODSetting_FortWeaponRanged     BelowLowerLODSettings;                             // 0x0040(0x0068)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
