#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FortSoundCueTemplates

#include "Basic.hpp"

#include "SoundCueTemplates_classes.hpp"
#include "FortSoundCueTemplates_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "DeveloperSettings_classes.hpp"


namespace SDK
{

// Class FortSoundCueTemplates.FortSoundCueTemplateBase
// 0x0000 (0x0560 - 0x0560)
class UFortSoundCueTemplateBase : public USoundCueTemplate
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortSoundCueTemplateBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortSoundCueTemplateBase")
	}
	static class UFortSoundCueTemplateBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortSoundCueTemplateBase>();
	}
};
DUMPER7_ASSERTS_UFortSoundCueTemplateBase;

// Class FortSoundCueTemplates.EmoteBase
// 0x0000 (0x0560 - 0x0560)
class UEmoteBase : public UFortSoundCueTemplateBase
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EmoteBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EmoteBase")
	}
	static class UEmoteBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEmoteBase>();
	}
};
DUMPER7_ASSERTS_UEmoteBase;

// Class FortSoundCueTemplates.EmoteFoley
// 0x0000 (0x0560 - 0x0560)
class UEmoteFoley final : public UEmoteBase
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EmoteFoley")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EmoteFoley")
	}
	static class UEmoteFoley* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEmoteFoley>();
	}
};
DUMPER7_ASSERTS_UEmoteFoley;

// Class FortSoundCueTemplates.EmoteMusic
// 0x0000 (0x0560 - 0x0560)
class UEmoteMusic final : public UEmoteBase
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EmoteMusic")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EmoteMusic")
	}
	static class UEmoteMusic* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEmoteMusic>();
	}
};
DUMPER7_ASSERTS_UEmoteMusic;

// Class FortSoundCueTemplates.EmoteMusic3P
// 0x0000 (0x0560 - 0x0560)
class UEmoteMusic3P final : public UEmoteBase
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EmoteMusic3P")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EmoteMusic3P")
	}
	static class UEmoteMusic3P* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEmoteMusic3P>();
	}
};
DUMPER7_ASSERTS_UEmoteMusic3P;

// Class FortSoundCueTemplates.PlayerFoleyBase
// 0x0000 (0x0560 - 0x0560)
class UPlayerFoleyBase : public UFortSoundCueTemplateBase
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PlayerFoleyBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PlayerFoleyBase")
	}
	static class UPlayerFoleyBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlayerFoleyBase>();
	}
};
DUMPER7_ASSERTS_UPlayerFoleyBase;

// Class FortSoundCueTemplates.PlayerFoley
// 0x0000 (0x0560 - 0x0560)
class UPlayerFoley : public UPlayerFoleyBase
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PlayerFoley")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PlayerFoley")
	}
	static class UPlayerFoley* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlayerFoley>();
	}
};
DUMPER7_ASSERTS_UPlayerFoley;

// Class FortSoundCueTemplates.FootstepFoley
// 0x0000 (0x0560 - 0x0560)
class UFootstepFoley final : public UPlayerFoley
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FootstepFoley")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FootstepFoley")
	}
	static class UFootstepFoley* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFootstepFoley>();
	}
};
DUMPER7_ASSERTS_UFootstepFoley;

// Class FortSoundCueTemplates.FortSoundCueTemplateDefaults
// 0x0060 (0x0090 - 0x0030)
class UFortSoundCueTemplateDefaults : public UDataAsset
{
public:
	class USoundClass*                            SoundClass;                                        // 0x0030(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USoundAttenuation*                      Attenuation;                                       // 0x0038(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USoundConcurrency*                      Concurrency;                                       // 0x0040(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         VolumeMultiplier;                                  // 0x0048(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PitchMultiplier;                                   // 0x004C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FFortSubmixPair>                SubmixSends;                                       // 0x0050(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<struct FFortBusPair>                   PreEffectBusSends;                                 // 0x0060(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<struct FFortBusPair>                   PostEffectBusSends;                                // 0x0070(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	class USoundWave*                             LicensedTrackAlternative;                          // 0x0080(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USoundSubmixBase*                       LicensedSubmix;                                    // 0x0088(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortSoundCueTemplateDefaults")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortSoundCueTemplateDefaults")
	}
	static class UFortSoundCueTemplateDefaults* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortSoundCueTemplateDefaults>();
	}
};
DUMPER7_ASSERTS_UFortSoundCueTemplateDefaults;

// Class FortSoundCueTemplates.FortSoundCueTemplateDefaultSettings
// 0x0050 (0x0080 - 0x0030)
class UFortSoundCueTemplateDefaultSettings final : public UDataAsset
{
public:
	TMap<TSubclassOf<class UFortSoundCueTemplateBase>, class UFortSoundCueTemplateDefaults*> TemplateDefaults; // 0x0030(0x0050)(Edit, DisableEditOnInstance, UObjectWrapper, NativeAccessSpecifierPublic)

public:
	class UFortSoundCueTemplateDefaults* GetSettingsForTemplateType(TSubclassOf<class UFortSoundCueTemplateBase> TemplateType);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortSoundCueTemplateDefaultSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortSoundCueTemplateDefaultSettings")
	}
	static class UFortSoundCueTemplateDefaultSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortSoundCueTemplateDefaultSettings>();
	}
};
DUMPER7_ASSERTS_UFortSoundCueTemplateDefaultSettings;

// Class FortSoundCueTemplates.FortSoundCueTemplateSettings
// 0x0020 (0x0050 - 0x0030)
class UFortSoundCueTemplateSettings final : public UDeveloperSettings
{
public:
	TSoftObjectPtr<class UFortSoundCueTemplateDefaultSettings> DefaultTemplateSettings;              // 0x0030(0x0020)(Edit, Config, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	class UFortSoundCueTemplateDefaults* GetDefaultSettingsForTemplateType(TSubclassOf<class UFortSoundCueTemplateBase> TemplateType) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortSoundCueTemplateSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortSoundCueTemplateSettings")
	}
	static class UFortSoundCueTemplateSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortSoundCueTemplateSettings>();
	}
};
DUMPER7_ASSERTS_UFortSoundCueTemplateSettings;

// Class FortSoundCueTemplates.FortSoundCueTemplateSimple
// 0x0000 (0x0560 - 0x0560)
class UFortSoundCueTemplateSimple : public UFortSoundCueTemplateBase
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortSoundCueTemplateSimple")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortSoundCueTemplateSimple")
	}
	static class UFortSoundCueTemplateSimple* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortSoundCueTemplateSimple>();
	}
};
DUMPER7_ASSERTS_UFortSoundCueTemplateSimple;

// Class FortSoundCueTemplates.GliderThrustSCTDefaults
// 0x0160 (0x01F0 - 0x0090)
class UGliderThrustSCTDefaults final : public UFortSoundCueTemplateDefaults
{
public:
	struct FGliderThrustData                      Forward;                                           // 0x0090(0x0058)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	struct FGliderThrustData                      Sideways;                                          // 0x00E8(0x0058)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	struct FGliderThrustData                      Backwards;                                         // 0x0140(0x0058)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	struct FGliderThrustData                      AnyDirection;                                      // 0x0198(0x0058)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GliderThrustSCTDefaults")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GliderThrustSCTDefaults")
	}
	static class UGliderThrustSCTDefaults* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGliderThrustSCTDefaults>();
	}
};
DUMPER7_ASSERTS_UGliderThrustSCTDefaults;

// Class FortSoundCueTemplates.GliderThrustLoop
// 0x0000 (0x0560 - 0x0560)
class UGliderThrustLoop final : public UFortSoundCueTemplateBase
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GliderThrustLoop")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GliderThrustLoop")
	}
	static class UGliderThrustLoop* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGliderThrustLoop>();
	}
};
DUMPER7_ASSERTS_UGliderThrustLoop;

// Class FortSoundCueTemplates.GliderThrustStart
// 0x0000 (0x0560 - 0x0560)
class UGliderThrustStart final : public UFortSoundCueTemplateBase
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GliderThrustStart")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GliderThrustStart")
	}
	static class UGliderThrustStart* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGliderThrustStart>();
	}
};
DUMPER7_ASSERTS_UGliderThrustStart;

// Class FortSoundCueTemplates.GliderOpen
// 0x0000 (0x0560 - 0x0560)
class UGliderOpen final : public UFortSoundCueTemplateSimple
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GliderOpen")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GliderOpen")
	}
	static class UGliderOpen* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGliderOpen>();
	}
};
DUMPER7_ASSERTS_UGliderOpen;

// Class FortSoundCueTemplates.GliderClose
// 0x0000 (0x0560 - 0x0560)
class UGliderClose final : public UFortSoundCueTemplateSimple
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GliderClose")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GliderClose")
	}
	static class UGliderClose* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGliderClose>();
	}
};
DUMPER7_ASSERTS_UGliderClose;

// Class FortSoundCueTemplates.MusicPack
// 0x0000 (0x0560 - 0x0560)
class UMusicPack final : public UFortSoundCueTemplateBase
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MusicPack")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MusicPack")
	}
	static class UMusicPack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMusicPack>();
	}
};
DUMPER7_ASSERTS_UMusicPack;

// Class FortSoundCueTemplates.PhysicsStateSCTDefaults
// 0x0248 (0x02D8 - 0x0090)
class UPhysicsStateSCTDefaults final : public UFortSoundCueTemplateDefaults
{
public:
	class FName                                   SpeedParameterName;                                // 0x0090(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPhysicsStateData                      Rolling;                                           // 0x0098(0x0090)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	struct FPhysicsStateData                      Sliding;                                           // 0x0128(0x0090)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	struct FPhysicsStateData                      Flying;                                            // 0x01B8(0x0090)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	struct FPhysicsStateData                      Floating;                                          // 0x0248(0x0090)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PhysicsStateSCTDefaults")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PhysicsStateSCTDefaults")
	}
	static class UPhysicsStateSCTDefaults* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPhysicsStateSCTDefaults>();
	}
};
DUMPER7_ASSERTS_UPhysicsStateSCTDefaults;

// Class FortSoundCueTemplates.PhysicsStateLoop
// 0x0000 (0x0560 - 0x0560)
class UPhysicsStateLoop final : public UFortSoundCueTemplateBase
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PhysicsStateLoop")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PhysicsStateLoop")
	}
	static class UPhysicsStateLoop* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPhysicsStateLoop>();
	}
};
DUMPER7_ASSERTS_UPhysicsStateLoop;

// Class FortSoundCueTemplates.PhysicsImpactSCTDefaults
// 0x0110 (0x01A0 - 0x0090)
class UPhysicsImpactSCTDefaults final : public UFortSoundCueTemplateDefaults
{
public:
	class FName                                   ImpactTypeParameterName;                           // 0x0090(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   StrengthParameterName;                             // 0x0094(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPhysicsImpactData                     Light;                                             // 0x0098(0x0058)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FPhysicsImpactData                     Medium;                                            // 0x00F0(0x0058)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FPhysicsImpactData                     Heavy;                                             // 0x0148(0x0058)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PhysicsImpactSCTDefaults")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PhysicsImpactSCTDefaults")
	}
	static class UPhysicsImpactSCTDefaults* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPhysicsImpactSCTDefaults>();
	}
};
DUMPER7_ASSERTS_UPhysicsImpactSCTDefaults;

// Class FortSoundCueTemplates.PhysicsImpact
// 0x0000 (0x0560 - 0x0560)
class UPhysicsImpact final : public UFortSoundCueTemplateBase
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PhysicsImpact")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PhysicsImpact")
	}
	static class UPhysicsImpact* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPhysicsImpact>();
	}
};
DUMPER7_ASSERTS_UPhysicsImpact;

// Class FortSoundCueTemplates.PickaxeSCTDefaults
// 0x0020 (0x00B0 - 0x0090)
class UPickaxeSCTDefaults final : public UFortSoundCueTemplateDefaults
{
public:
	class USoundAttenuation*                      CloseAttenuation;                                  // 0x0090(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USoundAttenuation*                      DistantAttenuation;                                // 0x0098(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class USoundWave*>                     DistantVariations;                                 // 0x00A0(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, UObjectWrapper, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PickaxeSCTDefaults")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PickaxeSCTDefaults")
	}
	static class UPickaxeSCTDefaults* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPickaxeSCTDefaults>();
	}
};
DUMPER7_ASSERTS_UPickaxeSCTDefaults;

// Class FortSoundCueTemplates.PickaxeBase
// 0x0000 (0x0560 - 0x0560)
class UPickaxeBase : public UFortSoundCueTemplateBase
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PickaxeBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PickaxeBase")
	}
	static class UPickaxeBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPickaxeBase>();
	}
};
DUMPER7_ASSERTS_UPickaxeBase;

// Class FortSoundCueTemplates.PickaxeSwing
// 0x0000 (0x0560 - 0x0560)
class UPickaxeSwing final : public UPickaxeBase
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PickaxeSwing")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PickaxeSwing")
	}
	static class UPickaxeSwing* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPickaxeSwing>();
	}
};
DUMPER7_ASSERTS_UPickaxeSwing;

// Class FortSoundCueTemplates.PickaxeReady
// 0x0000 (0x0560 - 0x0560)
class UPickaxeReady final : public UPickaxeBase
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PickaxeReady")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PickaxeReady")
	}
	static class UPickaxeReady* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPickaxeReady>();
	}
};
DUMPER7_ASSERTS_UPickaxeReady;

// Class FortSoundCueTemplates.PickaxeImpactEnemy
// 0x0000 (0x0560 - 0x0560)
class UPickaxeImpactEnemy final : public UFortSoundCueTemplateSimple
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PickaxeImpactEnemy")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PickaxeImpactEnemy")
	}
	static class UPickaxeImpactEnemy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPickaxeImpactEnemy>();
	}
};
DUMPER7_ASSERTS_UPickaxeImpactEnemy;

// Class FortSoundCueTemplates.PlayerFoleyDefaults
// 0x0048 (0x00D8 - 0x0090)
class UPlayerFoleyDefaults final : public UFortSoundCueTemplateDefaults
{
public:
	class USoundClass*                            LocalPlayerSoundClass;                             // 0x0090(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USoundClass*                            TeammateSoundClass;                                // 0x0098(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USoundClass*                            HostileSoundClass;                                 // 0x00A0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USoundAttenuation*                      LocalPlayerAttenuation;                            // 0x00A8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USoundAttenuation*                      AboveAttenuation;                                  // 0x00B0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USoundAttenuation*                      BelowAttenuation;                                  // 0x00B8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USoundAttenuation*                      ParallelAttenuation;                               // 0x00C0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FDistanceDatum>                 ElevationCrossfadeDistances;                       // 0x00C8(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PlayerFoleyDefaults")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PlayerFoleyDefaults")
	}
	static class UPlayerFoleyDefaults* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlayerFoleyDefaults>();
	}
};
DUMPER7_ASSERTS_UPlayerFoleyDefaults;

// Class FortSoundCueTemplates.WeaponLowAmmo
// 0x0000 (0x0560 - 0x0560)
class UWeaponLowAmmo final : public UFortSoundCueTemplateSimple
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("WeaponLowAmmo")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WeaponLowAmmo")
	}
	static class UWeaponLowAmmo* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWeaponLowAmmo>();
	}
};
DUMPER7_ASSERTS_UWeaponLowAmmo;

// Class FortSoundCueTemplates.WeaponOutOfAmmo
// 0x0000 (0x0560 - 0x0560)
class UWeaponOutOfAmmo final : public UFortSoundCueTemplateSimple
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("WeaponOutOfAmmo")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WeaponOutOfAmmo")
	}
	static class UWeaponOutOfAmmo* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWeaponOutOfAmmo>();
	}
};
DUMPER7_ASSERTS_UWeaponOutOfAmmo;

// Class FortSoundCueTemplates.WeaponReloadStart
// 0x0000 (0x0560 - 0x0560)
class UWeaponReloadStart final : public UFortSoundCueTemplateSimple
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("WeaponReloadStart")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WeaponReloadStart")
	}
	static class UWeaponReloadStart* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWeaponReloadStart>();
	}
};
DUMPER7_ASSERTS_UWeaponReloadStart;

// Class FortSoundCueTemplates.WeaponReloadInsert
// 0x0000 (0x0560 - 0x0560)
class UWeaponReloadInsert final : public UFortSoundCueTemplateSimple
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("WeaponReloadInsert")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WeaponReloadInsert")
	}
	static class UWeaponReloadInsert* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWeaponReloadInsert>();
	}
};
DUMPER7_ASSERTS_UWeaponReloadInsert;

// Class FortSoundCueTemplates.WeaponReloadEnd
// 0x0000 (0x0560 - 0x0560)
class UWeaponReloadEnd final : public UFortSoundCueTemplateSimple
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("WeaponReloadEnd")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WeaponReloadEnd")
	}
	static class UWeaponReloadEnd* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWeaponReloadEnd>();
	}
};
DUMPER7_ASSERTS_UWeaponReloadEnd;

// Class FortSoundCueTemplates.WeaponTargetingStart
// 0x0000 (0x0560 - 0x0560)
class UWeaponTargetingStart final : public UFortSoundCueTemplateSimple
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("WeaponTargetingStart")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WeaponTargetingStart")
	}
	static class UWeaponTargetingStart* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWeaponTargetingStart>();
	}
};
DUMPER7_ASSERTS_UWeaponTargetingStart;

// Class FortSoundCueTemplates.WeaponTargetingEnd
// 0x0000 (0x0560 - 0x0560)
class UWeaponTargetingEnd final : public UFortSoundCueTemplateSimple
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("WeaponTargetingEnd")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WeaponTargetingEnd")
	}
	static class UWeaponTargetingEnd* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWeaponTargetingEnd>();
	}
};
DUMPER7_ASSERTS_UWeaponTargetingEnd;

}

