#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FortniteConversationUI

#include "Basic.hpp"

#include "CommonUI_classes.hpp"
#include "FortniteGame_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "FortniteConversationUI_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "FortniteUI_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteConversationRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class FortniteConversationUI.FortConversationOptionBrief
// 0x0000 (0x02E8 - 0x02E8)
class UFortConversationOptionBrief : public UCommonUserWidget
{
public:
	void ConfigureBP(const struct FConversationContext& ClientContext, const struct FClientConversationOptionEntry& OptionEntry, const int32 SelectedIndex);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortConversationOptionBrief")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortConversationOptionBrief")
	}
	static class UFortConversationOptionBrief* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortConversationOptionBrief>();
	}
};
DUMPER7_ASSERTS_UFortConversationOptionBrief;

// Class FortniteConversationUI.FortItemTransactionBrief
// 0x0018 (0x0300 - 0x02E8)
class UFortItemTransactionBrief : public UFortConversationOptionBrief
{
public:
	uint8                                         Pad_2E8[0x8];                                      // 0x02E8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortTransactionStrip*                  TransactionStrip_Main;                             // 0x02F0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortItem*                              DisplayItem;                                       // 0x02F8(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnTransactionInfoReceived(class UFortItem* Item);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortItemTransactionBrief")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortItemTransactionBrief")
	}
	static class UFortItemTransactionBrief* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortItemTransactionBrief>();
	}
};
DUMPER7_ASSERTS_UFortItemTransactionBrief;

// Class FortniteConversationUI.FortApplyAbilityBrief
// 0x0020 (0x0320 - 0x0300)
class UFortApplyAbilityBrief final : public UFortItemTransactionBrief
{
public:
	class FText                                   PurchaseServiceText;                               // 0x0300(0x0018)(Edit, Protected, NativeAccessSpecifierProtected)
	class UCommonRichTextBlock*                   Text_Display;                                      // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void OnAbleToPurchase();
	void OnUnableToPurchase(EPreventAbilityUseReason Reason);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortApplyAbilityBrief")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortApplyAbilityBrief")
	}
	static class UFortApplyAbilityBrief* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortApplyAbilityBrief>();
	}
};
DUMPER7_ASSERTS_UFortApplyAbilityBrief;

// Class FortniteConversationUI.FortBasicBrief
// 0x0000 (0x02E8 - 0x02E8)
class UFortBasicBrief final : public UFortConversationOptionBrief
{
public:
	void OnChoiceTextReceived(const class FText& Text);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortBasicBrief")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortBasicBrief")
	}
	static class UFortBasicBrief* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortBasicBrief>();
	}
};
DUMPER7_ASSERTS_UFortBasicBrief;

// Class FortniteConversationUI.FortBasicItemBrief
// 0x0070 (0x0358 - 0x02E8)
class UFortBasicItemBrief final : public UFortConversationOptionBrief
{
public:
	uint8                                         Pad_2E8[0x8];                                      // 0x02E8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonTextBlock*                       Text_TitleBar;                                     // 0x02F0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortTransactionStrip*                  TransactionStrip_Main;                             // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortItem*                              DisplayItem;                                       // 0x0300(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TMap<class FName, struct FDataDrivenServiceBriefConfig> ServiceConfigs;                          // 0x0308(0x0050)(Edit, NativeAccessSpecifierPrivate)

public:
	void OnAbleToUse(const bool bShowWarningMessage);
	void OnItemInfoReceived(class UFortItem* Item, int32 StackSize);
	void OnUnableToUse(const class FText& Reason);
	void OnUpdateDescriptionText(const class FText& DescriptionText);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortBasicItemBrief")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortBasicItemBrief")
	}
	static class UFortBasicItemBrief* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortBasicItemBrief>();
	}
};
DUMPER7_ASSERTS_UFortBasicItemBrief;

// Class FortniteConversationUI.FortBuyBrief
// 0x0000 (0x0300 - 0x0300)
class UFortBuyBrief final : public UFortItemTransactionBrief
{
public:
	void OnDisplayUnavailability(ECannotBuyReason CannotBuyReason);
	void OnPurchaseDataReceived(int32 StackSize, int32 RemainingForSale);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortBuyBrief")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortBuyBrief")
	}
	static class UFortBuyBrief* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortBuyBrief>();
	}
};
DUMPER7_ASSERTS_UFortBuyBrief;

// Class FortniteConversationUI.FortConversationMarker
// 0x00D8 (0x04A8 - 0x03D0)
class UFortConversationMarker final : public UFortActorIndicatorWidget
{
public:
	uint8                                         Pad_3D0[0x38];                                     // 0x03D0(0x0038)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                InitialOffset;                                     // 0x0408(0x0018)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FVector                                ManualOffset;                                      // 0x0420(0x0018)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         MessageBubbleDuration;                             // 0x0438(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         LastTextBubbleDuration;                            // 0x043C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bSetCustomInteractionWidgetOnlyWhenNeeded;         // 0x0440(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_441[0x7];                                      // 0x0441(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonVisibilitySwitcher*              Switcher_States;                                   // 0x0448(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UWidget*                                Overlay_PreviewState;                              // 0x0450(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_458[0x8];                                      // 0x0458(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortConversationMessageWidget*         ConversationMessage_Main;                          // 0x0460(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_468[0x8];                                      // 0x0468(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonTextBlock*                       Text_ParticipantName;                              // 0x0470(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_478[0x8];                                      // 0x0478(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortKeybindWidget*                     Keybind_Nameplate;                                 // 0x0480(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UImage*                                 NPCIcon;                                           // 0x0488(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UTexture2D*                             CustomDialogMarkerIndicatorIcon;                   // 0x0490(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UTexture2D*                             DefaultDialogMarkerIndicatorIcon;                  // 0x0498(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_4A0[0x8];                                      // 0x04A0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnCanInteract(bool bCanInteract);
	void OnConversationActorProximityChanged(EInteractionRange TargetInteractionRange, class UFortNonPlayerConversationParticipantComponent* ConversationComponent);
	void OnInteractionRangeChanged(EInteractionRange TargetInteractionRange);
	void OnMessageShownOverActor(class AActor* OverActor);
	void OnSetIndicatedActor(class AActor* NewIndicatorActor);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortConversationMarker")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortConversationMarker")
	}
	static class UFortConversationMarker* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortConversationMarker>();
	}
};
DUMPER7_ASSERTS_UFortConversationMarker;

// Class FortniteConversationUI.FortConversationMessageWidget
// 0x0000 (0x02C0 - 0x02C0)
class UFortConversationMessageWidget final : public UUserWidget
{
public:
	void OnMainMessageSet(const class FText& NPCName, const class FText& MessageBody);
	void OnMessageHidden();
	void OnMessageShown();
	void OnPreviewMessageSet(const class FText& PreviewText);
	void SetPreviewMessage(const class FText& MessageToSet);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortConversationMessageWidget")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortConversationMessageWidget")
	}
	static class UFortConversationMessageWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortConversationMessageWidget>();
	}
};
DUMPER7_ASSERTS_UFortConversationMessageWidget;

// Class FortniteConversationUI.FortConversationOption
// 0x00A0 (0x15E0 - 0x1540)
class UFortConversationOption final : public UFortRadialPickerEntry
{
public:
	uint8                                         Pad_1540[0x8];                                     // 0x1540(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             OnOptionConfirmedSound;                            // 0x1548(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USoundBase*                             OnOptionHoveredSound;                              // 0x1550(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonVisibilitySwitcher*              Switcher_DisplayAsset;                             // 0x1558(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftObjectPtr<class UObject>                 DefaultSoftTaskIcon;                               // 0x1560(0x0020)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftObjectPtr<class USoundBase>              DefaultConfirmChoiceSound;                         // 0x1580(0x0020)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftObjectPtr<class USoundBase>              DefaultHoverChoiceSound;                           // 0x15A0(0x0020)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_15C0[0x20];                                    // 0x15C0(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnOptionConfirmed();
	void OnSetupFromDisplayAsset(class UObject* DisplayAsset);
	void OnSetupFromItemDef(class UFortItem* Item);
	void OnSetupPivotFromRadialInformation(int32 NumElements, int32 ItemIndex);

	int32 GetUnlockLevel() const;
	bool IsAvailable() const;
	bool IsLocked() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortConversationOption")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortConversationOption")
	}
	static class UFortConversationOption* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortConversationOption>();
	}
};
DUMPER7_ASSERTS_UFortConversationOption;

// Class FortniteConversationUI.FortConversationOptionsPanel
// 0x0018 (0x01A8 - 0x0190)
class UFortConversationOptionsPanel final : public UPanelWidget
{
public:
	uint8                                         Pad_190[0x10];                                     // 0x0190(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MaxRows;                                           // 0x01A0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         MiddleColumnWidth;                                 // 0x01A4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	class UPanelSlot* AddChildToDynamicPanel(class UWidget* Content);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortConversationOptionsPanel")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortConversationOptionsPanel")
	}
	static class UFortConversationOptionsPanel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortConversationOptionsPanel>();
	}
};
DUMPER7_ASSERTS_UFortConversationOptionsPanel;

// Class FortniteConversationUI.FortConversationScreen
// 0x01C8 (0x05C8 - 0x0400)
class UFortConversationScreen : public UCommonActivatableWidget
{
public:
	uint8                                         Pad_400[0x18];                                     // 0x0400(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonVisibilitySwitcher*              Switcher_Details;                                  // 0x0418(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_420[0x38];                                     // 0x0420(0x0038)(Fixing Size After Last Property [ Dumper-7 ])
	class UInputComponent*                        ConversationInputComp;                             // 0x0458(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         CurrentlySelectedIndex;                            // 0x0460(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bBlockOptionIntroAnimation;                        // 0x0464(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_465[0x3];                                      // 0x0465(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   RadialSelectionMaterialParameterName;              // 0x0468(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_46C[0x4];                                      // 0x046C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FGameplayTag>                   TagPriorities;                                     // 0x0470(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPrivate)
	class FName                                   InteractActionNameKBM;                             // 0x0480(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   ADSInputAction;                                    // 0x0484(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   InteractActionNameGamepad;                         // 0x0488(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_48C[0x4];                                      // 0x048C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableRowHandle                    ConfirmBinding;                                    // 0x0490(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                    MakeSelectionBinding;                              // 0x04A0(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                    ADSMouseBinding;                                   // 0x04B0(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                    CancelActionBinding;                               // 0x04C0(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                    RightTriggerBinding;                               // 0x04D0(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	TMap<class FString, TSoftClassPtr<class UClass>> DetailsNodeTypeToBrief;                         // 0x04E0(0x0050)(Edit, UObjectWrapper, NativeAccessSpecifierPrivate)
	TSoftClassPtr<class UClass>                   ChatBrief;                                         // 0x0530(0x0020)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FString                                 DataDrivenBriefPrefix;                             // 0x0550(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftClassPtr<class UClass>                   DataDrivenBrief;                                   // 0x0560(0x0020)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortSlottedRadialMenu*                 RadialMenu_DialogOptions;                          // 0x0580(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UImage*                                 Image_RadialHighlight;                             // 0x0588(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortKeybindWidget*                     Keybind_Confirm;                                   // 0x0590(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortBasicBrief*                        BasicBrief_Main;                                   // 0x0598(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USizeBox*                               SizeBox_RadialMenu;                                // 0x05A0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UWidget*                                Overlay_Details;                                   // 0x05A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UWidget*                                Overlay_WheelContainer;                            // 0x05B0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UImage*                                 Image_Background;                                  // 0x05B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UImage*                                 Image_LoadingSpinner;                              // 0x05C0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void EndConversation();
	void OnConversationOptionUnavailable(class UFortRadialSlot* SelectedEntry);
	void OnConversationStarted();
	void OnItemSelected(int32 OriginalIndex);
	void OnOptionsPopulated();
	void OnSelectedItemAvailabilityChanged(bool bIsAvailable);

	bool ShouldBlockOptionIntroAnim() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortConversationScreen")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortConversationScreen")
	}
	static class UFortConversationScreen* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortConversationScreen>();
	}
};
DUMPER7_ASSERTS_UFortConversationScreen;

// Class FortniteConversationUI.FortDataDrivenServiceBrief
// 0x0078 (0x0360 - 0x02E8)
class UFortDataDrivenServiceBrief final : public UFortConversationOptionBrief
{
public:
	uint8                                         Pad_2E8[0x8];                                      // 0x02E8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonTextBlock*                       Text_TitleBar;                                     // 0x02F0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonRichTextBlock*                   RichText_Description;                              // 0x02F8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonTextBlock*                       Text_StockRemaining;                               // 0x0300(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortTransactionStrip*                  TransactionStrip_Main;                             // 0x0308(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TMap<class FName, struct FDataDrivenServiceBriefConfig> ServiceConfigs;                          // 0x0310(0x0050)(Edit, Protected, NativeAccessSpecifierProtected)

public:
	void OnAbleToPurchase();
	void OnTransactionInfoReceived(class UFortItem* Item);
	void OnUnableToPurchase(const class FText& Reason);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortDataDrivenServiceBrief")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortDataDrivenServiceBrief")
	}
	static class UFortDataDrivenServiceBrief* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortDataDrivenServiceBrief>();
	}
};
DUMPER7_ASSERTS_UFortDataDrivenServiceBrief;

// Class FortniteConversationUI.FortDuelBrief
// 0x0028 (0x0328 - 0x0300)
class UFortDuelBrief final : public UFortItemTransactionBrief
{
public:
	class FText                                   TextTemplate;                                      // 0x0300(0x0018)(Edit, NativeAccessSpecifierPrivate)
	class UCommonRichTextBlock*                   Text_Objective;                                    // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTileView*                        TileView;                                          // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void DisplayLootItems(const TArray<class UFortItem*>& Items);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortDuelBrief")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortDuelBrief")
	}
	static class UFortDuelBrief* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortDuelBrief>();
	}
};
DUMPER7_ASSERTS_UFortDuelBrief;

// Class FortniteConversationUI.FortHireBrief
// 0x0020 (0x0320 - 0x0300)
class UFortHireBrief final : public UFortItemTransactionBrief
{
public:
	class FText                                   TextTemplate;                                      // 0x0300(0x0018)(Edit, NativeAccessSpecifierPrivate)
	class UCommonRichTextBlock*                   Text_Objective;                                    // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void HandleNPCDismissal(bool bAtMaxNPCNum, bool bWillDismissNPCAtHire);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortHireBrief")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortHireBrief")
	}
	static class UFortHireBrief* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortHireBrief>();
	}
};
DUMPER7_ASSERTS_UFortHireBrief;

// Class FortniteConversationUI.FortIntelBrief
// 0x0020 (0x0320 - 0x0300)
class UFortIntelBrief final : public UFortItemTransactionBrief
{
public:
	class FText                                   TextTemplate;                                      // 0x0300(0x0018)(Edit, NativeAccessSpecifierPrivate)
	class UCommonRichTextBlock*                   Text_Objective;                                    // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortIntelBrief")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortIntelBrief")
	}
	static class UFortIntelBrief* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortIntelBrief>();
	}
};
DUMPER7_ASSERTS_UFortIntelBrief;

// Class FortniteConversationUI.FortItemFundBrief
// 0x0130 (0x0418 - 0x02E8)
class UFortItemFundBrief final : public UCommonUserWidget
{
public:
	uint8                                         Pad_2E8[0xB0];                                     // 0x02E8(0x00B0)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonTextBlock*                       Text_TitleBar;                                     // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_ProgressPercent;                              // 0x03A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_ProgressCount;                                // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortSimpleMaterialProgressBar*         Progress_Funding;                                  // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortLazyImage*                         LazyImage_Icon;                                    // 0x03B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortTransactionStrip*                  TransactionStrip_Main;                             // 0x03C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TMap<class FName, struct FDataDrivenServiceBriefConfig> ServiceConfigs;                          // 0x03C8(0x0050)(Edit, NativeAccessSpecifierPrivate)

public:
	const class FText GetDataForKey(const class FString& Key, const bool bUseIndexAdjustment);
	void InitializeFromContext(const struct FConversationContext& ConversationContext);
	void OnIntializationComplete();
	void OnProgressUpdated(const float CurrentFundingFraction);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortItemFundBrief")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortItemFundBrief")
	}
	static class UFortItemFundBrief* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortItemFundBrief>();
	}
};
DUMPER7_ASSERTS_UFortItemFundBrief;

// Class FortniteConversationUI.FortSingleItemFundBrief
// 0x0068 (0x0350 - 0x02E8)
class UFortSingleItemFundBrief : public UFortConversationOptionBrief
{
public:
	uint8                                         Pad_2E8[0x8];                                      // 0x02E8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortItemFundBrief*                     Item_Entry;                                        // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortNPCTextDisplay*                    NPCTextDisplay;                                    // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TMap<class FName, struct FDataDrivenServiceBriefConfig> ServiceConfigs;                          // 0x0300(0x0050)(Edit, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortSingleItemFundBrief")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortSingleItemFundBrief")
	}
	static class UFortSingleItemFundBrief* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortSingleItemFundBrief>();
	}
};
DUMPER7_ASSERTS_UFortSingleItemFundBrief;

// Class FortniteConversationUI.FortMultiItemFundBrief
// 0x0010 (0x0360 - 0x0350)
class UFortMultiItemFundBrief final : public UFortSingleItemFundBrief
{
public:
	class UFortItemFundBrief*                     Item_EntrySecondary;                               // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortItemFundBrief*                     Item_EntryTertiary;                                // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void UpdateSelectedVisuals(int32 SelectedIndex);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortMultiItemFundBrief")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortMultiItemFundBrief")
	}
	static class UFortMultiItemFundBrief* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortMultiItemFundBrief>();
	}
};
DUMPER7_ASSERTS_UFortMultiItemFundBrief;

// Class FortniteConversationUI.FortNPCTextDisplay
// 0x0010 (0x02D0 - 0x02C0)
class UFortNPCTextDisplay final : public UUserWidget
{
public:
	class UCommonRichTextBlock*                   Text_Message;                                      // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortLazyImage*                         LazyImage_NPCImage;                                // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnItemNameUpdated(const class FString& ItemName);
	void OnTextUpdated();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortNPCTextDisplay")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortNPCTextDisplay")
	}
	static class UFortNPCTextDisplay* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortNPCTextDisplay>();
	}
};
DUMPER7_ASSERTS_UFortNPCTextDisplay;

// Class FortniteConversationUI.FortPlayerConversationUIComponent
// 0x0148 (0x01E8 - 0x00A0)
class UFortPlayerConversationUIComponent final : public UActorComponent
{
public:
	uint8                                         Pad_A0[0x8];                                       // 0x00A0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bBlockUISpawning;                                  // 0x00A8(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftClassPtr<class UClass>                   DialogWidgetSoftClass;                             // 0x00B0(0x0020)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftClassPtr<class UClass>                   DialogMarkerSoftClass;                             // 0x00D0(0x0020)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftClassPtr<class UClass>                   MobileDialogWidgetSoftClass;                       // 0x00F0(0x0020)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class UDynamicUIScene*>                SpectatorConversationScenes;                       // 0x0110(0x0010)(Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate)
	TArray<class UDynamicUIScene*>                SpectatorMobileConversationScenes;                 // 0x0120(0x0010)(Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate)
	TSubclassOf<class UUserWidget>                DialogWidgetClass;                                 // 0x0130(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UUserWidget>                DialogMarkerClass;                                 // 0x0138(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FUserWidgetPool                        DialogWidgetPool;                                  // 0x0140(0x0088)(Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1C8[0x20];                                     // 0x01C8(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnMinigameStarted();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortPlayerConversationUIComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortPlayerConversationUIComponent")
	}
	static class UFortPlayerConversationUIComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortPlayerConversationUIComponent>();
	}
};
DUMPER7_ASSERTS_UFortPlayerConversationUIComponent;

// Class FortniteConversationUI.FortQuestBrief
// 0x0050 (0x0338 - 0x02E8)
class UFortQuestBrief final : public UFortConversationOptionBrief
{
public:
	uint8                                         Pad_2E8[0x8];                                      // 0x02E8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   ThisMatchOnlyQuestText;                            // 0x02F0(0x0018)(Edit, Protected, NativeAccessSpecifierProtected)
	class UCommonRichTextBlock*                   Text_Objective;                                    // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_MoneyReward;                                  // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_XpReward;                                     // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_ExpirationTime;                               // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonLazyImage*                       LazyImage_QuestProviderImage;                      // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UOverlay*                               Overlay_QuestProvider;                             // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnQuestExpirationTimeSet(const bool bDisplayExpirationTime);
	void OnQuestInformationRecieved(const class FText& Objective, const struct FFortRarityItemData& RarityData, const struct FGameplayTag& CategoryTag, int32 XPReward, int32 MoneyReward);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortQuestBrief")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortQuestBrief")
	}
	static class UFortQuestBrief* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortQuestBrief>();
	}
};
DUMPER7_ASSERTS_UFortQuestBrief;

// Class FortniteConversationUI.FortShowFutureStormCircleBrief
// 0x0020 (0x0320 - 0x0300)
class UFortShowFutureStormCircleBrief final : public UFortItemTransactionBrief
{
public:
	class FText                                   PurchaseServiceText;                               // 0x0300(0x0018)(Edit, NativeAccessSpecifierPrivate)
	class UCommonRichTextBlock*                   Text_Display;                                      // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnAbleToPurchase();
	void OnUnableToPurchase(EPreventUseStormCircleServiceReason Reason);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortShowFutureStormCircleBrief")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortShowFutureStormCircleBrief")
	}
	static class UFortShowFutureStormCircleBrief* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortShowFutureStormCircleBrief>();
	}
};
DUMPER7_ASSERTS_UFortShowFutureStormCircleBrief;

// Class FortniteConversationUI.FortSingleOrMultiItemFundBrief
// 0x0050 (0x0338 - 0x02E8)
class UFortSingleOrMultiItemFundBrief final : public UFortConversationOptionBrief
{
public:
	uint8                                         Pad_2E8[0x8];                                      // 0x02E8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftClassPtr<class UClass>                   SingleItemBrief;                                   // 0x02F0(0x0020)(Edit, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftClassPtr<class UClass>                   MultiItemsBrief;                                   // 0x0310(0x0020)(Edit, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UOverlay*                               Overlay_Brief;                                     // 0x0330(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortSingleOrMultiItemFundBrief")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortSingleOrMultiItemFundBrief")
	}
	static class UFortSingleOrMultiItemFundBrief* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortSingleOrMultiItemFundBrief>();
	}
};
DUMPER7_ASSERTS_UFortSingleOrMultiItemFundBrief;

// Class FortniteConversationUI.FortTransactionStrip
// 0x0058 (0x0318 - 0x02C0)
class UFortTransactionStrip final : public UUserWidget
{
public:
	uint8                                         Pad_2C0[0x8];                                      // 0x02C0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonTextBlock*                       Text_CostDescription;                              // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class UFortWorldItemDefinition> CachedGlobalCurrency;                             // 0x02D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortWorldItemDefinition*               ResourceCurrency;                                  // 0x02D8(0x0008)(Edit, ZeroConstructor, NoDestructor, AdvancedDisplay, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2E0[0x38];                                     // 0x02E0(0x0038)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleOnItemCountChanged(TScriptInterface<class IFortInventoryOwnerInterface> InventoryOwner, class UFortItemDefinition* Definition, int32 Delta);
	void OnSetTransactionCostVisibility(const bool bVisible);
	void OnTransactionInfoReceived(const struct FFortServiceTransactionInfo& TransactionInfo);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortTransactionStrip")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortTransactionStrip")
	}
	static class UFortTransactionStrip* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortTransactionStrip>();
	}
};
DUMPER7_ASSERTS_UFortTransactionStrip;

// Class FortniteConversationUI.FortUpgradeBrief
// 0x0000 (0x0300 - 0x0300)
class UFortUpgradeBrief final : public UFortItemTransactionBrief
{
public:
	void OnUnableToUpgrade(EFortWeaponUpgradeInteractionResult CannotUpgradeCause);
	void OnUpgradeInfoReceived(class UFortItem* CurrentWeapon);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortUpgradeBrief")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortUpgradeBrief")
	}
	static class UFortUpgradeBrief* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortUpgradeBrief>();
	}
};
DUMPER7_ASSERTS_UFortUpgradeBrief;

// Class FortniteConversationUI.MobileConversationScreen
// 0x0030 (0x05F8 - 0x05C8)
class UMobileConversationScreen final : public UFortConversationScreen
{
public:
	class UButton*                                MobileButtonConfirm;                               // 0x05C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UButton*                                MobileButtonTouchInformation;                      // 0x05D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_5D8[0x8];                                      // 0x05D8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      MobileCloseButton;                                 // 0x05E0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonVisibilitySwitcher*              Switcher_CenteredDetails;                          // 0x05E8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_5F0[0x8];                                      // 0x05F0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnHandleConfirmClicked();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MobileConversationScreen")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MobileConversationScreen")
	}
	static class UMobileConversationScreen* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMobileConversationScreen>();
	}
};
DUMPER7_ASSERTS_UMobileConversationScreen;

}

