#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FortPostGameNewQuestsWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass FortPostGameNewQuestsWidget.FortPostGameNewQuestsWidget_C
// 0x0028 (0x03D8 - 0x03B0)
class UFortPostGameNewQuestsWidget_C final : public UFortPostGameNewQuestsWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Outro;                                             // 0x03B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Intro;                                             // 0x03C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       EntryBoxOutro;                                     // 0x03C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       EntryBoxIntro;                                     // 0x03D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)

public:
	void OnPlayOutro();
	void OnPlayNewQuestsEntryBoxOutro();
	void OnPlayNewQuestsEntryBoxIntro();
	void OnPlayIntro();
	void OnInitialized();
	void HandleIntroFinished();
	void HandleEntryBoxOutroFinished();
	void HandleEntryBoxIntroFinished();
	void ExecuteUbergraph_FortPostGameNewQuestsWidget(int32 EntryPoint);
	void Destruct();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("FortPostGameNewQuestsWidget_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortPostGameNewQuestsWidget_C")
	}
	static class UFortPostGameNewQuestsWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortPostGameNewQuestsWidget_C>();
	}
};
DUMPER7_ASSERTS_UFortPostGameNewQuestsWidget_C;

}

