#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FortReplayNotification

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "CommonUI_classes.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass FortReplayNotification.FortReplayNotification_C
// 0x00A0 (0x0388 - 0x02E8)
class UFortReplayNotification_C final : public UCommonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonBorder*                          Border;                                            // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Notification;                                      // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	double                                        TimeToDisplay;                                     // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        FadeInterpSpeed;                                   // 0x0308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsFading;                                          // 0x0310(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_311[0x7];                                      // 0x0311(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        RemainingTime;                                     // 0x0318(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   FullyVisible;                                      // 0x0320(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   FullyHidden;                                       // 0x0338(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   GameOnly;                                          // 0x0350(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   ReplayOnly;                                        // 0x0368(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	ESlateVisibility                              PendingVisibility;                                 // 0x0380(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void TickRemainingTime(double DeltaTime);
	void TickFade(double DeltaTime);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void StartFading();
	void ShowNotificationWIthSettings(class FText& NotificationText, struct FNotificationUISettings& NotificationSettings);
	void ShowNotification(class FText& NotificationText);
	void SetNotificationVisibility(ESlateVisibility Visibility_0);
	void OnShowNotificationsEnabledChanged_Event_0(bool bShouldShowNotifications);
	void IsVisibilityNotification(const class FText& Notification_0, bool* IsVisibilityNotification_0);
	void GetVisibilityText(EHudVisibilityState Visibility_0, class FText* Text);
	void ExecuteUbergraph_FortReplayNotification(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("FortReplayNotification_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortReplayNotification_C")
	}
	static class UFortReplayNotification_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortReplayNotification_C>();
	}
};
DUMPER7_ASSERTS_UFortReplayNotification_C;

}

