#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FortBroadcastAmbientSettingsTab

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function FortBroadcastAmbientSettingsTab.FortBroadcastAmbientSettingsTab_C.UpdateTimeOfDay
// 0x0040 (0x0040 - 0x0000)
struct FortBroadcastAmbientSettingsTab_C_UpdateTimeOfDay final
{
public:
	bool                                          CallFunc_IsGeneralTimeOfDayManagerActive_ReturnValue; // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCurrentTimeOfDay_ReturnValue;          // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16[0x2];                                       // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UOptionsMenuSliderReplay_C*             K2Node_DynamicCast_AsOptions_Menu_Slider_Replay;   // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_DoubleDouble_ReturnValue;        // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_VariableSet_LastTimeOfDay_ImplicitCast;     // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_NotEqual_DoubleDouble_B_ImplicitCast;     // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast;      // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FortBroadcastAmbientSettingsTab_C_UpdateTimeOfDay;

// Function FortBroadcastAmbientSettingsTab.FortBroadcastAmbientSettingsTab_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct FortBroadcastAmbientSettingsTab_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FortBroadcastAmbientSettingsTab_C_PreConstruct;

// Function FortBroadcastAmbientSettingsTab.FortBroadcastAmbientSettingsTab_C.OnTimeOfDayPauseChanged
// 0x0001 (0x0001 - 0x0000)
struct FortBroadcastAmbientSettingsTab_C_OnTimeOfDayPauseChanged final
{
public:
	bool                                          bPaused;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FortBroadcastAmbientSettingsTab_C_OnTimeOfDayPauseChanged;

// Function FortBroadcastAmbientSettingsTab.FortBroadcastAmbientSettingsTab_C.InitializeWidgets
// 0x0020 (0x0020 - 0x0000)
struct FortBroadcastAmbientSettingsTab_C_InitializeWidgets final
{
public:
	TArray<class FText>                           K2Node_MakeArray_Array;                            // 0x0000(0x0010)(ReferenceParm)
	class UOptionsMenuSliderReplay_C*             K2Node_DynamicCast_AsOptions_Menu_Slider_Replay;   // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FortBroadcastAmbientSettingsTab_C_InitializeWidgets;

// Function FortBroadcastAmbientSettingsTab.FortBroadcastAmbientSettingsTab_C.ExecuteUbergraph_FortBroadcastAmbientSettingsTab
// 0x0038 (0x0038 - 0x0000)
struct FortBroadcastAmbientSettingsTab_C_ExecuteUbergraph_FortBroadcastAmbientSettingsTab final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_ComponentBoundEvent_Slider_Value;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_Selected_Index;         // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bPaused;                              // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x2];                                       // 0x0022(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x0028(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetTimeOfDay_TimeOfDay_ImplicitCast;      // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FortBroadcastAmbientSettingsTab_C_ExecuteUbergraph_FortBroadcastAmbientSettingsTab;

// Function FortBroadcastAmbientSettingsTab.FortBroadcastAmbientSettingsTab_C.BndEvt__FortBroadcastAmbientSettingsTab_TimeOfDayPauseToggle_K2Node_ComponentBoundEvent_1_Selection Changed__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct FortBroadcastAmbientSettingsTab_C_BndEvt__FortBroadcastAmbientSettingsTab_TimeOfDayPauseToggle_K2Node_ComponentBoundEvent_1_Selection_Changed__DelegateSignature final
{
public:
	int32                                         Selected_Index;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FortBroadcastAmbientSettingsTab_C_BndEvt__FortBroadcastAmbientSettingsTab_TimeOfDayPauseToggle_K2Node_ComponentBoundEvent_1_Selection_Changed__DelegateSignature;

// Function FortBroadcastAmbientSettingsTab.FortBroadcastAmbientSettingsTab_C.BndEvt__FortBroadcastAmbientSettingsTab_OptionsMenuSliderReplay_K2Node_ComponentBoundEvent_0_SliderChanged__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct FortBroadcastAmbientSettingsTab_C_BndEvt__FortBroadcastAmbientSettingsTab_OptionsMenuSliderReplay_K2Node_ComponentBoundEvent_0_SliderChanged__DelegateSignature final
{
public:
	double                                        Slider_Value;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FortBroadcastAmbientSettingsTab_C_BndEvt__FortBroadcastAmbientSettingsTab_OptionsMenuSliderReplay_K2Node_ComponentBoundEvent_0_SliderChanged__DelegateSignature;

}

