#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GameplayGraph

#include "Basic.hpp"

#include "GameplayGraph_structs.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class GameplayGraph.GraphElement
// 0x0020 (0x0048 - 0x0028)
class UGraphElement : public UObject
{
public:
	EGraphElementType                             ElementType;                                       // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FGraphUniqueIndex                      UniqueIndex;                                       // 0x002C(0x0014)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TWeakObjectPtr<class UGraph>                  ParentGraph;                                       // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GraphElement")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GraphElement")
	}
	static class UGraphElement* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGraphElement>();
	}
};
DUMPER7_ASSERTS_UGraphElement;

// Class GameplayGraph.Graph
// 0x0190 (0x01B8 - 0x0028)
class UGraph : public UObject
{
public:
	uint8                                         Pad_28[0x48];                                      // 0x0028(0x0048)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<struct FGraphVertexHandle, class UGraphVertex*> Vertices;                                   // 0x0070(0x0050)(UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                         Pad_C0[0x50];                                      // 0x00C0(0x0050)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<struct FGraphEdgeHandle, class UGraphEdge*> Edges;                                          // 0x0110(0x0050)(UObjectWrapper, NativeAccessSpecifierPrivate)
	TMap<struct FGraphIslandHandle, class UGraphIsland*> Islands;                                    // 0x0160(0x0050)(UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1B0[0x8];                                      // 0x01B0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("Graph")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Graph")
	}
	static class UGraph* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGraph>();
	}
};
DUMPER7_ASSERTS_UGraph;

// Class GameplayGraph.GraphEdge
// 0x0038 (0x0080 - 0x0048)
class UGraphEdge final : public UGraphElement
{
public:
	struct FGraphVertexHandle                     A;                                                 // 0x0048(0x001C)(SaveGame, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FGraphVertexHandle                     B;                                                 // 0x0064(0x001C)(SaveGame, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GraphEdge")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GraphEdge")
	}
	static class UGraphEdge* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGraphEdge>();
	}
};
DUMPER7_ASSERTS_UGraphEdge;

// Class GameplayGraph.GraphIsland
// 0x00B8 (0x0100 - 0x0048)
class UGraphIsland : public UGraphElement
{
public:
	uint8                                         Pad_48[0x60];                                      // 0x0048(0x0060)(Fixing Size After Last Property [ Dumper-7 ])
	TSet<struct FGraphVertexHandle>               Vertices;                                          // 0x00A8(0x0050)(SaveGame, NativeAccessSpecifierPrivate)
	bool                                          bPendingDestroy;                                   // 0x00F8(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_F9[0x3];                                       // 0x00F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	EGraphIslandOperations                        AllowedOperations;                                 // 0x00FC(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GraphIsland")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GraphIsland")
	}
	static class UGraphIsland* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGraphIsland>();
	}
};
DUMPER7_ASSERTS_UGraphIsland;

// Class GameplayGraph.GraphVertex
// 0x00A0 (0x00E8 - 0x0048)
class UGraphVertex : public UGraphElement
{
public:
	uint8                                         Pad_48[0x30];                                      // 0x0048(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<struct FGraphVertexHandle, struct FGraphEdgeHandle> Edges;                                  // 0x0078(0x0050)(NativeAccessSpecifierPrivate)
	struct FGraphIslandHandle                     ParentIsland;                                      // 0x00C8(0x001C)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_E4[0x4];                                       // 0x00E4(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GraphVertex")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GraphVertex")
	}
	static class UGraphVertex* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGraphVertex>();
	}
};
DUMPER7_ASSERTS_UGraphVertex;

}

