#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GameplayGraph

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// Enum GameplayGraph.EGraphElementType
// NumValues: 0x0005
enum class EGraphElementType : uint32
{
	Node                                     = 0,
	Edge                                     = 1,
	Island                                   = 2,
	Unknown                                  = 3,
	EGraphElementType_MAX                    = 4,
};

// Enum GameplayGraph.EGraphIslandOperations
// NumValues: 0x0007
enum class EGraphIslandOperations : uint32
{
	None                                     = 0,
	Add                                      = 1,
	Split                                    = 2,
	Merge                                    = 4,
	Destroy                                  = 8,
	All                                      = 15,
	EGraphIslandOperations_MAX               = 16,
};

// ScriptStruct GameplayGraph.GraphProperties
// 0x0001 (0x0001 - 0x0000)
struct FGraphProperties final
{
public:
	bool                                          bGenerateIslands;                                  // 0x0000(0x0001)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGraphProperties;

// ScriptStruct GameplayGraph.GraphUniqueIndex
// 0x0014 (0x0014 - 0x0000)
struct FGraphUniqueIndex final
{
public:
	struct FGuid                                  UniqueIndex;                                       // 0x0000(0x0010)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bIsTemporary;                                      // 0x0010(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGraphUniqueIndex;

// ScriptStruct GameplayGraph.GraphHandle
// 0x001C (0x001C - 0x0000)
struct FGraphHandle
{
public:
	struct FGraphUniqueIndex                      UniqueIndex;                                       // 0x0000(0x0014)(SaveGame, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TWeakObjectPtr<class UGraphElement>           Element;                                           // 0x0014(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};
DUMPER7_ASSERTS_FGraphHandle;

// ScriptStruct GameplayGraph.GraphEdgeHandle
// 0x0000 (0x001C - 0x001C)
struct FGraphEdgeHandle final : public FGraphHandle
{
};
DUMPER7_ASSERTS_FGraphEdgeHandle;

// ScriptStruct GameplayGraph.GraphVertexHandle
// 0x0000 (0x001C - 0x001C)
struct FGraphVertexHandle final : public FGraphHandle
{
};
DUMPER7_ASSERTS_FGraphVertexHandle;

// ScriptStruct GameplayGraph.SerializedIslandData
// 0x0010 (0x0010 - 0x0000)
struct FSerializedIslandData final
{
public:
	TArray<struct FGraphVertexHandle>             Vertices;                                          // 0x0000(0x0010)(ZeroConstructor, SaveGame, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FSerializedIslandData;

// ScriptStruct GameplayGraph.SerializedEdgeData
// 0x0038 (0x0038 - 0x0000)
struct FSerializedEdgeData final
{
public:
	struct FGraphVertexHandle                     Node1;                                             // 0x0000(0x001C)(SaveGame, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGraphVertexHandle                     Node2;                                             // 0x001C(0x001C)(SaveGame, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FSerializedEdgeData;

// ScriptStruct GameplayGraph.GraphIslandHandle
// 0x0000 (0x001C - 0x001C)
struct FGraphIslandHandle final : public FGraphHandle
{
};
DUMPER7_ASSERTS_FGraphIslandHandle;

// ScriptStruct GameplayGraph.SerializableGraph
// 0x00B8 (0x00B8 - 0x0000)
struct FSerializableGraph
{
public:
	struct FGraphProperties                       Properties;                                        // 0x0000(0x0001)(SaveGame, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FGraphVertexHandle>             Vertices;                                          // 0x0008(0x0010)(ZeroConstructor, SaveGame, NativeAccessSpecifierPublic)
	TMap<struct FGraphEdgeHandle, struct FSerializedEdgeData> Edges;                                 // 0x0018(0x0050)(SaveGame, NativeAccessSpecifierPublic)
	TMap<struct FGraphIslandHandle, struct FSerializedIslandData> Islands;                           // 0x0068(0x0050)(SaveGame, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FSerializableGraph;

}

