#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GameplayStreamingFN

#include "Basic.hpp"

#include "GameplayStreaming_classes.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class GameplayStreamingFN.FortLocalPlayerAccountHelper
// 0x0028 (0x0050 - 0x0028)
class UFortLocalPlayerAccountHelper final : public UObject
{
public:
	uint8                                         Pad_28[0x28];                                      // 0x0028(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortLocalPlayerAccountHelper")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortLocalPlayerAccountHelper")
	}
	static class UFortLocalPlayerAccountHelper* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortLocalPlayerAccountHelper>();
	}
};
DUMPER7_ASSERTS_UFortLocalPlayerAccountHelper;

// Class GameplayStreamingFN.FortGFNGameplayStreamingHandler
// 0x0038 (0x00B0 - 0x0078)
class UFortGFNGameplayStreamingHandler final : public UGFNGameplayStreamingHandler
{
public:
	uint8                                         Pad_78[0x8];                                       // 0x0078(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortLocalPlayerAccountHelper*          FortLocalPlayerAccountHelper;                      // 0x0080(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TWeakObjectPtr<class UFortOnlineAccount>      WeakFortOnlineAccount;                             // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_90[0x20];                                      // 0x0090(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortGFNGameplayStreamingHandler")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortGFNGameplayStreamingHandler")
	}
	static class UFortGFNGameplayStreamingHandler* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortGFNGameplayStreamingHandler>();
	}
};
DUMPER7_ASSERTS_UFortGFNGameplayStreamingHandler;

// Class GameplayStreamingFN.FortLunaGameplayStreamingHandler
// 0x0030 (0x00A8 - 0x0078)
class UFortLunaGameplayStreamingHandler final : public ULunaGameplayStreamingHandler
{
public:
	uint8                                         Pad_78[0x30];                                      // 0x0078(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortLunaGameplayStreamingHandler")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortLunaGameplayStreamingHandler")
	}
	static class UFortLunaGameplayStreamingHandler* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortLunaGameplayStreamingHandler>();
	}
};
DUMPER7_ASSERTS_UFortLunaGameplayStreamingHandler;

// Class GameplayStreamingFN.FortSalmonGameplayStreamingHandler
// 0x0018 (0x0090 - 0x0078)
class UFortSalmonGameplayStreamingHandler final : public USalmonGameplayStreamingHandler
{
public:
	uint8                                         Pad_78[0x18];                                      // 0x0078(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortSalmonGameplayStreamingHandler")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortSalmonGameplayStreamingHandler")
	}
	static class UFortSalmonGameplayStreamingHandler* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortSalmonGameplayStreamingHandler>();
	}
};
DUMPER7_ASSERTS_UFortSalmonGameplayStreamingHandler;

// Class GameplayStreamingFN.FortGameplayStreamingHandler
// 0x0000 (0x0000 - 0x0000)
class IFortGameplayStreamingHandler final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortGameplayStreamingHandler")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortGameplayStreamingHandler")
	}
	static class IFortGameplayStreamingHandler* GetDefaultObj()
	{
		return GetDefaultObjImpl<IFortGameplayStreamingHandler>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IFortGameplayStreamingHandler;

// Class GameplayStreamingFN.FortGameplayStreamingService
// 0x0008 (0x0038 - 0x0030)
class UFortGameplayStreamingService final : public UGameplayStreamingService
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortGameplayStreamingService")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortGameplayStreamingService")
	}
	static class UFortGameplayStreamingService* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortGameplayStreamingService>();
	}
};
DUMPER7_ASSERTS_UFortGameplayStreamingService;

}

