#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HarmonixAudioReactivity

#include "Basic.hpp"

#include "HarmonixAudioReactivity_structs.hpp"


namespace SDK::Params
{

// Function HarmonixAudioReactivity.HarmonixAudioAnalyzerResultsDispatcher.HasProvider
// 0x0008 (0x0008 - 0x0000)
struct HarmonixAudioAnalyzerResultsDispatcher_HasProvider final
{
public:
	class FName                                   Name_0;                                            // 0x0000(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_HarmonixAudioAnalyzerResultsDispatcher_HasProvider;

// Function HarmonixAudioReactivity.HarmonixAudioAnalyzerResultsDispatcher.TryGetResults
// 0x0070 (0x0070 - 0x0000)
struct HarmonixAudioAnalyzerResultsDispatcher_TryGetResults final
{
public:
	class FName                                   Name_0;                                            // 0x0000(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHarmonixAudioAnalyzerResults          Results;                                           // 0x0008(0x0060)(Parm, OutParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0068(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_HarmonixAudioAnalyzerResultsDispatcher_TryGetResults;

// Function HarmonixAudioReactivity.HarmonixAudioAnalyzerResultsProvider.CreateHarmonixAudioAnalyzerResultsProvider
// 0x0010 (0x0010 - 0x0000)
struct HarmonixAudioAnalyzerResultsProvider_CreateHarmonixAudioAnalyzerResultsProvider final
{
public:
	class FName                                   Name_0;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHarmonixAudioAnalyzerResultsProvider*  ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_HarmonixAudioAnalyzerResultsProvider_CreateHarmonixAudioAnalyzerResultsProvider;

// Function HarmonixAudioReactivity.HarmonixAudioAnalyzerResultsProvider.SetArbitraryTextureData
// 0x0010 (0x0010 - 0x0000)
struct HarmonixAudioAnalyzerResultsProvider_SetArbitraryTextureData final
{
public:
	TArray<float>                                 ArbitraryTextureData;                              // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_HarmonixAudioAnalyzerResultsProvider_SetArbitraryTextureData;

// Function HarmonixAudioReactivity.HarmonixTextureBase.GetCurrentTextureHeight
// 0x0004 (0x0004 - 0x0000)
struct HarmonixTextureBase_GetCurrentTextureHeight final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_HarmonixTextureBase_GetCurrentTextureHeight;

// Function HarmonixAudioReactivity.HarmonixTextureBase.GetCurrentTextureWidth
// 0x0004 (0x0004 - 0x0000)
struct HarmonixTextureBase_GetCurrentTextureWidth final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_HarmonixTextureBase_GetCurrentTextureWidth;

// Function HarmonixAudioReactivity.HarmonixPeakTamer.CreateHarmonixPeakTamer
// 0x0008 (0x0008 - 0x0000)
struct HarmonixPeakTamer_CreateHarmonixPeakTamer final
{
public:
	class UHarmonixPeakTamer*                     ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_HarmonixPeakTamer_CreateHarmonixPeakTamer;

// Function HarmonixAudioReactivity.HarmonixPeakTamer.Configure
// 0x0014 (0x0014 - 0x0000)
struct HarmonixPeakTamer_Configure final
{
public:
	struct FHarmonixPeakTamerSettings             Settings;                                          // 0x0000(0x0014)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_HarmonixPeakTamer_Configure;

// Function HarmonixAudioReactivity.HarmonixPeakTamer.Update
// 0x0008 (0x0008 - 0x0000)
struct HarmonixPeakTamer_Update final
{
public:
	float                                         InputValue;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DeltaTimeSeconds;                                  // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_HarmonixPeakTamer_Update;

// Function HarmonixAudioReactivity.HarmonixPeakTamer.GetPeak
// 0x0004 (0x0004 - 0x0000)
struct HarmonixPeakTamer_GetPeak final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_HarmonixPeakTamer_GetPeak;

// Function HarmonixAudioReactivity.HarmonixPeakTamer.GetValue
// 0x0004 (0x0004 - 0x0000)
struct HarmonixPeakTamer_GetValue final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_HarmonixPeakTamer_GetValue;

}

