#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HealthShieldRegenRuntime

#include "Basic.hpp"

#include "HealthShieldRegenRuntime_structs.hpp"


namespace SDK::Params
{

// Function HealthShieldRegenRuntime.FortHealthShieldRegenComponent.AllowHealthShieldRegen
// 0x0001 (0x0001 - 0x0000)
struct FortHealthShieldRegenComponent_AllowHealthShieldRegen final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortHealthShieldRegenComponent_AllowHealthShieldRegen;

// Function HealthShieldRegenRuntime.FortHealthShieldRegenComponent.AssignHealthShieldRegen_HealthListenerDelegates
// 0x0020 (0x0020 - 0x0000)
struct FortHealthShieldRegenComponent_AssignHealthShieldRegen_HealthListenerDelegates final
{
public:
	const class UGameplayAbility*                 OwningAbility;                                     // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFortHealthShieldRegen_HealthDelegateContainer Delegates;                                 // 0x0008(0x0018)(Parm, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortHealthShieldRegenComponent_AssignHealthShieldRegen_HealthListenerDelegates;

// Function HealthShieldRegenRuntime.FortHealthShieldRegenComponent.AssignHealthShieldRegen_ShieldListenerDelegates
// 0x0038 (0x0038 - 0x0000)
struct FortHealthShieldRegenComponent_AssignHealthShieldRegen_ShieldListenerDelegates final
{
public:
	const class UGameplayAbility*                 OwningAbility;                                     // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFortHealthShieldRegen_ShieldDelegateContainer Delegates;                                 // 0x0008(0x0030)(Parm, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortHealthShieldRegenComponent_AssignHealthShieldRegen_ShieldListenerDelegates;

// Function HealthShieldRegenRuntime.FortHealthShieldRegenComponent.ClearHealthShieldRegen_HealthListenerDelegates
// 0x0008 (0x0008 - 0x0000)
struct FortHealthShieldRegenComponent_ClearHealthShieldRegen_HealthListenerDelegates final
{
public:
	const class UGameplayAbility*                 OwningAbility;                                     // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortHealthShieldRegenComponent_ClearHealthShieldRegen_HealthListenerDelegates;

// Function HealthShieldRegenRuntime.FortHealthShieldRegenComponent.ClearHealthShieldRegen_ShieldListenerDelegates
// 0x0008 (0x0008 - 0x0000)
struct FortHealthShieldRegenComponent_ClearHealthShieldRegen_ShieldListenerDelegates final
{
public:
	const class UGameplayAbility*                 OwningAbility;                                     // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortHealthShieldRegenComponent_ClearHealthShieldRegen_ShieldListenerDelegates;

}

