#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: IceRuntime

#include "Basic.hpp"

#include "FortniteGame_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "Curie_classes.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK
{

// Class IceRuntime.FortCurieElementAttachConditionHandlerIce
// 0x0000 (0x0040 - 0x0040)
class UFortCurieElementAttachConditionHandlerIce final : public UFortCurieElementAttachConditionHandler
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortCurieElementAttachConditionHandlerIce")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortCurieElementAttachConditionHandlerIce")
	}
	static class UFortCurieElementAttachConditionHandlerIce* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortCurieElementAttachConditionHandlerIce>();
	}
};
DUMPER7_ASSERTS_UFortCurieElementAttachConditionHandlerIce;

// Class IceRuntime.FortCurieElementAttachHandlerIce
// 0x0058 (0x00E8 - 0x0090)
class UFortCurieElementAttachHandlerIce final : public UFortCurieElementAttachHandler
{
public:
	float                                         MinWaterContentOnDetach;                           // 0x0090(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         ShatterDamageThreshold;                            // 0x0094(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TMap<class ABuildingActor*, float>            AggregateDamagePerActor;                           // 0x0098(0x0050)(NativeAccessSpecifierPrivate)

public:
	void HandleBuildingDamaged(class AActor* DamagedActor, float Damage, class AController* InstigatedBy, class AActor* DamageCauser, const struct FVector& HitLocation, class UPrimitiveComponent* FHitComponent, class FName BoneName, const struct FVector& Momentum);
	void ResolveBuildingDamage(class ABuildingActor* DamagedBuildingActor, class AController* InstigatedBy, class AActor* DamageCauser);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortCurieElementAttachHandlerIce")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortCurieElementAttachHandlerIce")
	}
	static class UFortCurieElementAttachHandlerIce* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortCurieElementAttachHandlerIce>();
	}
};
DUMPER7_ASSERTS_UFortCurieElementAttachHandlerIce;

// Class IceRuntime.FortCurieIceNativeFXHandlerConfig
// 0x0000 (0x0168 - 0x0168)
class UFortCurieIceNativeFXHandlerConfig final : public UFortCurieNativeFXHandlerConfig
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortCurieIceNativeFXHandlerConfig")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortCurieIceNativeFXHandlerConfig")
	}
	static class UFortCurieIceNativeFXHandlerConfig* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortCurieIceNativeFXHandlerConfig>();
	}
};
DUMPER7_ASSERTS_UFortCurieIceNativeFXHandlerConfig;

// Class IceRuntime.FortCurieIceNativeFXHandler
// 0x0000 (0x0040 - 0x0040)
class UFortCurieIceNativeFXHandler final : public UFortCurieNativeFXHandler
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortCurieIceNativeFXHandler")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortCurieIceNativeFXHandler")
	}
	static class UFortCurieIceNativeFXHandler* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortCurieIceNativeFXHandler>();
	}
};
DUMPER7_ASSERTS_UFortCurieIceNativeFXHandler;

// Class IceRuntime.IceGroundPath
// 0x0060 (0x02F0 - 0x0290)
class AIceGroundPath final : public AActor
{
public:
	class UStaticMesh*                            StaticMesh;                                        // 0x0290(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UMaterial*                              Material;                                          // 0x0298(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	ESplineMeshAxis                               ForwardAxis;                                       // 0x02A0(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2A1[0x7];                                      // 0x02A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FVector_NetQuantize>            SplinePoints;                                      // 0x02A8(0x0010)(Net, ZeroConstructor, Transient, RepNotify, NativeAccessSpecifierPrivate)
	struct FVector                                SplineOffset;                                      // 0x02B8(0x0018)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         SplineColliderExtentWidth;                         // 0x02D0(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         SplineColliderExtentHeight;                        // 0x02D4(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         LandscapeTraceBuffer;                              // 0x02D8(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2DC[0x4];                                      // 0x02DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UBoxComponent*>                  BoxColliderArray;                                  // 0x02E0(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPrivate)

public:
	void AddSplinePoint(const struct FVector& InWorldLoc);
	struct FVector GetLocationOnLandscape(const struct FVector& Location);
	void OnRep_SplinePoints();

	bool GetLastSplinePointLocation(struct FVector* LastPointLocation) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("IceGroundPath")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"IceGroundPath")
	}
	static class AIceGroundPath* GetDefaultObj()
	{
		return GetDefaultObjImpl<AIceGroundPath>();
	}
};
DUMPER7_ASSERTS_AIceGroundPath;

// Class IceRuntime.FortCurieIcePropagationManagerConfig
// 0x0018 (0x0058 - 0x0040)
class UFortCurieIcePropagationManagerConfig final : public UCurieManagerComponentConfig
{
public:
	float                                         IceBlockSeparation;                                // 0x0040(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class ABuildingGameplayActor>     IceBlockClass;                                     // 0x0048(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         PropagationRate;                                   // 0x0050(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         DefaultPropagationDepth;                           // 0x0054(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortCurieIcePropagationManagerConfig")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortCurieIcePropagationManagerConfig")
	}
	static class UFortCurieIcePropagationManagerConfig* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortCurieIcePropagationManagerConfig>();
	}
};
DUMPER7_ASSERTS_UFortCurieIcePropagationManagerConfig;

// Class IceRuntime.FortCurieIcePropagationManager
// 0x0058 (0x0088 - 0x0030)
class UFortCurieIcePropagationManager final : public UFortCurieManagerComponent
{
public:
	class UFortCurieIcePropagationManagerConfig*  InternalManagerConfig;                             // 0x0030(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_38[0x50];                                      // 0x0038(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnIceBlockDied(class AActor* DamagedActor, float Damage, class AController* InstigatedBy, class AActor* DamageCauser, const struct FVector& HitLocation, class UPrimitiveComponent* FHitComponent, class FName BoneName, const struct FVector& Momentum);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortCurieIcePropagationManager")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortCurieIcePropagationManager")
	}
	static class UFortCurieIcePropagationManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortCurieIcePropagationManager>();
	}
};
DUMPER7_ASSERTS_UFortCurieIcePropagationManager;

// Class IceRuntime.FortIceSkatesMovementControls
// 0x0190 (0x01C0 - 0x0030)
class UFortIceSkatesMovementControls final : public UFortMovementControls
{
public:
	struct FScalableFloat                         TurnSpeed;                                         // 0x0030(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         Acceleration;                                      // 0x0058(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         UphillSlopeAcceleration;                           // 0x0080(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         DownhillSlopeAcceleration;                         // 0x00A8(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         MaxSlopeAngle;                                     // 0x00D0(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         MinSpeed;                                          // 0x00F8(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         TargetSpeed;                                       // 0x0120(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         MaxSpeed;                                          // 0x0148(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         AirDrag;                                           // 0x0170(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_198[0x28];                                     // 0x0198(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortIceSkatesMovementControls")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortIceSkatesMovementControls")
	}
	static class UFortIceSkatesMovementControls* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortIceSkatesMovementControls>();
	}
};
DUMPER7_ASSERTS_UFortIceSkatesMovementControls;

}

