#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ItemizationVerse_0

#include "Basic.hpp"

#include "ItemizationVerse_0_structs.hpp"
#include "VerseNative_structs.hpp"
#include "EpicGamesTemporary_structs.hpp"


namespace SDK::Params
{

// Function ItemizationVerse.item_definition_base_asset._L_2fFortnite_2ecom_2fItemization_2fitem__definition__base__asset_N_RGetAttribute_L_N_Ksubtype_Litem__attribute__base_R_R
// 0x0028 (0x0028 - 0x0000)
struct item_definition_base_asset__L_2fFortnite_2ecom_2fItemization_2fitem__definition__base__asset_N_RGetAttribute_L_N_Ksubtype_Litem__attribute__base_R_R final
{
public:
	TArray<class UClass*>                         __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0010)(Parm, ContainsInstancedReference)
	TOptional<TArray<struct Ftuple_Lsubtype_Litem__attribute__base_R_Mitem__attribute__value__base_R>> RetVal; // 0x0010(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, ContainsInstancedReference)
};
DUMPER7_ASSERTS_item_definition_base_asset__L_2fFortnite_2ecom_2fItemization_2fitem__definition__base__asset_N_RGetAttribute_L_N_Ksubtype_Litem__attribute__base_R_R;

// Function ItemizationVerse.item_definition_base_asset._L_2fFortnite_2ecom_2fItemization_2fitem__definition__base__asset_N_RGetItemComponent_L_N_Ksubtype_Lfort__item__component__base_R_R
// 0x0028 (0x0028 - 0x0000)
struct item_definition_base_asset__L_2fFortnite_2ecom_2fItemization_2fitem__definition__base__asset_N_RGetItemComponent_L_N_Ksubtype_Lfort__item__component__base_R_R final
{
public:
	TArray<class UClass*>                         __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0010)(Parm, ContainsInstancedReference)
	TOptional<TArray<struct Ftuple_Lsubtype_Lfort__item__component__base_R_Mfort__item__component__base_R>> RetVal; // 0x0010(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, ContainsInstancedReference)
};
DUMPER7_ASSERTS_item_definition_base_asset__L_2fFortnite_2ecom_2fItemization_2fitem__definition__base__asset_N_RGetItemComponent_L_N_Ksubtype_Lfort__item__component__base_R_R;

// Function ItemizationVerse._Root._L_2fFortnite_2ecom_2fItemization_N_ROnItemStateUpdate_L_Nfort__item_M_Nitem__state_R
// 0x0010 (0x0010 - 0x0000)
struct _Root__L_2fFortnite_2ecom_2fItemization_N_ROnItemStateUpdate_L_Nfort__item_M_Nitem__state_R final
{
public:
	struct Ftuple_Lfort__item_Mitem__state_R      __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0010)(Parm, HasGetValueTypeHash)
};
DUMPER7_ASSERTS__Root__L_2fFortnite_2ecom_2fItemization_N_ROnItemStateUpdate_L_Nfort__item_M_Nitem__state_R;

// Function ItemizationVerse._Root._L_2fFortnite_2ecom_2fItemization_N_Roperator_U_2eGetInventoryCollection_U_L_Ncreative__object_M_Ntuple_L_R_M_Ntuple_L_R_R
// 0x0018 (0x0018 - 0x0000)
struct _Root__L_2fFortnite_2ecom_2fItemization_N_Roperator_U_2eGetInventoryCollection_U_L_Ncreative__object_M_Ntuple_L_R_M_Ntuple_L_R_R final
{
public:
	struct ItemizationVerse_0::Ftuple_Lcreative__object_Mtuple_L_R_Mtuple_L_R_R __verse_0xB2CDDD72_Argument; // 0x0000(0x0010)(Parm, HasGetValueTypeHash)
	TOptional<class Ufort_inventory_collection*, true> RetVal;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};
DUMPER7_ASSERTS__Root__L_2fFortnite_2ecom_2fItemization_N_Roperator_U_2eGetInventoryCollection_U_L_Ncreative__object_M_Ntuple_L_R_M_Ntuple_L_R_R;

// Function ItemizationVerse._Root._L_2fFortnite_2ecom_2fItemization_N_Roperator_U_2eGetOrCreateInventoryCollection_U_L_Ncreative__object_M_Ntuple_L_R_M_Ntuple_L_R_R
// 0x0018 (0x0018 - 0x0000)
struct _Root__L_2fFortnite_2ecom_2fItemization_N_Roperator_U_2eGetOrCreateInventoryCollection_U_L_Ncreative__object_M_Ntuple_L_R_M_Ntuple_L_R_R final
{
public:
	struct ItemizationVerse_0::Ftuple_Lcreative__object_Mtuple_L_R_Mtuple_L_R_R __verse_0xB2CDDD72_Argument; // 0x0000(0x0010)(Parm, HasGetValueTypeHash)
	TOptional<class Ufort_inventory_collection*, true> RetVal;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};
DUMPER7_ASSERTS__Root__L_2fFortnite_2ecom_2fItemization_N_Roperator_U_2eGetOrCreateInventoryCollection_U_L_Ncreative__object_M_Ntuple_L_R_M_Ntuple_L_R_R;

// Function ItemizationVerse._Root._L_2fFortnite_2ecom_2fItemization_N_Roperator_U_2eGetPlayerInventoryCollection_U_L_Nfort__character_M_Ntuple_L_R_M_Ntuple_L_R_R
// 0x0018 (0x0018 - 0x0000)
struct _Root__L_2fFortnite_2ecom_2fItemization_N_Roperator_U_2eGetPlayerInventoryCollection_U_L_Nfort__character_M_Ntuple_L_R_M_Ntuple_L_R_R final
{
public:
	struct ItemizationVerse_0::Ftuple_Lfort__character_Mtuple_L_R_Mtuple_L_R_R __verse_0xB2CDDD72_Argument; // 0x0000(0x0010)(Parm, HasGetValueTypeHash)
	TOptional<class Ufort_inventory_collection*, true> RetVal;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};
DUMPER7_ASSERTS__Root__L_2fFortnite_2ecom_2fItemization_N_Roperator_U_2eGetPlayerInventoryCollection_U_L_Nfort__character_M_Ntuple_L_R_M_Ntuple_L_R_R;

// Function ItemizationVerse.fort_item.$InitCDO
// 0x0040 (0x0040 - 0x0000)
struct fort_item__InitCDO final
{
public:
	TOptional<class Uitem_definition_base_asset*, true> _ExprResult_0;                               // 0x0000(0x0008)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<EVerseFalse>                        __verse_0x00000000__1;                             // 0x0008(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_1 : 1;                                 // 0x000A(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	TOptional<EVerseFalse>                        _ExprResultStack_2;                                // 0x000B(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         _ExprResult_3;                                     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Eitem_state                                   _ExprResult_4;                                     // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TOptional<class Uitem_definition_base_asset*, true> _ExprResult_5;                               // 0x0020(0x0008)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<EVerseFalse>                        __verse_0x00000000__3;                             // 0x0028(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_6 : 1;                                 // 0x002A(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	TOptional<EVerseFalse>                        _ExprResultStack_7;                                // 0x002B(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         _ExprResult_8;                                     // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Eitem_state                                   _ExprResult_9;                                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_fort_item__InitCDO;

// Function ItemizationVerse.fort_item._L_2fFortnite_2ecom_2fItemization_2ffort__item_N_RGetAttribute_L_N_Ksubtype_Litem__attribute__base_R_R
// 0x0028 (0x0028 - 0x0000)
struct fort_item__L_2fFortnite_2ecom_2fItemization_2ffort__item_N_RGetAttribute_L_N_Ksubtype_Litem__attribute__base_R_R final
{
public:
	TArray<class UClass*>                         __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0010)(Parm, ContainsInstancedReference)
	TOptional<TArray<struct Ftuple_Lsubtype_Litem__attribute__base_R_Mitem__attribute__value__base_R>> RetVal; // 0x0010(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, ContainsInstancedReference)
};
DUMPER7_ASSERTS_fort_item__L_2fFortnite_2ecom_2fItemization_2ffort__item_N_RGetAttribute_L_N_Ksubtype_Litem__attribute__base_R_R;

// Function ItemizationVerse.fort_item._L_2fFortnite_2ecom_2fItemization_2ffort__item_N_RGetItemComponent_L_N_Ksubtype_Lfort__item__component__base_R_R
// 0x0028 (0x0028 - 0x0000)
struct fort_item__L_2fFortnite_2ecom_2fItemization_2ffort__item_N_RGetItemComponent_L_N_Ksubtype_Lfort__item__component__base_R_R final
{
public:
	TArray<class UClass*>                         __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0010)(Parm, ContainsInstancedReference)
	TOptional<TArray<struct Ftuple_Lsubtype_Lfort__item__component__base_R_Mfort__item__component__base_R>> RetVal; // 0x0010(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, ContainsInstancedReference)
};
DUMPER7_ASSERTS_fort_item__L_2fFortnite_2ecom_2fItemization_2ffort__item_N_RGetItemComponent_L_N_Ksubtype_Lfort__item__component__base_R_R;

// Function ItemizationVerse.fort_item._L_2fFortnite_2ecom_2fItemization_2ffort__item_N_RGetItemComponentLocalStorage_L_N_Ksubtype_Lfort__item__component__local__storage_R_R
// 0x0028 (0x0028 - 0x0000)
struct fort_item__L_2fFortnite_2ecom_2fItemization_2ffort__item_N_RGetItemComponentLocalStorage_L_N_Ksubtype_Lfort__item__component__local__storage_R_R final
{
public:
	TArray<class UClass*>                         __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0010)(Parm, ContainsInstancedReference)
	TOptional<TArray<struct Ftuple_Lsubtype_Lfort__item__component__local__storage_R_Mfort__item__component__local__storage_R>> RetVal; // 0x0010(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, ContainsInstancedReference)
};
DUMPER7_ASSERTS_fort_item__L_2fFortnite_2ecom_2fItemization_2ffort__item_N_RGetItemComponentLocalStorage_L_N_Ksubtype_Lfort__item__component__local__storage_R_R;

// Function ItemizationVerse.fort_item._L_2fFortnite_2ecom_2fItemization_2ffort__item_N_RGetItemComponentSharedLocalStorage_L_N_Ksubtype_Lfort__item__component__shared__local__storage_R_R
// 0x0028 (0x0028 - 0x0000)
struct fort_item__L_2fFortnite_2ecom_2fItemization_2ffort__item_N_RGetItemComponentSharedLocalStorage_L_N_Ksubtype_Lfort__item__component__shared__local__storage_R_R final
{
public:
	TArray<class UClass*>                         __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0010)(Parm, ContainsInstancedReference)
	TOptional<TArray<struct Ftuple_Lsubtype_Lfort__item__component__shared__local__storage_R_Mfort__item__component__shared__local__storage_R>> RetVal; // 0x0010(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, ContainsInstancedReference)
};
DUMPER7_ASSERTS_fort_item__L_2fFortnite_2ecom_2fItemization_2ffort__item_N_RGetItemComponentSharedLocalStorage_L_N_Ksubtype_Lfort__item__component__shared__local__storage_R_R;

// Function ItemizationVerse.fort_item._L_2fFortnite_2ecom_2fItemization_2ffort__item_N_RGetItemDefinition
// 0x0020 (0x0020 - 0x0000)
struct fort_item__L_2fFortnite_2ecom_2fItemization_2ffort__item_N_RGetItemDefinition final
{
public:
	struct ItemizationVerse_0::Ftuple_L_R         __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TOptional<class Uitem_definition_base_asset*, true> RetVal;                                      // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class Uitem_definition_base_asset*, true> _ExprResultStack_0;                          // 0x0010(0x0008)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class Uitem_definition_base_asset*, true> _ExprResultStack_1;                          // 0x0018(0x0008)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_fort_item__L_2fFortnite_2ecom_2fItemization_2ffort__item_N_RGetItemDefinition;

// Function ItemizationVerse.fort_item._L_2fFortnite_2ecom_2fItemization_2ffort__item_N_RGetItemOwnerTransform
// 0x0080 (0x0080 - 0x0000)
struct fort_item__L_2fFortnite_2ecom_2fItemization_2ffort__item_N_RGetItemOwnerTransform final
{
public:
	struct ItemizationVerse_0::Ftuple_L_R         __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0xF];                                        // 0x0001(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	TOptional<struct FSpatialMath_transform>      RetVal;                                            // 0x0010(0x0070)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor)
};
DUMPER7_ASSERTS_fort_item__L_2fFortnite_2ecom_2fItemization_2ffort__item_N_RGetItemOwnerTransform;

// Function ItemizationVerse.fort_item._L_2fFortnite_2ecom_2fItemization_2ffort__item_N_RGetItemSlot
// 0x0020 (0x0020 - 0x0000)
struct fort_item__L_2fFortnite_2ecom_2fItemization_2ffort__item_N_RGetItemSlot final
{
public:
	struct ItemizationVerse_0::Ftuple_L_R         __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TOptional<int64>                              RetVal;                                            // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseFalse                                   _ExprResult_0;                                     // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseFalse                                   _ExprResult_1;                                     // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_fort_item__L_2fFortnite_2ecom_2fItemization_2ffort__item_N_RGetItemSlot;

// Function ItemizationVerse.fort_item._L_2fFortnite_2ecom_2fItemization_2ffort__item_N_RGetItemState
// 0x0005 (0x0005 - 0x0000)
struct fort_item__L_2fFortnite_2ecom_2fItemization_2ffort__item_N_RGetItemState final
{
public:
	struct ItemizationVerse_0::Ftuple_L_R         __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	TOptional<Eitem_state>                        RetVal;                                            // 0x0001(0x0002)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseFalse                                   _ExprResult_0;                                     // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseFalse                                   _ExprResult_1;                                     // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_fort_item__L_2fFortnite_2ecom_2fItemization_2ffort__item_N_RGetItemState;

// Function ItemizationVerse.fort_item._L_2fFortnite_2ecom_2fItemization_2ffort__item_N_RGetOwningInventory
// 0x0010 (0x0010 - 0x0000)
struct fort_item__L_2fFortnite_2ecom_2fItemization_2ffort__item_N_RGetOwningInventory final
{
public:
	struct ItemizationVerse_0::Ftuple_L_R         __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TOptional<class Ufort_inventory*, true>       RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_fort_item__L_2fFortnite_2ecom_2fItemization_2ffort__item_N_RGetOwningInventory;

// Function ItemizationVerse.fort_item._L_2fFortnite_2ecom_2fItemization_2ffort__item_N_RGetOwningInventoryCollection
// 0x0010 (0x0010 - 0x0000)
struct fort_item__L_2fFortnite_2ecom_2fItemization_2ffort__item_N_RGetOwningInventoryCollection final
{
public:
	struct ItemizationVerse_0::Ftuple_L_R         __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TOptional<class Ufort_inventory_collection*, true> RetVal;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_fort_item__L_2fFortnite_2ecom_2fItemization_2ffort__item_N_RGetOwningInventoryCollection;

// Function ItemizationVerse.fort_item._L_2fFortnite_2ecom_2fItemization_2ffort__item_N_ROnItemSlotChanged_L_Nint_R
// 0x0018 (0x0018 - 0x0000)
struct fort_item__L_2fFortnite_2ecom_2fItemization_2ffort__item_N_ROnItemSlotChanged_L_Nint_R final
{
public:
	int64                                         __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         _AssignmentScratch_0;                              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         _AssignmentScratch_1;                              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_fort_item__L_2fFortnite_2ecom_2fItemization_2ffort__item_N_ROnItemSlotChanged_L_Nint_R;

// Function ItemizationVerse.fort_item._L_2fFortnite_2ecom_2fItemization_2ffort__item_N_ROnItemStateChanged_L_Nitem__state_R
// 0x0003 (0x0003 - 0x0000)
struct fort_item__L_2fFortnite_2ecom_2fItemization_2ffort__item_N_ROnItemStateChanged_L_Nitem__state_R final
{
public:
	Eitem_state                                   __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Eitem_state                                   _AssignmentScratch_0;                              // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Eitem_state                                   _AssignmentScratch_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_fort_item__L_2fFortnite_2ecom_2fItemization_2ffort__item_N_ROnItemStateChanged_L_Nitem__state_R;

// Function ItemizationVerse.fort_inventory._L_2fFortnite_2ecom_2fItemization_2ffort__inventory_N_RGetItemList
// 0x0020 (0x0020 - 0x0000)
struct fort_inventory__L_2fFortnite_2ecom_2fItemization_2ffort__inventory_N_RGetItemList final
{
public:
	struct ItemizationVerse_0::Ftuple_L_R         __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TOptional<TArray<class Ufort_item*>>          RetVal;                                            // 0x0008(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, ContainsInstancedReference)
};
DUMPER7_ASSERTS_fort_inventory__L_2fFortnite_2ecom_2fItemization_2ffort__inventory_N_RGetItemList;

// Function ItemizationVerse.fort_inventory._L_2fFortnite_2ecom_2fItemization_2ffort__inventory_N_RGetOwningInventoryCollection
// 0x0010 (0x0010 - 0x0000)
struct fort_inventory__L_2fFortnite_2ecom_2fItemization_2ffort__inventory_N_RGetOwningInventoryCollection final
{
public:
	struct ItemizationVerse_0::Ftuple_L_R         __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TOptional<class Ufort_inventory_collection*, true> RetVal;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_fort_inventory__L_2fFortnite_2ecom_2fItemization_2ffort__inventory_N_RGetOwningInventoryCollection;

// Function ItemizationVerse.fort_equippable_inventory._L_2fFortnite_2ecom_2fItemization_2ffort__equippable__inventory_N_RGetEquippedItemList
// 0x0020 (0x0020 - 0x0000)
struct fort_equippable_inventory__L_2fFortnite_2ecom_2fItemization_2ffort__equippable__inventory_N_RGetEquippedItemList final
{
public:
	struct ItemizationVerse_0::Ftuple_L_R         __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TOptional<TArray<class Ufort_item*>>          RetVal;                                            // 0x0008(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, ContainsInstancedReference)
};
DUMPER7_ASSERTS_fort_equippable_inventory__L_2fFortnite_2ecom_2fItemization_2ffort__equippable__inventory_N_RGetEquippedItemList;

// Function ItemizationVerse.fort_inventory_collection.$InitCDO
// 0x00A0 (0x00A0 - 0x0000)
struct fort_inventory_collection__InitCDO final
{
public:
	class UVerseEngine_subscribable_event*        _ExprResult_0;                                     // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_1;                                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerseEngine_subscribable_event*        _ExprResult_2;                                     // 0x0010(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_3;                                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerseEngine_subscribable_event*        _ExprResult_4;                                     // 0x0020(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_5;                                // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerseEngine_subscribable_event*        _ExprResult_6;                                     // 0x0030(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_7;                                // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerseEngine_subscribable_event*        _ExprResult_8;                                     // 0x0040(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_9;                                // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerseEngine_subscribable_event*        _ExprResult_10;                                    // 0x0050(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_11;                               // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerseEngine_subscribable_event*        _ExprResult_12;                                    // 0x0060(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_13;                               // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerseEngine_subscribable_event*        _ExprResult_14;                                    // 0x0070(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_15;                               // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerseEngine_subscribable_event*        _ExprResult_16;                                    // 0x0080(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_17;                               // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerseEngine_subscribable_event*        _ExprResult_18;                                    // 0x0090(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_19;                               // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_fort_inventory_collection__InitCDO;

// Function ItemizationVerse.fort_inventory_collection._L_2fFortnite_2ecom_2fItemization_2ffort__inventory__collection_N_RGetEquippableInventoryList
// 0x0018 (0x0018 - 0x0000)
struct fort_inventory_collection__L_2fFortnite_2ecom_2fItemization_2ffort__inventory__collection_N_RGetEquippableInventoryList final
{
public:
	struct ItemizationVerse_0::Ftuple_L_R         __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class Ufort_equippable_inventory*>     RetVal;                                            // 0x0008(0x0010)(Parm, OutParm, ReturnParm, ContainsInstancedReference)
};
DUMPER7_ASSERTS_fort_inventory_collection__L_2fFortnite_2ecom_2fItemization_2ffort__inventory__collection_N_RGetEquippableInventoryList;

// Function ItemizationVerse.fort_inventory_collection._L_2fFortnite_2ecom_2fItemization_2ffort__inventory__collection_N_RGetEquippedItemList
// 0x0018 (0x0018 - 0x0000)
struct fort_inventory_collection__L_2fFortnite_2ecom_2fItemization_2ffort__inventory__collection_N_RGetEquippedItemList final
{
public:
	struct ItemizationVerse_0::Ftuple_L_R         __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class Ufort_item*>                     RetVal;                                            // 0x0008(0x0010)(Parm, OutParm, ReturnParm, ContainsInstancedReference)
};
DUMPER7_ASSERTS_fort_inventory_collection__L_2fFortnite_2ecom_2fItemization_2ffort__inventory__collection_N_RGetEquippedItemList;

// Function ItemizationVerse.fort_inventory_collection._L_2fFortnite_2ecom_2fItemization_2ffort__inventory__collection_N_RGetInventoryList
// 0x0018 (0x0018 - 0x0000)
struct fort_inventory_collection__L_2fFortnite_2ecom_2fItemization_2ffort__inventory__collection_N_RGetInventoryList final
{
public:
	struct ItemizationVerse_0::Ftuple_L_R         __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class Ufort_inventory*>                RetVal;                                            // 0x0008(0x0010)(Parm, OutParm, ReturnParm, ContainsInstancedReference)
};
DUMPER7_ASSERTS_fort_inventory_collection__L_2fFortnite_2ecom_2fItemization_2ffort__inventory__collection_N_RGetInventoryList;

// Function ItemizationVerse.fort_inventory_collection._L_2fFortnite_2ecom_2fItemization_2ffort__inventory__collection_N_RGetItemList
// 0x0018 (0x0018 - 0x0000)
struct fort_inventory_collection__L_2fFortnite_2ecom_2fItemization_2ffort__inventory__collection_N_RGetItemList final
{
public:
	struct ItemizationVerse_0::Ftuple_L_R         __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class Ufort_item*>                     RetVal;                                            // 0x0008(0x0010)(Parm, OutParm, ReturnParm, ContainsInstancedReference)
};
DUMPER7_ASSERTS_fort_inventory_collection__L_2fFortnite_2ecom_2fItemization_2ffort__inventory__collection_N_RGetItemList;

// Function ItemizationVerse.fort_inventory_collection._L_2fFortnite_2ecom_2fItemization_2ffort__inventory__collection_N_ROnInventoryAdded
// 0x0010 (0x0010 - 0x0000)
struct fort_inventory_collection__L_2fFortnite_2ecom_2fItemization_2ffort__inventory__collection_N_ROnInventoryAdded final
{
public:
	struct ItemizationVerse_0::Ftuple_L_R         __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                RetVal;                                            // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_fort_inventory_collection__L_2fFortnite_2ecom_2fItemization_2ffort__inventory__collection_N_ROnInventoryAdded;

// Function ItemizationVerse.fort_inventory_collection._L_2fFortnite_2ecom_2fItemization_2ffort__inventory__collection_N_ROnInventoryRemoved
// 0x0010 (0x0010 - 0x0000)
struct fort_inventory_collection__L_2fFortnite_2ecom_2fItemization_2ffort__inventory__collection_N_ROnInventoryRemoved final
{
public:
	struct ItemizationVerse_0::Ftuple_L_R         __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                RetVal;                                            // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_fort_inventory_collection__L_2fFortnite_2ecom_2fItemization_2ffort__inventory__collection_N_ROnInventoryRemoved;

// Function ItemizationVerse.fort_inventory_collection._L_2fFortnite_2ecom_2fItemization_2ffort__inventory__collection_N_ROnItemsAdded
// 0x0010 (0x0010 - 0x0000)
struct fort_inventory_collection__L_2fFortnite_2ecom_2fItemization_2ffort__inventory__collection_N_ROnItemsAdded final
{
public:
	struct ItemizationVerse_0::Ftuple_L_R         __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                RetVal;                                            // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_fort_inventory_collection__L_2fFortnite_2ecom_2fItemization_2ffort__inventory__collection_N_ROnItemsAdded;

// Function ItemizationVerse.fort_inventory_collection._L_2fFortnite_2ecom_2fItemization_2ffort__inventory__collection_N_ROnItemSlotsChanged
// 0x0010 (0x0010 - 0x0000)
struct fort_inventory_collection__L_2fFortnite_2ecom_2fItemization_2ffort__inventory__collection_N_ROnItemSlotsChanged final
{
public:
	struct ItemizationVerse_0::Ftuple_L_R         __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                RetVal;                                            // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_fort_inventory_collection__L_2fFortnite_2ecom_2fItemization_2ffort__inventory__collection_N_ROnItemSlotsChanged;

// Function ItemizationVerse.fort_inventory_collection._L_2fFortnite_2ecom_2fItemization_2ffort__inventory__collection_N_ROnItemsRemoved
// 0x0010 (0x0010 - 0x0000)
struct fort_inventory_collection__L_2fFortnite_2ecom_2fItemization_2ffort__inventory__collection_N_ROnItemsRemoved final
{
public:
	struct ItemizationVerse_0::Ftuple_L_R         __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                RetVal;                                            // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_fort_inventory_collection__L_2fFortnite_2ecom_2fItemization_2ffort__inventory__collection_N_ROnItemsRemoved;

// Function ItemizationVerse.item_attribute_value_float._L_2fFortnite_2ecom_2fItemization_2fitem__attribute__value__base_N_RGetAsFloat
// 0x0010 (0x0010 - 0x0000)
struct item_attribute_value_float__L_2fFortnite_2ecom_2fItemization_2fitem__attribute__value__base_N_RGetAsFloat final
{
public:
	struct ItemizationVerse_0::Ftuple_L_R         __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_item_attribute_value_float__L_2fFortnite_2ecom_2fItemization_2fitem__attribute__value__base_N_RGetAsFloat;

// Function ItemizationVerse.item_attribute_value_float._L_2fFortnite_2ecom_2fItemization_2fitem__attribute__value__base_N_RGetAsInt
// 0x0050 (0x0050 - 0x0000)
struct item_attribute_value_float__L_2fFortnite_2ecom_2fItemization_2fitem__attribute__value__base_N_RGetAsInt final
{
public:
	struct ItemizationVerse_0::Ftuple_L_R         __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TOptional<int64>                              _ExprResultStack_0;                                // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_1;                                         // 0x0020(0x0010)(HasGetValueTypeHash)
	TOptional<int64>                              _ExprResultStack_2;                                // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_3;                                         // 0x0040(0x0010)(HasGetValueTypeHash)
};
DUMPER7_ASSERTS_item_attribute_value_float__L_2fFortnite_2ecom_2fItemization_2fitem__attribute__value__base_N_RGetAsInt;

// Function ItemizationVerse.item_attribute_value_float._L_2fFortnite_2ecom_2fItemization_2fitem__attribute__value__base_N_RGetAsLogic
// 0x0098 (0x0098 - 0x0000)
struct item_attribute_value_float__L_2fFortnite_2ecom_2fItemization_2fitem__attribute__value__base_N_RGetAsLogic final
{
public:
	struct ItemizationVerse_0::Ftuple_L_R         __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         RetVal : 1;                                        // 0x0001(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	FUtf8String                                   InvokeResultDummy_0;                               // 0x0008(0x0010)(HasGetValueTypeHash)
	TOptional<FUtf8String>                        _ExprResultStack_1;                                // 0x0018(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	FUtf8String                                   _ExprResult_2;                                     // 0x0030(0x0010)(HasGetValueTypeHash)
	FUtf8String                                   _ExprResult_3;                                     // 0x0040(0x0010)(HasGetValueTypeHash)
	FUtf8String                                   InvokeResultDummy_4;                               // 0x0050(0x0010)(HasGetValueTypeHash)
	TOptional<FUtf8String>                        _ExprResultStack_5;                                // 0x0060(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	FUtf8String                                   _ExprResult_6;                                     // 0x0078(0x0010)(HasGetValueTypeHash)
	FUtf8String                                   _ExprResult_7;                                     // 0x0088(0x0010)(HasGetValueTypeHash)
};
DUMPER7_ASSERTS_item_attribute_value_float__L_2fFortnite_2ecom_2fItemization_2fitem__attribute__value__base_N_RGetAsLogic;

// Function ItemizationVerse.item_attribute_value_float._L_2fFortnite_2ecom_2fItemization_2fitem__attribute__value__base_N_RGetAsString
// 0x0038 (0x0038 - 0x0000)
struct item_attribute_value_float__L_2fFortnite_2ecom_2fItemization_2fitem__attribute__value__base_N_RGetAsString final
{
public:
	struct ItemizationVerse_0::Ftuple_L_R         __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseStringProperty_                         RetVal;                                            // 0x0008(0x0010)(Parm, OutParm, ReturnParm, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_0;                                         // 0x0018(0x0010)(HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_1;                                         // 0x0028(0x0010)(HasGetValueTypeHash)
};
DUMPER7_ASSERTS_item_attribute_value_float__L_2fFortnite_2ecom_2fItemization_2fitem__attribute__value__base_N_RGetAsString;

// Function ItemizationVerse.item_attribute_value_int._L_2fFortnite_2ecom_2fItemization_2fitem__attribute__value__base_N_RGetAsFloat
// 0x0010 (0x0010 - 0x0000)
struct item_attribute_value_int__L_2fFortnite_2ecom_2fItemization_2fitem__attribute__value__base_N_RGetAsFloat final
{
public:
	struct ItemizationVerse_0::Ftuple_L_R         __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_item_attribute_value_int__L_2fFortnite_2ecom_2fItemization_2fitem__attribute__value__base_N_RGetAsFloat;

// Function ItemizationVerse.item_attribute_value_int._L_2fFortnite_2ecom_2fItemization_2fitem__attribute__value__base_N_RGetAsInt
// 0x0010 (0x0010 - 0x0000)
struct item_attribute_value_int__L_2fFortnite_2ecom_2fItemization_2fitem__attribute__value__base_N_RGetAsInt final
{
public:
	struct ItemizationVerse_0::Ftuple_L_R         __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_item_attribute_value_int__L_2fFortnite_2ecom_2fItemization_2fitem__attribute__value__base_N_RGetAsInt;

// Function ItemizationVerse.item_attribute_value_int._L_2fFortnite_2ecom_2fItemization_2fitem__attribute__value__base_N_RGetAsLogic
// 0x0098 (0x0098 - 0x0000)
struct item_attribute_value_int__L_2fFortnite_2ecom_2fItemization_2fitem__attribute__value__base_N_RGetAsLogic final
{
public:
	struct ItemizationVerse_0::Ftuple_L_R         __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         RetVal : 1;                                        // 0x0001(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	FUtf8String                                   InvokeResultDummy_0;                               // 0x0008(0x0010)(HasGetValueTypeHash)
	TOptional<FUtf8String>                        _ExprResultStack_1;                                // 0x0018(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	FUtf8String                                   _ExprResult_2;                                     // 0x0030(0x0010)(HasGetValueTypeHash)
	FUtf8String                                   _ExprResult_3;                                     // 0x0040(0x0010)(HasGetValueTypeHash)
	FUtf8String                                   InvokeResultDummy_4;                               // 0x0050(0x0010)(HasGetValueTypeHash)
	TOptional<FUtf8String>                        _ExprResultStack_5;                                // 0x0060(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	FUtf8String                                   _ExprResult_6;                                     // 0x0078(0x0010)(HasGetValueTypeHash)
	FUtf8String                                   _ExprResult_7;                                     // 0x0088(0x0010)(HasGetValueTypeHash)
};
DUMPER7_ASSERTS_item_attribute_value_int__L_2fFortnite_2ecom_2fItemization_2fitem__attribute__value__base_N_RGetAsLogic;

// Function ItemizationVerse.item_attribute_value_int._L_2fFortnite_2ecom_2fItemization_2fitem__attribute__value__base_N_RGetAsString
// 0x0038 (0x0038 - 0x0000)
struct item_attribute_value_int__L_2fFortnite_2ecom_2fItemization_2fitem__attribute__value__base_N_RGetAsString final
{
public:
	struct ItemizationVerse_0::Ftuple_L_R         __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseStringProperty_                         RetVal;                                            // 0x0008(0x0010)(Parm, OutParm, ReturnParm, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_0;                                         // 0x0018(0x0010)(HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_1;                                         // 0x0028(0x0010)(HasGetValueTypeHash)
};
DUMPER7_ASSERTS_item_attribute_value_int__L_2fFortnite_2ecom_2fItemization_2fitem__attribute__value__base_N_RGetAsString;

// Function ItemizationVerse.item_attribute_value_logic._L_2fFortnite_2ecom_2fItemization_2fitem__attribute__value__base_N_RGetAsFloat
// 0x0018 (0x0018 - 0x0000)
struct item_attribute_value_logic__L_2fFortnite_2ecom_2fItemization_2fitem__attribute__value__base_N_RGetAsFloat final
{
public:
	struct ItemizationVerse_0::Ftuple_L_R         __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TOptional<uint8>                              _ExprResultStack_0;                                // 0x0010(0x0002)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TOptional<uint8>                              _ExprResultStack_1;                                // 0x0012(0x0002)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_item_attribute_value_logic__L_2fFortnite_2ecom_2fItemization_2fitem__attribute__value__base_N_RGetAsFloat;

// Function ItemizationVerse.item_attribute_value_logic._L_2fFortnite_2ecom_2fItemization_2fitem__attribute__value__base_N_RGetAsInt
// 0x0018 (0x0018 - 0x0000)
struct item_attribute_value_logic__L_2fFortnite_2ecom_2fItemization_2fitem__attribute__value__base_N_RGetAsInt final
{
public:
	struct ItemizationVerse_0::Ftuple_L_R         __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TOptional<uint8>                              _ExprResultStack_0;                                // 0x0010(0x0002)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TOptional<uint8>                              _ExprResultStack_1;                                // 0x0012(0x0002)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_item_attribute_value_logic__L_2fFortnite_2ecom_2fItemization_2fitem__attribute__value__base_N_RGetAsInt;

// Function ItemizationVerse.item_attribute_value_logic._L_2fFortnite_2ecom_2fItemization_2fitem__attribute__value__base_N_RGetAsLogic
// 0x0002 (0x0002 - 0x0000)
struct item_attribute_value_logic__L_2fFortnite_2ecom_2fItemization_2fitem__attribute__value__base_N_RGetAsLogic final
{
public:
	struct ItemizationVerse_0::Ftuple_L_R         __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         RetVal : 1;                                        // 0x0001(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash))
};
DUMPER7_ASSERTS_item_attribute_value_logic__L_2fFortnite_2ecom_2fItemization_2fitem__attribute__value__base_N_RGetAsLogic;

// Function ItemizationVerse.item_attribute_value_logic._L_2fFortnite_2ecom_2fItemization_2fitem__attribute__value__base_N_RGetAsString
// 0x0020 (0x0020 - 0x0000)
struct alignas(0x08) item_attribute_value_logic__L_2fFortnite_2ecom_2fItemization_2fitem__attribute__value__base_N_RGetAsString final
{
public:
	struct ItemizationVerse_0::Ftuple_L_R         __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseStringProperty_                         RetVal;                                            // 0x0008(0x0010)(Parm, OutParm, ReturnParm, HasGetValueTypeHash)
	TOptional<uint8>                              _ExprResultStack_0;                                // 0x0018(0x0002)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TOptional<uint8>                              _ExprResultStack_1;                                // 0x001A(0x0002)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_item_attribute_value_logic__L_2fFortnite_2ecom_2fItemization_2fitem__attribute__value__base_N_RGetAsString;

// Function ItemizationVerse.item_attribute_value_string.$InitCDO
// 0x0020 (0x0020 - 0x0000)
struct alignas(0x08) item_attribute_value_string__InitCDO final
{
public:
	FVerseStringProperty_                         _ExprResult_0;                                     // 0x0000(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_1;                                     // 0x0010(0x0010)(HasGetValueTypeHash)
};
DUMPER7_ASSERTS_item_attribute_value_string__InitCDO;

// Function ItemizationVerse.item_attribute_value_string._L_2fFortnite_2ecom_2fItemization_2fitem__attribute__value__base_N_RGetAsString
// 0x0018 (0x0018 - 0x0000)
struct alignas(0x08) item_attribute_value_string__L_2fFortnite_2ecom_2fItemization_2fitem__attribute__value__base_N_RGetAsString final
{
public:
	struct ItemizationVerse_0::Ftuple_L_R         __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseStringProperty_                         RetVal;                                            // 0x0008(0x0010)(Parm, OutParm, ReturnParm, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_item_attribute_value_string__L_2fFortnite_2ecom_2fItemization_2fitem__attribute__value__base_N_RGetAsString;

}

