#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ItemizationCoreUI

#include "Basic.hpp"

#include "ModelViewViewModel_classes.hpp"
#include "ItemizationCoreRuntime_structs.hpp"
#include "Engine_classes.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// Class ItemizationCoreUI.InventoryCollectionViewModel
// 0x0058 (0x00C0 - 0x0068)
class UInventoryCollectionViewModel final : public UMVVMViewModelBase
{
public:
	TArray<class UInventoryViewModel*>            InventoryViewModels;                               // 0x0068(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	class UInventoryItemEntryViewModel*           SelectedInventoryItemEntryViewModel;               // 0x0078(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UInventoryItemEntryViewModel*           LastAmountChangedInventoryItemEntryViewModel;      // 0x0080(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_88[0x38];                                      // 0x0088(0x0038)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void InitializeViewModel(class UObject* InitializingObject);
	void UnbindInventoryCollection(const bool bUnusedParam);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("InventoryCollectionViewModel")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"InventoryCollectionViewModel")
	}
	static class UInventoryCollectionViewModel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInventoryCollectionViewModel>();
	}
};
DUMPER7_ASSERTS_UInventoryCollectionViewModel;

// Class ItemizationCoreUI.InventoryItemEntryViewModel
// 0x0140 (0x01A8 - 0x0068)
class UInventoryItemEntryViewModel final : public UMVVMViewModelBase
{
public:
	bool                                          bItemSelected;                                     // 0x0068(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bItemBeingSwapped;                                 // 0x0069(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bCanDrop;                                          // 0x006A(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bCanSwap;                                          // 0x006B(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bIsCooldownActive;                                 // 0x006C(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CooldownTimeLeft;                                  // 0x0070(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         CooldownProgress;                                  // 0x0074(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int64                                         ItemAmountChanged;                                 // 0x0078(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UTexture2D*                             CachedItemIcon;                                    // 0x0080(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UTexture2D*                             CachedSmallItemIcon;                               // 0x0088(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_90[0x118];                                     // 0x0090(0x0118)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void DropAll(const bool bUnused);
	void DropAmount(const int64 Amount);
	void DropHalf(const bool bUnused);
	void SetEquippableItemActive(const bool bActive);
	void SetItemSlotNumber(const int32 SlotNumber);
	void ToggleEquippableItemActive(const bool bUnused);
	void UpdateCanSwap(const class UInventoryItemEntryViewModel* SwapInventoryItemEntryViewModel);
	void UseItem(const bool bUnused);

	bool CanItemBeMadeActive() const;
	bool CanItemBeMadeInactive() const;
	class UInputAction* GetEquipSlotInputAction() const;
	const struct FGuid GetInventoryID() const;
	int64 GetItemAmount() const;
	const class UItemDefinitionBase* GetItemDefinition() const;
	class FText GetItemDescription() const;
	const struct FGuid GetItemEntryID() const;
	class UTexture2D* GetItemIcon() const;
	EItemIconDisplayTextType GetItemIconDisplayTextType() const;
	class FText GetItemName() const;
	int64 GetItemPrimaryAmmoCount() const;
	const class UItemRarity* GetItemRarity() const;
	int32 GetItemSlotNumber() const;
	const class UItemType* GetItemType() const;
	class UTexture2D* GetSmallItemIcon() const;
	TSoftObjectPtr<class UTexture2D> GetSoftItemIcon() const;
	TSoftObjectPtr<class UTexture2D> GetSoftSmallItemIcon() const;
	bool IsEquipSlotInputBindingVisible() const;
	bool IsItemActive() const;
	bool IsItemEntryIDValid() const;
	bool IsItemIconLoading() const;
	bool IsSmallItemIconLoading() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("InventoryItemEntryViewModel")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"InventoryItemEntryViewModel")
	}
	static class UInventoryItemEntryViewModel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInventoryItemEntryViewModel>();
	}
};
DUMPER7_ASSERTS_UInventoryItemEntryViewModel;

// Class ItemizationCoreUI.InventoryViewModel
// 0x0068 (0x00D0 - 0x0068)
class UInventoryViewModel final : public UMVVMViewModelBase
{
public:
	TArray<class UInventoryItemEntryViewModel*>   InventoryItemEntryViewModels;                      // 0x0068(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	class UInventoryItemEntryViewModel*           ActiveItemEntryViewModel;                          // 0x0078(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UInventoryItemEntryViewModel*           InventoryItemEntryViewModelBeingSwapped;           // 0x0080(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_88[0x48];                                      // 0x0088(0x0048)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	const class UInventoryDefinition* GetInventoryDefinition() const;
	const class FText GetInventoryDescription() const;
	const class FText GetInventoryName() const;
	int32 GetTotalSlots() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("InventoryViewModel")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"InventoryViewModel")
	}
	static class UInventoryViewModel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInventoryViewModel>();
	}
};
DUMPER7_ASSERTS_UInventoryViewModel;

// Class ItemizationCoreUI.InventoryViewModelAllowedConversionFunctions
// 0x0000 (0x0028 - 0x0028)
class UInventoryViewModelAllowedConversionFunctions : public UBlueprintFunctionLibrary
{
public:
	static class UInventoryViewModel* FindInventoryViewModel(const class UInventoryDefinition* InventoryDefinition, const TArray<class UInventoryViewModel*>& InventoryViewModels);
	static TArray<class UInventoryItemEntryViewModel*> GetInventoryItemEntryViewModels(const TArray<class UInventoryItemEntryViewModel*>& InventoryItemEntryViewModels, const bool bIncludeEmptySlots);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("InventoryViewModelAllowedConversionFunctions")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"InventoryViewModelAllowedConversionFunctions")
	}
	static class UInventoryViewModelAllowedConversionFunctions* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInventoryViewModelAllowedConversionFunctions>();
	}
};
DUMPER7_ASSERTS_UInventoryViewModelAllowedConversionFunctions;

// Class ItemizationCoreUI.InventoryViewModelConversionFunctions
// 0x0000 (0x0028 - 0x0028)
class UInventoryViewModelConversionFunctions final : public UInventoryViewModelAllowedConversionFunctions
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("InventoryViewModelConversionFunctions")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"InventoryViewModelConversionFunctions")
	}
	static class UInventoryViewModelConversionFunctions* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInventoryViewModelConversionFunctions>();
	}
};
DUMPER7_ASSERTS_UInventoryViewModelConversionFunctions;

// Class ItemizationCoreUI.UniformGridEntryPanel
// 0x00C8 (0x0280 - 0x01B8)
class UUniformGridEntryPanel final : public UUniformGridPanel
{
public:
	TMulticastInlineDelegate<void()>              OnGridItemsSet;                                    // 0x01B8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UWidget* GridEntry)> OnGridEntryAdded;                       // 0x01C8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UWidget* GridEntry)> OnGridEntryRemoved;                     // 0x01D8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TSubclassOf<class UUserWidget>                EntryWidgetClass;                                  // 0x01E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         NumColumns;                                        // 0x01F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	EHorizontalAlignment                          SlotHorizontalAlignment;                           // 0x01F4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	EVerticalAlignment                            SlotVerticalAlignment;                             // 0x01F5(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1F6[0x2];                                      // 0x01F6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUserWidgetPool                        EntryWidgetPool;                                   // 0x01F8(0x0088)(Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate)

public:
	void SetGridItems(const TArray<class UObject*>& GridItems);
	void SetSlotAlignment(const EHorizontalAlignment InSlotHorizontalAlignment, const EVerticalAlignment InSlotVerticalAlignment);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("UniformGridEntryPanel")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UniformGridEntryPanel")
	}
	static class UUniformGridEntryPanel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUniformGridEntryPanel>();
	}
};
DUMPER7_ASSERTS_UUniformGridEntryPanel;

}

