#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ItemizationRuntime

#include "Basic.hpp"

#include "ItemizationRuntime_structs.hpp"
#include "FortImGuiCore_classes.hpp"
#include "ItemizationCoreRuntime_classes.hpp"


namespace SDK
{

// Class ItemizationRuntime.InventoryDebugMenu
// 0x0080 (0x0540 - 0x04C0)
class AInventoryDebugMenu final : public AImGuiDebugMenuBase
{
public:
	class AActor*                                 MonitoredActor;                                    // 0x04B8(0x0008)(Net, ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FInventoryCollectionDebugSnapshot      ServerDebugSnapshot;                               // 0x04C0(0x0030)(Net, Transient, NativeAccessSpecifierPrivate)
	struct FFortInventoryDebugSnapshot            ServerDebugSnapshot_FortInventory;                 // 0x04F0(0x0048)(Net, Transient, NativeAccessSpecifierPrivate)
	int32                                         SelectedInventoryIndex;                            // 0x0538(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bDisplayClient;                                    // 0x053C(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bDisplayServer;                                    // 0x053D(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bDisplayFortInventories;                           // 0x053E(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bDisplayInventoryCollections;                      // 0x053F(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void ServerClose();
	void ServerSetMonitoredActor(class AActor* ActorToMonitor);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("InventoryDebugMenu")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"InventoryDebugMenu")
	}
	static class AInventoryDebugMenu* GetDefaultObj()
	{
		return GetDefaultObjImpl<AInventoryDebugMenu>();
	}
};
DUMPER7_ASSERTS_AInventoryDebugMenu;

// Class ItemizationRuntime.ItemGamePickup
// 0x0008 (0x02C0 - 0x02B8)
class AItemGamePickup final : public AItemPickup
{
public:
	uint8                                         Pad_2B8[0x8];                                      // 0x02B8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ItemGamePickup")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ItemGamePickup")
	}
	static class AItemGamePickup* GetDefaultObj()
	{
		return GetDefaultObjImpl<AItemGamePickup>();
	}
};
DUMPER7_ASSERTS_AItemGamePickup;

}

