#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ItemizationVerse_0

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"
#include "ItemizationVerse_classes.hpp"
#include "ItemizationVerse_0_structs.hpp"
#include "ItemizationCoreRuntime_classes.hpp"
#include "VerseNative_structs.hpp"
#include "VerseAssets_0_classes.hpp"


namespace SDK
{

// VerseClass ItemizationVerse.item_definition_base_asset
// 0x0020 (0x00E8 - 0x00C8)
class Uitem_definition_base_asset : public UAssets_asset
{
public:
	FVerseFunctionProperty_                       __verse_0x49F09B17__L_2fFortnite_2ecom_2fItemization_2fitem__definition__base__asset_N_RGetAttribute_L_N_Ksubtype_Litem__attribute__base_R_R; // 0x00C8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x94109DC5__L_2fFortnite_2ecom_2fItemization_2fitem__definition__base__asset_N_RGetItemComponent_L_N_Ksubtype_Lfort__item__component__base_R_R; // 0x00D8(0x0010)(InstancedReference, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	TOptional<TArray<struct Ftuple_Lsubtype_Litem__attribute__base_R_Mitem__attribute__value__base_R>> _L_2fFortnite_2ecom_2fItemization_2fitem__definition__base__asset_N_RGetAttribute_L_N_Ksubtype_Litem__attribute__base_R_R(const TArray<class UClass*>& __verse_0xB2CDDD72_Argument);
	TOptional<TArray<struct Ftuple_Lsubtype_Lfort__item__component__base_R_Mfort__item__component__base_R>> _L_2fFortnite_2ecom_2fItemization_2fitem__definition__base__asset_N_RGetItemComponent_L_N_Ksubtype_Lfort__item__component__base_R_R(const TArray<class UClass*>& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("item_definition_base_asset")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"item_definition_base_asset")
	}
	static class Uitem_definition_base_asset* GetDefaultObj()
	{
		return GetDefaultObjImpl<Uitem_definition_base_asset>();
	}
};
DUMPER7_ASSERTS_Uitem_definition_base_asset;

// VerseClass ItemizationVerse.$SolarisSignatureFunctionOuter
// 0x0000 (0x0028 - 0x0028)
class ItemizationVerse_0::U_SolarisSignatureFunctionOuter final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL_FULLNAME("VerseClass ItemizationVerse.$SolarisSignatureFunctionOuter")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"$SolarisSignatureFunctionOuter")
	}
	static class ItemizationVerse_0::U_SolarisSignatureFunctionOuter* GetDefaultObj()
	{
		return GetDefaultObjImpl<ItemizationVerse_0::U_SolarisSignatureFunctionOuter>();
	}
};
DUMPER7_ASSERTS_ItemizationVerse_0__U_SolarisSignatureFunctionOuter;

// VerseClass ItemizationVerse._Root
// 0x0000 (0x0028 - 0x0028)
class ItemizationVerse_0::U_Root final : public UObject
{
public:
	static void _L_2fFortnite_2ecom_2fItemization_N_ROnItemStateUpdate_L_Nfort__item_M_Nitem__state_R(const struct Ftuple_Lfort__item_Mitem__state_R& __verse_0xB2CDDD72_Argument);
	static TOptional<class Ufort_inventory_collection*, true> _L_2fFortnite_2ecom_2fItemization_N_Roperator_U_2eGetInventoryCollection_U_L_Ncreative__object_M_Ntuple_L_R_M_Ntuple_L_R_R(const struct ItemizationVerse_0::Ftuple_Lcreative__object_Mtuple_L_R_Mtuple_L_R_R& __verse_0xB2CDDD72_Argument);
	static TOptional<class Ufort_inventory_collection*, true> _L_2fFortnite_2ecom_2fItemization_N_Roperator_U_2eGetOrCreateInventoryCollection_U_L_Ncreative__object_M_Ntuple_L_R_M_Ntuple_L_R_R(const struct ItemizationVerse_0::Ftuple_Lcreative__object_Mtuple_L_R_Mtuple_L_R_R& __verse_0xB2CDDD72_Argument);
	static TOptional<class Ufort_inventory_collection*, true> _L_2fFortnite_2ecom_2fItemization_N_Roperator_U_2eGetPlayerInventoryCollection_U_L_Nfort__character_M_Ntuple_L_R_M_Ntuple_L_R_R(const struct ItemizationVerse_0::Ftuple_Lfort__character_Mtuple_L_R_Mtuple_L_R_R& __verse_0xB2CDDD72_Argument);

	void _InitCDO();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL_FULLNAME("VerseClass ItemizationVerse._Root")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"_Root")
	}
	static class ItemizationVerse_0::U_Root* GetDefaultObj()
	{
		return GetDefaultObjImpl<ItemizationVerse_0::U_Root>();
	}
};
DUMPER7_ASSERTS_ItemizationVerse_0__U_Root;

// VerseClass ItemizationVerse.fort_item_component
// 0x0000 (0x0028 - 0x0028)
class Ufort_item_component final : public UItemComponentBase
{
public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("fort_item_component")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"fort_item_component")
	}
	static class Ufort_item_component* GetDefaultObj()
	{
		return GetDefaultObjImpl<Ufort_item_component>();
	}
};
DUMPER7_ASSERTS_Ufort_item_component;

// VerseClass ItemizationVerse.fort_item
// 0x00D8 (0x0118 - 0x0040)
class Ufort_item final : public UVerseItem
{
public:
	FVerseFunctionProperty_                       __verse_0x46E08D00__L_2fFortnite_2ecom_2fItemization_2ffort__item_N_RGetOwningInventoryCollection; // 0x0040(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xBCF2E91F__L_2fFortnite_2ecom_2fItemization_2ffort__item_N_RGetOwningInventory; // 0x0050(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x47044098__L_2fFortnite_2ecom_2fItemization_2ffort__item_N_RGetItemOwnerTransform; // 0x0060(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xFA38C349__L_2fFortnite_2ecom_2fItemization_2ffort__item_N_RGetAttribute_L_N_Ksubtype_Litem__attribute__base_R_R; // 0x0070(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xB3041392__L_2fFortnite_2ecom_2fItemization_2ffort__item_N_RGetItemComponent_L_N_Ksubtype_Lfort__item__component__base_R_R; // 0x0080(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x5E40B0E6__L_2fFortnite_2ecom_2fItemization_2ffort__item_N_RGetItemComponentLocalStorage_L_N_Ksubtype_Lfort__item__component__local__storage_R_R; // 0x0090(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x9CC103C0__L_2fFortnite_2ecom_2fItemization_2ffort__item_N_RGetItemComponentSharedLocalStorage_L_N_Ksubtype_Lfort__item__component__shared__local__storage_R_R; // 0x00A0(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x376FE579__L_2fFortnite_2ecom_2fItemization_2ffort__item_N_RGetItemDefinition; // 0x00B0(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x19B089D3__L_2fFortnite_2ecom_2fItemization_2ffort__item_N_RGetItemSlot; // 0x00C0(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x8BEC6D4C__L_2fFortnite_2ecom_2fItemization_2ffort__item_N_RGetItemState; // 0x00D0(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xCC83B9D7__L_2fFortnite_2ecom_2fItemization_2ffort__item_N_ROnItemSlotChanged_L_Nint_R; // 0x00E0(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xF5A1FD18__L_2fFortnite_2ecom_2fItemization_2ffort__item_N_ROnItemStateChanged_L_Nitem__state_R; // 0x00F0(0x0010)(InstancedReference, HasGetValueTypeHash)
	TOptional<class Uitem_definition_base_asset*, true> __verse_0x37298358_ItemDefinition;           // 0x0100(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	int64                                         __verse_0x77CFCAB0_ItemSlot;                       // 0x0108(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Eitem_state                                   __verse_0xF26FD6C7_ItemState;                      // 0x0110(0x0001)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	TOptional<TArray<struct Ftuple_Lsubtype_Litem__attribute__base_R_Mitem__attribute__value__base_R>> _L_2fFortnite_2ecom_2fItemization_2ffort__item_N_RGetAttribute_L_N_Ksubtype_Litem__attribute__base_R_R(const TArray<class UClass*>& __verse_0xB2CDDD72_Argument);
	TOptional<TArray<struct Ftuple_Lsubtype_Lfort__item__component__base_R_Mfort__item__component__base_R>> _L_2fFortnite_2ecom_2fItemization_2ffort__item_N_RGetItemComponent_L_N_Ksubtype_Lfort__item__component__base_R_R(const TArray<class UClass*>& __verse_0xB2CDDD72_Argument);
	TOptional<TArray<struct Ftuple_Lsubtype_Lfort__item__component__local__storage_R_Mfort__item__component__local__storage_R>> _L_2fFortnite_2ecom_2fItemization_2ffort__item_N_RGetItemComponentLocalStorage_L_N_Ksubtype_Lfort__item__component__local__storage_R_R(const TArray<class UClass*>& __verse_0xB2CDDD72_Argument);
	TOptional<TArray<struct Ftuple_Lsubtype_Lfort__item__component__shared__local__storage_R_Mfort__item__component__shared__local__storage_R>> _L_2fFortnite_2ecom_2fItemization_2ffort__item_N_RGetItemComponentSharedLocalStorage_L_N_Ksubtype_Lfort__item__component__shared__local__storage_R_R(const TArray<class UClass*>& __verse_0xB2CDDD72_Argument);
	TOptional<class Uitem_definition_base_asset*, true> _L_2fFortnite_2ecom_2fItemization_2ffort__item_N_RGetItemDefinition(const struct ItemizationVerse_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	TOptional<struct FSpatialMath_transform> _L_2fFortnite_2ecom_2fItemization_2ffort__item_N_RGetItemOwnerTransform(const struct ItemizationVerse_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	TOptional<int64> _L_2fFortnite_2ecom_2fItemization_2ffort__item_N_RGetItemSlot(const struct ItemizationVerse_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	TOptional<Eitem_state> _L_2fFortnite_2ecom_2fItemization_2ffort__item_N_RGetItemState(const struct ItemizationVerse_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	TOptional<class Ufort_inventory*, true> _L_2fFortnite_2ecom_2fItemization_2ffort__item_N_RGetOwningInventory(const struct ItemizationVerse_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	TOptional<class Ufort_inventory_collection*, true> _L_2fFortnite_2ecom_2fItemization_2ffort__item_N_RGetOwningInventoryCollection(const struct ItemizationVerse_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fItemization_2ffort__item_N_ROnItemSlotChanged_L_Nint_R(int64 __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fItemization_2ffort__item_N_ROnItemStateChanged_L_Nitem__state_R(Eitem_state __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("fort_item")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"fort_item")
	}
	static class Ufort_item* GetDefaultObj()
	{
		return GetDefaultObjImpl<Ufort_item>();
	}
};
DUMPER7_ASSERTS_Ufort_item;

// VerseClass ItemizationVerse.fort_inventory
// 0x0020 (0x00C8 - 0x00A8)
class Ufort_inventory : public UVerseInventory
{
public:
	FVerseFunctionProperty_                       __verse_0xC035A497__L_2fFortnite_2ecom_2fItemization_2ffort__inventory_N_RGetOwningInventoryCollection; // 0x00A8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x14C1F62E__L_2fFortnite_2ecom_2fItemization_2ffort__inventory_N_RGetItemList; // 0x00B8(0x0010)(InstancedReference, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	TOptional<TArray<class Ufort_item*>> _L_2fFortnite_2ecom_2fItemization_2ffort__inventory_N_RGetItemList(const struct ItemizationVerse_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	TOptional<class Ufort_inventory_collection*, true> _L_2fFortnite_2ecom_2fItemization_2ffort__inventory_N_RGetOwningInventoryCollection(const struct ItemizationVerse_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("fort_inventory")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"fort_inventory")
	}
	static class Ufort_inventory* GetDefaultObj()
	{
		return GetDefaultObjImpl<Ufort_inventory>();
	}
};
DUMPER7_ASSERTS_Ufort_inventory;

// VerseClass ItemizationVerse.fort_equippable_inventory
// 0x0018 (0x00E0 - 0x00C8)
class Ufort_equippable_inventory final : public Ufort_inventory
{
public:
	FVerseFunctionProperty_                       __verse_0xE302317F__L_2fFortnite_2ecom_2fItemization_2ffort__equippable__inventory_N_RGetEquippedItemList; // 0x00C8(0x0010)(InstancedReference, HasGetValueTypeHash)
	uint8                                         Pad_D8[0x8];                                       // 0x00D8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	TOptional<TArray<class Ufort_item*>> _L_2fFortnite_2ecom_2fItemization_2ffort__equippable__inventory_N_RGetEquippedItemList(const struct ItemizationVerse_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("fort_equippable_inventory")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"fort_equippable_inventory")
	}
	static class Ufort_equippable_inventory* GetDefaultObj()
	{
		return GetDefaultObjImpl<Ufort_equippable_inventory>();
	}
};
DUMPER7_ASSERTS_Ufort_equippable_inventory;

// VerseClass ItemizationVerse.fort_inventory_collection
// 0x00B8 (0x01F0 - 0x0138)
class Ufort_inventory_collection final : public UVerseInventoryCollectionWrapper
{
public:
	FVerseFunctionProperty_                       __verse_0x7A5540C0__L_2fFortnite_2ecom_2fItemization_2ffort__inventory__collection_N_RGetInventoryList; // 0x0138(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x016A2F76__L_2fFortnite_2ecom_2fItemization_2ffort__inventory__collection_N_RGetEquippableInventoryList; // 0x0148(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x1E5D5CC7__L_2fFortnite_2ecom_2fItemization_2ffort__inventory__collection_N_RGetItemList; // 0x0158(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xFD73C034__L_2fFortnite_2ecom_2fItemization_2ffort__inventory__collection_N_RGetEquippedItemList; // 0x0168(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xFDA63BFD__L_2fFortnite_2ecom_2fItemization_2ffort__inventory__collection_N_ROnItemsAdded; // 0x0178(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xC402E9A3__L_2fFortnite_2ecom_2fItemization_2ffort__inventory__collection_N_ROnItemsRemoved; // 0x0188(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xB7CD6DEC__L_2fFortnite_2ecom_2fItemization_2ffort__inventory__collection_N_ROnItemSlotsChanged; // 0x0198(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xEF68A014__L_2fFortnite_2ecom_2fItemization_2ffort__inventory__collection_N_ROnInventoryAdded; // 0x01A8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x6A933053__L_2fFortnite_2ecom_2fItemization_2ffort__inventory__collection_N_ROnInventoryRemoved; // 0x01B8(0x0010)(InstancedReference, HasGetValueTypeHash)
	class UVerseEngine_subscribable_event*        __verse_0xD496A7AB_OnItemsAddedInternal;           // 0x01C8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerseEngine_subscribable_event*        __verse_0x00F72D33_OnItemsRemovedInternal;         // 0x01D0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerseEngine_subscribable_event*        __verse_0x8AD60149_OnItemSlotsChangedInternal;     // 0x01D8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerseEngine_subscribable_event*        __verse_0x308CC10A_OnInventoryAddedInternal;       // 0x01E0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerseEngine_subscribable_event*        __verse_0x7A45F364_OnInventoryRemovedInternal;     // 0x01E8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	TArray<class Ufort_equippable_inventory*> _L_2fFortnite_2ecom_2fItemization_2ffort__inventory__collection_N_RGetEquippableInventoryList(const struct ItemizationVerse_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	TArray<class Ufort_item*> _L_2fFortnite_2ecom_2fItemization_2ffort__inventory__collection_N_RGetEquippedItemList(const struct ItemizationVerse_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	TArray<class Ufort_inventory*> _L_2fFortnite_2ecom_2fItemization_2ffort__inventory__collection_N_RGetInventoryList(const struct ItemizationVerse_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	TArray<class Ufort_item*> _L_2fFortnite_2ecom_2fItemization_2ffort__inventory__collection_N_RGetItemList(const struct ItemizationVerse_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	class UObject* _L_2fFortnite_2ecom_2fItemization_2ffort__inventory__collection_N_ROnInventoryAdded(const struct ItemizationVerse_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	class UObject* _L_2fFortnite_2ecom_2fItemization_2ffort__inventory__collection_N_ROnInventoryRemoved(const struct ItemizationVerse_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	class UObject* _L_2fFortnite_2ecom_2fItemization_2ffort__inventory__collection_N_ROnItemsAdded(const struct ItemizationVerse_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	class UObject* _L_2fFortnite_2ecom_2fItemization_2ffort__inventory__collection_N_ROnItemSlotsChanged(const struct ItemizationVerse_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	class UObject* _L_2fFortnite_2ecom_2fItemization_2ffort__inventory__collection_N_ROnItemsRemoved(const struct ItemizationVerse_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("fort_inventory_collection")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"fort_inventory_collection")
	}
	static class Ufort_inventory_collection* GetDefaultObj()
	{
		return GetDefaultObjImpl<Ufort_inventory_collection>();
	}
};
DUMPER7_ASSERTS_Ufort_inventory_collection;

// VerseClass ItemizationVerse.item_attribute_float
// 0x0008 (0x0088 - 0x0080)
class Uitem_attribute_float final : public UItemAttribute_Decimal
{
public:
	double                                        __verse_0xF4334CD7_DefaultValue;                   // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("item_attribute_float")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"item_attribute_float")
	}
	static class Uitem_attribute_float* GetDefaultObj()
	{
		return GetDefaultObjImpl<Uitem_attribute_float>();
	}
};
DUMPER7_ASSERTS_Uitem_attribute_float;

// VerseClass ItemizationVerse.item_attribute_int
// 0x0008 (0x0088 - 0x0080)
class Uitem_attribute_int final : public UItemAttribute_Int
{
public:
	int64                                         __verse_0xF4334CD7_DefaultValue;                   // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("item_attribute_int")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"item_attribute_int")
	}
	static class Uitem_attribute_int* GetDefaultObj()
	{
		return GetDefaultObjImpl<Uitem_attribute_int>();
	}
};
DUMPER7_ASSERTS_Uitem_attribute_int;

// VerseClass ItemizationVerse.item_attribute_logic
// 0x0008 (0x0080 - 0x0078)
class Uitem_attribute_logic final : public UItemAttribute_Bool
{
public:
	uint8                                         __verse_0xF4334CD7_DefaultValue : 1;               // 0x0078(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (InstancedReference, NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("item_attribute_logic")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"item_attribute_logic")
	}
	static class Uitem_attribute_logic* GetDefaultObj()
	{
		return GetDefaultObjImpl<Uitem_attribute_logic>();
	}
};
DUMPER7_ASSERTS_Uitem_attribute_logic;

// VerseClass ItemizationVerse.item_attribute_string
// 0x0010 (0x0090 - 0x0080)
class Uitem_attribute_string final : public UItemAttribute_String
{
public:
	FVerseStringProperty_                         __verse_0xF4334CD7_DefaultValue;                   // 0x0080(0x0010)(InstancedReference, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("item_attribute_string")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"item_attribute_string")
	}
	static class Uitem_attribute_string* GetDefaultObj()
	{
		return GetDefaultObjImpl<Uitem_attribute_string>();
	}
};
DUMPER7_ASSERTS_Uitem_attribute_string;

// VerseClass ItemizationVerse.item_attribute_value_float
// 0x0008 (0x0048 - 0x0040)
class Uitem_attribute_value_float final : public UItemAttributeValue_Decimal
{
public:
	double                                        __verse_0x31A8F10C_Value;                          // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	double _L_2fFortnite_2ecom_2fItemization_2fitem__attribute__value__base_N_RGetAsFloat(const struct ItemizationVerse_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	int64 _L_2fFortnite_2ecom_2fItemization_2fitem__attribute__value__base_N_RGetAsInt(const struct ItemizationVerse_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	uint8 _L_2fFortnite_2ecom_2fItemization_2fitem__attribute__value__base_N_RGetAsLogic(const struct ItemizationVerse_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	FVerseStringProperty_ _L_2fFortnite_2ecom_2fItemization_2fitem__attribute__value__base_N_RGetAsString(const struct ItemizationVerse_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("item_attribute_value_float")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"item_attribute_value_float")
	}
	static class Uitem_attribute_value_float* GetDefaultObj()
	{
		return GetDefaultObjImpl<Uitem_attribute_value_float>();
	}
};
DUMPER7_ASSERTS_Uitem_attribute_value_float;

// VerseClass ItemizationVerse.item_attribute_value_int
// 0x0008 (0x0048 - 0x0040)
class Uitem_attribute_value_int final : public UItemAttributeValue_Int
{
public:
	int64                                         __verse_0x31A8F10C_Value;                          // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	double _L_2fFortnite_2ecom_2fItemization_2fitem__attribute__value__base_N_RGetAsFloat(const struct ItemizationVerse_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	int64 _L_2fFortnite_2ecom_2fItemization_2fitem__attribute__value__base_N_RGetAsInt(const struct ItemizationVerse_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	uint8 _L_2fFortnite_2ecom_2fItemization_2fitem__attribute__value__base_N_RGetAsLogic(const struct ItemizationVerse_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	FVerseStringProperty_ _L_2fFortnite_2ecom_2fItemization_2fitem__attribute__value__base_N_RGetAsString(const struct ItemizationVerse_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("item_attribute_value_int")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"item_attribute_value_int")
	}
	static class Uitem_attribute_value_int* GetDefaultObj()
	{
		return GetDefaultObjImpl<Uitem_attribute_value_int>();
	}
};
DUMPER7_ASSERTS_Uitem_attribute_value_int;

// VerseClass ItemizationVerse.item_attribute_value_logic
// 0x0008 (0x0048 - 0x0040)
class Uitem_attribute_value_logic final : public UItemAttributeValue_Bool
{
public:
	uint8                                         __verse_0x31A8F10C_Value : 1;                      // 0x0040(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (InstancedReference, NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	double _L_2fFortnite_2ecom_2fItemization_2fitem__attribute__value__base_N_RGetAsFloat(const struct ItemizationVerse_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	int64 _L_2fFortnite_2ecom_2fItemization_2fitem__attribute__value__base_N_RGetAsInt(const struct ItemizationVerse_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	uint8 _L_2fFortnite_2ecom_2fItemization_2fitem__attribute__value__base_N_RGetAsLogic(const struct ItemizationVerse_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	FVerseStringProperty_ _L_2fFortnite_2ecom_2fItemization_2fitem__attribute__value__base_N_RGetAsString(const struct ItemizationVerse_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("item_attribute_value_logic")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"item_attribute_value_logic")
	}
	static class Uitem_attribute_value_logic* GetDefaultObj()
	{
		return GetDefaultObjImpl<Uitem_attribute_value_logic>();
	}
};
DUMPER7_ASSERTS_Uitem_attribute_value_logic;

// VerseClass ItemizationVerse.item_attribute_value_string
// 0x0010 (0x0050 - 0x0040)
class Uitem_attribute_value_string final : public UItemAttributeValue_String
{
public:
	FVerseStringProperty_                         __verse_0x31A8F10C_Value;                          // 0x0040(0x0010)(InstancedReference, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	FVerseStringProperty_ _L_2fFortnite_2ecom_2fItemization_2fitem__attribute__value__base_N_RGetAsString(const struct ItemizationVerse_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("item_attribute_value_string")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"item_attribute_value_string")
	}
	static class Uitem_attribute_value_string* GetDefaultObj()
	{
		return GetDefaultObjImpl<Uitem_attribute_value_string>();
	}
};
DUMPER7_ASSERTS_Uitem_attribute_value_string;

// VerseClass ItemizationVerse.item_definition_asset
// 0x0000 (0x00E8 - 0x00E8)
class Uitem_definition_asset final : public Uitem_definition_base_asset
{
public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("item_definition_asset")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"item_definition_asset")
	}
	static class Uitem_definition_asset* GetDefaultObj()
	{
		return GetDefaultObjImpl<Uitem_definition_asset>();
	}
};
DUMPER7_ASSERTS_Uitem_definition_asset;

// VerseClass ItemizationVerse.item_variant_asset
// 0x0000 (0x00E8 - 0x00E8)
class Uitem_variant_asset final : public Uitem_definition_base_asset
{
public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("item_variant_asset")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"item_variant_asset")
	}
	static class Uitem_variant_asset* GetDefaultObj()
	{
		return GetDefaultObjImpl<Uitem_variant_asset>();
	}
};
DUMPER7_ASSERTS_Uitem_variant_asset;

}

