#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ItemizationCoreRuntime

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "VerseGameplayTags_structs.hpp"
#include "ItemizationCoreRuntime_structs.hpp"
#include "EnhancedInput_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "McpProfileSys_classes.hpp"


namespace SDK
{

// Class ItemizationCoreRuntime.InventoryDefinition
// 0x0048 (0x0078 - 0x0030)
class UInventoryDefinition : public UDataAsset
{
public:
	class FText                                   Name_0;                                            // 0x0030(0x0018)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	class FText                                   Description;                                       // 0x0048(0x0018)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	uint16                                        Slots;                                             // 0x0060(0x0002)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         PickupPriority;                                    // 0x0062(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_63[0x5];                                       // 0x0063(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UItemRequirements*                      ItemRequirements;                                  // 0x0068(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bEnableItemStacking;                               // 0x0070(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bRequireUniqueItemDefinitionPerStack;              // 0x0071(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_72[0x6];                                       // 0x0072(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("InventoryDefinition")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"InventoryDefinition")
	}
	static class UInventoryDefinition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInventoryDefinition>();
	}
};
DUMPER7_ASSERTS_UInventoryDefinition;

// Class ItemizationCoreRuntime.ItemizationWorldSubsystem
// 0x00A8 (0x00D8 - 0x0030)
class UItemizationWorldSubsystem final : public UWorldSubsystem
{
public:
	uint8                                         Pad_30[0xA0];                                      // 0x0030(0x00A0)(Fixing Size After Last Property [ Dumper-7 ])
	class UItemizationPersistenceManagerBase*     ItemizationPersistenceManager;                     // 0x00D0(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnInventoryComponentDestroyed(const class UInventoryComponent* InventoryComponent);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ItemizationWorldSubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ItemizationWorldSubsystem")
	}
	static class UItemizationWorldSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UItemizationWorldSubsystem>();
	}
};
DUMPER7_ASSERTS_UItemizationWorldSubsystem;

// Class ItemizationCoreRuntime.ItemComponentBase
// 0x0000 (0x0028 - 0x0028)
class UItemComponentBase : public UObject
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ItemComponentBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ItemComponentBase")
	}
	static class UItemComponentBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UItemComponentBase>();
	}
};
DUMPER7_ASSERTS_UItemComponentBase;

// Class ItemizationCoreRuntime.ItemComponent_Pickup
// 0x0040 (0x0068 - 0x0028)
class UItemComponent_Pickup final : public UItemComponentBase
{
public:
	TSoftObjectPtr<class USkeletalMesh>           SkeletalMesh;                                      // 0x0028(0x0020)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UStaticMesh>             StaticMesh;                                        // 0x0048(0x0020)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ItemComponent_Pickup")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ItemComponent_Pickup")
	}
	static class UItemComponent_Pickup* GetDefaultObj()
	{
		return GetDefaultObjImpl<UItemComponent_Pickup>();
	}
};
DUMPER7_ASSERTS_UItemComponent_Pickup;

// Class ItemizationCoreRuntime.ItemPickup
// 0x0028 (0x02B8 - 0x0290)
class AItemPickup : public AActor
{
public:
	class UCapsuleComponent*                      TouchCapsule;                                      // 0x0290(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UItemDefinitionBase*                    ItemDefinition;                                    // 0x0298(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, EditConst, RepNotify, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int64                                         Amount;                                            // 0x02A0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USkeletalMeshComponent*                 SkeletalMesh;                                      // 0x02A8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x02B0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnRep_ItemDefinition();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ItemPickup")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ItemPickup")
	}
	static class AItemPickup* GetDefaultObj()
	{
		return GetDefaultObjImpl<AItemPickup>();
	}
};
DUMPER7_ASSERTS_AItemPickup;

// Class ItemizationCoreRuntime.InventoryCollection
// 0x05B0 (0x0840 - 0x0290)
class AInventoryCollection final : public AInfo
{
public:
	TMulticastInlineDelegate<void(class AInventoryCollection* OwningInventory, const EInventoryCollectionLoadState PreviousLoadState, const EInventoryCollectionLoadState NewLoadState)> OnInventoryCollectionLoadStateChanged; // 0x0290(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TArray<class UInventory*>                     InventoryList;                                     // 0x02A0(0x0010)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TMap<struct FGuid, class UInventory*>         InventoryMap;                                      // 0x02B0(0x0050)(ExportObject, Transient, ContainsInstancedReference, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TMap<struct FGuid, struct FGuid>              ItemInventoryMap;                                  // 0x0300(0x0050)(Transient, Protected, NativeAccessSpecifierProtected)
	TMap<struct FGuid, class UItemInstance*>      ItemInstanceMap;                                   // 0x0350(0x0050)(Transient, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	class UItemComponentStorageManager*           ItemComponentStorageManager;                       // 0x03A0(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3A8[0x468];                                    // 0x03A8(0x0468)(Fixing Size After Last Property [ Dumper-7 ])
	EInventoryCollectionType                      InventoryCollectionType;                           // 0x0810(0x0001)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_811[0x27];                                     // 0x0811(0x0027)(Fixing Size After Last Property [ Dumper-7 ])
	EInventoryCollectionLoadState                 InventoryCollectionLoadState;                      // 0x0838(0x0001)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_839[0x7];                                      // 0x0839(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ClientOnItemAbilityCooldownUpdated(class UInventory* Inventory, const struct FGuid& ItemEntryID, const struct FItemAbilityCooldownState& CooldownState);
	void DropItem(const struct FGuid& ItemEntryID, const int64 AmountToDrop);
	void Server_DropItem(const struct FGuid& ItemEntryID, const int64 AmountToDrop);
	void Server_SetEquippableItemActive(const struct FGuid& ItemEntryID);
	void Server_SetEquippableItemInactive(const struct FGuid& ItemEntryID);
	void Server_SetItemSlot(const struct FGuid& OwningInventoryID, const struct FGuid& ItemEntryID, const uint16 SlotNumber, const EVkInventoryMoveBehaviour MoveBehaviour);
	void Server_UseItem(const struct FGuid& ItemId, const struct FGuid& AdditionalItemID);
	void SetEquippableItemActive(const struct FGuid& ItemEntryID);
	void SetEquippableItemInactive(const struct FGuid& ItemEntryID);
	void UseItem(const struct FGuid& ItemId, const struct FGuid& AdditionalItemID);

	bool GetAllInventoriesInCollection(TArray<struct FGuid>* OutInventoryIDList) const;
	bool GetAllItemsInInventory(const struct FGuid& TargetInventoryID, TArray<struct FGuid>* OutItemEntryIDList) const;
	TArray<struct FGuid> GetInventoriesWithInventoryDefinition(const class UInventoryDefinition* InventoryDefinition) const;
	const class UInventoryDefinition* GetInventoryDefinition(const struct FGuid& TargetInventoryID) const;
	TArray<struct FGuid> GetInventoryListInPickupPriorityForItemDefinition(const class UItemDefinitionBase* ItemDefinition) const;
	const class FText GetInventoryName(const struct FGuid& TargetInventoryID) const;
	int64 GetItemAmount(const class UItemDefinitionBase* ItemDefinition) const;
	int64 GetItemAmountFromEntry(const struct FGuid& TargetInventoryID, const struct FGuid& ItemEntryID) const;
	int64 GetItemAmountFromInventory(const class UItemDefinitionBase* ItemDefinition, const struct FGuid& TargetInventoryID) const;
	const class UItemDefinitionBase* GetItemDefinition(const struct FGuid& TargetInventoryID, const struct FGuid& ItemEntryID) const;
	int64 GetItemIntAttribute(const struct FGuid& TargetInventoryID, const struct FGuid& ItemEntryID, const TSubclassOf<class UItemAttribute_Int>& Attribute) const;
	int32 GetItemSlotNumber(const struct FGuid& TargetInventoryID, const struct FGuid& ItemEntryID) const;
	bool IsItemEquipped(const struct FGuid& ItemEntryID) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("InventoryCollection")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"InventoryCollection")
	}
	static class AInventoryCollection* GetDefaultObj()
	{
		return GetDefaultObjImpl<AInventoryCollection>();
	}
};
DUMPER7_ASSERTS_AInventoryCollection;

// Class ItemizationCoreRuntime.Inventory
// 0x04F8 (0x0598 - 0x00A0)
class UInventory : public UActorComponent
{
public:
	class AInventoryCollection*                   OwningInventoryCollection;                         // 0x00A0(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UInventoryDefinition*                   InventoryDefinition;                               // 0x00A8(0x0008)(Net, ZeroConstructor, RepNotify, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGuid                                  InventoryID;                                       // 0x00B0(0x0010)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FItemEntryList                         ItemEntryData;                                     // 0x00C0(0x0308)(Net, RepNotify, Protected, NativeAccessSpecifierProtected)
	uint16                                        InventoryTotalSlotsOverride;                       // 0x03C8(0x0002)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3CA[0x6];                                      // 0x03CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         InventoryMaxStackSizeOverride;                     // 0x03D0(0x0008)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<uint8>                                 InventoryMaxStackSizeOverrideAttributeData;        // 0x03D8(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_3E8[0x1B0];                                    // 0x03E8(0x01B0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnRep_InventoryDefinition();
	void OnRep_InventoryID();
	void OnRep_InventoryMaxStackSizeOverride();
	void OnRep_InventoryTotalSlotsOverride();
	void OnRep_ItemData();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("Inventory")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Inventory")
	}
	static class UInventory* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInventory>();
	}
};
DUMPER7_ASSERTS_UInventory;

// Class ItemizationCoreRuntime.EquippableInventory
// 0x0078 (0x0610 - 0x0598)
class UEquippableInventory final : public UInventory
{
public:
	TArray<struct FGuid>                          EquippedItems;                                     // 0x0598(0x0010)(Net, ZeroConstructor, RepNotify, NativeAccessSpecifierPrivate)
	TArray<struct FGuid>                          PreviouslyEquippedItems;                           // 0x05A8(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	uint8                                         Pad_5B8[0x58];                                     // 0x05B8(0x0058)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnRep_EquippedItems();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EquippableInventory")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EquippableInventory")
	}
	static class UEquippableInventory* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEquippableInventory>();
	}
};
DUMPER7_ASSERTS_UEquippableInventory;

// Class ItemizationCoreRuntime.EquippableInventoryDefinition
// 0x0038 (0x00B0 - 0x0078)
class UEquippableInventoryDefinition : public UInventoryDefinition
{
public:
	TArray<struct FEquipItemRestriction>          EquipRestrictions;                                 // 0x0078(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TArray<struct FEquipItemCondition>            AutoEquipConditions;                               // 0x0088(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TArray<class UInputAction*>                   SlotBindings;                                      // 0x0098(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	bool                                          bShowSlotBindings;                                 // 0x00A8(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EquippableInventoryDefinition")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EquippableInventoryDefinition")
	}
	static class UEquippableInventoryDefinition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEquippableInventoryDefinition>();
	}
};
DUMPER7_ASSERTS_UEquippableInventoryDefinition;

// Class ItemizationCoreRuntime.EquipmentSlot
// 0x0000 (0x00B0 - 0x00B0)
class UEquipmentSlot final : public UEquippableInventoryDefinition
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EquipmentSlot")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EquipmentSlot")
	}
	static class UEquipmentSlot* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEquipmentSlot>();
	}
};
DUMPER7_ASSERTS_UEquipmentSlot;

// Class ItemizationCoreRuntime.ItemInstance
// 0x0018 (0x0040 - 0x0028)
class UItemInstance : public UObject
{
public:
	struct FGuid                                  ItemEntryID;                                       // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_38[0x8];                                       // 0x0038(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ItemInstance")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ItemInstance")
	}
	static class UItemInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UItemInstance>();
	}
};
DUMPER7_ASSERTS_UItemInstance;

// Class ItemizationCoreRuntime.EquipmentHotBar
// 0x0000 (0x00B0 - 0x00B0)
class UEquipmentHotBar final : public UEquippableInventoryDefinition
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EquipmentHotBar")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EquipmentHotBar")
	}
	static class UEquipmentHotBar* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEquipmentHotBar>();
	}
};
DUMPER7_ASSERTS_UEquipmentHotBar;

// Class ItemizationCoreRuntime.InventoryCheatManager
// 0x0000 (0x0028 - 0x0028)
class UInventoryCheatManager final : public UCheatManagerExtension
{
public:
	void InventoryAddToItem(int32 InventoryIndex, int32 ItemIndex, int64 AmountToAdd);
	void InventoryDropItem(int32 InventoryIndex, int32 ItemIndex, int64 AmountToDrop);
	void InventoryMoveAmountOfItem(int32 SourceInventoryIndex, int32 ItemIndex, int32 TargetInventoryIndex, int64 AmountToMove);
	void InventoryMoveItem(int32 SourceInventoryIndex, int32 ItemIndex, int32 TargetInventoryIndex);
	void InventoryRemoveFromItem(int32 InventoryIndex, int32 ItemIndex, int64 AmountToRemove);
	void InventorySetEquippedItemActive(int32 InventoryIndex, int32 ItemIndex, bool bActive);
	void InventorySetItemSlot(int32 InventoryIndex, int32 ItemIndex, uint16 NewSlotIndex);
	void InventoryUseItem(int32 InventoryIndex, int32 ItemIndex);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("InventoryCheatManager")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"InventoryCheatManager")
	}
	static class UInventoryCheatManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInventoryCheatManager>();
	}
};
DUMPER7_ASSERTS_UInventoryCheatManager;

// Class ItemizationCoreRuntime.InventorySetupData
// 0x00A8 (0x00D8 - 0x0030)
class UInventorySetupData final : public UDataAsset
{
public:
	TArray<TSoftObjectPtr<class UEquippableInventoryDefinition>> EquipmentSetups;                    // 0x0030(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<TSoftObjectPtr<class UInventoryDefinition>> InventoryDefinitions;                         // 0x0040(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<TSoftObjectPtr<class UItemDefinition>> StartingItems;                                     // 0x0050(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UInputMappingContext>    InputMappingContext;                               // 0x0060(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UClass>                   InventoryUIWidgetClass;                            // 0x0080(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UClass>                   InventoryHUDUIWidgetClass;                         // 0x00A0(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   DisplayName;                                       // 0x00C0(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("InventorySetupData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"InventorySetupData")
	}
	static class UInventorySetupData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInventorySetupData>();
	}
};
DUMPER7_ASSERTS_UInventorySetupData;

// Class ItemizationCoreRuntime.ItemDefinitionBase
// 0x00B0 (0x00E0 - 0x0030)
class UItemDefinitionBase : public UMcpItemDefinitionBase
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   ItemName;                                          // 0x0038(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	class FText                                   ItemDescription;                                   // 0x0050(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	class FText                                   ItemShortDescription;                              // 0x0068(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FItemComponentContainer                ComponentContainer;                                // 0x0080(0x0010)(Edit, DisableEditOnInstance, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_90[0x50];                                      // 0x0090(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class FText GetDisplayName() const;
	const class UItemComponentBase* GetItemComponentByClass(const TSubclassOf<class UItemComponentBase> ItemComponentClass) const;
	class FText GetItemDescription() const;
	class FText GetItemShortDescription() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ItemDefinitionBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ItemDefinitionBase")
	}
	static class UItemDefinitionBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UItemDefinitionBase>();
	}
};
DUMPER7_ASSERTS_UItemDefinitionBase;

// Class ItemizationCoreRuntime.ItemDefinition
// 0x00B0 (0x0190 - 0x00E0)
class UItemDefinition final : public UItemDefinitionBase
{
public:
	uint8                                         Pad_E0[0xA8];                                      // 0x00E0(0x00A8)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ModifiedComponentIdx;                              // 0x0188(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_18C[0x4];                                      // 0x018C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ItemDefinition")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ItemDefinition")
	}
	static class UItemDefinition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UItemDefinition>();
	}
};
DUMPER7_ASSERTS_UItemDefinition;

// Class ItemizationCoreRuntime.ItemAbilityConfigurationAsset
// 0x0008 (0x0038 - 0x0030)
class UItemAbilityConfigurationAsset final : public UPrimaryDataAsset
{
public:
	TSubclassOf<class UGameplayAbility>           GameplayAbilityClass;                              // 0x0030(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	void Construct(class UGameplayAbility* Ability) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ItemAbilityConfigurationAsset")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ItemAbilityConfigurationAsset")
	}
	static class UItemAbilityConfigurationAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UItemAbilityConfigurationAsset>();
	}
};
DUMPER7_ASSERTS_UItemAbilityConfigurationAsset;

// Class ItemizationCoreRuntime.ItemAbilityCost
// 0x0000 (0x0028 - 0x0028)
class UItemAbilityCost : public UObject
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ItemAbilityCost")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ItemAbilityCost")
	}
	static class UItemAbilityCost* GetDefaultObj()
	{
		return GetDefaultObjImpl<UItemAbilityCost>();
	}
};
DUMPER7_ASSERTS_UItemAbilityCost;

// Class ItemizationCoreRuntime.ItemAbilityCostItem
// 0x0028 (0x0050 - 0x0028)
class UItemAbilityCostItem final : public UItemAbilityCost
{
public:
	TSoftObjectPtr<class UItemDefinitionBase>     ItemDefinition;                                    // 0x0028(0x0020)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         NumConsumed;                                       // 0x0048(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ItemAbilityCostItem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ItemAbilityCostItem")
	}
	static class UItemAbilityCostItem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UItemAbilityCostItem>();
	}
};
DUMPER7_ASSERTS_UItemAbilityCostItem;

// Class ItemizationCoreRuntime.ItemAbilityCostAttribute
// 0x0018 (0x0040 - 0x0028)
class UItemAbilityCostAttribute final : public UItemAbilityCost
{
public:
	TSubclassOf<class UItemAttribute_Int>         Attribute;                                         // 0x0028(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         MinValue;                                          // 0x0030(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         Change;                                            // 0x0038(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ItemAbilityCostAttribute")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ItemAbilityCostAttribute")
	}
	static class UItemAbilityCostAttribute* GetDefaultObj()
	{
		return GetDefaultObjImpl<UItemAbilityCostAttribute>();
	}
};
DUMPER7_ASSERTS_UItemAbilityCostAttribute;

// Class ItemizationCoreRuntime.ItemizationFunctionLibrary
// 0x0000 (0x0028 - 0x0028)
class UItemizationFunctionLibrary final : public UBlueprintFunctionLibrary
{
public:
	static class FString DescribeInventoryID(const struct FGuid& InventoryID);
	static class FString DescribeItemEntryID(const struct FGuid& ItemEntryID);
	static TArray<TSubclassOf<class UItemAttribute>> GetItemDataAttributeList(const struct FItemAggregatedData& ItemData);
	static bool GetItemDataBoolAttributeValue(const struct FItemAggregatedData& ItemData, const TSubclassOf<class UItemAttribute_Bool> AttributeClass);
	static double GetItemDataDecimalAttributeValue(const struct FItemAggregatedData& ItemData, const TSubclassOf<class UItemAttribute_Decimal> AttributeClass);
	static const class UItemDefinitionBase* GetItemDataDefinition(const struct FItemAggregatedData& ItemData);
	static int64 GetItemDataIntAttributeValue(const struct FItemAggregatedData& ItemData, const TSubclassOf<class UItemAttribute_Int> AttributeClass);
	static struct FGuid GetItemDataItemEntryID(const struct FItemAggregatedData& ItemData);
	static int32 GetItemDataSlot(const struct FItemAggregatedData& ItemData);
	static class FString GetItemDataStringAttributeValue(const struct FItemAggregatedData& ItemData, const TSubclassOf<class UItemAttribute_String> AttributeClass);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ItemizationFunctionLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ItemizationFunctionLibrary")
	}
	static class UItemizationFunctionLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UItemizationFunctionLibrary>();
	}
};
DUMPER7_ASSERTS_UItemizationFunctionLibrary;

// Class ItemizationCoreRuntime.ItemAbilityCooldown
// 0x0008 (0x0030 - 0x0028)
class UItemAbilityCooldown : public UObject
{
public:
	bool                                          bApplyOnStart;                                     // 0x0028(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ItemAbilityCooldown")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ItemAbilityCooldown")
	}
	static class UItemAbilityCooldown* GetDefaultObj()
	{
		return GetDefaultObjImpl<UItemAbilityCooldown>();
	}
};
DUMPER7_ASSERTS_UItemAbilityCooldown;

// Class ItemizationCoreRuntime.ItemAbilityCooldownTime
// 0x0008 (0x0038 - 0x0030)
class UItemAbilityCooldownTime final : public UItemAbilityCooldown
{
public:
	float                                         CooldownTime;                                      // 0x0030(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ItemAbilityCooldownTime")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ItemAbilityCooldownTime")
	}
	static class UItemAbilityCooldownTime* GetDefaultObj()
	{
		return GetDefaultObjImpl<UItemAbilityCooldownTime>();
	}
};
DUMPER7_ASSERTS_UItemAbilityCooldownTime;

// Class ItemizationCoreRuntime.ItemAbilityCooldownVelocityBased
// 0x0010 (0x0040 - 0x0030)
class UItemAbilityCooldownVelocityBased final : public UItemAbilityCooldown
{
public:
	float                                         CooldownTimeIfStationary;                          // 0x0030(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CooldownTimeScaleFactorIfMoving;                   // 0x0034(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          CooldownTimeIsResetToZeroWhenMoving;               // 0x0038(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ItemAbilityCooldownVelocityBased")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ItemAbilityCooldownVelocityBased")
	}
	static class UItemAbilityCooldownVelocityBased* GetDefaultObj()
	{
		return GetDefaultObjImpl<UItemAbilityCooldownVelocityBased>();
	}
};
DUMPER7_ASSERTS_UItemAbilityCooldownVelocityBased;

// Class ItemizationCoreRuntime.ItemAttachment
// 0x0018 (0x02A8 - 0x0290)
class AItemAttachment final : public AActor
{
public:
	class UMeshComponent*                         Mesh;                                              // 0x0290(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UItemAttachmentDefinition*              AttachmentData;                                    // 0x0298(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2A0[0x8];                                      // 0x02A0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ItemAttachment")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ItemAttachment")
	}
	static class AItemAttachment* GetDefaultObj()
	{
		return GetDefaultObjImpl<AItemAttachment>();
	}
};
DUMPER7_ASSERTS_AItemAttachment;

// Class ItemizationCoreRuntime.ItemAttribute
// 0x0048 (0x0070 - 0x0028)
class UItemAttribute : public UObject
{
public:
	class FText                                   AttributeName;                                     // 0x0028(0x0018)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	class FText                                   AttributeDescription;                              // 0x0040(0x0018)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TArray<uint8>                                 DefaultValueAsData;                                // 0x0058(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	EItemAttributeType                            AttributeType;                                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bUsesCustomSerializer;                             // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_6A[0x6];                                       // 0x006A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class FText GetAttributeDescription() const;
	class FText GetAttributeName() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ItemAttribute")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ItemAttribute")
	}
	static class UItemAttribute* GetDefaultObj()
	{
		return GetDefaultObjImpl<UItemAttribute>();
	}
};
DUMPER7_ASSERTS_UItemAttribute;

// Class ItemizationCoreRuntime.ItemAttribute_Int
// 0x0010 (0x0080 - 0x0070)
class UItemAttribute_Int : public UItemAttribute
{
public:
	int64                                         DefaultValue;                                      // 0x0070(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EAttributeCombineLogic_Math                   CombineLogic;                                      // 0x0078(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ItemAttribute_Int")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ItemAttribute_Int")
	}
	static class UItemAttribute_Int* GetDefaultObj()
	{
		return GetDefaultObjImpl<UItemAttribute_Int>();
	}
};
DUMPER7_ASSERTS_UItemAttribute_Int;

// Class ItemizationCoreRuntime.ItemAttribute_Decimal
// 0x0010 (0x0080 - 0x0070)
class UItemAttribute_Decimal : public UItemAttribute
{
public:
	double                                        DefaultValue;                                      // 0x0070(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EAttributeCombineLogic_Math                   CombineLogic;                                      // 0x0078(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ItemAttribute_Decimal")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ItemAttribute_Decimal")
	}
	static class UItemAttribute_Decimal* GetDefaultObj()
	{
		return GetDefaultObjImpl<UItemAttribute_Decimal>();
	}
};
DUMPER7_ASSERTS_UItemAttribute_Decimal;

// Class ItemizationCoreRuntime.ItemAttribute_Bool
// 0x0008 (0x0078 - 0x0070)
class UItemAttribute_Bool : public UItemAttribute
{
public:
	bool                                          DefaultValue;                                      // 0x0070(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ItemAttribute_Bool")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ItemAttribute_Bool")
	}
	static class UItemAttribute_Bool* GetDefaultObj()
	{
		return GetDefaultObjImpl<UItemAttribute_Bool>();
	}
};
DUMPER7_ASSERTS_UItemAttribute_Bool;

// Class ItemizationCoreRuntime.ItemAttribute_String
// 0x0010 (0x0080 - 0x0070)
class UItemAttribute_String : public UItemAttribute
{
public:
	class FString                                 DefaultValue;                                      // 0x0070(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ItemAttribute_String")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ItemAttribute_String")
	}
	static class UItemAttribute_String* GetDefaultObj()
	{
		return GetDefaultObjImpl<UItemAttribute_String>();
	}
};
DUMPER7_ASSERTS_UItemAttribute_String;

// Class ItemizationCoreRuntime.ItemAttribute_Int_Test
// 0x0000 (0x0080 - 0x0080)
class UItemAttribute_Int_Test final : public UItemAttribute_Int
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ItemAttribute_Int_Test")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ItemAttribute_Int_Test")
	}
	static class UItemAttribute_Int_Test* GetDefaultObj()
	{
		return GetDefaultObjImpl<UItemAttribute_Int_Test>();
	}
};
DUMPER7_ASSERTS_UItemAttribute_Int_Test;

// Class ItemizationCoreRuntime.ItemAttribute_Decimal_Test
// 0x0000 (0x0080 - 0x0080)
class UItemAttribute_Decimal_Test final : public UItemAttribute_Decimal
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ItemAttribute_Decimal_Test")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ItemAttribute_Decimal_Test")
	}
	static class UItemAttribute_Decimal_Test* GetDefaultObj()
	{
		return GetDefaultObjImpl<UItemAttribute_Decimal_Test>();
	}
};
DUMPER7_ASSERTS_UItemAttribute_Decimal_Test;

// Class ItemizationCoreRuntime.ItemAttribute_Bool_Test
// 0x0000 (0x0078 - 0x0078)
class UItemAttribute_Bool_Test final : public UItemAttribute_Bool
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ItemAttribute_Bool_Test")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ItemAttribute_Bool_Test")
	}
	static class UItemAttribute_Bool_Test* GetDefaultObj()
	{
		return GetDefaultObjImpl<UItemAttribute_Bool_Test>();
	}
};
DUMPER7_ASSERTS_UItemAttribute_Bool_Test;

// Class ItemizationCoreRuntime.ItemAttribute_String_Test
// 0x0000 (0x0080 - 0x0080)
class UItemAttribute_String_Test final : public UItemAttribute_String
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ItemAttribute_String_Test")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ItemAttribute_String_Test")
	}
	static class UItemAttribute_String_Test* GetDefaultObj()
	{
		return GetDefaultObjImpl<UItemAttribute_String_Test>();
	}
};
DUMPER7_ASSERTS_UItemAttribute_String_Test;

// Class ItemizationCoreRuntime.ItemAttributeValueBase
// 0x0018 (0x0040 - 0x0028)
class UItemAttributeValueBase : public UObject
{
public:
	struct FGuid                                  QueriedItemEntryID;                                // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class AInventoryCollection>    QueriedInventoryCollection;                        // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ItemAttributeValueBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ItemAttributeValueBase")
	}
	static class UItemAttributeValueBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UItemAttributeValueBase>();
	}
};
DUMPER7_ASSERTS_UItemAttributeValueBase;

// Class ItemizationCoreRuntime.ItemAttributeValue_Int
// 0x0000 (0x0040 - 0x0040)
class UItemAttributeValue_Int : public UItemAttributeValueBase
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ItemAttributeValue_Int")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ItemAttributeValue_Int")
	}
	static class UItemAttributeValue_Int* GetDefaultObj()
	{
		return GetDefaultObjImpl<UItemAttributeValue_Int>();
	}
};
DUMPER7_ASSERTS_UItemAttributeValue_Int;

// Class ItemizationCoreRuntime.ItemAttributeValue_Decimal
// 0x0000 (0x0040 - 0x0040)
class UItemAttributeValue_Decimal : public UItemAttributeValueBase
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ItemAttributeValue_Decimal")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ItemAttributeValue_Decimal")
	}
	static class UItemAttributeValue_Decimal* GetDefaultObj()
	{
		return GetDefaultObjImpl<UItemAttributeValue_Decimal>();
	}
};
DUMPER7_ASSERTS_UItemAttributeValue_Decimal;

// Class ItemizationCoreRuntime.ItemAttributeValue_Bool
// 0x0000 (0x0040 - 0x0040)
class UItemAttributeValue_Bool : public UItemAttributeValueBase
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ItemAttributeValue_Bool")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ItemAttributeValue_Bool")
	}
	static class UItemAttributeValue_Bool* GetDefaultObj()
	{
		return GetDefaultObjImpl<UItemAttributeValue_Bool>();
	}
};
DUMPER7_ASSERTS_UItemAttributeValue_Bool;

// Class ItemizationCoreRuntime.ItemAttributeValue_String
// 0x0000 (0x0040 - 0x0040)
class UItemAttributeValue_String : public UItemAttributeValueBase
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ItemAttributeValue_String")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ItemAttributeValue_String")
	}
	static class UItemAttributeValue_String* GetDefaultObj()
	{
		return GetDefaultObjImpl<UItemAttributeValue_String>();
	}
};
DUMPER7_ASSERTS_UItemAttributeValue_String;

// Class ItemizationCoreRuntime.ItemComponentStorageManager
// 0x00A0 (0x00C8 - 0x0028)
class UItemComponentStorageManager final : public UObject
{
public:
	TMap<class UClass*, struct FItemEntryStorageMap> ClassIndividualStorageMap;                      // 0x0028(0x0050)(Transient, NativeAccessSpecifierPrivate)
	TMap<class UClass*, class UItemComponentSharedLocalStorage*> ClassSharedStorageMap;              // 0x0078(0x0050)(Transient, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ItemComponentStorageManager")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ItemComponentStorageManager")
	}
	static class UItemComponentStorageManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UItemComponentStorageManager>();
	}
};
DUMPER7_ASSERTS_UItemComponentStorageManager;

// Class ItemizationCoreRuntime.ItemComponentLocalStorage
// 0x0010 (0x0038 - 0x0028)
class UItemComponentLocalStorage : public UObject
{
public:
	uint8                                         Pad_28[0x10];                                      // 0x0028(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ItemComponentLocalStorage")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ItemComponentLocalStorage")
	}
	static class UItemComponentLocalStorage* GetDefaultObj()
	{
		return GetDefaultObjImpl<UItemComponentLocalStorage>();
	}
};
DUMPER7_ASSERTS_UItemComponentLocalStorage;

// Class ItemizationCoreRuntime.ItemComponentSharedLocalStorage
// 0x0000 (0x0028 - 0x0028)
class UItemComponentSharedLocalStorage : public UObject
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ItemComponentSharedLocalStorage")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ItemComponentSharedLocalStorage")
	}
	static class UItemComponentSharedLocalStorage* GetDefaultObj()
	{
		return GetDefaultObjImpl<UItemComponentSharedLocalStorage>();
	}
};
DUMPER7_ASSERTS_UItemComponentSharedLocalStorage;

// Class ItemizationCoreRuntime.ItemComponent_Ability
// 0x0010 (0x0038 - 0x0028)
class UItemComponent_Ability final : public UItemComponentBase
{
public:
	TArray<struct FItemAbilityBinding>            AbilityList;                                       // 0x0028(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, ContainsInstancedReference, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ItemComponent_Ability")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ItemComponent_Ability")
	}
	static class UItemComponent_Ability* GetDefaultObj()
	{
		return GetDefaultObjImpl<UItemComponent_Ability>();
	}
};
DUMPER7_ASSERTS_UItemComponent_Ability;

// Class ItemizationCoreRuntime.ItemComponentStorage_Ability
// 0x0028 (0x0060 - 0x0038)
class UItemComponentStorage_Ability final : public UItemComponentLocalStorage
{
public:
	TArray<bool>                                  AbilityIsAvailableList;                            // 0x0038(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	class UItemComponent_Ability*                 SourceData;                                        // 0x0048(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAbilitySystemComponent*                AbilitySystemComponent;                            // 0x0050(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_58[0x8];                                       // 0x0058(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ItemComponentStorage_Ability")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ItemComponentStorage_Ability")
	}
	static class UItemComponentStorage_Ability* GetDefaultObj()
	{
		return GetDefaultObjImpl<UItemComponentStorage_Ability>();
	}
};
DUMPER7_ASSERTS_UItemComponentStorage_Ability;

// Class ItemizationCoreRuntime.ItemComponentStorage_AbilityShared
// 0x0050 (0x0078 - 0x0028)
class UItemComponentStorage_AbilityShared final : public UItemComponentSharedLocalStorage
{
public:
	TMap<uint32, struct FItemAbilityRuntimeData>  RefCountedAbilityRuntimeData;                      // 0x0028(0x0050)(NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ItemComponentStorage_AbilityShared")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ItemComponentStorage_AbilityShared")
	}
	static class UItemComponentStorage_AbilityShared* GetDefaultObj()
	{
		return GetDefaultObjImpl<UItemComponentStorage_AbilityShared>();
	}
};
DUMPER7_ASSERTS_UItemComponentStorage_AbilityShared;

// Class ItemizationCoreRuntime.ItemAttachmentDefinition
// 0x0008 (0x0030 - 0x0028)
class UItemAttachmentDefinition : public UObject
{
public:
	EItemStateFilter                              AttachmentVisibility;                              // 0x0028(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ItemAttachmentDefinition")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ItemAttachmentDefinition")
	}
	static class UItemAttachmentDefinition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UItemAttachmentDefinition>();
	}
};
DUMPER7_ASSERTS_UItemAttachmentDefinition;

// Class ItemizationCoreRuntime.ItemMeshAttachmentDefinition
// 0x0050 (0x0080 - 0x0030)
class UItemMeshAttachmentDefinition : public UItemAttachmentDefinition
{
public:
	class FName                                   AttachToSocketName;                                // 0x0030(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                OffsetLocation;                                    // 0x0038(0x0018)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               OffsetRotation;                                    // 0x0050(0x0018)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                MeshScale;                                         // 0x0068(0x0018)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ItemMeshAttachmentDefinition")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ItemMeshAttachmentDefinition")
	}
	static class UItemMeshAttachmentDefinition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UItemMeshAttachmentDefinition>();
	}
};
DUMPER7_ASSERTS_UItemMeshAttachmentDefinition;

// Class ItemizationCoreRuntime.ItemInputAction
// 0x0000 (0x0080 - 0x0080)
class UItemInputAction final : public UInputAction
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ItemInputAction")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ItemInputAction")
	}
	static class UItemInputAction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UItemInputAction>();
	}
};
DUMPER7_ASSERTS_UItemInputAction;

// Class ItemizationCoreRuntime.ItemStaticMeshAttachmentDefinition
// 0x0020 (0x00A0 - 0x0080)
class UItemStaticMeshAttachmentDefinition final : public UItemMeshAttachmentDefinition
{
public:
	TSoftObjectPtr<class UStaticMesh>             Mesh;                                              // 0x0080(0x0020)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ItemStaticMeshAttachmentDefinition")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ItemStaticMeshAttachmentDefinition")
	}
	static class UItemStaticMeshAttachmentDefinition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UItemStaticMeshAttachmentDefinition>();
	}
};
DUMPER7_ASSERTS_UItemStaticMeshAttachmentDefinition;

// Class ItemizationCoreRuntime.ItemSkeletalMeshAttachmentDefinition
// 0x0040 (0x00C0 - 0x0080)
class UItemSkeletalMeshAttachmentDefinition final : public UItemMeshAttachmentDefinition
{
public:
	TSoftObjectPtr<class USkeletalMesh>           Mesh;                                              // 0x0080(0x0020)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UAnimSequence>           Animation;                                         // 0x00A0(0x0020)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ItemSkeletalMeshAttachmentDefinition")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ItemSkeletalMeshAttachmentDefinition")
	}
	static class UItemSkeletalMeshAttachmentDefinition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UItemSkeletalMeshAttachmentDefinition>();
	}
};
DUMPER7_ASSERTS_UItemSkeletalMeshAttachmentDefinition;

// Class ItemizationCoreRuntime.ItemComponent_Attach
// 0x0010 (0x0038 - 0x0028)
class UItemComponent_Attach final : public UItemComponentBase
{
public:
	TArray<class UItemAttachmentDefinition*>      Attachments;                                       // 0x0028(0x0010)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, ContainsInstancedReference, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ItemComponent_Attach")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ItemComponent_Attach")
	}
	static class UItemComponent_Attach* GetDefaultObj()
	{
		return GetDefaultObjImpl<UItemComponent_Attach>();
	}
};
DUMPER7_ASSERTS_UItemComponent_Attach;

// Class ItemizationCoreRuntime.ItemComponentStorage_Attach
// 0x0020 (0x0058 - 0x0038)
class UItemComponentStorage_Attach final : public UItemComponentLocalStorage
{
public:
	TArray<TWeakObjectPtr<class AItemAttachment>> ActorAttachments;                                  // 0x0038(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	uint8                                         Pad_48[0x10];                                      // 0x0048(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnOwnerTransformUpdated(float DeltaSeconds, const struct FVector& OldLocation, const struct FVector& OldVelocity);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ItemComponentStorage_Attach")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ItemComponentStorage_Attach")
	}
	static class UItemComponentStorage_Attach* GetDefaultObj()
	{
		return GetDefaultObjImpl<UItemComponentStorage_Attach>();
	}
};
DUMPER7_ASSERTS_UItemComponentStorage_Attach;

// Class ItemizationCoreRuntime.ItemizationPersistenceManagerBase
// 0x0000 (0x0028 - 0x0028)
class UItemizationPersistenceManagerBase final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ItemizationPersistenceManagerBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ItemizationPersistenceManagerBase")
	}
	static class UItemizationPersistenceManagerBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UItemizationPersistenceManagerBase>();
	}
};
DUMPER7_ASSERTS_UItemizationPersistenceManagerBase;

// Class ItemizationCoreRuntime.ItemAttribute_WasLoadedFromSave
// 0x0000 (0x0078 - 0x0078)
class UItemAttribute_WasLoadedFromSave final : public UItemAttribute_Bool
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ItemAttribute_WasLoadedFromSave")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ItemAttribute_WasLoadedFromSave")
	}
	static class UItemAttribute_WasLoadedFromSave* GetDefaultObj()
	{
		return GetDefaultObjImpl<UItemAttribute_WasLoadedFromSave>();
	}
};
DUMPER7_ASSERTS_UItemAttribute_WasLoadedFromSave;

// Class ItemizationCoreRuntime.ItemComponent_Core
// 0x0020 (0x0048 - 0x0028)
class UItemComponent_Core final : public UItemComponentBase
{
public:
