#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ItemCostWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ItemCostWidget.ItemCostWidget_C
// 0x0038 (0x02F8 - 0x02C0)
class UItemCostWidget_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                RarityBorder;                                      // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         ResourceWidgetsContainer;                          // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UResourceCountWidget_C*>         ResourceWidgets;                                   // 0x02D8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class UMaterialInstanceDynamic*               RarityMID;                                         // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          ShowRarityData;                                    // 0x02F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bUseBackgroundForAffordabilityFeedback;            // 0x02F1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UpdateResource(const TMap<EFortResourceType, int32>& Costs, class UResourceCountWidget_C* ResourceWidget);
	void SetRarityData(const struct FFortRarityItemData& RarityData);
	void SetItemCost(class AActor* Actor, class UClass* SpecifiedItemCostComponent);
	void PreConstruct(bool IsDesignTime);
	void PopulateWidgets();
	void GetValidatedCost(const TMap<EFortResourceType, int32>& Costs, const EFortResourceType& Resource, bool* CostIsValid, int32* Cost);
	void FindWidget(EFortResourceType Resource, class UResourceCountWidget_C** Widget);
	void ExecuteUbergraph_ItemCostWidget(int32 EntryPoint);
	void AreCostsValid(const TMap<EFortResourceType, int32>& Costs, bool* CostsAreValid);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ItemCostWidget_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ItemCostWidget_C")
	}
	static class UItemCostWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UItemCostWidget_C>();
	}
};
DUMPER7_ASSERTS_UItemCostWidget_C;

}

