#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ItemizationCoreUI

#include "Basic.hpp"

#include "ItemizationCoreRuntime_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function ItemizationCoreUI.InventoryCollectionViewModel.InitializeViewModel
// 0x0008 (0x0008 - 0x0000)
struct InventoryCollectionViewModel_InitializeViewModel final
{
public:
	class UObject*                                InitializingObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InventoryCollectionViewModel_InitializeViewModel;

// Function ItemizationCoreUI.InventoryCollectionViewModel.UnbindInventoryCollection
// 0x0001 (0x0001 - 0x0000)
struct InventoryCollectionViewModel_UnbindInventoryCollection final
{
public:
	bool                                          bUnusedParam;                                      // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InventoryCollectionViewModel_UnbindInventoryCollection;

// Function ItemizationCoreUI.InventoryItemEntryViewModel.DropAll
// 0x0001 (0x0001 - 0x0000)
struct InventoryItemEntryViewModel_DropAll final
{
public:
	bool                                          bUnused;                                           // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InventoryItemEntryViewModel_DropAll;

// Function ItemizationCoreUI.InventoryItemEntryViewModel.DropAmount
// 0x0008 (0x0008 - 0x0000)
struct InventoryItemEntryViewModel_DropAmount final
{
public:
	int64                                         Amount;                                            // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InventoryItemEntryViewModel_DropAmount;

// Function ItemizationCoreUI.InventoryItemEntryViewModel.DropHalf
// 0x0001 (0x0001 - 0x0000)
struct InventoryItemEntryViewModel_DropHalf final
{
public:
	bool                                          bUnused;                                           // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InventoryItemEntryViewModel_DropHalf;

// Function ItemizationCoreUI.InventoryItemEntryViewModel.SetEquippableItemActive
// 0x0001 (0x0001 - 0x0000)
struct InventoryItemEntryViewModel_SetEquippableItemActive final
{
public:
	bool                                          bActive;                                           // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InventoryItemEntryViewModel_SetEquippableItemActive;

// Function ItemizationCoreUI.InventoryItemEntryViewModel.SetItemSlotNumber
// 0x0004 (0x0004 - 0x0000)
struct InventoryItemEntryViewModel_SetItemSlotNumber final
{
public:
	int32                                         SlotNumber;                                        // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InventoryItemEntryViewModel_SetItemSlotNumber;

// Function ItemizationCoreUI.InventoryItemEntryViewModel.ToggleEquippableItemActive
// 0x0001 (0x0001 - 0x0000)
struct InventoryItemEntryViewModel_ToggleEquippableItemActive final
{
public:
	bool                                          bUnused;                                           // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InventoryItemEntryViewModel_ToggleEquippableItemActive;

// Function ItemizationCoreUI.InventoryItemEntryViewModel.UpdateCanSwap
// 0x0008 (0x0008 - 0x0000)
struct InventoryItemEntryViewModel_UpdateCanSwap final
{
public:
	const class UInventoryItemEntryViewModel*     SwapInventoryItemEntryViewModel;                   // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InventoryItemEntryViewModel_UpdateCanSwap;

// Function ItemizationCoreUI.InventoryItemEntryViewModel.UseItem
// 0x0001 (0x0001 - 0x0000)
struct InventoryItemEntryViewModel_UseItem final
{
public:
	bool                                          bUnused;                                           // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InventoryItemEntryViewModel_UseItem;

// Function ItemizationCoreUI.InventoryItemEntryViewModel.CanItemBeMadeActive
// 0x0001 (0x0001 - 0x0000)
struct InventoryItemEntryViewModel_CanItemBeMadeActive final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InventoryItemEntryViewModel_CanItemBeMadeActive;

// Function ItemizationCoreUI.InventoryItemEntryViewModel.CanItemBeMadeInactive
// 0x0001 (0x0001 - 0x0000)
struct InventoryItemEntryViewModel_CanItemBeMadeInactive final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InventoryItemEntryViewModel_CanItemBeMadeInactive;

// Function ItemizationCoreUI.InventoryItemEntryViewModel.GetEquipSlotInputAction
// 0x0008 (0x0008 - 0x0000)
struct InventoryItemEntryViewModel_GetEquipSlotInputAction final
{
public:
	class UInputAction*                           ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InventoryItemEntryViewModel_GetEquipSlotInputAction;

// Function ItemizationCoreUI.InventoryItemEntryViewModel.GetInventoryID
// 0x0010 (0x0010 - 0x0000)
struct InventoryItemEntryViewModel_GetInventoryID final
{
public:
	struct FGuid                                  ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InventoryItemEntryViewModel_GetInventoryID;

// Function ItemizationCoreUI.InventoryItemEntryViewModel.GetItemAmount
// 0x0008 (0x0008 - 0x0000)
struct InventoryItemEntryViewModel_GetItemAmount final
{
public:
	int64                                         ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InventoryItemEntryViewModel_GetItemAmount;

// Function ItemizationCoreUI.InventoryItemEntryViewModel.GetItemDefinition
// 0x0008 (0x0008 - 0x0000)
struct InventoryItemEntryViewModel_GetItemDefinition final
{
public:
	const class UItemDefinitionBase*              ReturnValue;                                       // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InventoryItemEntryViewModel_GetItemDefinition;

// Function ItemizationCoreUI.InventoryItemEntryViewModel.GetItemDescription
// 0x0018 (0x0018 - 0x0000)
struct InventoryItemEntryViewModel_GetItemDescription final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InventoryItemEntryViewModel_GetItemDescription;

// Function ItemizationCoreUI.InventoryItemEntryViewModel.GetItemEntryID
// 0x0010 (0x0010 - 0x0000)
struct InventoryItemEntryViewModel_GetItemEntryID final
{
public:
	struct FGuid                                  ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InventoryItemEntryViewModel_GetItemEntryID;

// Function ItemizationCoreUI.InventoryItemEntryViewModel.GetItemIcon
// 0x0008 (0x0008 - 0x0000)
struct InventoryItemEntryViewModel_GetItemIcon final
{
public:
	class UTexture2D*                             ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InventoryItemEntryViewModel_GetItemIcon;

// Function ItemizationCoreUI.InventoryItemEntryViewModel.GetItemIconDisplayTextType
// 0x0001 (0x0001 - 0x0000)
struct InventoryItemEntryViewModel_GetItemIconDisplayTextType final
{
public:
	EItemIconDisplayTextType                      ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InventoryItemEntryViewModel_GetItemIconDisplayTextType;

// Function ItemizationCoreUI.InventoryItemEntryViewModel.GetItemName
// 0x0018 (0x0018 - 0x0000)
struct InventoryItemEntryViewModel_GetItemName final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InventoryItemEntryViewModel_GetItemName;

// Function ItemizationCoreUI.InventoryItemEntryViewModel.GetItemPrimaryAmmoCount
// 0x0008 (0x0008 - 0x0000)
struct InventoryItemEntryViewModel_GetItemPrimaryAmmoCount final
{
public:
	int64                                         ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InventoryItemEntryViewModel_GetItemPrimaryAmmoCount;

// Function ItemizationCoreUI.InventoryItemEntryViewModel.GetItemRarity
// 0x0008 (0x0008 - 0x0000)
struct InventoryItemEntryViewModel_GetItemRarity final
{
public:
	const class UItemRarity*                      ReturnValue;                                       // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InventoryItemEntryViewModel_GetItemRarity;

// Function ItemizationCoreUI.InventoryItemEntryViewModel.GetItemSlotNumber
// 0x0004 (0x0004 - 0x0000)
struct InventoryItemEntryViewModel_GetItemSlotNumber final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InventoryItemEntryViewModel_GetItemSlotNumber;

// Function ItemizationCoreUI.InventoryItemEntryViewModel.GetItemType
// 0x0008 (0x0008 - 0x0000)
struct InventoryItemEntryViewModel_GetItemType final
{
public:
	const class UItemType*                        ReturnValue;                                       // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InventoryItemEntryViewModel_GetItemType;

// Function ItemizationCoreUI.InventoryItemEntryViewModel.GetSmallItemIcon
// 0x0008 (0x0008 - 0x0000)
struct InventoryItemEntryViewModel_GetSmallItemIcon final
{
public:
	class UTexture2D*                             ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InventoryItemEntryViewModel_GetSmallItemIcon;

// Function ItemizationCoreUI.InventoryItemEntryViewModel.GetSoftItemIcon
// 0x0020 (0x0020 - 0x0000)
struct InventoryItemEntryViewModel_GetSoftItemIcon final
{
public:
	TSoftObjectPtr<class UTexture2D>              ReturnValue;                                       // 0x0000(0x0020)(Parm, OutParm, ReturnParm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InventoryItemEntryViewModel_GetSoftItemIcon;

// Function ItemizationCoreUI.InventoryItemEntryViewModel.GetSoftSmallItemIcon
// 0x0020 (0x0020 - 0x0000)
struct InventoryItemEntryViewModel_GetSoftSmallItemIcon final
{
public:
	TSoftObjectPtr<class UTexture2D>              ReturnValue;                                       // 0x0000(0x0020)(Parm, OutParm, ReturnParm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InventoryItemEntryViewModel_GetSoftSmallItemIcon;

// Function ItemizationCoreUI.InventoryItemEntryViewModel.IsEquipSlotInputBindingVisible
// 0x0001 (0x0001 - 0x0000)
struct InventoryItemEntryViewModel_IsEquipSlotInputBindingVisible final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InventoryItemEntryViewModel_IsEquipSlotInputBindingVisible;

// Function ItemizationCoreUI.InventoryItemEntryViewModel.IsItemActive
// 0x0001 (0x0001 - 0x0000)
struct InventoryItemEntryViewModel_IsItemActive final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InventoryItemEntryViewModel_IsItemActive;

// Function ItemizationCoreUI.InventoryItemEntryViewModel.IsItemEntryIDValid
// 0x0001 (0x0001 - 0x0000)
struct InventoryItemEntryViewModel_IsItemEntryIDValid final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InventoryItemEntryViewModel_IsItemEntryIDValid;

// Function ItemizationCoreUI.InventoryItemEntryViewModel.IsItemIconLoading
// 0x0001 (0x0001 - 0x0000)
struct InventoryItemEntryViewModel_IsItemIconLoading final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InventoryItemEntryViewModel_IsItemIconLoading;

// Function ItemizationCoreUI.InventoryItemEntryViewModel.IsSmallItemIconLoading
// 0x0001 (0x0001 - 0x0000)
struct InventoryItemEntryViewModel_IsSmallItemIconLoading final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InventoryItemEntryViewModel_IsSmallItemIconLoading;

// Function ItemizationCoreUI.InventoryViewModel.GetInventoryDefinition
// 0x0008 (0x0008 - 0x0000)
struct InventoryViewModel_GetInventoryDefinition final
{
public:
	const class UInventoryDefinition*             ReturnValue;                                       // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InventoryViewModel_GetInventoryDefinition;

// Function ItemizationCoreUI.InventoryViewModel.GetInventoryDescription
// 0x0018 (0x0018 - 0x0000)
struct InventoryViewModel_GetInventoryDescription final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InventoryViewModel_GetInventoryDescription;

// Function ItemizationCoreUI.InventoryViewModel.GetInventoryName
// 0x0018 (0x0018 - 0x0000)
struct InventoryViewModel_GetInventoryName final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InventoryViewModel_GetInventoryName;

// Function ItemizationCoreUI.InventoryViewModel.GetTotalSlots
// 0x0004 (0x0004 - 0x0000)
struct InventoryViewModel_GetTotalSlots final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InventoryViewModel_GetTotalSlots;

// Function ItemizationCoreUI.InventoryViewModelAllowedConversionFunctions.FindInventoryViewModel
// 0x0020 (0x0020 - 0x0000)
struct InventoryViewModelAllowedConversionFunctions_FindInventoryViewModel final
{
public:
	const class UInventoryDefinition*             InventoryDefinition;                               // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UInventoryViewModel*>            InventoryViewModels;                               // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	class UInventoryViewModel*                    ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InventoryViewModelAllowedConversionFunctions_FindInventoryViewModel;

// Function ItemizationCoreUI.InventoryViewModelAllowedConversionFunctions.GetInventoryItemEntryViewModels
// 0x0028 (0x0028 - 0x0000)
struct InventoryViewModelAllowedConversionFunctions_GetInventoryItemEntryViewModels final
{
public:
	TArray<class UInventoryItemEntryViewModel*>   InventoryItemEntryViewModels;                      // 0x0000(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bIncludeEmptySlots;                                // 0x0010(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UInventoryItemEntryViewModel*>   ReturnValue;                                       // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InventoryViewModelAllowedConversionFunctions_GetInventoryItemEntryViewModels;

// Function ItemizationCoreUI.UniformGridEntryPanel.SetGridItems
// 0x0010 (0x0010 - 0x0000)
struct UniformGridEntryPanel_SetGridItems final
{
public:
	TArray<class UObject*>                        GridItems;                                         // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UniformGridEntryPanel_SetGridItems;

// Function ItemizationCoreUI.UniformGridEntryPanel.SetSlotAlignment
// 0x0002 (0x0002 - 0x0000)
struct UniformGridEntryPanel_SetSlotAlignment final
{
public:
	EHorizontalAlignment                          InSlotHorizontalAlignment;                         // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EVerticalAlignment                            InSlotVerticalAlignment;                           // 0x0001(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UniformGridEntryPanel_SetSlotAlignment;

}

