#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ItemizationVerse

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "VerseFortnite_classes.hpp"
#include "ItemizationCoreRuntime_classes.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class ItemizationVerse.VerseInventoryCollectionWrapper
// 0x00F0 (0x0138 - 0x0048)
class UVerseInventoryCollectionWrapper : public UVerseFortniteActorWrapper
{
public:
	TMap<struct FGuid, class UVerseItem*>         ItemMap;                                           // 0x0048(0x0050)(Protected, NativeAccessSpecifierProtected)
	TMap<struct FGuid, class UVerseInventory*>    InventoryMap;                                      // 0x0098(0x0050)(Protected, NativeAccessSpecifierProtected)
	TMap<struct FGuid, class UVerseInventory*>    EquippableInventoryMap;                            // 0x00E8(0x0050)(Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("VerseInventoryCollectionWrapper")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"VerseInventoryCollectionWrapper")
	}
	static class UVerseInventoryCollectionWrapper* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseInventoryCollectionWrapper>();
	}
};
DUMPER7_ASSERTS_UVerseInventoryCollectionWrapper;

// Class ItemizationVerse.VerseInventory
// 0x0080 (0x00A8 - 0x0028)
class UVerseInventory : public UObject
{
public:
	struct FGuid                                  InventoryID;                                       // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class AInventoryCollection>    OwningInventoryCollection;                         // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class UVerseInventoryCollectionWrapper> OwningCollectionWrapper;                  // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSet<struct FGuid>                            ItemSetIDSet;                                      // 0x0048(0x0050)(Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_98[0x10];                                      // 0x0098(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("VerseInventory")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"VerseInventory")
	}
	static class UVerseInventory* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseInventory>();
	}
};
DUMPER7_ASSERTS_UVerseInventory;

// Class ItemizationVerse.VerseItem
// 0x0000 (0x0040 - 0x0040)
class UVerseItem : public UItemInstance
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("VerseItem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"VerseItem")
	}
	static class UVerseItem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseItem>();
	}
};
DUMPER7_ASSERTS_UVerseItem;

// Class ItemizationVerse.VerseItemizationSubsystem
// 0x0000 (0x0030 - 0x0030)
class UVerseItemizationSubsystem final : public UWorldSubsystem
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("VerseItemizationSubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"VerseItemizationSubsystem")
	}
	static class UVerseItemizationSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseItemizationSubsystem>();
	}
};
DUMPER7_ASSERTS_UVerseItemizationSubsystem;

}

