#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: JunoUI

#include "Basic.hpp"

#include "CraftingRuntime_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "CommonInput_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "JunoUI_structs.hpp"
#include "CommonUILegacy_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "JunoGameNative_structs.hpp"
#include "CommonUI_classes.hpp"
#include "SlateCore_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "CommonConversationRuntime_structs.hpp"
#include "DataRegistry_structs.hpp"
#include "JunoCraftingBaseUI_structs.hpp"
#include "DynamicUI_classes.hpp"


namespace SDK
{

// Class JunoUI.GameStateComponent_JunoFeedback
// 0x0000 (0x00A0 - 0x00A0)
class UGameStateComponent_JunoFeedback final : public UGameStateComponent_PlayerFeedback
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameStateComponent_JunoFeedback")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameStateComponent_JunoFeedback")
	}
	static class UGameStateComponent_JunoFeedback* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameStateComponent_JunoFeedback>();
	}
};
DUMPER7_ASSERTS_UGameStateComponent_JunoFeedback;

// Class JunoUI.JunoBangWidget
// 0x0020 (0x02E0 - 0x02C0)
class UJunoBangWidget final : public UUserWidget
{
public:
	uint8                                         Pad_2C0[0x20];                                     // 0x02C0(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnFreeBuildToggled(bool bFreeBuildEnabled);
	void SetBangCount(int32 NewCount);
	void SetBangVisibility(EJunoBangVisibility BangVisibility);

	bool IsFreeBuildEnabled() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JunoBangWidget")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JunoBangWidget")
	}
	static class UJunoBangWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoBangWidget>();
	}
};
DUMPER7_ASSERTS_UJunoBangWidget;

// Class JunoUI.JunoBedAssignmentListEntry
// 0x0010 (0x14F0 - 0x14E0)
class UJunoBedAssignmentListEntry final : public UCommonButtonLegacy
{
public:
	uint8                                         Pad_14E0[0x8];                                     // 0x14E0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UJunoBedAssignmentListObject*           BedAssignmentListObject;                           // 0x14E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void OnBedAssignmentObjectSet(class UJunoBedAssignmentListObject* NewBedAssignmentListObject);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JunoBedAssignmentListEntry")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JunoBedAssignmentListEntry")
	}
	static class UJunoBedAssignmentListEntry* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoBedAssignmentListEntry>();
	}
};
DUMPER7_ASSERTS_UJunoBedAssignmentListEntry;

// Class JunoUI.JunoBedAssignmentListObject
// 0x0080 (0x00A8 - 0x0028)
class UJunoBedAssignmentListObject final : public UObject
{
public:
	struct FGameplayTag                           NPCGameplayTag;                                    // 0x0028(0x0004)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   NPCDisplayName;                                    // 0x0030(0x0018)(NativeAccessSpecifierPrivate)
	TSoftObjectPtr<class UTexture2D>              NPCIcon;                                           // 0x0048(0x0020)(UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bHasBed;                                           // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUniqueNetIdRepl                       PlayerNetId;                                       // 0x0070(0x0030)(HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bIsBed;                                            // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool GetHasBed() const;
	bool GetIsBed() const;
	class FText GetNPCDisplayName() const;
	struct FGameplayTag GetNPCGameplayTag() const;
	TSoftObjectPtr<class UTexture2D> GetNPCIcon() const;
	bool IsEmpty() const;
	bool IsNPC() const;
	bool IsPlayer() const;
	bool IsSelectable() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JunoBedAssignmentListObject")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JunoBedAssignmentListObject")
	}
	static class UJunoBedAssignmentListObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoBedAssignmentListObject>();
	}
};
DUMPER7_ASSERTS_UJunoBedAssignmentListObject;

// Class JunoUI.JunoBiomeUIData
// 0x0050 (0x0080 - 0x0030)
class UJunoBiomeUIData final : public UDataAsset
{
public:
	TMap<EJunoBiome, struct FJunoBiomeUIDisplayData> BiomeUIDisplayData;                             // 0x0030(0x0050)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)

public:
	static const class UJunoBiomeUIData* GetJunoBIomeUIData();

	bool FindBiomeTypeUIData(const EJunoBiome& Biome, struct FJunoBiomeUIDisplayData* OutBiomeUIDisplayData) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JunoBiomeUIData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JunoBiomeUIData")
	}
	static class UJunoBiomeUIData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoBiomeUIData>();
	}
};
DUMPER7_ASSERTS_UJunoBiomeUIData;

// Class JunoUI.JunoVillageScreenBase
// 0x0190 (0x0590 - 0x0400)
class UJunoVillageScreenBase : public UCommonActivatableWidget
{
public:
	uint8                                         Pad_400[0x30];                                     // 0x0400(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      Button_Back;                                       // 0x0430(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                      Button_Close;                                      // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FJunoVillageUIData                     VillageUIData;                                     // 0x0440(0x0138)(BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	class AJunoCampActor*                         CampActor;                                         // 0x0578(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UJunoCampMembershipActorComponent*      CampMembershipActorComponent;                      // 0x0580(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UJunoAwesomeLevelComponent*             AwesomeLevelComponent;                             // 0x0588(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void BP_OnAwesomeLevelChanged(const struct FJunoAwesomeLevelChangeData& Data);
	void BP_OnAwesomePointsChanged(const struct FJunoAwesomePointModificationData& Data);
	void OnAwesomeLevelChanged(const struct FJunoAwesomeLevelChangeData& LevelChangeData);
	void OnAwesomePointsModified(const struct FJunoAwesomePointModificationData& PointModificationData);
	void OnVillageDataChanged();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JunoVillageScreenBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JunoVillageScreenBase")
	}
	static class UJunoVillageScreenBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoVillageScreenBase>();
	}
};
DUMPER7_ASSERTS_UJunoVillageScreenBase;

// Class JunoUI.JunoVillageUpgradeScreen
// 0x0028 (0x05B8 - 0x0590)
class UJunoVillageUpgradeScreen final : public UJunoVillageScreenBase
{
public:
	class UCommonButtonBase*                      Button_Upgrade;                                    // 0x0590(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDynamicEntryBox*                       EntryBox_Ingredients;                              // 0x0598(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDynamicEntryBox*                       EntryBox_Perks;                                    // 0x05A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UScrollBox*                             ScrollBox_Rewards;                                 // 0x05A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UScrollBox*                             ScrollBox_Requirements;                            // 0x05B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void OnUpgrade();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JunoVillageUpgradeScreen")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JunoVillageUpgradeScreen")
	}
	static class UJunoVillageUpgradeScreen* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoVillageUpgradeScreen>();
	}
};
DUMPER7_ASSERTS_UJunoVillageUpgradeScreen;

// Class JunoUI.JunoBuildingBarAssignScreen
// 0x0048 (0x0448 - 0x0400)
class UJunoBuildingBarAssignScreen final : public UCommonActivatableWidget
{
public:
	class UJunoBuildingBarMenu*                   BuildingBarMenuWidget;                             // 0x0400(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FJunoBuildingSlotData                  PreviewSlotData;                                   // 0x0408(0x0040)(NoDestructor, NativeAccessSpecifierPrivate)

public:
	void SetRecipeToAssign(class FName InRecipeToAssign);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JunoBuildingBarAssignScreen")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JunoBuildingBarAssignScreen")
	}
	static class UJunoBuildingBarAssignScreen* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoBuildingBarAssignScreen>();
	}
};
DUMPER7_ASSERTS_UJunoBuildingBarAssignScreen;

// Class JunoUI.JunoBuildingBarHud
// 0x0060 (0x0388 - 0x0328)
class UJunoBuildingBarHud : public UFortHUDElementWidget
{
public:
	class UDynamicEntryBox*                       EntryBox_Slots;                                    // 0x0328(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EJunoBuildModeType                            BuildBarType;                                      // 0x0330(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_331[0x57];                                     // 0x0331(0x0057)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JunoBuildingBarHud")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JunoBuildingBarHud")
	}
	static class UJunoBuildingBarHud* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoBuildingBarHud>();
	}
};
DUMPER7_ASSERTS_UJunoBuildingBarHud;

// Class JunoUI.JunoBuildingBarHudSlot
// 0x0018 (0x0300 - 0x02E8)
class UJunoBuildingBarHudSlot : public UCommonUserWidget
{
public:
	class UJunoBuildingDisplaySlot*               DisplaySlotWidget;                                 // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortKeybindWidget*                     KeyBind_Keyboard;                                  // 0x02F0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bCollapseOnEmpty;                                  // 0x02F8(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2F9[0x7];                                      // 0x02F9(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnBuildingSlotPinned(bool bIsPinned);
	void OnSelectionChanged(bool bInSelected, const struct FJunoBuildingSlotData& BuildingSlotInitData);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JunoBuildingBarHudSlot")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JunoBuildingBarHudSlot")
	}
	static class UJunoBuildingBarHudSlot* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoBuildingBarHudSlot>();
	}
};
DUMPER7_ASSERTS_UJunoBuildingBarHudSlot;

// Class JunoUI.JunoBuildingBarMenu
// 0x0088 (0x0370 - 0x02E8)
class UJunoBuildingBarMenu final : public UCommonUserWidget
{
public:
	uint8                                         Pad_2E8[0x10];                                     // 0x02E8(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bClickableSlots;                                   // 0x02F8(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	EJunoBuildModeType                            BuildBarType;                                      // 0x02F9(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2FA[0xE];                                      // 0x02FA(0x000E)(Fixing Size After Last Property [ Dumper-7 ])
	class UDynamicEntryBox*                       EntryBox_Slots;                                    // 0x0308(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FJunoBuildingSlotData                  PreviewData;                                       // 0x0310(0x0040)(NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_350[0x20];                                     // 0x0350(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JunoBuildingBarMenu")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JunoBuildingBarMenu")
	}
	static class UJunoBuildingBarMenu* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoBuildingBarMenu>();
	}
};
DUMPER7_ASSERTS_UJunoBuildingBarMenu;

// Class JunoUI.JunoEquipmentWidget
// 0x0060 (0x0388 - 0x0328)
class UJunoEquipmentWidget final : public UFortHUDElementWidget
{
public:
	class UJunoInventorySlot*                     InventorySlot_Item;                                // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FJunoItemSlot                          ItemSlotData;                                      // 0x0330(0x0050)(Transient, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_380[0x8];                                      // 0x0380(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnSlotItemChanged(const EJunoItemChangeType ChangeType, const class UFortItem* SlotItem);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JunoEquipmentWidget")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JunoEquipmentWidget")
	}
	static class UJunoEquipmentWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoEquipmentWidget>();
	}
};
DUMPER7_ASSERTS_UJunoEquipmentWidget;

// Class JunoUI.JunoBuildingBarMenuSlot
// 0x0010 (0x14A0 - 0x1490)
class UJunoBuildingBarMenuSlot final : public UCommonButtonBase
{
public:
	class UJunoBuildingDisplaySlot*               DisplaySlotWidget;                                 // 0x1490(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1498[0x8];                                     // 0x1498(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnEnterPreview(const struct FJunoBuildingSlotData& InPreviewSlotData);
	void OnLeavePreview();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JunoBuildingBarMenuSlot")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JunoBuildingBarMenuSlot")
	}
	static class UJunoBuildingBarMenuSlot* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoBuildingBarMenuSlot>();
	}
};
DUMPER7_ASSERTS_UJunoBuildingBarMenuSlot;

// Class JunoUI.JunoBuildingDisplaySlot
// 0x0040 (0x0328 - 0x02E8)
class UJunoBuildingDisplaySlot final : public UCommonUserWidget
{
public:
	struct FJunoBuildingSlotData                  BuildingSlotData;                                  // 0x02E8(0x0040)(Transient, NoDestructor, NativeAccessSpecifierPrivate)

public:
	void OnSelectionChanged(bool bInSelected);
	void OnSetBuildingSlotInitData(const struct FJunoBuildingSlotData& BuildingSlotInitData);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JunoBuildingDisplaySlot")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JunoBuildingDisplaySlot")
	}
	static class UJunoBuildingDisplaySlot* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoBuildingDisplaySlot>();
	}
};
DUMPER7_ASSERTS_UJunoBuildingDisplaySlot;

// Class JunoUI.JunoBuildingIngredientsGroup
// 0x0078 (0x03A0 - 0x0328)
class UJunoBuildingIngredientsGroup final : public UFortHUDElementWidget
{
public:
	class UDynamicEntryBox*                       EntryBox_Ingredients;                              // 0x0328(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FGameplayTagContainer                  FilteredTags;                                      // 0x0330(0x0020)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	uint8                                         Pad_350[0x50];                                     // 0x0350(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnCanCraftChanged(const bool bCanCraft);
	void OnRecipeDisplayDataChanged(const class FText& RecipeDisplayName, const class UJunoBuildInstructionsItemDefinition* BuildingItemDefinition);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JunoBuildingIngredientsGroup")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JunoBuildingIngredientsGroup")
	}
	static class UJunoBuildingIngredientsGroup* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoBuildingIngredientsGroup>();
	}
};
DUMPER7_ASSERTS_UJunoBuildingIngredientsGroup;

// Class JunoUI.JunoBuildingMemoryComponent
// 0x0028 (0x00C8 - 0x00A0)
class UJunoBuildingMemoryComponent final : public UActorComponent
{
public:
	class UDataTable*                             Thresholds;                                        // 0x00A0(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_A8[0x20];                                      // 0x00A8(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JunoBuildingMemoryComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JunoBuildingMemoryComponent")
	}
	static class UJunoBuildingMemoryComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoBuildingMemoryComponent>();
	}
};
DUMPER7_ASSERTS_UJunoBuildingMemoryComponent;

// Class JunoUI.JunoLocalPlayerViewModel
// 0x0038 (0x01C0 - 0x0188)
class UJunoLocalPlayerViewModel final : public UFortPlayerViewModel
{
public:
	TWeakObjectPtr<class AFortPlayerControllerAthena> TrackedPlayerController;                       // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<TWeakObjectPtr<class AFortPlayerState>> CachedPlayerStates;                               // 0x0190(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1A0[0x20];                                     // 0x01A0(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JunoLocalPlayerViewModel")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JunoLocalPlayerViewModel")
	}
	static class UJunoLocalPlayerViewModel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoLocalPlayerViewModel>();
	}
};
DUMPER7_ASSERTS_UJunoLocalPlayerViewModel;

// Class JunoUI.JunoRecipeDetailsWidget
// 0x0048 (0x0330 - 0x02E8)
class UJunoRecipeDetailsWidget : public UCommonUserWidget
{
public:
	bool                                          bCanCraft;                                         // 0x02E8(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bDisableInfiniteIcon;                              // 0x02E9(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2EA[0x16];                                     // 0x02EA(0x0016)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FCraftingIngredientRequirement> IngredientRequirements;                            // 0x0300(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class AActor>                  CraftingObject;                                    // 0x0310(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   CurrentRecipe;                                     // 0x0318(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_31C[0x4];                                      // 0x031C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UDynamicEntryBox*                       EntryBox_Ingredients;                              // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UScrollBox*                             ScrollBox_Ingredients;                             // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void HandleCraftingSuccess(const struct FCraftingObjectSuccessEvent& Event);
	void HandleInventoryChanged(const struct FJunoItemSlot& Item, const EJunoItemChangeType ChangeType);
	void NotifyParentActivated();
	void NotifyParentDeactivated();
	void OnSetRecipeDetails(const class FText& Name_0, EJunoKnowledgeState KnowledgeState, int32 CraftCount, const class UItemDefinitionBase* CraftedItemDef, const class FText& SourceName, const struct FSlateBrush& SourceIcon);
	void SetCraftingObject(class AActor* InCraftingObject);
	void UpdateRecipeFocus(const class FName& Recipe);

	class FName GetCurrentRecipe() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JunoRecipeDetailsWidget")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JunoRecipeDetailsWidget")
	}
	static class UJunoRecipeDetailsWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoRecipeDetailsWidget>();
	}
};
DUMPER7_ASSERTS_UJunoRecipeDetailsWidget;

// Class JunoUI.JunoBuildingRecipeDetails
// 0x0050 (0x0380 - 0x0330)
class UJunoBuildingRecipeDetails final : public UJunoRecipeDetailsWidget
{
public:
	uint8                                         Pad_330[0x8];                                      // 0x0330(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UDynamicEntryBox*                       EntryBox_GuidedBuildingIngredients;                // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         LoadingMinimumWaitTimeSeconds;                     // 0x0340(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_344[0x4];                                      // 0x0344(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftClassPtr<class UClass>                   ActorClassToBuild;                                 // 0x0348(0x0020)(Transient, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_368[0x10];                                     // 0x0368(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UScrollBox*                             ScrollBox_Requirements;                            // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnLoadingBuildingActorAsset();
	void OnLoadingBuildingActorAssetComplete(const struct FJunoGuidedBuildingUIData& GuidedBuildingUIData);
	void SetGuidedBuildIngredientsToPreviewCount(int32 InGuidedBuildIngredientsToPreviewCount);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JunoBuildingRecipeDetails")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JunoBuildingRecipeDetails")
	}
	static class UJunoBuildingRecipeDetails* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoBuildingRecipeDetails>();
	}
};
DUMPER7_ASSERTS_UJunoBuildingRecipeDetails;

// Class JunoUI.JunoCompassWidget
// 0x0130 (0x05C0 - 0x0490)
class UJunoCompassWidget final : public UFortCompassWidget
{
public:
	uint8                                         Pad_490[0x8];                                      // 0x0490(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CompassWidth;                                      // 0x0498(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FVector2f                              MarkerSize;                                        // 0x049C(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FVector2f                              MobileMarkerSize;                                  // 0x04A4(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         MarkerDistanceCutOff;                              // 0x04AC(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         MarkerDistanceOffset;                              // 0x04B0(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FGameplayTag                           AdvancedCompassTag;                                // 0x04B4(0x0004)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FSlateFontInfo                         MarkerDistanceTextFont;                            // 0x04B8(0x0058)(Edit, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TMap<struct FGuid, class UMaterialInstanceDynamic*> ActiveMarkers;                               // 0x0510(0x0050)(Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	TMap<struct FSoftObjectPath, struct FJunoMarkerMaterialInstances> AvailableMaterialInstances;    // 0x0560(0x0050)(Transient, NativeAccessSpecifierPrivate)
	uint8                                         Pad_5B0[0x10];                                     // 0x05B0(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void UpdateHasAdvancedCompassFlag();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JunoCompassWidget")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JunoCompassWidget")
	}
	static class UJunoCompassWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoCompassWidget>();
	}
};
DUMPER7_ASSERTS_UJunoCompassWidget;

// Class JunoUI.JunoConversationMarker
// 0x0138 (0x0508 - 0x03D0)
class UJunoConversationMarker final : public UFortActorIndicatorWidget
{
public:
	uint8                                         Pad_3D0[0x8];                                      // 0x03D0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortKeybindWidget*                     Keybind_Interact;                                  // 0x03D8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         MessageBubbleDuration;                             // 0x03E0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         LastTextBubbleDuration;                            // 0x03E4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bSetCustomInteractionWidgetOnlyWhenNeeded;         // 0x03E8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3E9[0x1F];                                     // 0x03E9(0x001F)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<struct FGameplayTag, struct FJunoNPCStateUIData> CachedNPCStateMap;                         // 0x0408(0x0050)(Transient, NativeAccessSpecifierPrivate)
	TMap<struct FGameplayTag, struct FJunoNPCStateUIData> ActiveNPCStateMap;                         // 0x0458(0x0050)(Transient, NativeAccessSpecifierPrivate)
	uint8                                         Pad_4A8[0x60];                                     // 0x04A8(0x0060)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ClearNPCStatus();
	void OnConversationInteractionUpdated(EDialogMarkerInteractionState NewInteractionState, bool bNewCanInteract);
	void OnMessageUpdated(const class FText& MessageText);
	void OnParticipantNameChanged(const class FText& InParticipantName);
	void SetNPCStatus(const struct FJunoNPCStateUIData& NPCStateData);

	EDialogMarkerInteractionState GetInteractionState() const;
	bool OnCanInteract() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JunoConversationMarker")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JunoConversationMarker")
	}
	static class UJunoConversationMarker* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoConversationMarker>();
	}
};
DUMPER7_ASSERTS_UJunoConversationMarker;

// Class JunoUI.JunoOffhandWidget
// 0x0040 (0x0368 - 0x0328)
class UJunoOffhandWidget final : public UFortHUDElementWidget
{
public:
	uint8                                         Pad_328[0x18];                                     // 0x0328(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class UDynamicEntryBox*                       EntryBox_Slots;                                    // 0x0340(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class UJunoOffhandWidgetSlot*>         CachedOffhandWidgetSlots;                          // 0x0348(0x0010)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                         Pad_358[0x10];                                     // 0x0358(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JunoOffhandWidget")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JunoOffhandWidget")
	}
	static class UJunoOffhandWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoOffhandWidget>();
	}
};
DUMPER7_ASSERTS_UJunoOffhandWidget;

// Class JunoUI.JunoConversationOption
// 0x0080 (0x1510 - 0x1490)
class UJunoConversationOption final : public UCommonButtonBase
{
public:
	uint8                                         Pad_1490[0x8];                                     // 0x1490(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FClientConversationOptionEntry         RepresentedOption;                                 // 0x1498(0x0070)(Transient, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1508[0x8];                                     // 0x1508(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	struct FClientConversationOptionEntry GetConversationOption();
	void OnConversationOptionUpdated(const struct FClientConversationOptionEntry& InOption);
	void OnDisplayAssetLoaded(class UObject* ResolvedAsset);
	void OnDisplayItemDefLoaded(const class UFortItemDefinition* ResolvedItemDef);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JunoConversationOption")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JunoConversationOption")
	}
	static class UJunoConversationOption* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoConversationOption>();
	}
};
DUMPER7_ASSERTS_UJunoConversationOption;

// Class JunoUI.JunoConversationScreen
// 0x0080 (0x0480 - 0x0400)
class UJunoConversationScreen final : public UCommonActivatableWidget
{
public:
	class UCommonButtonGroupBase*                 Group_Options;                                     // 0x0400(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UTexture2D>              ParticipantIconSmall;                              // 0x0408(0x0020)(BlueprintVisible, BlueprintReadOnly, Transient, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDynamicEntryBox*                       EntryBox_Options;                                  // 0x0428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UJunoConversationOption*                LastEntryHovered;                                  // 0x0430(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                    CloseScreenAction;                                 // 0x0438(0x0010)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_448[0x38];                                     // 0x0448(0x0038)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void EndConversation();
	void HandleParticipantIconChanged(const TSoftObjectPtr<class UTexture2D>& Icon);
	void OnConversationMessageUpdated(const struct FClientConversationMessage& ConversationMessage);
	void OnConversationOptionsUpdated();
	void OnConversationStarted();
	void OnParticipantIconChanged(const TSoftObjectPtr<class UTexture2D>& Icon);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JunoConversationScreen")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JunoConversationScreen")
	}
	static class UJunoConversationScreen* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoConversationScreen>();
	}
};
DUMPER7_ASSERTS_UJunoConversationScreen;

// Class JunoUI.JunoDebugWatermark
// 0x0000 (0x0328 - 0x0328)
class UJunoDebugWatermark final : public UFortHUDElementWidget
{
public:
	bool ShouldShowSeed();

	class FString GetWorldID() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JunoDebugWatermark")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JunoDebugWatermark")
	}
	static class UJunoDebugWatermark* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoDebugWatermark>();
	}
};
DUMPER7_ASSERTS_UJunoDebugWatermark;

// Class JunoUI.JunoDisassemblingScreen
// 0x0140 (0x0540 - 0x0400)
class UJunoDisassemblingScreen final : public UCommonActivatableWidget
{
public:
	uint8                                         Pad_400[0x30];                                     // 0x0400(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	EDisassemblingStationInventoryState           StationInventoryState;                             // 0x0430(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_431[0x27];                                     // 0x0431(0x0027)(Fixing Size After Last Property [ Dumper-7 ])
	class AJunoCraftingObjectBGA*                 CraftingObject;                                    // 0x0458(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UJunoPlayerInventoryContainer*          Container_PlayerInventory;                         // 0x0460(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UJunoInventoryGroup*                    InventoryGroup_Input;                              // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UJunoInventoryGroup*                    InventoryGroup_Output;                             // 0x0470(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_Back;                                       // 0x0478(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_CloseTouch;                                 // 0x0480(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_TakeStack;                                  // 0x0488(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_DepositStack;                               // 0x0490(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_MoreActions;                                // 0x0498(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_TakeAll;                                    // 0x04A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonGroupBase*                 ButtonGroup_AllSlots;                              // 0x04A8(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                    CancelAction;                                      // 0x04B0(0x0010)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                    BackAction;                                        // 0x04C0(0x0010)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPrivate)
	class UJunoInventorySlot*                     LastSelectedSlot;                                  // 0x04D0(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UJunoInventorySlot*                     LastHoveredSlot;                                   // 0x04D8(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UJunoPassiveCraftingComponent*          JunoPassiveCraftingComponent;                      // 0x04E0(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UJunoInventoryDragAndDropHandler*       JunoInventoryDragAndDropHandler;                   // 0x04E8(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_4F0[0x50];                                     // 0x04F0(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleCraftingFormulaChanged(class AActor* CraftingObjectActor, const class FName& NewFormula);
	void OnCrafringFormulaResultsChanged(const TArray<struct FItemAndCount>& CraftingResults);
	void OnDisabledInventoryItemHovered();
	void OnSlotItemSelected(const class UFortItem* Item);
	void OnUpdateStationCraftingState(EDisassemblingStationInventoryState NewState);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JunoDisassemblingScreen")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JunoDisassemblingScreen")
	}
	static class UJunoDisassemblingScreen* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoDisassemblingScreen>();
	}
};
DUMPER7_ASSERTS_UJunoDisassemblingScreen;

// Class JunoUI.JunoDynamicControlPromptsWidget
// 0x0008 (0x0330 - 0x0328)
class UJunoDynamicControlPromptsWidget final : public UFortHUDElementWidget
{
public:
	class UDynamicEntryBox*                       EntryBox;                                          // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void AddEntry(const struct FJunoInputAlternateDisplayText& DisplayText);
	void InitializeEntry(const struct FJunoInputAlternateDisplayText& DisplayText, class UUserWidget* EntryWidget);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JunoDynamicControlPromptsWidget")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JunoDynamicControlPromptsWidget")
	}
	static class UJunoDynamicControlPromptsWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoDynamicControlPromptsWidget>();
	}
};
DUMPER7_ASSERTS_UJunoDynamicControlPromptsWidget;

// Class JunoUI.JunoEnchantmentScreen
// 0x0088 (0x0488 - 0x0400)
class UJunoEnchantmentScreen final : public UCommonActivatableWidget
{
public:
	uint8                                         Pad_400[0x8];                                      // 0x0400(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UJunoPlayerInventoryContainer*          Container_PlayerInventory;                         // 0x0408(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UGridListView*                          RecipeList_Enchantments;                           // 0x0410(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UDynamicEntryBox*                       EntryBox_RecipeIngredients;                        // 0x0418(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_Enchant;                                    // 0x0420(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_TouchSelect;                                // 0x0428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class AJunoCraftingObjectBGA*                 CraftingObject;                                    // 0x0430(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UJunoInventorySlot*                     LastInventorySlot;                                 // 0x0438(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortItem*                              ChosenItem;                                        // 0x0440(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<struct FFortAlterationSlotStatus>      ChosenItemAlterations;                             // 0x0448(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	uint8                                         Pad_458[0x8];                                      // 0x0458(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UJunoInventorySlot*                     HoveredInventorySlot;                              // 0x0460(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_468[0x20];                                     // 0x0468(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void CancelEnchanting();
	void HandleCraftingSuccess(const struct FCraftingObjectSuccessEvent& Event);
	void OnDisabledInventoryItemHovered();
	void OnEnchantableItemSlotsCreated(bool bNothingToEnchant);
	void OnEnchantButtonStateChanged(EJunoEnchantButtonState InButtonState);
	void OnEnchantmentStationHeaderData(const struct FJunoCraftingStationUIDataEntry& InEntry);
	void OnInputMethodChanged(ECommonInputType NewInputType);
	void OnInventoryItemChosen(const class UFortItem* ChosenInventoryItem);
	void OnInventoryItemHovered(const class UFortItem* HoveredInventoryItem);
	void OnItemEnchanted(const class UFortItem* Item, const class UFortItemDefinition* PreviewAlteration, int32 UpdatedAlterationIndex);
	void OnRecipeEntryHovered(class UFortAlterationItemDefinition* PreviewEnchantment);
	void OnRecipeEntrySelected(class UFortAlterationItemDefinition* PreviewEnchantment);
	void RequestBackout();
	void SelectInventorySlot(class UJunoInventorySlot* InventorySlot);

	EJunoEnchantmentScreenState GetCurrentScreenState() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JunoEnchantmentScreen")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JunoEnchantmentScreen")
	}
	static class UJunoEnchantmentScreen* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoEnchantmentScreen>();
	}
};
DUMPER7_ASSERTS_UJunoEnchantmentScreen;

// Class JunoUI.JunoEnchantmentsWidget
// 0x0010 (0x02F8 - 0x02E8)
class UJunoEnchantmentsWidget final : public UCommonUserWidget
{
public:
	class UDynamicEntryBox*                       EntryBox_Enchantments;                             // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortItem*                              RepresentedItem;                                   // 0x02F0(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnEnchantmentsUpdated(bool bHasEnchantments);
	void SetPreviewEnchantment(class UFortAlterationItemDefinition* InEnchantment);
	void SetRepresentedItem(class UFortItem* InRepresentedItem);
	void SetUpdatedEnchantmentIndex(int32 UpdatedIndex);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JunoEnchantmentsWidget")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JunoEnchantmentsWidget")
	}
	static class UJunoEnchantmentsWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoEnchantmentsWidget>();
	}
};
DUMPER7_ASSERTS_UJunoEnchantmentsWidget;

// Class JunoUI.JunoEnchantmentWidget
// 0x0010 (0x02F8 - 0x02E8)
class UJunoEnchantmentWidget final : public UCommonUserWidget
{
public:
	class UFortAlterationItemDefinition*          Enchantment;                                       // 0x02E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EJunoEnchantmentState                         EnchantmentState;                                  // 0x02F0(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2F1[0x7];                                      // 0x02F1(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnRepresentedItemChanged();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JunoEnchantmentWidget")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JunoEnchantmentWidget")
	}
	static class UJunoEnchantmentWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoEnchantmentWidget>();
	}
};
DUMPER7_ASSERTS_UJunoEnchantmentWidget;

// Class JunoUI.JunoFullScreenMap
// 0x0150 (0x0550 - 0x0400)
class UJunoFullScreenMap final : public UCommonActivatableWidget
{
public:
	uint8                                         Pad_400[0x28];                                     // 0x0400(0x0028)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableRowHandle                    CloseScreenAction;                                 // 0x0428(0x0010)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_Back;                                       // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_CloseTouch;                                 // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UJunoMapWidget*                         MapWidget;                                         // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         ZoomMouseWheelScale;                               // 0x0450(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FJunoMapZoomBounds                     ZoomBounds;                                        // 0x0454(0x0008)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPrivate)
	float                                         WorldMetersInWidth;                                // 0x045C(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         TouchZoomSpeed;                                    // 0x0460(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         GamepadZoomSpeed;                                  // 0x0464(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         GamepadPanSpeed;                                   // 0x0468(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         GamepadDeadZone;                                   // 0x046C(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bLockPanningToPlayerVisibility;                    // 0x0470(0x0001)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_471[0x3];                                      // 0x0471(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         PlayerVisibilityPadding;                           // 0x0474(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftObjectPtr<class UMaterialInterface>      PlayerIconMaterial;                                // 0x0478(0x0020)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         PlayerIconSize;                                    // 0x0498(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_49C[0x4];                                      // 0x049C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UMaterialInterface>      AnchoringArrowIconMaterial;                        // 0x04A0(0x0020)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         AnchoringArrowIconSize;                            // 0x04C0(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         AnchorMapPadding;                                  // 0x04C4(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         MarkerCyclingDisplayDuration;                      // 0x04C8(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         InContainerIconDistance;                           // 0x04CC(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
