#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: JunoEncountersPOIRuntime

#include "Basic.hpp"

#include "JunoGameNative_structs.hpp"
#include "StateTreeModule_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "WorldConditions_structs.hpp"
#include "StructUtils_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "DataRegistry_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "EncountersRuntime_structs.hpp"


namespace SDK
{

// ScriptStruct JunoEncountersPOIRuntime.JunoEnableVillagerProviderStateTreeTaskInstanceData
// 0x0018 (0x0018 - 0x0000)
struct FJunoEnableVillagerProviderStateTreeTaskInstanceData final
{
public:
	TWeakObjectPtr<class AJunoEncounterStaticPointProvider> VillagerProvider;                        // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableProvider;                                   // 0x0008(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 UserActor;                                         // 0x0010(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FJunoEnableVillagerProviderStateTreeTaskInstanceData;

// ScriptStruct JunoEncountersPOIRuntime.JunoEnableVillagerProviderStateTreeTask
// 0x0000 (0x0020 - 0x0020)
struct FJunoEnableVillagerProviderStateTreeTask final : public FStateTreeTaskCommonBase
{
};
DUMPER7_ASSERTS_FJunoEnableVillagerProviderStateTreeTask;

// ScriptStruct JunoEncountersPOIRuntime.JunoGetVillagerProviderStateTreeTaskInstanceData
// 0x0058 (0x0058 - 0x0000)
struct FJunoGetVillagerProviderStateTreeTaskInstanceData final
{
public:
	struct FGameplayTagQuery                      ProviderTagQuery;                                  // 0x0000(0x0048)(Edit, NativeAccessSpecifierPublic)
	class AActor*                                 UserActor;                                         // 0x0048(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class AJunoEncounterStaticPointProvider> VillagerProvider;                        // 0x0050(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FJunoGetVillagerProviderStateTreeTaskInstanceData;

// ScriptStruct JunoEncountersPOIRuntime.JunoGetVillagerProviderStateTreeTask
// 0x0000 (0x0020 - 0x0020)
struct FJunoGetVillagerProviderStateTreeTask final : public FStateTreeTaskCommonBase
{
};
DUMPER7_ASSERTS_FJunoGetVillagerProviderStateTreeTask;

// ScriptStruct JunoEncountersPOIRuntime.JunoPOIEncounterCategoryRow
// 0x0088 (0x0090 - 0x0008)
struct FJunoPOIEncounterCategoryRow final : public FTableRowBase
{
public:
	TSoftObjectPtr<class UDataRegistry>           POIEncounterRegistry;                              // 0x0008(0x0020)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTagQuery                      RequiredCapabilities;                              // 0x0028(0x0048)(Edit, NativeAccessSpecifierPublic)
	struct FWorldConditionQueryDefinition         WorldConditionDefinition;                          // 0x0070(0x0018)(Edit, NativeAccessSpecifierPublic)
	float                                         Weight;                                            // 0x0088(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FJunoPOIEncounterCategoryRow;

// ScriptStruct JunoEncountersPOIRuntime.JunoPOIEncounterSaveData
// 0x0100 (0x0100 - 0x0000)
struct FJunoPOIEncounterSaveData final
{
public:
	bool                                          bEncounterChosen;                                  // 0x0000(0x0001)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UEncounterItemDefinition> ChosenEncounterDefinition;                        // 0x0008(0x0020)(SaveGame, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UEncounterFactionData>   ChosenFaction;                                     // 0x0028(0x0020)(SaveGame, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ChosenVariant;                                     // 0x0048(0x0004)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDataRegistryId                        EncounterRow;                                      // 0x004C(0x0008)(ZeroConstructor, SaveGame, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<struct FGameplayTag, struct FPersistenceFrameworkDataTableRowHandle> Variables;             // 0x0058(0x0050)(SaveGame, NativeAccessSpecifierPublic)
	TMap<struct FGameplayTag, int32>              PersistentValues;                                  // 0x00A8(0x0050)(SaveGame, NativeAccessSpecifierPublic)
	bool                                          bIsPOISetup;                                       // 0x00F8(0x0001)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEncounterFinished;                                // 0x00F9(0x0001)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFactionChosen;                                    // 0x00FA(0x0001)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_FB[0x5];                                       // 0x00FB(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FJunoPOIEncounterSaveData;

// ScriptStruct JunoEncountersPOIRuntime.JunoPOIEncounterPersistenceFeatureData_InGameClass_PersistentInfo
// 0x0100 (0x0100 - 0x0000)
struct FJunoPOIEncounterPersistenceFeatureData_InGameClass_PersistentInfo final
{
public:
	struct FJunoPOIEncounterSaveData              SavedEncounterState;                               // 0x0000(0x0100)(NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FJunoPOIEncounterPersistenceFeatureData_InGameClass_PersistentInfo;

// ScriptStruct JunoEncountersPOIRuntime.JunoPOIDestroyActorRetainmentEntry
// 0x0008 (0x0008 - 0x0000)
struct FJunoPOIDestroyActorRetainmentEntry final
{
public:
	int32                                         Count;                                             // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Weight;                                            // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FJunoPOIDestroyActorRetainmentEntry;

// ScriptStruct JunoEncountersPOIRuntime.JunoPOIDestroyActorInfo
// 0x0058 (0x0058 - 0x0000)
struct FJunoPOIDestroyActorInfo final
{
public:
	struct FGameplayTagQuery                      DestroyActorQuery;                                 // 0x0000(0x0048)(Edit, NativeAccessSpecifierPublic)
	TArray<struct FJunoPOIDestroyActorRetainmentEntry> RetainmentEntries;                            // 0x0048(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FJunoPOIDestroyActorInfo;

// ScriptStruct JunoEncountersPOIRuntime.JunoPOIHLODActorInfo
// 0x0068 (0x0068 - 0x0000)
struct FJunoPOIHLODActorInfo final
{
public:
	TSoftClassPtr<class UClass>                   HLODActorClass;                                    // 0x0000(0x0020)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTagQuery                      HLODActorAnchorQuery;                              // 0x0020(0x0048)(Edit, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FJunoPOIHLODActorInfo;

// ScriptStruct JunoEncountersPOIRuntime.JunoPOIEncounterRow
// 0x00C0 (0x00C8 - 0x0008)
struct FJunoPOIEncounterRow final : public FTableRowBase
{
public:
	class UEncounterItemDefinition*               EncounterDefinition;                               // 0x0008(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UDataRegistry>           FactionRegistry;                                   // 0x0010(0x0020)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTagQuery                      RequiredCapabilities;                              // 0x0030(0x0048)(Edit, NativeAccessSpecifierPublic)
	struct FWorldConditionQueryDefinition         WorldConditionDefinition;                          // 0x0078(0x0018)(Edit, NativeAccessSpecifierPublic)
	TArray<struct FJunoPOIHLODActorInfo>          HLODActorsEntries;                                 // 0x0090(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FJunoPOIDestroyActorInfo>       DestroyActorsEntries;                              // 0x00A0(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FInstancedStruct>               POIVariables;                                      // 0x00B0(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	float                                         Weight;                                            // 0x00C0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FJunoPOIEncounterRow;

// ScriptStruct JunoEncountersPOIRuntime.JunoSpawnActorStateTreeTaskInstanceData
// 0x00F8 (0x00F8 - 0x0000)
struct FJunoSpawnActorStateTreeTaskInstanceData final
{
public:
	TSoftClassPtr<class UClass>                   ActorClass;                                        // 0x0000(0x0020)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTagQuery                      AnchorQuery;                                       // 0x0020(0x0048)(Edit, NativeAccessSpecifierPublic)
	struct FVector                                AnchorOffset;                                      // 0x0068(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnablePhysics;                                    // 0x0080(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAttachEncounterVolume;                            // 0x0081(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_82[0x6];                                       // 0x0082(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  ActorTags;                                         // 0x0088(0x0020)(Edit, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  ActorIdentifierTags;                               // 0x00A8(0x0020)(Edit, NativeAccessSpecifierPublic)
	ESpawnActorPersistenceBehavior                PersistenceBehavior;                               // 0x00C8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C9[0x3];                                       // 0x00C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           PersistenceID;                                     // 0x00CC(0x0004)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bWaitForSpawnedActor;                              // 0x00D0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D1[0x3];                                       // 0x00D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TWeakObjectPtr<class AActor>                  SpawnedActor;                                      // 0x00D4(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 UserActor;                                         // 0x00E0(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UJunoSpawnActorTaskHelper*              JunoSpawnActorHelper;                              // 0x00E8(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_F0[0x8];                                       // 0x00F0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FJunoSpawnActorStateTreeTaskInstanceData;

// ScriptStruct JunoEncountersPOIRuntime.JunoSpawnActorStateTreeTask
// 0x0000 (0x0020 - 0x0020)
struct FJunoSpawnActorStateTreeTask final : public FStateTreeTaskCommonBase
{
};
DUMPER7_ASSERTS_FJunoSpawnActorStateTreeTask;

// ScriptStruct JunoEncountersPOIRuntime.JunoSpawnedActorMakePersistentStateTreeTaskInstanceData
// 0x0058 (0x0058 - 0x0000)
struct FJunoSpawnedActorMakePersistentStateTreeTaskInstanceData final
{
public:
	struct FGameplayTagQuery                      ActorQuery;                                        // 0x0000(0x0048)(Edit, NativeAccessSpecifierPublic)
	bool                                          bMakeTransient;                                    // 0x0048(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 UserActor;                                         // 0x0050(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FJunoSpawnedActorMakePersistentStateTreeTaskInstanceData;

// ScriptStruct JunoEncountersPOIRuntime.JunoSpawnedActorMakePersistentStateTreeTask
// 0x0000 (0x0020 - 0x0020)
struct FJunoSpawnedActorMakePersistentStateTreeTask final : public FStateTreeTaskCommonBase
{
};
DUMPER7_ASSERTS_FJunoSpawnedActorMakePersistentStateTreeTask;

// ScriptStruct JunoEncountersPOIRuntime.JunoEncounterConditionalTags
// 0x0028 (0x0028 - 0x0000)
struct FJunoEncounterConditionalTags final
{
public:
	EJunoBiome                                    Biome;                                             // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  TagsToApply;                                       // 0x0008(0x0020)(Edit, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FJunoEncounterConditionalTags;

// ScriptStruct JunoEncountersPOIRuntime.FindPrefabSpawnedActorStateTreeTaskInstanceData
// 0x0020 (0x0020 - 0x0000)
struct FFindPrefabSpawnedActorStateTreeTaskInstanceData final
{
public:
	TSubclassOf<class AActor>                     MustBeOfClass;                                     // 0x0000(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 UserActor;                                         // 0x0008(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class AActor>                  Actor;                                             // 0x0010(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_18[0x8];                                       // 0x0018(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FFindPrefabSpawnedActorStateTreeTaskInstanceData;

// ScriptStruct JunoEncountersPOIRuntime.FindPrefabSpawnedActorStateTreeTask
// 0x0008 (0x0028 - 0x0020)
struct FFindPrefabSpawnedActorStateTreeTask final : public FStateTreeTaskCommonBase
{
public:
	struct FStateTreeStateLink                    TransitionTo;                                      // 0x0020(0x0002)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FFindPrefabSpawnedActorStateTreeTask;

// ScriptStruct JunoEncountersPOIRuntime.JunoVillagerProviderSpawnTransitionStateTreeTaskInstanceData
// 0x0020 (0x0020 - 0x0000)
struct FJunoVillagerProviderSpawnTransitionStateTreeTaskInstanceData final
{
public:
	TWeakObjectPtr<class AJunoEncounterStaticPointProvider> VillagerProvider;                        // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 UserActor;                                         // 0x0008(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class AActor>                  Villager;                                          // 0x0010(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_18[0x8];                                       // 0x0018(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FJunoVillagerProviderSpawnTransitionStateTreeTaskInstanceData;

// ScriptStruct JunoEncountersPOIRuntime.JunoVillagerProviderSpawnTransitionStateTreeTask
// 0x0008 (0x0028 - 0x0020)
struct FJunoVillagerProviderSpawnTransitionStateTreeTask final : public FStateTreeTaskCommonBase
{
public:
	struct FStateTreeStateLink                    TransitionTo;                                      // 0x0020(0x0002)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FJunoVillagerProviderSpawnTransitionStateTreeTask;

}

