#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: JunoAdventuresRuntime

#include "Basic.hpp"

#include "JunoAdventuresRuntime_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CommonConversationRuntime_structs.hpp"
#include "JunoGameNative_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function JunoAdventuresRuntime.JunoControllerComponent_ConversationHistory.Client_SetCachedContextualMessageResult
// 0x0058 (0x0058 - 0x0000)
struct JunoControllerComponent_ConversationHistory_Client_SetCachedContextualMessageResult final
{
public:
	struct FJunoContextualMessageQueryResult      Result;                                            // 0x0000(0x0058)(ConstParm, Parm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_JunoControllerComponent_ConversationHistory_Client_SetCachedContextualMessageResult;

// Function JunoAdventuresRuntime.JunoControllerRequirement_CampResidentsHaveTag.ValidateRoleTag
// 0x0018 (0x0018 - 0x0000)
struct JunoControllerRequirement_CampResidentsHaveTag_ValidateRoleTag final
{
public:
	struct FGameplayTag                           OtherResidentIdentifier;                           // 0x0000(0x0004)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UPlayspaceComponent_JunoAIPersistence* RootAIPersistenceComp;                        // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_JunoControllerRequirement_CampResidentsHaveTag_ValidateRoleTag;

// Function JunoAdventuresRuntime.JunoControllerRequirement_CampResidentsHaveTag.ValidateUniqueResidentTag
// 0x0008 (0x0008 - 0x0000)
struct JunoControllerRequirement_CampResidentsHaveTag_ValidateUniqueResidentTag final
{
public:
	struct FGameplayTag                           OtherResidentIdentifier;                           // 0x0000(0x0004)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_JunoControllerRequirement_CampResidentsHaveTag_ValidateUniqueResidentTag;

// Function JunoAdventuresRuntime.JunoControllerRequirement_HasCompletedQuestObjective.Editor_GetValidObjectives
// 0x0010 (0x0010 - 0x0000)
struct JunoControllerRequirement_HasCompletedQuestObjective_Editor_GetValidObjectives final
{
public:
	TArray<class FName>                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_JunoControllerRequirement_HasCompletedQuestObjective_Editor_GetValidObjectives;

// Function JunoAdventuresRuntime.JunoConversationTaskNode_Speech.PlayClientVoiceLine
// 0x0090 (0x0090 - 0x0000)
struct JunoConversationTaskNode_Speech_PlayClientVoiceLine final
{
public:
	struct FConversationContext                   Context;                                           // 0x0000(0x0038)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FJunoContextualMessageQueryResult      MessageParams;                                     // 0x0038(0x0058)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_JunoConversationTaskNode_Speech_PlayClientVoiceLine;

// Function JunoAdventuresRuntime.JunoChangeInventoryHelper.HandleInventoryChangedEvent
// 0x0058 (0x0058 - 0x0000)
struct JunoChangeInventoryHelper_HandleInventoryChangedEvent final
{
public:
	struct FJunoItemSlot                          ItemSlot;                                          // 0x0000(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EJunoItemChangeType                           ChangeType;                                        // 0x0050(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_JunoChangeInventoryHelper_HandleInventoryChangedEvent;

// Function JunoAdventuresRuntime.JunoConversationTaskNode_CompleteQuestObjective.Editor_GetValidObjectives
// 0x0010 (0x0010 - 0x0000)
struct JunoConversationTaskNode_CompleteQuestObjective_Editor_GetValidObjectives final
{
public:
	TArray<class FName>                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_JunoConversationTaskNode_CompleteQuestObjective_Editor_GetValidObjectives;

// Function JunoAdventuresRuntime.JunoQuestGiverComponent.HandleOnJunoQuestComplete
// 0x0010 (0x0010 - 0x0000)
struct JunoQuestGiverComponent_HandleOnJunoQuestComplete final
{
public:
	TScriptInterface<class IQuestInstanceInterface> QuestInstance;                                   // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_JunoQuestGiverComponent_HandleOnJunoQuestComplete;

// Function JunoAdventuresRuntime.JunoQuestGiverComponent.GetGrantableQuestID
// 0x0010 (0x0010 - 0x0000)
struct JunoQuestGiverComponent_GetGrantableQuestID final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_JunoQuestGiverComponent_GetGrantableQuestID;

// Function JunoAdventuresRuntime.JunoTokenHandlerAIComponent.ReceiveToken
// 0x0004 (0x0004 - 0x0000)
struct JunoTokenHandlerAIComponent_ReceiveToken final
{
public:
	struct FGameplayTag                           JunoToken;                                         // 0x0000(0x0004)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_JunoTokenHandlerAIComponent_ReceiveToken;

// Function JunoAdventuresRuntime.JunoTokenHandlerAIComponent.GetSavedTokens
// 0x0020 (0x0020 - 0x0000)
struct JunoTokenHandlerAIComponent_GetSavedTokens final
{
public:
	struct FGameplayTagContainer                  ReturnValue;                                       // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_JunoTokenHandlerAIComponent_GetSavedTokens;

// Function JunoAdventuresRuntime.JunoQuestDatabaseComponent.GetJunoQuestState
// 0x0018 (0x0018 - 0x0000)
struct JunoQuestDatabaseComponent_GetJunoQuestState final
{
public:
	class FString                                 QuestID;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EJunoQuestState                               ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_JunoQuestDatabaseComponent_GetJunoQuestState;

// Function JunoAdventuresRuntime.JunoQuestManagerComponent.ActivateQuest
// 0x0010 (0x0010 - 0x0000)
struct JunoQuestManagerComponent_ActivateQuest final
{
public:
	const class UFortQuestItemDefinition_Athena*  QuestDefinition;                                   // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 QuestGiver;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_JunoQuestManagerComponent_ActivateQuest;

// Function JunoAdventuresRuntime.JunoQuestManagerComponent.SendQuestStatEvent
// 0x0050 (0x0050 - 0x0000)
struct JunoQuestManagerComponent_SendQuestStatEvent final
{
public:
	EFortQuestObjectiveStatEvent                  Type;                                              // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  SourceTags;                                        // 0x0008(0x0020)(Parm, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  TargetTags;                                        // 0x0028(0x0020)(Parm, NativeAccessSpecifierPublic)
	int32                                         Count;                                             // 0x0048(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_JunoQuestManagerComponent_SendQuestStatEvent;

// Function JunoAdventuresRuntime.JunoQuestManagerComponent.GetQuestGiverForQuestID
// 0x0018 (0x0018 - 0x0000)
struct JunoQuestManagerComponent_GetQuestGiverForQuestID final
{
public:
	class FString                                 QuestID;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class AActor*                           ReturnValue;                                       // 0x0010(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_JunoQuestManagerComponent_GetQuestGiverForQuestID;

// Function JunoAdventuresRuntime.FortQuestDefinitionComponent_Juno.Editor_GetValidObjectiveNames
// 0x0010 (0x0010 - 0x0000)
struct FortQuestDefinitionComponent_Juno_Editor_GetValidObjectiveNames final
{
public:
	TArray<class FName>                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortQuestDefinitionComponent_Juno_Editor_GetValidObjectiveNames;

// Function JunoAdventuresRuntime.JunoAdventuresBlueprintLibrary.GetJunoQuestDatabase
// 0x0010 (0x0010 - 0x0000)
struct JunoAdventuresBlueprintLibrary_GetJunoQuestDatabase final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UJunoQuestDatabaseComponent*            ReturnValue;                                       // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_JunoAdventuresBlueprintLibrary_GetJunoQuestDatabase;

// Function JunoAdventuresRuntime.JunoAdventuresBlueprintLibrary.GetJunoQuestManager
// 0x0010 (0x0010 - 0x0000)
struct JunoAdventuresBlueprintLibrary_GetJunoQuestManager final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UJunoQuestManagerComponent*             ReturnValue;                                       // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_JunoAdventuresBlueprintLibrary_GetJunoQuestManager;

// Function JunoAdventuresRuntime.JunoCheatManager_Adventures.JunoQueueScriptRowMessagesForNpcConversation
// 0x0020 (0x0020 - 0x0000)
struct JunoCheatManager_Adventures_JunoQueueScriptRowMessagesForNpcConversation final
{
public:
	class FString                                 ScriptName;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 RowName;                                           // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_JunoCheatManager_Adventures_JunoQueueScriptRowMessagesForNpcConversation;

// Function JunoAdventuresRuntime.JunoCheatManager_Adventures.JunoRepopulateAvailableQuestsWithTags
// 0x0010 (0x0010 - 0x0000)
struct JunoCheatManager_Adventures_JunoRepopulateAvailableQuestsWithTags final
{
public:
	class FString                                 QuestPoolTags;                                     // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_JunoCheatManager_Adventures_JunoRepopulateAvailableQuestsWithTags;

// Function JunoAdventuresRuntime.JunoCheatManager_Adventures.JunoInjectDisplayTextForNpcConversation
// 0x0010 (0x0010 - 0x0000)
struct JunoCheatManager_Adventures_JunoInjectDisplayTextForNpcConversation final
{
public:
	class FString                                 TestString;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_JunoCheatManager_Adventures_JunoInjectDisplayTextForNpcConversation;

// Function JunoAdventuresRuntime.JunoCheatManager_Adventures.JunoPrintNPCsInfo
// 0x0001 (0x0001 - 0x0000)
struct JunoCheatManager_Adventures_JunoPrintNPCsInfo final
{
public:
	bool                                          bIgnoreAIsWithNoAssignment;                        // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_JunoCheatManager_Adventures_JunoPrintNPCsInfo;

// Function JunoAdventuresRuntime.JunoCheatManager_Adventures.JunoSpawnVisitorInClosestCamp
// 0x0018 (0x0018 - 0x0000)
struct JunoCheatManager_Adventures_JunoSpawnVisitorInClosestCamp final
{
public:
	class FString                                 PartialUniqueAIIdentifier;                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Count;                                             // 0x0010(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_JunoCheatManager_Adventures_JunoSpawnVisitorInClosestCamp;

}

