#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: JunoGameNative

#include "Basic.hpp"

#include "DeltaFileSystem_structs.hpp"
#include "DataRegistry_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "CraftingRuntime_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"
#include "PlayspaceSystem_classes.hpp"
#include "JunoGameNative_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "ModularGameplay_classes.hpp"
#include "FortniteAI_classes.hpp"
#include "NavigationSystem_classes.hpp"
#include "SpatialMetricsCore_classes.hpp"
#include "EnergyRuntime_classes.hpp"
#include "DeveloperSettings_classes.hpp"
#include "MeshNetwork_classes.hpp"
#include "WorldConditions_classes.hpp"
#include "GameplayEventRouter_structs.hpp"
#include "GameFeatures_classes.hpp"
#include "SoundLibrary_classes.hpp"
#include "GameplayStateMachine_classes.hpp"
#include "GameplayGraph_structs.hpp"
#include "FortGameplayGraph_structs.hpp"
#include "FortImGuiCore_classes.hpp"


namespace SDK
{

// Class JunoGameNative.FortAutomationRpcManager_Juno
// 0x0050 (0x00A8 - 0x0058)
class UFortAutomationRpcManager_Juno final : public UFortAutomationRpcManager
{
public:
	uint8                                         Pad_58[0x50];                                      // 0x0058(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortAutomationRpcManager_Juno")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortAutomationRpcManager_Juno")
	}
	static class UFortAutomationRpcManager_Juno* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAutomationRpcManager_Juno>();
	}
};
DUMPER7_ASSERTS_UFortAutomationRpcManager_Juno;

// Class JunoGameNative.JunoPassiveCraftingAnalyticsComponent
// 0x0048 (0x00E8 - 0x00A0)
class UJunoPassiveCraftingAnalyticsComponent final : public UGameFrameworkComponent
{
public:
	uint8                                         Pad_A0[0x8];                                       // 0x00A0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJunoPassiveCraftingItemAndCount       AccumulatedItem;                                   // 0x00A8(0x0010)(SaveGame, NoDestructor, NativeAccessSpecifierPrivate)
	TArray<struct FJunoPassiveCraftingContributorAnalytics> AccumulatedContributors;                 // 0x00B8(0x0010)(ZeroConstructor, SaveGame, NativeAccessSpecifierPrivate)
	TArray<struct FJunoPassiveCraftingItemAndCount> AccumulatedIngredients;                          // 0x00C8(0x0010)(ZeroConstructor, SaveGame, NativeAccessSpecifierPrivate)
	class FName                                   Recipe;                                            // 0x00D8(0x0004)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        AccumulatedCraftingTime;                           // 0x00E0(0x0008)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JunoPassiveCraftingAnalyticsComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JunoPassiveCraftingAnalyticsComponent")
	}
	static class UJunoPassiveCraftingAnalyticsComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoPassiveCraftingAnalyticsComponent>();
	}
};
DUMPER7_ASSERTS_UJunoPassiveCraftingAnalyticsComponent;

// Class JunoGameNative.FortQueryGenerator_PointsOutsideVolume
// 0x0078 (0x0100 - 0x0088)
class UFortQueryGenerator_PointsOutsideVolume final : public UEnvQueryGenerator_ProjectedPoints
{
public:
	struct FAIDataProviderFloatValue              SpaceBetween;                                      // 0x0088(0x0038)(Edit, DisableEditOnInstance, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	struct FAIDataProviderFloatValue              NumberOfRingsAroundVolume;                         // 0x00C0(0x0038)(Edit, DisableEditOnInstance, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	TSubclassOf<class UEnvQueryContext>           GenerateInVolume;                                  // 0x00F8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortQueryGenerator_PointsOutsideVolume")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortQueryGenerator_PointsOutsideVolume")
	}
	static class UFortQueryGenerator_PointsOutsideVolume* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortQueryGenerator_PointsOutsideVolume>();
	}
};
DUMPER7_ASSERTS_UFortQueryGenerator_PointsOutsideVolume;

// Class JunoGameNative.JunoBuildingTrackedActorInterface
// 0x0000 (0x0000 - 0x0000)
class IJunoBuildingTrackedActorInterface final
{
public:
	float GetNetRelevanceDistanceOverride() const;
	int32 GetNumberOfRelevantActors() const;
	bool ShouldBeTrackedByMetrics() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JunoBuildingTrackedActorInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JunoBuildingTrackedActorInterface")
	}
	static class IJunoBuildingTrackedActorInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IJunoBuildingTrackedActorInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IJunoBuildingTrackedActorInterface;

// Class JunoGameNative.JunoPickup
// 0x0008 (0x07C0 - 0x07B8)
class AJunoPickup final : public AFortPickupAthena
{
public:
	float                                         MaxDropTossSpeed;                                  // 0x07B8(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_7BC[0x4];                                      // 0x07BC(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JunoPickup")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JunoPickup")
	}
	static class AJunoPickup* GetDefaultObj()
	{
		return GetDefaultObjImpl<AJunoPickup>();
	}
};
DUMPER7_ASSERTS_AJunoPickup;

// Class JunoGameNative.JunoAbility_PlayerPushPhysicsObject
// 0x0130 (0x0C90 - 0x0B60)
class UJunoAbility_PlayerPushPhysicsObject final : public UFortGameplayAbility
{
public:
	EFortPhysicsSimSize                           MaxPhysicsObjectSizeToPush;                        // 0x0B60(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	EFortPhysicsSimSize                           MinPhysicsObjectSizeToPush;                        // 0x0B61(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_B62[0x6];                                      // 0x0B62(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  NoTagsPusher;                                      // 0x0B68(0x0020)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FGameplayTagContainer                  NoTagsPushedObject;                                // 0x0B88(0x0020)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	class UAnimMontage*                           DefaultPushMontage;                                // 0x0BA8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<struct FPushMontageData>               SpecializedPushMontages;                           // 0x0BB0(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FGameplayTagQuery                      EnergyComponentQuery;                              // 0x0BC0(0x0048)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         EnergyInitialCost;                                 // 0x0C08(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         EnergyDrainPerSecond;                              // 0x0C30(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	bool                                          bEnergyExhausted;                                  // 0x0C58(0x0001)(Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_C59[0x3];                                      // 0x0C59(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TWeakObjectPtr<class UFortComponent_Energy>   CachedEnergyComponent;                             // 0x0C5C(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_C64[0xC];                                      // 0x0C64(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	TWeakObjectPtr<class AActor>                  TrackedObjectToPush;                               // 0x0C70(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	EFortPhysicsSimSize                           TrackedObjectSimSize;                              // 0x0C78(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_C79[0x17];                                     // 0x0C79(0x0017)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void CancelPushingPhysicsObject();
	void OnEnergyDrained(class UFortComponent_Energy* EnergyComponentDrained);
	void OnEnergyFullyRecharged(class UFortComponent_Energy* EnergyComponentRecharged);
	void OnPlayerHit(class AActor* HitPlayer, class AActor* HitActor, const struct FVector& NormalImpulse, const struct FHitResult& Hit);
	void PotentiallyStartUsingEnergy();
	void StopUsingEnergy();

	class UAnimMontage* GetMontageToPlay() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JunoAbility_PlayerPushPhysicsObject")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JunoAbility_PlayerPushPhysicsObject")
	}
	static class UJunoAbility_PlayerPushPhysicsObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoAbility_PlayerPushPhysicsObject>();
	}
};
DUMPER7_ASSERTS_UJunoAbility_PlayerPushPhysicsObject;

// Class JunoGameNative.JunoAccountItemDefinitionOverrideManager
// 0x0168 (0x0190 - 0x0028)
class UJunoAccountItemDefinitionOverrideManager : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortHeroType*                          JunoHeroDefinition;                                // 0x0030(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDataTable*                             DefaultCharacters;                                 // 0x0038(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TMap<TSoftClassPtr<class UClass>, TSoftClassPtr<class UClass>> PreviewActorClasses;              // 0x0040(0x0050)(Edit, DisableEditOnInstance, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TMap<TSoftClassPtr<class UClass>, struct FGameplayTagContainer> GameplayTagParentsToRemoveFromOverrides; // 0x0090(0x0050)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TMap<TSoftClassPtr<class UClass>, struct FGameplayTagContainer> GameplayTagsToAdd;               // 0x00E0(0x0050)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TMap<struct FPrimaryAssetId, struct FJunoAccountItemDefinitionOverride> Overrides;               // 0x0130(0x0050)(Transient, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_180[0x10];                                     // 0x0180(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JunoAccountItemDefinitionOverrideManager")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JunoAccountItemDefinitionOverrideManager")
	}
	static class UJunoAccountItemDefinitionOverrideManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoAccountItemDefinitionOverrideManager>();
	}
};
DUMPER7_ASSERTS_UJunoAccountItemDefinitionOverrideManager;

// Class JunoGameNative.JunoPassiveResourcesGatheringComponent
// 0x00D8 (0x0178 - 0x00A0)
class UJunoPassiveResourcesGatheringComponent final : public UGameFrameworkComponent
{
public:
	uint8                                         Pad_A0[0x28];                                      // 0x00A0(0x0028)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FPassiveResourcesGatheringRowRuntime> ActiveGatheringRows;                         // 0x00C8(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	TMulticastInlineDelegate<void(class AActor* GeneratingActor, int32 GeneratedItemsCount, bool bIsRuntime)> OnPassiveResourceGeneratedDelegate; // 0x00D8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPrivate)
	uint8                                         Pad_E8[0x28];                                      // 0x00E8(0x0028)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagQuery                      MatchingRolesQuery;                                // 0x0110(0x0048)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	TArray<struct FDataTableRowHandle>            GatheringRows;                                     // 0x0158(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                    SimulationConfigurationRow;                        // 0x0168(0x0010)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPrivate)

public:
	bool OverrideGatheringRow(const struct FDataTableRowHandle& GatheringRow);
	void RemoveGatheringRowOverride();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JunoPassiveResourcesGatheringComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JunoPassiveResourcesGatheringComponent")
	}
	static class UJunoPassiveResourcesGatheringComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoPassiveResourcesGatheringComponent>();
	}
};
DUMPER7_ASSERTS_UJunoPassiveResourcesGatheringComponent;

// Class JunoGameNative.JunoAccountItemOverrideDefinition
// 0x0078 (0x00A8 - 0x0030)
class UJunoAccountItemOverrideDefinition : public UPrimaryDataAsset
{
public:
	struct FGameplayTagContainer                  GameplayTagsToAdd;                                 // 0x0030(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	bool                                          bOverrideFrontendTransform;                        // 0x0050(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FrontendPreviewScale;                              // 0x0054(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                                FrontendPreviewPivotOffset;                        // 0x0058(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FRotator                               FrontendPreviewInitialRotation;                    // 0x0070(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	TSoftClassPtr<class UClass>                   PreviewActorClass;                                 // 0x0088(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JunoAccountItemOverrideDefinition")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JunoAccountItemOverrideDefinition")
	}
	static class UJunoAccountItemOverrideDefinition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoAccountItemOverrideDefinition>();
	}
};
DUMPER7_ASSERTS_UJunoAccountItemOverrideDefinition;

// Class JunoGameNative.JunoAthenaCharacterItemOverrideDefinition
// 0x0088 (0x0130 - 0x00A8)
class UJunoAthenaCharacterItemOverrideDefinition final : public UJunoAccountItemOverrideDefinition
{
public:
	TSoftObjectPtr<class UAthenaCharacterItemDefinition> BaseAthenaCharacterItemDefinition;          // 0x00A8(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UAssembledMeshSchema>    AssembledMeshSchema;                               // 0x00C8(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UAssembledMeshSchema>    LowDetailsAssembledMeshSchema;                     // 0x00E8(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UAnimMontage>            FrontendAnimMontageIdleOverride;                   // 0x0108(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         PreviewPawnScale;                                  // 0x0128(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_12C[0x4];                                      // 0x012C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetBaseAthenaCharacterItemDefinition(TSoftObjectPtr<class UAthenaCharacterItemDefinition> InBaseAthenaCharacterItemDefinition);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JunoAthenaCharacterItemOverrideDefinition")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JunoAthenaCharacterItemOverrideDefinition")
	}
	static class UJunoAthenaCharacterItemOverrideDefinition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoAthenaCharacterItemOverrideDefinition>();
	}
};
DUMPER7_ASSERTS_UJunoAthenaCharacterItemOverrideDefinition;

// Class JunoGameNative.JunoMutator_AutoPickup
// 0x0020 (0x0358 - 0x0338)
class AJunoMutator_AutoPickup final : public AFortAthenaMutator
{
public:
	struct FGameplayTagContainer                  DoNotAutoPickupGameplayTags;                       // 0x0338(0x0020)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JunoMutator_AutoPickup")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JunoMutator_AutoPickup")
	}
	static class AJunoMutator_AutoPickup* GetDefaultObj()
	{
		return GetDefaultObjImpl<AJunoMutator_AutoPickup>();
	}
};
DUMPER7_ASSERTS_AJunoMutator_AutoPickup;

// Class JunoGameNative.JunoAthenaDanceItemOverrideDefinition
// 0x00E8 (0x0190 - 0x00A8)
class UJunoAthenaDanceItemOverrideDefinition final : public UJunoAccountItemOverrideDefinition
{
public:
	TSoftObjectPtr<class UAthenaDanceItemDefinition> BaseAthenaDanceItemDefinition;                  // 0x00A8(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UAnimMontage>            Animation;                                         // 0x00C8(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UAnimMontage>            AnimationFemaleOverride;                           // 0x00E8(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FFortEmoteMapping>              AnimationOverrides;                                // 0x0108(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UAnimMontage>            FrontEndAnimation;                                 // 0x0118(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UAnimMontage>            FrontEndAnimationFemaleOverride;                   // 0x0138(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FFortEmoteMapping>              FrontEndAnimationOverrides;                        // 0x0158(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FVector                                GroupEmotePositionOffset;                          // 0x0168(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         GroupEmotePositionOffsetTolerance;                 // 0x0180(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         GroupEmoteFollowDistance;                          // 0x0184(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         WalkForwardSpeed;                                  // 0x0188(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_18C[0x4];                                      // 0x018C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetBaseAthenaDanceItemDefinition(TSoftObjectPtr<class UAthenaDanceItemDefinition> InBaseAthenaDanceItemDefinition);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JunoAthenaDanceItemOverrideDefinition")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JunoAthenaDanceItemOverrideDefinition")
	}
	static class UJunoAthenaDanceItemOverrideDefinition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoAthenaDanceItemOverrideDefinition>();
	}
};
DUMPER7_ASSERTS_UJunoAthenaDanceItemOverrideDefinition;

// Class JunoGameNative.JunoActionConfig
// 0x0010 (0x0038 - 0x0028)
class UJunoActionConfig : public UObject
{
public:
	TSubclassOf<class UJunoAction>                JunoActionClass;                                   // 0x0028(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EJunoActionExecutionConfig                    JunoActionExecutionConfig;                         // 0x0030(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JunoActionConfig")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JunoActionConfig")
	}
	static class UJunoActionConfig* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoActionConfig>();
	}
};
DUMPER7_ASSERTS_UJunoActionConfig;

// Class JunoGameNative.JunoPersistenceReportGenerator
// 0x0020 (0x0048 - 0x0028)
class UJunoPersistenceReportGenerator final : public UObject
{
public:
	uint8                                         Pad_28[0x20];                                      // 0x0028(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JunoPersistenceReportGenerator")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JunoPersistenceReportGenerator")
	}
	static class UJunoPersistenceReportGenerator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoPersistenceReportGenerator>();
	}
};
DUMPER7_ASSERTS_UJunoPersistenceReportGenerator;

// Class JunoGameNative.JunoActionConfig_StaticMesh
// 0x0008 (0x0040 - 0x0038)
class UJunoActionConfig_StaticMesh final : public UJunoActionConfig
{
public:
	class UStaticMesh*                            StaticMesh;                                        // 0x0038(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JunoActionConfig_StaticMesh")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JunoActionConfig_StaticMesh")
	}
	static class UJunoActionConfig_StaticMesh* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoActionConfig_StaticMesh>();
	}
};
DUMPER7_ASSERTS_UJunoActionConfig_StaticMesh;

// Class JunoGameNative.JunoActorAttributeOverrideComponent
// 0x0018 (0x00B8 - 0x00A0)
class UJunoActorAttributeOverrideComponent final : public UFortBuildingActorTagComponent
{
public:
	struct FDataRegistryType                      AttributeOverrideDataRegistry;                     // 0x00A0(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FDataRegistryId                        DataRegistryItemId;                                // 0x00A4(0x0008)(ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_AC[0xC];                                       // 0x00AC(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class FName GetPrimaryLootTier();
	class FName GetSecondaryLootTier();
	void SetupHealthAttributeSet();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JunoActorAttributeOverrideComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JunoActorAttributeOverrideComponent")
	}
	static class UJunoActorAttributeOverrideComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoActorAttributeOverrideComponent>();
	}
};
DUMPER7_ASSERTS_UJunoActorAttributeOverrideComponent;

// Class JunoGameNative.JunoPersistenceFeatureDataActor
// 0x0040 (0x02D0 - 0x0290)
class AJunoPersistenceFeatureDataActor : public AInfo
{
public:
	uint8                                         Pad_290[0x28];                                     // 0x0290(0x0028)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGuid                                  SavedActorGuid;                                    // 0x02B8(0x0010)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         Version;                                           // 0x02C8(0x0004)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bSpawnedByLevelSaveRecord;                         // 0x02CC(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bForceDirty;                                       // 0x02CD(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bDirty;                                            // 0x02CE(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2CF[0x1];                                      // 0x02CF(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnPersistentDataModified();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JunoPersistenceFeatureDataActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JunoPersistenceFeatureDataActor")
	}
	static class AJunoPersistenceFeatureDataActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AJunoPersistenceFeatureDataActor>();
	}
};
DUMPER7_ASSERTS_AJunoPersistenceFeatureDataActor;

// Class JunoGameNative.JunoPlayspaceAccountantFeatureDataActor
// 0x0058 (0x0328 - 0x02D0)
class AJunoPlayspaceAccountantFeatureDataActor final : public AJunoPersistenceFeatureDataActor
{
public:
	uint8                                         Pad_2D0[0x8];                                      // 0x02D0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FName, int32>                      PersistentValueTable;                              // 0x02D8(0x0050)(SaveGame, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JunoPlayspaceAccountantFeatureDataActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JunoPlayspaceAccountantFeatureDataActor")
	}
	static class AJunoPlayspaceAccountantFeatureDataActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AJunoPlayspaceAccountantFeatureDataActor>();
	}
};
DUMPER7_ASSERTS_AJunoPlayspaceAccountantFeatureDataActor;

// Class JunoGameNative.JunoActorInstancesReportHandler
// 0x0028 (0x0050 - 0x0028)
class UJunoActorInstancesReportHandler final : public UObject
{
public:
	uint8                                         Pad_28[0x28];                                      // 0x0028(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JunoActorInstancesReportHandler")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JunoActorInstancesReportHandler")
	}
	static class UJunoActorInstancesReportHandler* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoActorInstancesReportHandler>();
	}
};
DUMPER7_ASSERTS_UJunoActorInstancesReportHandler;

// Class JunoGameNative.JunoPlayerCampPawnComponent
// 0x0070 (0x0110 - 0x00A0)
class UJunoPlayerCampPawnComponent final : public UActorComponent
{
public:
	uint8                                         Pad_A0[0x70];                                      // 0x00A0(0x0070)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleAwesomeLevelChanged(const struct FJunoAwesomeLevelChangeData& ChangeData);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JunoPlayerCampPawnComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JunoPlayerCampPawnComponent")
	}
	static class UJunoPlayerCampPawnComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoPlayerCampPawnComponent>();
	}
};
DUMPER7_ASSERTS_UJunoPlayerCampPawnComponent;

// Class JunoGameNative.JunoAIPersistenceFeatureDataActor
// 0x0130 (0x0400 - 0x02D0)
class AJunoAIPersistenceFeatureDataActor final : public AJunoPersistenceFeatureDataActor
{
public:
	uint8                                         Pad_2D0[0x10];                                     // 0x02D0(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSavedAIDataManager                    SavedAIData;                                       // 0x02E0(0x0120)(SaveGame, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JunoAIPersistenceFeatureDataActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JunoAIPersistenceFeatureDataActor")
	}
	static class AJunoAIPersistenceFeatureDataActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AJunoAIPersistenceFeatureDataActor>();
	}
};
DUMPER7_ASSERTS_AJunoAIPersistenceFeatureDataActor;

// Class JunoGameNative.JunoAIPersistenceFeatureDataInterface
// 0x0000 (0x0000 - 0x0000)
class IJunoAIPersistenceFeatureDataInterface final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JunoAIPersistenceFeatureDataInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JunoAIPersistenceFeatureDataInterface")
	}
	static class IJunoAIPersistenceFeatureDataInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IJunoAIPersistenceFeatureDataInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IJunoAIPersistenceFeatureDataInterface;

// Class JunoGameNative.JunoPersistenceFeatureData
// 0x0000 (0x0000 - 0x0000)
class IJunoPersistenceFeatureData final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JunoPersistenceFeatureData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JunoPersistenceFeatureData")
	}
	static class IJunoPersistenceFeatureData* GetDefaultObj()
	{
		return GetDefaultObjImpl<IJunoPersistenceFeatureData>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IJunoPersistenceFeatureData;

// Class JunoGameNative.JunoAIPersistenceFeatureModule
// 0x0000 (0x00E0 - 0x00E0)
class UJunoAIPersistenceFeatureModule final : public UPersistenceFrameworkModule
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JunoAIPersistenceFeatureModule")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JunoAIPersistenceFeatureModule")
	}
	static class UJunoAIPersistenceFeatureModule* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoAIPersistenceFeatureModule>();
	}
};
DUMPER7_ASSERTS_UJunoAIPersistenceFeatureModule;

// Class JunoGameNative.JunoBasePFWContainer
// 0x00A0 (0x01E0 - 0x0140)
class UJunoBasePFWContainer : public UPersistenceFrameworkContainer
{
public:
	uint8                                         Pad_140[0xA0];                                     // 0x0140(0x00A0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JunoBasePFWContainer")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JunoBasePFWContainer")
	}
	static class UJunoBasePFWContainer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoBasePFWContainer>();
	}
};
DUMPER7_ASSERTS_UJunoBasePFWContainer;

// Class JunoGameNative.JunoPlayerSaveData_Container
// 0x0068 (0x0248 - 0x01E0)
class UJunoPlayerSaveData_Container final : public UJunoBasePFWContainer
{
public:
	struct FPersistenceFrameworkPlayerInfo        PlayerInfo;                                        // 0x01E0(0x0020)(NativeAccessSpecifierPrivate)
	struct FUniqueNetIdRepl                       PlayerNetId;                                       // 0x0200(0x0030)(HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_230[0x18];                                     // 0x0230(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JunoPlayerSaveData_Container")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JunoPlayerSaveData_Container")
	}
	static class UJunoPlayerSaveData_Container* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoPlayerSaveData_Container>();
	}
};
DUMPER7_ASSERTS_UJunoPlayerSaveData_Container;

// Class JunoGameNative.JunoBasePFWPersistenceFeatureDataContainer
// 0x0000 (0x01E0 - 0x01E0)
class UJunoBasePFWPersistenceFeatureDataContainer : public UJunoBasePFWContainer
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JunoBasePFWPersistenceFeatureDataContainer")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JunoBasePFWPersistenceFeatureDataContainer")
	}
	static class UJunoBasePFWPersistenceFeatureDataContainer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoBasePFWPersistenceFeatureDataContainer>();
	}
};
DUMPER7_ASSERTS_UJunoBasePFWPersistenceFeatureDataContainer;

// Class JunoGameNative.JunoAIPersistenceFeatureData_Container
// 0x0000 (0x01E0 - 0x01E0)
class UJunoAIPersistenceFeatureData_Container final : public UJunoBasePFWPersistenceFeatureDataContainer
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JunoAIPersistenceFeatureData_Container")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JunoAIPersistenceFeatureData_Container")
	}
	static class UJunoAIPersistenceFeatureData_Container* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoAIPersistenceFeatureData_Container>();
	}
};
DUMPER7_ASSERTS_UJunoAIPersistenceFeatureData_Container;

// Class JunoGameNative.JunoQueryContext_Camp_Extents
// 0x0000 (0x0028 - 0x0028)
class UJunoQueryContext_Camp_Extents final : public UEnvQueryContext
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JunoQueryContext_Camp_Extents")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JunoQueryContext_Camp_Extents")
	}
	static class UJunoQueryContext_Camp_Extents* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoQueryContext_Camp_Extents>();
	}
};
DUMPER7_ASSERTS_UJunoQueryContext_Camp_Extents;

// Class JunoGameNative.JunoAlterationCraftingComponent
// 0x0010 (0x00B0 - 0x00A0)
class UJunoAlterationCraftingComponent final : public UGameFrameworkComponent
{
public:
	TWeakObjectPtr<class UCraftingObjectComponent> CachedCraftingObjectComponent;                    // 0x00A0(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FDataRegistryType                      WeaponEssenceDataRegistryType;                     // 0x00A8(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleCraftingStateChanged(const struct FCraftingObjectStateChangedEvent& Event);
	bool OnCheckValidItemType(class AFortPlayerController* Instigator);
	void OnCraftingSuccess(const struct FCraftingObjectSuccessEvent& Event);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JunoAlterationCraftingComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JunoAlterationCraftingComponent")
	}
	static class UJunoAlterationCraftingComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoAlterationCraftingComponent>();
	}
};
DUMPER7_ASSERTS_UJunoAlterationCraftingComponent;

// Class JunoGameNative.JunoAnalytics
// 0x0000 (0x0028 - 0x0028)
class UJunoAnalytics final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JunoAnalytics")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JunoAnalytics")
	}
	static class UJunoAnalytics* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoAnalytics>();
	}
};
DUMPER7_ASSERTS_UJunoAnalytics;

// Class JunoGameNative.JunoPlayspaceAccountantPersistenceFeatureData_Container
// 0x0000 (0x01E0 - 0x01E0)
class UJunoPlayspaceAccountantPersistenceFeatureData_Container final : public UJunoBasePFWPersistenceFeatureDataContainer
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JunoPlayspaceAccountantPersistenceFeatureData_Container")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JunoPlayspaceAccountantPersistenceFeatureData_Container")
	}
	static class UJunoPlayspaceAccountantPersistenceFeatureData_Container* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoPlayspaceAccountantPersistenceFeatureData_Container>();
	}
};
DUMPER7_ASSERTS_UJunoPlayspaceAccountantPersistenceFeatureData_Container;

// Class JunoGameNative.JunoAnimNotifyState_QueueInput
// 0x0068 (0x0098 - 0x0030)
class UJunoAnimNotifyState_QueueInput final : public UAnimNotifyState
{
public:
	bool                                          bQueueMantisInput;                                 // 0x0030(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  GameplayEventTagsToQueue;                          // 0x0038(0x0020)(Edit, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  AbilityTagsToRemove;                               // 0x0058(0x0020)(Edit, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  AbilityTagsToAdd;                                  // 0x0078(0x0020)(Edit, BlueprintReadOnly, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JunoAnimNotifyState_QueueInput")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JunoAnimNotifyState_QueueInput")
	}
	static class UJunoAnimNotifyState_QueueInput* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoAnimNotifyState_QueueInput>();
	}
};
DUMPER7_ASSERTS_UJunoAnimNotifyState_QueueInput;

// Class JunoGameNative.JunoAnimNotifyState_MakeInterruptible
// 0x0040 (0x0070 - 0x0030)
class UJunoAnimNotifyState_MakeInterruptible final : public UAnimNotifyState
{
public:
	struct FGameplayTagContainer                  AbilityTagsToRemove;                               // 0x0030(0x0020)(Edit, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  AbilityTagsToAdd;                                  // 0x0050(0x0020)(Edit, BlueprintReadOnly, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JunoAnimNotifyState_MakeInterruptible")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JunoAnimNotifyState_MakeInterruptible")
	}
	static class UJunoAnimNotifyState_MakeInterruptible* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoAnimNotifyState_MakeInterruptible>();
	}
};
DUMPER7_ASSERTS_UJunoAnimNotifyState_MakeInterruptible;

// Class JunoGameNative.JunoPlayerSaveDataProviderInterface
// 0x0000 (0x0000 - 0x0000)
class IJunoPlayerSaveDataProviderInterface final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JunoPlayerSaveDataProviderInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JunoPlayerSaveDataProviderInterface")
	}
	static class IJunoPlayerSaveDataProviderInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IJunoPlayerSaveDataProviderInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IJunoPlayerSaveDataProviderInterface;

// Class JunoGameNative.JunoAsyncAction_WaitForEventRouter
// 0x0030 (0x0060 - 0x0030)
class UJunoAsyncAction_WaitForEventRouter final : public UBlueprintAsyncActionBase
{
public:
	TMulticastInlineDelegate<void(class UGameplayEventRouterComponent* EventRouter)> OnGameplayEventRouterAvailable; // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_40[0x20];                                      // 0x0040(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UJunoAsyncAction_WaitForEventRouter* WaitForEventRouter(class AActor* ContextActor);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JunoAsyncAction_WaitForEventRouter")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JunoAsyncAction_WaitForEventRouter")
	}
	static class UJunoAsyncAction_WaitForEventRouter* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoAsyncAction_WaitForEventRouter>();
	}
};
DUMPER7_ASSERTS_UJunoAsyncAction_WaitForEventRouter;

// Class JunoGameNative.JunoBuilderToolSelectedActorInterface
// 0x0000 (0x0000 - 0x0000)
class IJunoBuilderToolSelectedActorInterface final
{
public:
	void ReceiveSelectionSpawnedByBuilderTool(class AJunoBuilderTool* BuilderTool, class UJunoBuilderToolInteractionBehavior* Behavior, const struct FJunoBuilderToolSelectionSpawnParams& SelectionSpawnParameters);
	void ReceiveSpawnedByBuilderTool(class AJunoBuilderTool* BuilderTool, class UJunoBuilderToolInteractionBehavior* Behavior);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JunoBuilderToolSelectedActorInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JunoBuilderToolSelectedActorInterface")
	}
	static class IJunoBuilderToolSelectedActorInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IJunoBuilderToolSelectedActorInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IJunoBuilderToolSelectedActorInterface;

// Class JunoGameNative.JunoAdventureGameplayVolume
// 0x0040 (0x0370 - 0x0330)
class AJunoAdventureGameplayVolume final : public AGameplayVolume
{
public:
	uint8                                         Pad_330[0x8];                                      // 0x0330(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bShouldPersist;                                    // 0x0338(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bDestroyLinkedPlayspaceOnEndPlay;                  // 0x0339(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_33A[0x1E];                                     // 0x033A(0x001E)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGuid                                  SavedActorGuid;                                    // 0x0358(0x0010)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_368[0x8];                                      // 0x0368(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JunoAdventureGameplayVolume")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JunoAdventureGameplayVolume")
	}
	static class AJunoAdventureGameplayVolume* GetDefaultObj()
	{
		return GetDefaultObjImpl<AJunoAdventureGameplayVolume>();
	}
};
DUMPER7_ASSERTS_AJunoAdventureGameplayVolume;

// Class JunoGameNative.JunoBuildingAccountItemDefBase
// 0x0030 (0x0770 - 0x0740)
class UJunoBuildingAccountItemDefBase : public UAthenaCosmeticItemDefinition
{
public:
	uint8                                         Pad_740[0x8];                                      // 0x0740(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftClassPtr<class UClass>                   BuildingActorClassToPreview;                       // 0x0748(0x0020)(Edit, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         JunoBuildingFrontendPreviewScale;                  // 0x0768(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_76C[0x4];                                      // 0x076C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JunoBuildingAccountItemDefBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JunoBuildingAccountItemDefBase")
	}
	static class UJunoBuildingAccountItemDefBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoBuildingAccountItemDefBase>();
	}
};
DUMPER7_ASSERTS_UJunoBuildingAccountItemDefBase;

// Class JunoGameNative.JunoBuildingSetAccountItemDefinition
// 0x0000 (0x0770 - 0x0770)
class UJunoBuildingSetAccountItemDefinition final : public UJunoBuildingAccountItemDefBase
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JunoBuildingSetAccountItemDefinition")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JunoBuildingSetAccountItemDefinition")
	}
	static class UJunoBuildingSetAccountItemDefinition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoBuildingSetAccountItemDefinition>();
	}
};
DUMPER7_ASSERTS_UJunoBuildingSetAccountItemDefinition;

// Class JunoGameNative.JunoPlayspacePersistenceComponent
// 0x0028 (0x0120 - 0x00F8)
class UJunoPlayspacePersistenceComponent : public UFortPlayspaceComponent
{
public:
	uint8                                         Pad_F8[0x8];                                       // 0x00F8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TSubclassOf<class UObject>>            RequiredPersistenceFeatureDataClasses;             // 0x0100(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, UObjectWrapper, NativeAccessSpecifierPrivate)
	TArray<struct FJunoPersistenceFeature>        PersistenceFeatures;                               // 0x0110(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JunoPlayspacePersistenceComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JunoPlayspacePersistenceComponent")
	}
	static class UJunoPlayspacePersistenceComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoPlayspacePersistenceComponent>();
	}
};
DUMPER7_ASSERTS_UJunoPlayspacePersistenceComponent;

// Class JunoGameNative.JunoRootPlayspacePersistenceComponent
// 0x0000 (0x0120 - 0x0120)
class UJunoRootPlayspacePersistenceComponent final : public UJunoPlayspacePersistenceComponent
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JunoRootPlayspacePersistenceComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JunoRootPlayspacePersistenceComponent")
	}
	static class UJunoRootPlayspacePersistenceComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoRootPlayspacePersistenceComponent>();
	}
};
DUMPER7_ASSERTS_UJunoRootPlayspacePersistenceComponent;

// Class JunoGameNative.JunoBuildingPropAccountItemDefinition
// 0x0000 (0x0770 - 0x0770)
class UJunoBuildingPropAccountItemDefinition final : public UJunoBuildingAccountItemDefBase
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JunoBuildingPropAccountItemDefinition")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JunoBuildingPropAccountItemDefinition")
	}
	static class UJunoBuildingPropAccountItemDefinition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoBuildingPropAccountItemDefinition>();
	}
};
DUMPER7_ASSERTS_UJunoBuildingPropAccountItemDefinition;

// Class JunoGameNative.JunoBuildingConnectivityBlueprintLibrary
// 0x0000 (0x0028 - 0x0028)
class UJunoBuildingConnectivityBlueprintLibrary final : public UBlueprintFunctionLibrary
{
public:
	static void DebugDrawConnectionLocations(const class UObject* WorldContextObject, const struct FJunoBuildingConnection& Connection);
	static void DebugDrawConnections(const class UObject* WorldContextObject, const struct FJunoBuildingConnectionPointsResult& Candidates, const struct FJunoBuildingConnectionPointsResult& Targets, const struct FJunoBuildingConnection& ChosenConnection, const TArray<struct FJunoBuildingConnection>& Connections);
	static TArray<class UAtomModelAssetUserData*> GetAtomModelAssetUserData(const class UObject* Object);
	static TArray<struct FJunoBuildingConnectionPoint> GetKnobs(const struct FJunoBuildingConnectionPointsResult& Result);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JunoBuildingConnectivityBlueprintLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JunoBuildingConnectivityBlueprintLibrary")
	}
	static class UJunoBuildingConnectivityBlueprintLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoBuildingConnectivityBlueprintLibrary>();
	}
};
DUMPER7_ASSERTS_UJunoBuildingConnectivityBlueprintLibrary;

// Class JunoGameNative.JunoGameFeatureAction_AddJunoAnalytics
// 0x0008 (0x0030 - 0x0028)
class UJunoGameFeatureAction_AddJunoAnalytics final : public UGameFeatureAction
{
public:
	class UJunoAnalytics*                         JunoAnalytics;                                     // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JunoGameFeatureAction_AddJunoAnalytics")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JunoGameFeatureAction_AddJunoAnalytics")
	}
	static class UJunoGameFeatureAction_AddJunoAnalytics* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoGameFeatureAction_AddJunoAnalytics>();
	}
};
DUMPER7_ASSERTS_UJunoGameFeatureAction_AddJunoAnalytics;

// Class JunoGameNative.JunoBuildingCosmeticsSettings
// 0x00D8 (0x0108 - 0x0030)
class UJunoBuildingCosmeticsSettings final : public UPrimaryDataAsset
{
public:
	TSoftClassPtr<class UClass>                   JunoBuildingSetPreviewActorClass;                  // 0x0030(0x0020)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UClass>                   JunoBuildingPropPreviewActorClass;                 // 0x0050(0x0020)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UClass>                   JunoBuildingSetPreviewPrefabAssetClass;            // 0x0070(0x0020)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UClass>                   JunoBuildingPropPreviewPrefabAssetClass;           // 0x0090(0x0020)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           BuildingPartCategoryTag;                           // 0x00B0(0x0004)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           BuildingPartSubCategoryTag;                        // 0x00B4(0x0004)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<struct FGameplayTag, class FText>        PartCategoryNames;                                 // 0x00B8(0x0050)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JunoBuildingCosmeticsSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JunoBuildingCosmeticsSettings")
	}
	static class UJunoBuildingCosmeticsSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoBuildingCosmeticsSettings>();
	}
};
DUMPER7_ASSERTS_UJunoBuildingCosmeticsSettings;

// Class JunoGameNative.JunoBuildingPreviewPrefabAsset
// 0x00D0 (0x0360 - 0x0290)
class AJunoBuildingPreviewPrefabAsset final : public AActor
{
public:
	uint8                                         Pad_290[0x10];                                     // 0x0290(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortUICameraFrameTargetBounds         CameraFrameTargetBounds;                           // 0x02A0(0x0020)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	float                                         ZoomedInBoundsScale;                               // 0x02C0(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2C4[0x9C];                                     // 0x02C4(0x009C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JunoBuildingPreviewPrefabAsset")
	}
	static const class FName& StaticName()
	{
