#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: JunoProceduralLandscape

#include "Basic.hpp"

#include "JunoProceduralLandscape_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class JunoProceduralLandscape.JunoLandscapeCombinedMaterial
// 0x00A8 (0x00D0 - 0x0028)
class UJunoLandscapeCombinedMaterial final : public UObject
{
public:
	TArray<class FName>                           LayerNames;                                        // 0x0028(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<class ULandscapeLayerInfoObject*>      LandscapeInfos;                                    // 0x0038(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate)
	class UMaterialInstanceConstant*              MaterialBase;                                      // 0x0048(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UJunoLandscapeMaterialInstanceConstant* CPUReadbackMaterialBase;                           // 0x0050(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TMap<struct FJunoLandscapeMaterialInstanceCacheKey, struct FJunoLandscapeCombinedMaterialInstance> MaterialInstances; // 0x0058(0x0050)(NativeAccessSpecifierPrivate)
	TArray<struct FJunoLandscapeGrassAndPhysics>  GrassAndPhysicsTypes;                              // 0x00A8(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_B8[0x18];                                      // 0x00B8(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JunoLandscapeCombinedMaterial")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JunoLandscapeCombinedMaterial")
	}
	static class UJunoLandscapeCombinedMaterial* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoLandscapeCombinedMaterial>();
	}
};
DUMPER7_ASSERTS_UJunoLandscapeCombinedMaterial;

// Class JunoProceduralLandscape.JunoLandscapeExternalMaterialsCollector
// 0x0000 (0x0028 - 0x0028)
class UJunoLandscapeExternalMaterialsCollector : public UObject
{
public:
	void CollectExternalMaterials(class UJunoLandscapeLayersData* LayerData, bool bInlcudeMobile, bool bIncludeStandard);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JunoLandscapeExternalMaterialsCollector")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JunoLandscapeExternalMaterialsCollector")
	}
	static class UJunoLandscapeExternalMaterialsCollector* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoLandscapeExternalMaterialsCollector>();
	}
};
DUMPER7_ASSERTS_UJunoLandscapeExternalMaterialsCollector;

// Class JunoProceduralLandscape.JunoLandscapeGeneratorInterface
// 0x0000 (0x0000 - 0x0000)
class IJunoLandscapeGeneratorInterface final
{
public:
	class UJunoLandscapeRenderTarget* GenerateLandscape(bool bRenderHeightmap, class FName WeightmapName);
	void Initialize(class UJunoLandscapeRenderer* LandscapeRenderer);

	TArray<class FName> GetAffectedWeightmapLayers() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JunoLandscapeGeneratorInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JunoLandscapeGeneratorInterface")
	}
	static class IJunoLandscapeGeneratorInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IJunoLandscapeGeneratorInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IJunoLandscapeGeneratorInterface;

// Class JunoProceduralLandscape.JunoLandscapeMaterial
// 0x0060 (0x0088 - 0x0028)
class UJunoLandscapeMaterial final : public UObject
{
public:
	class UMaterialInterface*                     Parent;                                            // 0x0028(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, AssetRegistrySearchable, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInstanceDynamic*               MaterialInstanceDynamic;                           // 0x0030(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FName, class UJunoLandscapeRenderTarget*> TextureProperties;                          // 0x0038(0x0050)(UObjectWrapper, NativeAccessSpecifierPublic)

public:
	float K2_GetScalarParameterValue(class FName ParameterName);
	struct FLinearColor K2_GetVectorParameterValue(class FName ParameterName);
	void SetDoubleVectorParameterValue(class FName ParameterName, const struct FVector4& Value);
	void SetJunoTextureParameterValue(class FName ParameterName, class UTextureRenderTarget2D* Value);
	void SetRenderTargetParameterValue(class FName ParameterName, class UJunoLandscapeRenderTarget* Value);
	void SetScalarParameterValue(class FName ParameterName, float Value);
	void SetTextureParameterValue(class FName ParameterName, class UTexture* Value);
	void SetVectorParameterValue(class FName ParameterName, const struct FLinearColor& Value);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JunoLandscapeMaterial")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JunoLandscapeMaterial")
	}
	static class UJunoLandscapeMaterial* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoLandscapeMaterial>();
	}
};
DUMPER7_ASSERTS_UJunoLandscapeMaterial;

// Class JunoProceduralLandscape.JunoLandscapeMaterialInstanceConstant
// 0x0000 (0x0260 - 0x0260)
class UJunoLandscapeMaterialInstanceConstant final : public UMaterialInstanceConstant
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JunoLandscapeMaterialInstanceConstant")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JunoLandscapeMaterialInstanceConstant")
	}
	static class UJunoLandscapeMaterialInstanceConstant* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoLandscapeMaterialInstanceConstant>();
	}
};
DUMPER7_ASSERTS_UJunoLandscapeMaterialInstanceConstant;

// Class JunoProceduralLandscape.JunoLandscapeCustomMaterial
// 0x0058 (0x0280 - 0x0228)
class UJunoLandscapeCustomMaterial final : public UMaterial
{
public:
	uint8                                         Pad_228[0x58];                                     // 0x0228(0x0058)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JunoLandscapeCustomMaterial")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JunoLandscapeCustomMaterial")
	}
	static class UJunoLandscapeCustomMaterial* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoLandscapeCustomMaterial>();
	}
};
DUMPER7_ASSERTS_UJunoLandscapeCustomMaterial;

// Class JunoProceduralLandscape.JunoLandscapeDynamicCustomMaterial
// 0x0060 (0x0088 - 0x0028)
class UJunoLandscapeDynamicCustomMaterial final : public UObject
{
public:
	class UMaterialInstanceDynamic*               WrappedMaterial;                                   // 0x0028(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UTexture*                               Heightmap;                                         // 0x0030(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TMap<class FString, class UTexture*>          WeightMaps;                                        // 0x0038(0x0050)(UObjectWrapper, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JunoLandscapeDynamicCustomMaterial")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JunoLandscapeDynamicCustomMaterial")
	}
	static class UJunoLandscapeDynamicCustomMaterial* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoLandscapeDynamicCustomMaterial>();
	}
};
DUMPER7_ASSERTS_UJunoLandscapeDynamicCustomMaterial;

// Class JunoProceduralLandscape.JunoLandscapeComponent
// 0x0260 (0x0480 - 0x0220)
class UJunoLandscapeComponent final : public USceneComponent
{
public:
	class UMaterialInstanceDynamic*               RenderMaterial;                                    // 0x0220(0x0008)(Edit, ZeroConstructor, EditConst, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ALandscapeProxy*                        PairedLandscape;                                   // 0x0228(0x0008)(Edit, ZeroConstructor, EditConst, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ULandscapeComponent*                    LandscapeComponent;                                // 0x0230(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ULandscapeHeightfieldCollisionComponent* LandscapeCollisionComponent;                      // 0x0238(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_240[0x8];                                      // 0x0240(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBox                                   CachedLocalBox;                                    // 0x0248(0x0038)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FIntPoint                              ComponentKey;                                      // 0x0280(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FIntPoint                              ComponentBase;                                     // 0x0288(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FJunoLandscapeComponentPrecachSettings ServerPrecacheSettings;                            // 0x0290(0x0005)(Edit, EditConst, NoDestructor, NativeAccessSpecifierPublic)
	struct FJunoLandscapeComponentPrecachSettings ClientPrecacheSettings;                            // 0x0295(0x0005)(Edit, EditConst, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_29A[0x3E];                                     // 0x029A(0x003E)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ULandscapeGrassType*>            SerializedGrassReferences;                         // 0x02D8(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate)
	TArray<class UPhysicalMaterial*>              SerializedPhysicalMaterials;                       // 0x02E8(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate)
	TArray<class FName>                           SerializedWeightmaps;                              // 0x02F8(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<struct FJunoLandscapeCustomRenderIdentifier> SerializedCustomRenders;                     // 0x0308(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_318[0x140];                                    // 0x0318(0x0140)(Fixing Size After Last Property [ Dumper-7 ])
	struct FIntPoint                              SubTextureOffset;                                  // 0x0458(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FIntPoint                              SubTextureSize;                                    // 0x0460(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         ComponentQuadSize;                                 // 0x0468(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         ComponentVertSize;                                 // 0x046C(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_470[0x10];                                     // 0x0470(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JunoLandscapeComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JunoLandscapeComponent")
	}
	static class UJunoLandscapeComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoLandscapeComponent>();
	}
};
DUMPER7_ASSERTS_UJunoLandscapeComponent;

// Class JunoProceduralLandscape.JunoLandscapeLayersData
// 0x01F0 (0x0220 - 0x0030)
class UJunoLandscapeLayersData final : public UPrimaryDataAsset
{
public:
	TSubclassOf<class UJunoLandscapeExternalMaterialsCollector> ExternalMaterialGatherer;            // 0x0030(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterial*                              LandscapeMaterial;                                 // 0x0038(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FName, class ULandscapeLayerInfoObject*> AllLayerInfos;                               // 0x0040(0x0050)(Edit, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<class FString>                         LayerInfoDirectories;                              // 0x0090(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class FName>                           Biomes;                                            // 0x00A0(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FJunoLandscapeLayersGroup>      LayerGroups;                                       // 0x00B0(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class FName>                           SortedLayerNames;                                  // 0x00C0(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	TArray<class ULandscapeLayerInfoObject*>      SortedLayerInfos;                                  // 0x00D0(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	struct FJunoLandscapeMaterialCache            AllMaterials;                                      // 0x00E0(0x00A0)(NativeAccessSpecifierPrivate)
	TMap<class FName, uint32>                     LayerNameToIndex;                                  // 0x0180(0x0050)(NativeAccessSpecifierPrivate)
	uint8                                         Pad_1D0[0x50];                                     // 0x01D0(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void UpdateExternalMaterials();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JunoLandscapeLayersData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JunoLandscapeLayersData")
	}
	static class UJunoLandscapeLayersData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoLandscapeLayersData>();
	}
};
DUMPER7_ASSERTS_UJunoLandscapeLayersData;

// Class JunoProceduralLandscape.JunoLandscapeManager
// 0x0570 (0x05B0 - 0x0040)
class alignas(0x10) UJunoLandscapeManager final : public UTickableWorldSubsystem
{
public:
	uint8                                         Pad_40[0xC8];                                      // 0x0040(0x00C8)(Fixing Size After Last Property [ Dumper-7 ])
	class ALandscape*                             Landscape;                                         // 0x0108(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_110[0x20];                                     // 0x0110(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<struct FIntPoint, class UJunoLandscapeComponent*> ExistingComponents;                       // 0x0130(0x0050)(ExportObject, Transient, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPrivate)
	TMap<class UPrimitiveComponent*, class UJunoLandscapeComponent*> ExternalComponents;             // 0x0180(0x0050)(ExportObject, Transient, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPrivate)
	class UMaterialInterface*                     DebugMaterial;                                     // 0x01D0(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1D8[0x398];                                    // 0x01D8(0x0398)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     LandscapeMaterial;                                 // 0x0570(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UJunoLandscapeLayersData*               LayersData;                                        // 0x0578(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_580[0x30];                                     // 0x0580(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JunoLandscapeManager")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JunoLandscapeManager")
	}
	static class UJunoLandscapeManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoLandscapeManager>();
	}
};
DUMPER7_ASSERTS_UJunoLandscapeManager;

// Class JunoProceduralLandscape.JunoLandscapeGenerationItems
// 0x0010 (0x0040 - 0x0030)
class UJunoLandscapeGenerationItems final : public UPrimaryDataAsset
{
public:
	TArray<struct FJunoLandscapeGenerationData>   GenerationData;                                    // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JunoLandscapeGenerationItems")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JunoLandscapeGenerationItems")
	}
	static class UJunoLandscapeGenerationItems* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoLandscapeGenerationItems>();
	}
};
DUMPER7_ASSERTS_UJunoLandscapeGenerationItems;

// Class JunoProceduralLandscape.MaterialExpressionIsPreviousTileLocation_Juno
// 0x0028 (0x00D8 - 0x00B0)
class UMaterialExpressionIsPreviousTileLocation_Juno final : public UMaterialExpression
{
public:
	struct FExpressionInput                       TileMipSize;                                       // 0x00B0(0x0028)(NoDestructor, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MaterialExpressionIsPreviousTileLocation_Juno")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MaterialExpressionIsPreviousTileLocation_Juno")
	}
	static class UMaterialExpressionIsPreviousTileLocation_Juno* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMaterialExpressionIsPreviousTileLocation_Juno>();
	}
};
DUMPER7_ASSERTS_UMaterialExpressionIsPreviousTileLocation_Juno;

// Class JunoProceduralLandscape.MaterialExpressionGetTileMin_Juno
// 0x0078 (0x0128 - 0x00B0)
class UMaterialExpressionGetTileMin_Juno final : public UMaterialExpression
{
public:
	struct FExpressionInput                       TileSize;                                          // 0x00B0(0x0028)(NoDestructor, NativeAccessSpecifierPrivate)
	struct FExpressionInput                       TileMin;                                           // 0x00D8(0x0028)(NoDestructor, NativeAccessSpecifierPrivate)
	struct FExpressionInput                       TileMipSize;                                       // 0x0100(0x0028)(NoDestructor, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MaterialExpressionGetTileMin_Juno")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MaterialExpressionGetTileMin_Juno")
	}
	static class UMaterialExpressionGetTileMin_Juno* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMaterialExpressionGetTileMin_Juno>();
	}
};
DUMPER7_ASSERTS_UMaterialExpressionGetTileMin_Juno;

// Class JunoProceduralLandscape.MaterialExpressionGetUV_Juno
// 0x0028 (0x00D8 - 0x00B0)
class UMaterialExpressionGetUV_Juno final : public UMaterialExpression
{
public:
	struct FExpressionInput                       TileMipSize;                                       // 0x00B0(0x0028)(NoDestructor, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MaterialExpressionGetUV_Juno")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MaterialExpressionGetUV_Juno")
	}
	static class UMaterialExpressionGetUV_Juno* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMaterialExpressionGetUV_Juno>();
	}
};
DUMPER7_ASSERTS_UMaterialExpressionGetUV_Juno;

// Class JunoProceduralLandscape.MaterialExpressionGetGlobalKey_Juno
// 0x0078 (0x0128 - 0x00B0)
class UMaterialExpressionGetGlobalKey_Juno final : public UMaterialExpression
{
public:
	struct FExpressionInput                       TileSize;                                          // 0x00B0(0x0028)(NoDestructor, NativeAccessSpecifierPrivate)
	struct FExpressionInput                       TileMin;                                           // 0x00D8(0x0028)(NoDestructor, NativeAccessSpecifierPrivate)
	struct FExpressionInput                       TileMipSize;                                       // 0x0100(0x0028)(NoDestructor, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MaterialExpressionGetGlobalKey_Juno")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MaterialExpressionGetGlobalKey_Juno")
	}
	static class UMaterialExpressionGetGlobalKey_Juno* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMaterialExpressionGetGlobalKey_Juno>();
	}
};
DUMPER7_ASSERTS_UMaterialExpressionGetGlobalKey_Juno;

// Class JunoProceduralLandscape.MaterialExpressionGetGlobalKeyScaled_Juno
// 0x00A0 (0x0150 - 0x00B0)
class UMaterialExpressionGetGlobalKeyScaled_Juno final : public UMaterialExpression
{
public:
	struct FExpressionInput                       TileSize;                                          // 0x00B0(0x0028)(NoDestructor, NativeAccessSpecifierPrivate)
	struct FExpressionInput                       TileMin;                                           // 0x00D8(0x0028)(NoDestructor, NativeAccessSpecifierPrivate)
	struct FExpressionInput                       TileMipSize;                                       // 0x0100(0x0028)(NoDestructor, NativeAccessSpecifierPrivate)
	struct FExpressionInput                       LandscapeScale;                                    // 0x0128(0x0028)(NoDestructor, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MaterialExpressionGetGlobalKeyScaled_Juno")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MaterialExpressionGetGlobalKeyScaled_Juno")
	}
	static class UMaterialExpressionGetGlobalKeyScaled_Juno* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMaterialExpressionGetGlobalKeyScaled_Juno>();
	}
};
DUMPER7_ASSERTS_UMaterialExpressionGetGlobalKeyScaled_Juno;

// Class JunoProceduralLandscape.MaterialExpressionLandscapeOutputPassPreInit
// 0x0008 (0x00B8 - 0x00B0)
class UMaterialExpressionLandscapeOutputPassPreInit final : public UMaterialExpressionCustomOutput
{
public:
	class UMaterialExpressionLandscapeOutputPass* OutputPassExpressions;                             // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MaterialExpressionLandscapeOutputPassPreInit")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MaterialExpressionLandscapeOutputPassPreInit")
	}
	static class UMaterialExpressionLandscapeOutputPassPreInit* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMaterialExpressionLandscapeOutputPassPreInit>();
	}
};
DUMPER7_ASSERTS_UMaterialExpressionLandscapeOutputPassPreInit;

// Class JunoProceduralLandscape.MaterialExpressionLandscapeOutputPass
// 0x0058 (0x0108 - 0x00B0)
class UMaterialExpressionLandscapeOutputPass final : public UMaterialExpressionCustomOutput
{
public:
	class UMaterialExpressionCustomOutput*        GrassMaterialExpression;                           // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UMaterialExpressionCustomOutput*        PhysicsMaterialExpression;                         // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_C0[0x48];                                      // 0x00C0(0x0048)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MaterialExpressionLandscapeOutputPass")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MaterialExpressionLandscapeOutputPass")
	}
	static class UMaterialExpressionLandscapeOutputPass* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMaterialExpressionLandscapeOutputPass>();
	}
};
DUMPER7_ASSERTS_UMaterialExpressionLandscapeOutputPass;

// Class JunoProceduralLandscape.MaterialExpressionJunoLandscapeDynamicLayerSample
// 0x0018 (0x00C8 - 0x00B0)
class UMaterialExpressionJunoLandscapeDynamicLayerSample final : public UMaterialExpression
{
public:
	class FName                                   ParameterName;                                     // 0x00B0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         PreviewWeight;                                     // 0x00B4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_B8[0xC];                                       // 0x00B8(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         PreviewMip;                                        // 0x00C4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MaterialExpressionJunoLandscapeDynamicLayerSample")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MaterialExpressionJunoLandscapeDynamicLayerSample")
	}
	static class UMaterialExpressionJunoLandscapeDynamicLayerSample* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMaterialExpressionJunoLandscapeDynamicLayerSample>();
	}
};
DUMPER7_ASSERTS_UMaterialExpressionJunoLandscapeDynamicLayerSample;

// Class JunoProceduralLandscape.MaterialExpressionJunoLandscapeDynamicHeightSample
// 0x0030 (0x00E0 - 0x00B0)
class UMaterialExpressionJunoLandscapeDynamicHeightSample final : public UMaterialExpression
{
public:
	struct FExpressionInput                       XYOffset;                                          // 0x00B0(0x0028)(NoDestructor, NativeAccessSpecifierPublic)
	int32                                         PreviewMip;                                        // 0x00D8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MaterialExpressionJunoLandscapeDynamicHeightSample")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MaterialExpressionJunoLandscapeDynamicHeightSample")
	}
	static class UMaterialExpressionJunoLandscapeDynamicHeightSample* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMaterialExpressionJunoLandscapeDynamicHeightSample>();
	}
};
DUMPER7_ASSERTS_UMaterialExpressionJunoLandscapeDynamicHeightSample;

// Class JunoProceduralLandscape.MaterialExpressionJunoLandscapeCustomOutput
// 0x0050 (0x0100 - 0x00B0)
class UMaterialExpressionJunoLandscapeCustomOutput final : public UMaterialExpressionCustomOutput
{
public:
	struct FExpressionInput                       Result;                                            // 0x00B0(0x0028)(NoDestructor, NativeAccessSpecifierPrivate)
	struct FExpressionInput                       CustomMipResult;                                   // 0x00D8(0x0028)(NoDestructor, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MaterialExpressionJunoLandscapeCustomOutput")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MaterialExpressionJunoLandscapeCustomOutput")
	}
	static class UMaterialExpressionJunoLandscapeCustomOutput* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMaterialExpressionJunoLandscapeCustomOutput>();
	}
};
DUMPER7_ASSERTS_UMaterialExpressionJunoLandscapeCustomOutput;

// Class JunoProceduralLandscape.MaterialExpressionJunoLandscapeCustomOutputProxy
// 0x0000 (0x00B0 - 0x00B0)
class UMaterialExpressionJunoLandscapeCustomOutputProxy final : public UMaterialExpression
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MaterialExpressionJunoLandscapeCustomOutputProxy")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MaterialExpressionJunoLandscapeCustomOutputProxy")
	}
	static class UMaterialExpressionJunoLandscapeCustomOutputProxy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMaterialExpressionJunoLandscapeCustomOutputProxy>();
	}
};
DUMPER7_ASSERTS_UMaterialExpressionJunoLandscapeCustomOutputProxy;

// Class JunoProceduralLandscape.MaterialExpressionJunoLandscapeCustomMaterialSampleParentMIP
// 0x0030 (0x00E0 - 0x00B0)
class UMaterialExpressionJunoLandscapeCustomMaterialSampleParentMIP final : public UMaterialExpression
{
public:
	struct FExpressionInput                       UV;                                                // 0x00B0(0x0028)(NoDestructor, NativeAccessSpecifierPublic)
	class UMaterialExpressionCustom*              CustomExpression;                                  // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MaterialExpressionJunoLandscapeCustomMaterialSampleParentMIP")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MaterialExpressionJunoLandscapeCustomMaterialSampleParentMIP")
	}
	static class UMaterialExpressionJunoLandscapeCustomMaterialSampleParentMIP* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMaterialExpressionJunoLandscapeCustomMaterialSampleParentMIP>();
	}
};
DUMPER7_ASSERTS_UMaterialExpressionJunoLandscapeCustomMaterialSampleParentMIP;

// Class JunoProceduralLandscape.MaterialExpressionJunoLandscapeCustomMaterialGetUVOffset
// 0x0058 (0x0108 - 0x00B0)
class UMaterialExpressionJunoLandscapeCustomMaterialGetUVOffset final : public UMaterialExpression
{
public:
	struct FExpressionInput                       UV;                                                // 0x00B0(0x0028)(NoDestructor, NativeAccessSpecifierPublic)
	struct FExpressionInput                       ScaledOffset;                                      // 0x00D8(0x0028)(NoDestructor, NativeAccessSpecifierPublic)
	class UMaterialExpressionCustom*              CustomExpression;                                  // 0x0100(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MaterialExpressionJunoLandscapeCustomMaterialGetUVOffset")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MaterialExpressionJunoLandscapeCustomMaterialGetUVOffset")
	}
	static class UMaterialExpressionJunoLandscapeCustomMaterialGetUVOffset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMaterialExpressionJunoLandscapeCustomMaterialGetUVOffset>();
	}
};
DUMPER7_ASSERTS_UMaterialExpressionJunoLandscapeCustomMaterialGetUVOffset;

// Class JunoProceduralLandscape.JunoLandscapeRenderer
// 0x0090 (0x00B8 - 0x0028)
class UJunoLandscapeRenderer final : public UObject
{
public:
	class UJunoLandscapeMaterial*                 LandscapeMaterial;                                 // 0x0028(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_30[0x18];                                      // 0x0030(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class UWorld*                                 World;                                             // 0x0048(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TMap<class FName, class UJunoLandscapeRenderTarget*> RenderTargets;                              // 0x0050(0x0050)(Edit, Transient, EditConst, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                         Pad_A0[0x18];                                      // 0x00A0(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BeginDrawCanvasToRenderTarget(class UJunoLandscapeRenderTarget* TextureRenderTarget, class UJunoLandscapeCanvas** Canvas, struct FVector2D* Size, struct FDrawToRenderTargetContext_JunoLandscape* Context);
	void ClearRenderTarget2D(class UJunoLandscapeRenderTarget* TextureRenderTarget, const struct FLinearColor& ClearColor);
	class UJunoLandscapeMaterial* CreateMaterial(class UMaterialInterface* Parent, class FName OptionalName, EMIDCreationFlags CreationFlags);
	class UJunoLandscapeRenderTarget* CreateRenderTarget2D(int32 Width, int32 Height, ETextureRenderTargetFormat Format, const struct FLinearColor& ClearColor, bool bAutoGenerateMipMaps);
	void DrawMaterialToRenderTarget(class UJunoLandscapeRenderTarget* TextureRenderTarget, class UJunoLandscapeMaterial* Material);
	void DrawMaterialToRenderTargetUV(class UJunoLandscapeRenderTarget* RenderTarget, class UJunoLandscapeMaterial* RenderMaterial, const struct FVector2D& ScreenPosition, const struct FVector2D& ScreenSize, const struct FVector2D& CoordinatePosition, const struct FVector2D& CoordinateSize, float Rotation, const struct FVector2D& PivotPoint);
	void EndDrawCanvasToRenderTarget(const struct FDrawToRenderTargetContext_JunoLandscape& Context);
	class UJunoLandscapeRenderTarget* FindOrCreateNamedRenderTarget(class FName Name_0, ETextureRenderTargetFormat Format);
	void SetLandscapeMaterialScalarParameterValue(class FName ParameterName, float Value);
	void SetLandscapeMaterialTextureParameterValue(class FName ParameterName, class UJunoLandscapeRenderTarget* Value);
	void SetLandscapeMaterialVectorParameterValue(class FName ParameterName, const struct FLinearColor& Value);

	struct FBox2D CalculateRenderArea(const struct FTransform& Transform, const struct FVector2D& HalfExtents) const;
	class UJunoLandscapeRenderTarget* GetOutputHeightmapRenderTarget() const;
	struct FVector4 GetUVWorldTransform() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JunoLandscapeRenderer")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JunoLandscapeRenderer")
	}
	static class UJunoLandscapeRenderer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoLandscapeRenderer>();
	}
};
DUMPER7_ASSERTS_UJunoLandscapeRenderer;

// Class JunoProceduralLandscape.JunoLandscapeRenderTarget
// 0x0008 (0x0030 - 0x0028)
class UJunoLandscapeRenderTarget final : public UObject
{
public:
	class FName                                   ID;                                                // 0x0028(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETextureRenderTargetFormat                    Format;                                            // 0x002C(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JunoLandscapeRenderTarget")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JunoLandscapeRenderTarget")
	}
	static class UJunoLandscapeRenderTarget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoLandscapeRenderTarget>();
	}
};
DUMPER7_ASSERTS_UJunoLandscapeRenderTarget;

// Class JunoProceduralLandscape.JunoLandscapeCanvas
// 0x0010 (0x0038 - 0x0028)
class UJunoLandscapeCanvas final : public UObject
{
public:
	class UJunoLandscapeRenderTarget*             RenderTarget;                                      // 0x0028(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UJunoLandscapeRenderer*                 Renderer;                                          // 0x0030(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class FName GetNameReplacement(class FName NameIn);

	void DrawMaterial(class UJunoLandscapeMaterial* RenderMaterial, const struct FVector2D& ScreenPosition, const struct FVector2D& ScreenSize, const struct FVector2D& CoordinatePosition, const struct FVector2D& CoordinateSize, float Rotation, const struct FVector2D& PivotPoint);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JunoLandscapeCanvas")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JunoLandscapeCanvas")
	}
	static class UJunoLandscapeCanvas* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoLandscapeCanvas>();
	}
};
DUMPER7_ASSERTS_UJunoLandscapeCanvas;

}

