#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: JunoGameMobileUI

#include "Basic.hpp"

#include "DynamicBacchusHUD_classes.hpp"
#include "FortniteUI_classes.hpp"
#include "JunoGameNative_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK
{

// Class JunoGameMobileUI.FortMobileButtonBehaviorComponent_OffhandVisuals
// 0x0020 (0x0068 - 0x0048)
class UFortMobileButtonBehaviorComponent_OffhandVisuals final : public UFortMobileButtonBehaviorComponent_Visibility
{
public:
	uint8                                         Pad_48[0x18];                                      // 0x0048(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortItem*                              CachedOffhandItem;                                 // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void HandleInventoryItemChanged(const struct FJunoItemSlot& ItemSlot, const EJunoItemChangeType ChangeType);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortMobileButtonBehaviorComponent_OffhandVisuals")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortMobileButtonBehaviorComponent_OffhandVisuals")
	}
	static class UFortMobileButtonBehaviorComponent_OffhandVisuals* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortMobileButtonBehaviorComponent_OffhandVisuals>();
	}
};
DUMPER7_ASSERTS_UFortMobileButtonBehaviorComponent_OffhandVisuals;

// Class JunoGameMobileUI.JunoMobileActionButtonBehavior_Interact
// 0x0000 (0x0138 - 0x0138)
class UJunoMobileActionButtonBehavior_Interact final : public UFortMobileActionButtonBehavior
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JunoMobileActionButtonBehavior_Interact")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JunoMobileActionButtonBehavior_Interact")
	}
	static class UJunoMobileActionButtonBehavior_Interact* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoMobileActionButtonBehavior_Interact>();
	}
};
DUMPER7_ASSERTS_UJunoMobileActionButtonBehavior_Interact;

// Class JunoGameMobileUI.JunoGameDynamicMobileUIDirector
// 0x00D0 (0x0548 - 0x0478)
class AJunoGameDynamicMobileUIDirector final : public ADynamicBacchusHUDDirector
{
public:
	uint8                                         Pad_478[0x20];                                     // 0x0478(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  HUDTagsToSkip;                                     // 0x0498(0x0020)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	class FText                                   ForcedPresetName;                                  // 0x04B8(0x0018)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FGameplayTag                           ForcedProfile;                                     // 0x04D0(0x0004)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FGameplayTag                           ForcedProfileContainer;                            // 0x04D4(0x0004)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TMap<struct FGameplayTag, class UDynamicUIScene*> HUDContextVisibilityTagToScene;                // 0x04D8(0x0050)(Edit, DisableEditOnInstance, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                         Pad_528[0x20];                                     // 0x0528(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BP_OnBuildingModeChanged(const struct FJunoEvent_BuildingModeChanged& Event);
	void UpdateHUDLayoutContexts(const struct FGameplayTagContainer& ContextsToAdd, const struct FGameplayTagContainer& ContextsToRemove);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JunoGameDynamicMobileUIDirector")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JunoGameDynamicMobileUIDirector")
	}
	static class AJunoGameDynamicMobileUIDirector* GetDefaultObj()
	{
		return GetDefaultObjImpl<AJunoGameDynamicMobileUIDirector>();
	}
};
DUMPER7_ASSERTS_AJunoGameDynamicMobileUIDirector;

}

