#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: JunoWorldManagement

#include "Basic.hpp"

#include "JsonUtilities_structs.hpp"


namespace SDK
{

// Enum JunoWorldManagement.EJunoWorldOccupantKind
// NumValues: 0x0005
enum class EJunoWorldOccupantKind : uint8
{
	Owner                                    = 0,
	Keyholder                                = 1,
	Guest                                    = 2,
	Count                                    = 3,
	EJunoWorldOccupantKind_MAX               = 4,
};

// Enum JunoWorldManagement.EJunoWorldMetadataVersion
// NumValues: 0x0005
enum class EJunoWorldMetadataVersion : uint8
{
	Initial                                  = 0,
	GameplayPropertiesConvertedToArray       = 1,
	LastPlusOne                              = 2,
	Current                                  = 1,
	EJunoWorldMetadataVersion_MAX            = 3,
};

// Enum JunoWorldManagement.EJunoWorldSettingOptions_BuildMode
// NumValues: 0x0003
enum class EJunoWorldSettingOptions_BuildMode : uint8
{
	Survival                                 = 0,
	Sandbox                                  = 1,
	EJunoWorldSettingOptions_MAX             = 2,
};

// Enum JunoWorldManagement.EJunoWorldSettingOptions_CreatureActivation
// NumValues: 0x0003
enum class EJunoWorldSettingOptions_CreatureActivation : uint8
{
	On                                       = 0,
	Off                                      = 1,
	EJunoWorldSettingOptions_MAX             = 2,
};

// Enum JunoWorldManagement.EJunoWorldSettingOptions_WorldSwitch
// NumValues: 0x0003
enum class EJunoWorldSettingOptions_WorldSwitch : uint8
{
	On                                       = 0,
	Off                                      = 1,
	EJunoWorldSettingOptions_MAX             = 2,
};

// ScriptStruct JunoWorldManagement.JunoWorldSysMetadata
// 0x0018 (0x0018 - 0x0000)
struct FJunoWorldSysMetadata final
{
public:
	class FString                                 McpBackend;                                        // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         DeltasRevisionIndex;                               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FJunoWorldSysMetadata;

// ScriptStruct JunoWorldManagement.JunoWorldGameplayProperty
// 0x0018 (0x0018 - 0x0000)
struct FJunoWorldGameplayProperty final
{
public:
	class FString                                 ID;                                                // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Value;                                             // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FJunoWorldGameplayProperty;

// ScriptStruct JunoWorldManagement.JunoWorldGameMetadata
// 0x0058 (0x0058 - 0x0000)
struct FJunoWorldGameMetadata final
{
public:
	int32                                         PersistenceVersion;                                // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         AdventureSeed;                                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Title;                                             // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 MapName;                                           // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FJunoWorldGameplayProperty>     GameplayProperties;                                // 0x0028(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	struct FJsonObjectWrapper                     DevProperties;                                     // 0x0038(0x0020)(NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FJunoWorldGameMetadata;

// ScriptStruct JunoWorldManagement.JunoWorldMetadata
// 0x0088 (0x0088 - 0x0000)
struct FJunoWorldMetadata final
{
public:
	class FString                                 ID;                                                // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FJunoWorldSysMetadata                  Sys;                                               // 0x0010(0x0018)(NativeAccessSpecifierPublic)
	struct FJunoWorldGameMetadata                 Game;                                              // 0x0028(0x0058)(NativeAccessSpecifierPublic)
	uint8                                         Pad_80[0x8];                                       // 0x0080(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FJunoWorldMetadata;

// ScriptStruct JunoWorldManagement.JunoWorldGameMetadata_v0_Initial
// 0x0050 (0x0050 - 0x0000)
struct FJunoWorldGameMetadata_v0_Initial final
{
public:
	TMap<class FString, class FName>              GameplayProperties;                                // 0x0000(0x0050)(NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FJunoWorldGameMetadata_v0_Initial;

// ScriptStruct JunoWorldManagement.JunoWorldQuery
// 0x0090 (0x0090 - 0x0000)
struct FJunoWorldQuery final
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJunoWorldMetadata                     MetaData;                                          // 0x0008(0x0088)(NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FJunoWorldQuery;

// ScriptStruct JunoWorldManagement.JunoWorldQueryResult
// 0x0008 (0x0008 - 0x0000)
struct FJunoWorldQueryResult final
{
public:
	class UJunoUserWorldView*                     UserWorldView;                                     // 0x0000(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FJunoWorldQueryResult;

// ScriptStruct JunoWorldManagement.JunoWorldMCPProto_CreateWorldResult
// 0x0010 (0x0010 - 0x0000)
struct FJunoWorldMCPProto_CreateWorldResult final
{
public:
	class FString                                 WorldId;                                           // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FJunoWorldMCPProto_CreateWorldResult;

}

