#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: JunoUI

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "JunoLowMemoryFallbackRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "JunoGameNative_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// Enum JunoUI.EBlockedDirection
// NumValues: 0x0005
enum class EBlockedDirection : uint8
{
	Top                                      = 0,
	Right                                    = 1,
	Bottom                                   = 2,
	Left                                     = 3,
	EBlockedDirection_MAX                    = 4,
};

// Enum JunoUI.EJunoBangVisibility
// NumValues: 0x0004
enum class EJunoBangVisibility : uint8
{
	Hidden                                   = 0,
	UnviewedBang                             = 1,
	UnacquiredBang                           = 2,
	EJunoBangVisibility_MAX                  = 3,
};

// Enum JunoUI.EBuildingLimitationState
// NumValues: 0x0005
enum class EBuildingLimitationState : uint8
{
	WithinLimits                             = 0,
	ThresholdCrossed                         = 1,
	NearingMaxOut                            = 2,
	MaxedOut                                 = 3,
	EBuildingLimitationState_MAX             = 4,
};

// Enum JunoUI.EDisassemblingStationInventoryState
// NumValues: 0x0004
enum class EDisassemblingStationInventoryState : uint8
{
	CanCraft                                 = 0,
	InputIsEmpty                             = 1,
	OutputFull                               = 2,
	EDisassemblingStationInventoryState_MAX  = 3,
};

// Enum JunoUI.EJunoEnchantmentScreenState
// NumValues: 0x0004
enum class EJunoEnchantmentScreenState : uint8
{
	WeaponSelection                          = 0,
	EnchantmentSelection                     = 1,
	Count                                    = 2,
	EJunoEnchantmentScreenState_MAX          = 3,
};

// Enum JunoUI.EJunoEnchantButtonState
// NumValues: 0x0006
enum class EJunoEnchantButtonState : uint8
{
	CanEnchant                               = 0,
	NotEnoughResources                       = 1,
	NoAvailableEnchantments                  = 2,
	SlotsFull                                = 3,
	CanCancelEnchant                         = 4,
	EJunoEnchantButtonState_MAX              = 5,
};

// Enum JunoUI.EJunoEnchantmentState
// NumValues: 0x0005
enum class EJunoEnchantmentState : uint8
{
	Empty                                    = 0,
	Occupied                                 = 1,
	Preview                                  = 2,
	Updated                                  = 3,
	EJunoEnchantmentState_MAX                = 4,
};

// Enum JunoUI.EJunoHudMenuScreen
// NumValues: 0x0006
enum class EJunoHudMenuScreen : uint8
{
	InventoryScreen                          = 0,
	CraftingScreen                           = 1,
	CollectionScreen                         = 2,
	BuildingScreen                           = 3,
	Max_None                                 = 4,
	EJunoHudMenuScreen_MAX                   = 5,
};

// Enum JunoUI.EJunoSwapItemType
// NumValues: 0x0006
enum class EJunoSwapItemType : uint8
{
	None                                     = 0,
	Source                                   = 1,
	SelectedDestination                      = 2,
	PotentialDestination                     = 3,
	GearDestinationInvalid                   = 4,
	EJunoSwapItemType_MAX                    = 5,
};

// Enum JunoUI.EJunoBedAssignmentActionType
// NumValues: 0x0005
enum class EJunoBedAssignmentActionType : uint8
{
	None                                     = 0,
	AssignEmpty                              = 1,
	ReassignExisting                         = 2,
	UnassignExisting                         = 3,
	EJunoBedAssignmentActionType_MAX         = 4,
};

// Enum JunoUI.EJunoCraftButtonState
// NumValues: 0x0004
enum class EJunoCraftButtonState : uint8
{
	CanCraft                                 = 0,
	CannotCraft                              = 1,
	StopCraft                                = 2,
	EJunoCraftButtonState_MAX                = 3,
};

// Enum JunoUI.ESelectRecipeButtonState
// NumValues: 0x0004
enum class ESelectRecipeButtonState : uint8
{
	SelectRecipeHeroState                    = 0,
	SelectRecipeCommonState                  = 1,
	DepositState                             = 2,
	ESelectRecipeButtonState_MAX             = 3,
};

// Enum JunoUI.ECraftingStationsInventoryState
// NumValues: 0x0004
enum class ECraftingStationsInventoryState : uint8
{
	CanCraft                                 = 0,
	MissingIngredients                       = 1,
	OutputFull                               = 2,
	ECraftingStationsInventoryState_MAX      = 3,
};

// Enum JunoUI.EJunoInventoryModalOperation
// NumValues: 0x0004
enum class EJunoInventoryModalOperation : uint8
{
	None                                     = 0,
	MoveAll                                  = 1,
	MergeAll                                 = 2,
	EJunoInventoryModalOperation_MAX         = 3,
};

// Enum JunoUI.EJunoMapMarkerCustomizationEntryType
// NumValues: 0x0003
enum class EJunoMapMarkerCustomizationEntryType : uint8
{
	Icon                                     = 0,
	Color                                    = 1,
	EJunoMapMarkerCustomizationEntryType_MAX = 2,
};

// Enum JunoUI.EJunoPickupStreamAnim
// NumValues: 0x0004
enum class EJunoPickupStreamAnim : uint8
{
	None                                     = 0,
	Intro                                    = 1,
	Update                                   = 2,
	EJunoPickupStreamAnim_MAX                = 3,
};

// Enum JunoUI.EJunoHealthBarType
// NumValues: 0x0003
enum class EJunoHealthBarType : uint8
{
	Health                                   = 0,
	Overshield                               = 1,
	EJunoHealthBarType_MAX                   = 2,
};

// ScriptStruct JunoUI.RecipeFocus
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x04) FRecipeFocus final
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FRecipeFocus;

// ScriptStruct JunoUI.RecipeCategoryChange
// 0x0020 (0x0020 - 0x0000)
struct FRecipeCategoryChange final
{
public:
	struct FGameplayTagContainer                  FilterTags;                                        // 0x0000(0x0020)(NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FRecipeCategoryChange;

// ScriptStruct JunoUI.CanCraftRecipeChange
// 0x0001 (0x0001 - 0x0000)
struct FCanCraftRecipeChange final
{
public:
	uint8                                         Pad_0[0x1];                                        // 0x0000(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FCanCraftRecipeChange;

// ScriptStruct JunoUI.JunoBiomeUIDisplayData
// 0x0038 (0x0038 - 0x0000)
struct FJunoBiomeUIDisplayData final
{
public:
	class FText                                   DisplayText;                                       // 0x0000(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UObject>                 Icon;                                              // 0x0018(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FJunoBiomeUIDisplayData;

// ScriptStruct JunoUI.JunoMemoryMessage
// 0x0001 (0x0001 - 0x0000)
struct FJunoMemoryMessage final
{
public:
	EBuildingLimitationState                      BuildingLimitationState;                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FJunoMemoryMessage;

// ScriptStruct JunoUI.JunoBuildingMemoryThreshold
// 0x0008 (0x0010 - 0x0008)
struct FJunoBuildingMemoryThreshold final : public FTableRowBase
{
public:
	int32                                         BuildingPercentLimit;                              // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EJunoLowMemoryState                           MemoryStateLimit;                                  // 0x000C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EBuildingLimitationState                      LimitationState;                                   // 0x000D(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FJunoBuildingMemoryThreshold;

// ScriptStruct JunoUI.JunoGuidedBuildingUIData
// 0x000C (0x000C - 0x0000)
struct FJunoGuidedBuildingUIData final
{
public:
	bool                                          bIsGuidedBuildingSet;                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         TotalStagesInSet;                                  // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ExtraIngredientsInSet;                             // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FJunoGuidedBuildingUIData;

// ScriptStruct JunoUI.JunoMarkerMaterialInstances
// 0x0010 (0x0010 - 0x0000)
struct FJunoMarkerMaterialInstances final
{
public:
	TArray<class UMaterialInstanceDynamic*>       Instances;                                         // 0x0000(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FJunoMarkerMaterialInstances;

// ScriptStruct JunoUI.TrackedTouchData
// 0x000C (0x000C - 0x0000)
struct alignas(0x04) FTrackedTouchData final
{
public:
	uint8                                         Pad_0[0xC];                                        // 0x0000(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FTrackedTouchData;

// ScriptStruct JunoUI.JunoMapZoomBounds
// 0x0008 (0x0008 - 0x0000)
struct FJunoMapZoomBounds final
{
public:
	float                                         MinZoom;                                           // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaximumZoom;                                       // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FJunoMapZoomBounds;

// ScriptStruct JunoUI.JunoHudMenuTabRequest
// 0x0030 (0x0030 - 0x0000)
struct FJunoHudMenuTabRequest final
{
public:
	class FName                                   NameId;                                            // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   DisplayName;                                       // 0x0008(0x0018)(Edit, NativeAccessSpecifierPublic)
	TSubclassOf<class UCommonButtonBase>          ButtonType;                                        // 0x0020(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UCommonUserWidget>          ContentType;                                       // 0x0028(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FJunoHudMenuTabRequest;

// ScriptStruct JunoUI.JunoIngredientInfo
// 0x0028 (0x0028 - 0x0000)
struct FJunoIngredientInfo final
{
public:
	TSoftObjectPtr<class UFortItemDefinition>     Ingredient;                                        // 0x0000(0x0020)(UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         RequiredCount;                                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OwnedCount;                                        // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FJunoIngredientInfo;

// ScriptStruct JunoUI.JunoInventoryGroupUIData
// 0x0040 (0x0040 - 0x0000)
struct FJunoInventoryGroupUIData final
{
public:
	struct FGameplayTag                           GroupTag;                                          // 0x0000(0x0004)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   DisplayName;                                       // 0x0008(0x0018)(Edit, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UObject>                 OptionalIcon;                                      // 0x0020(0x0020)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FJunoInventoryGroupUIData;

// ScriptStruct JunoUI.JunoInventoryGroupUIDataList
// 0x0010 (0x0010 - 0x0000)
struct FJunoInventoryGroupUIDataList final
{
public:
	TArray<struct FJunoInventoryGroupUIData>      GroupDataList;                                     // 0x0000(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FJunoInventoryGroupUIDataList;

// ScriptStruct JunoUI.JunoItemSpawnerListEntries
// 0x0010 (0x0010 - 0x0000)
struct FJunoItemSpawnerListEntries final
{
public:
	TArray<class UJunoItemSpawnerListEntry*>      ListEntries;                                       // 0x0000(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FJunoItemSpawnerListEntries;

// ScriptStruct JunoUI.JunoItemSpawnerItemTagOrder
// 0x0010 (0x0010 - 0x0000)
struct FJunoItemSpawnerItemTagOrder final
{
public:
	TArray<struct FGameplayTag>                   ItemTags;                                          // 0x0000(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FJunoItemSpawnerItemTagOrder;

// ScriptStruct JunoUI.JunoModalSceneOperation
// 0x0010 (0x0010 - 0x0000)
struct FJunoModalSceneOperation final
{
public:
	class UDynamicUIScene*                        ModalScene;                                        // 0x0000(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                Payload;                                           // 0x0008(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FJunoModalSceneOperation;

// ScriptStruct JunoUI.JunoModalSelectionChoice
// 0x0038 (0x0038 - 0x0000)
struct FJunoModalSelectionChoice final
{
public:
	class FText                                   SelectionTitle;                                    // 0x0000(0x0018)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FDataTableRowHandle                    Action;                                            // 0x0018(0x0010)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              SelectionDelegate;                                 // 0x0028(0x0010)(BlueprintVisible, ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FJunoModalSelectionChoice;

// ScriptStruct JunoUI.JunoQuickBuildSlotData
// 0x0038 (0x0038 - 0x0000)
struct FJunoQuickBuildSlotData final
{
public:
	TSoftObjectPtr<class UTexture2D>              Icon;                                              // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   DisplayName;                                       // 0x0020(0x0018)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FJunoQuickBuildSlotData;

// ScriptStruct JunoUI.CountUnviewedRecipesInCategoryArgs
// 0x0020 (0x0020 - 0x0000)
struct FCountUnviewedRecipesInCategoryArgs final
{
public:
	class AFortPlayerController*                  PlayerController;                                  // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 CraftingObject;                                    // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           CategoryTag;                                       // 0x0010(0x0004)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           SubCategoryTag;                                    // 0x0014(0x0004)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOnlyKnownRecipes;                                 // 0x0018(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCountUnacquiredRecipes;                           // 0x0019(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FCountUnviewedRecipesInCategoryArgs;

// ScriptStruct JunoUI.JunoNPCStateUIData
// 0x0048 (0x0048 - 0x0000)
struct FJunoNPCStateUIData final
{
public:
	int32                                         Priority;                                          // 0x0000(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UObject>                 PrimaryIcon;                                       // 0x0008(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UObject>                 SecondaryIcon;                                     // 0x0028(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FJunoNPCStateUIData;

// ScriptStruct JunoUI.JunoVillageRewardEntryInfo
// 0x0080 (0x0080 - 0x0000)
struct FJunoVillageRewardEntryInfo final
{
public:
	int32                                         AwesomeLevel;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAwesomePerkReward                     AwesomePerkReward;                                 // 0x0008(0x0050)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	int32                                         NewVillagerSlotCount;                              // 0x0058(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UJunoKnowledgeBundle*>           KnowledgeBundles;                                  // 0x0060(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                         ButtonIndex;                                       // 0x0070(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         IndexWithinGroup;                                  // 0x0074(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ButtonsWithinGroup;                                // 0x0078(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FJunoVillageRewardEntryInfo;

// ScriptStruct JunoUI.JunoFreeBuildCategoryUIDataEntry
// 0x0058 (0x0058 - 0x0000)
struct FJunoFreeBuildCategoryUIDataEntry final
{
public:
	struct FGameplayTag                           CategoryTag;                                       // 0x0000(0x0004)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              CategoryIcon;                                      // 0x0008(0x0020)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   CategoryTitle;                                     // 0x0028(0x0018)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	class FText                                   CategoryDescription;                               // 0x0040(0x0018)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FJunoFreeBuildCategoryUIDataEntry;

// ScriptStruct JunoUI.JunoFreeBuildSubCategoryUIDataEntry
// 0x0020 (0x0020 - 0x0000)
struct FJunoFreeBuildSubCategoryUIDataEntry final
{
public:
	struct FGameplayTag                           SubCategoryTag;                                    // 0x0000(0x0004)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   SubCategoryTitle;                                  // 0x0008(0x0018)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FJunoFreeBuildSubCategoryUIDataEntry;

// ScriptStruct JunoUI.GridListSlotInfo
// 0x0024 (0x0024 - 0x0000)
struct FGridListSlotInfo final
{
public:
	class FName                                   SlotType;                                          // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Height;                                            // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Width;                                             // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ItemsPerRow;                                       // 0x000C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMargin                                ItemPadding;                                       // 0x0010(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_20[0x4];                                       // 0x0020(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGridListSlotInfo;

// ScriptStruct JunoUI.GridListViewInfo
// 0x0030 (0x0030 - 0x0000)
struct FGridListViewInfo final
{
public:
	TSubclassOf<class UUserWidget>                UserWidgetClass;                                   // 0x0000(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGridListSlotInfo                      GridListSlotInfo;                                  // 0x0008(0x0024)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGridListViewInfo;

// ScriptStruct JunoUI.JunoCraftingStationUIDataEntry
// 0x00F0 (0x00F0 - 0x0000)
struct FJunoCraftingStationUIDataEntry final
{
public:
	struct FGameplayTag                           SourceTag;                                         // 0x0000(0x0004)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftClassPtr<class UClass>                   CraftingObjectRef;                                 // 0x0008(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            CraftStationIcon;                                  // 0x0030(0x00C0)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FJunoCraftingStationUIDataEntry;

// ScriptStruct JunoUI.GridListSlotInfoContainer
// 0x0010 (0x0010 - 0x0000)
struct FGridListSlotInfoContainer final
{
public:
	TArray<struct FGridListSlotInfo>              GridListInfo;                                      // 0x0000(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGridListSlotInfoContainer;

// ScriptStruct JunoUI.JunoModalDescription
// 0x0088 (0x0088 - 0x0000)
struct FJunoModalDescription final
{
public:
	class UDynamicUIScene*                        ModalScene;                                        // 0x0000(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   Title;                                             // 0x0008(0x0018)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	class FText                                   Description;                                       // 0x0020(0x0018)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	class FText                                   ConfirmButtonText;                                 // 0x0038(0x0018)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	class FText                                   CancelButtonText;                                  // 0x0050(0x0018)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FDataTableRowHandle                    ConfirmAction;                                     // 0x0068(0x0010)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	struct FDataTableRowHandle                    CancelAction;                                      // 0x0078(0x0010)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FJunoModalDescription;

// ScriptStruct JunoUI.JunoMapMarkerEntryInitData
// 0x0038 (0x0038 - 0x0000)
struct FJunoMapMarkerEntryInitData final
{
public:
	EJunoMapMarkerCustomizationEntryType          WidgetEntryType;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture>                EntryIcon;                                         // 0x0008(0x0020)(BlueprintVisible, BlueprintReadOnly, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           EntryColor;                                        // 0x0028(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FJunoMapMarkerEntryInitData;

// ScriptStruct JunoUI.JunoVillageUIData
// 0x0138 (0x0138 - 0x0000)
struct FJunoVillageUIData final
{
public:
	class FText                                   POIName;                                           // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FJunoMarker                            Marker;                                            // 0x0018(0x0098)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	EJunoBiome                                    BiomeType;                                         // 0x00B0(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B1[0x3];                                       // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         AwesomeLevel;                                      // 0x00B4(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaxAwesomeLevel;                                   // 0x00B8(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         AwesomePoints;                                     // 0x00BC(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         AwesomePointGoal;                                  // 0x00C0(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         AwesomePointFloor;                                 // 0x00C4(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         AwesomePointsNeededForNextLevel;                   // 0x00C8(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AwesomeProgressToNextLevel;                        // 0x00CC(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AwesomeEffectiveProgressToNextLevel;               // 0x00D0(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         AwesomeLevelFromCurrentPoints;                     // 0x00D4(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FAwesomeLevelRewardEntry>       AwesomeLevelRewardEntries;                         // 0x00D8(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FJunoAwesomeUpgradeResourceCostList    CurrentUpgradeResourceCosts;                       // 0x00E8(0x0010)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	TArray<struct FAwesomePerkReward>             UnlockedPlayerPerks;                               // 0x00F8(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FActiveCampNPCEntry>            ActiveNPCEntries;                                  // 0x0108(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                         MaxNPCs;                                           // 0x0118(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11C[0x4];                                      // 0x011C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TWeakObjectPtr<class UJunoKnowledgeBundle>> KnowledgeBundles;                             // 0x0120(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	class UFortItemDefinition*                    VillageCenterItemDefinition;                       // 0x0130(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FJunoVillageUIData;

// ScriptStruct JunoUI.JunoHUDShowVillageUpgradeCelebrationEvent
// 0x0020 (0x0020 - 0x0000)
struct FJunoHUDShowVillageUpgradeCelebrationEvent final
{
public:
	class FText                                   VillageName;                                       // 0x0000(0x0018)(BlueprintVisible, NativeAccessSpecifierPublic)
	EJunoBiome                                    Biome;                                             // 0x0018(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         NewLevel;                                          // 0x001C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FJunoHUDShowVillageUpgradeCelebrationEvent;

// ScriptStruct JunoUI.JunoNotificationData
// 0x0050 (0x0050 - 0x0000)
struct FJunoNotificationData final
{
public:
	struct FGameplayTag                           NotificationType;                                  // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UItemDefinitionBase*>            ItemDefinitions;                                   // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  AdditionalTags;                                    // 0x0018(0x0020)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	class FString                                 PlayerName;                                        // 0x0038(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                InitObject;                                        // 0x0048(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FJunoNotificationData;

// ScriptStruct JunoUI.JunoNotificationEvent
// 0x0030 (0x0030 - 0x0000)
struct FJunoNotificationEvent final
{
public:
	struct FGameplayTag                           tag;                                               // 0x0000(0x0004)(BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftClassPtr<class UClass>                   NotificationSoftClass;                             // 0x0008(0x0020)(BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                InitObject;                                        // 0x0028(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FJunoNotificationEvent;

// ScriptStruct JunoUI.JunoPlayerIndicatorData
// 0x0048 (0x0048 - 0x0000)
struct FJunoPlayerIndicatorData final
{
public:
	class FString                                 PlayerName;                                        // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsAlive;                                          // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUniqueNetIdRepl                       UniqueNetId;                                       // 0x0018(0x0030)(BlueprintVisible, BlueprintReadOnly, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FJunoPlayerIndicatorData;

// ScriptStruct JunoUI.JunoWidgetSceneAndIndex
// 0x0010 (0x0010 - 0x0000)
struct FJunoWidgetSceneAndIndex final
{
public:
	class UDynamicUIScene*                        WidgetScene;                                       // 0x0000(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         WidgetAllowedIndex;                                // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRemoveOnDeath;                                    // 0x000C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FJunoWidgetSceneAndIndex;

}

