#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: JunoProceduralWorld

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "JunoProceduralWorld_structs.hpp"
#include "DataRegistry_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "JunoGameNative_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function JunoProceduralWorld.JunoProceduralWorldBlueprintLibrary.ApplyLandscapeTileSettings
// 0x0010 (0x0010 - 0x0000)
struct JunoProceduralWorldBlueprintLibrary_ApplyLandscapeTileSettings final
{
public:
	class ALandscape*                             LandscapeTile;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LODBlendRange;                                     // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseCompressedHeightmapStorage;                    // 0x000C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDisableRuntimeGrassMapGeneration;                 // 0x000D(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_JunoProceduralWorldBlueprintLibrary_ApplyLandscapeTileSettings;

// Function JunoProceduralWorld.JunoProceduralWorldBlueprintLibrary.CalcPOISizeExtent
// 0x0020 (0x0020 - 0x0000)
struct JunoProceduralWorldBlueprintLibrary_CalcPOISizeExtent final
{
public:
	EJunoPOISize                                  Size;                                              // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                ReturnValue;                                       // 0x0008(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_JunoProceduralWorldBlueprintLibrary_CalcPOISizeExtent;

// Function JunoProceduralWorld.JunoProceduralWorldBlueprintLibrary.CompareTagSets
// 0x00A8 (0x00A8 - 0x0000)
struct JunoProceduralWorldBlueprintLibrary_CompareTagSets final
{
public:
	TSet<class FName>                             Source;                                            // 0x0000(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TSet<class FName>                             Target;                                            // 0x0050(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	EJunoCompareTagSetsResult                     Result;                                            // 0x00A0(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_JunoProceduralWorldBlueprintLibrary_CompareTagSets;

// Function JunoProceduralWorld.JunoProceduralWorldBlueprintLibrary.CreateJunoRandomTableKeysIterator
// 0x0030 (0x0030 - 0x0000)
struct JunoProceduralWorldBlueprintLibrary_CreateJunoRandomTableKeysIterator final
{
public:
	struct FRandomStream                          RandomStream;                                      // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	TArray<class FName>                           Keys;                                              // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	struct FJunoRandomTableKeysIterator           ReturnValue;                                       // 0x0018(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_JunoProceduralWorldBlueprintLibrary_CreateJunoRandomTableKeysIterator;

// Function JunoProceduralWorld.JunoProceduralWorldBlueprintLibrary.CreateJunoWPLevelFromActors
// 0x0070 (0x0070 - 0x0000)
struct JunoProceduralWorldBlueprintLibrary_CreateJunoWPLevelFromActors final
{
public:
	class FString                                 LevelPackageName;                                  // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class AActor*>                         Actors;                                            // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UWorld>                  CreatedLevel;                                      // 0x0020(0x0020)(Parm, OutParm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseWorldPartition;                                // 0x0040(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   GridName;                                          // 0x0044(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LoadingRange;                                      // 0x0048(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         WorldPartitionGridCellSize;                        // 0x004C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              WorldPartitionGridCellOrigin;                      // 0x0050(0x0010)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UHLODLayer*                             DefaultHLODLayer;                                  // 0x0060(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EWorldPartitionServerStreamingMode            ServerStreamingMode;                               // 0x0068(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EWorldPartitionServerStreamingOutMode         ServerStreamingOutMode;                            // 0x0069(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6A[0x6];                                       // 0x006A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_JunoProceduralWorldBlueprintLibrary_CreateJunoWPLevelFromActors;

// Function JunoProceduralWorld.JunoProceduralWorldBlueprintLibrary.DeterministicShuffleKeys
// 0x0028 (0x0028 - 0x0000)
struct JunoProceduralWorldBlueprintLibrary_DeterministicShuffleKeys final
{
public:
	struct FRandomStream                          RandomSource;                                      // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	TArray<class FName>                           Array;                                             // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<class FName>                           ReturnValue;                                       // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_JunoProceduralWorldBlueprintLibrary_DeterministicShuffleKeys;

// Function JunoProceduralWorld.JunoProceduralWorldBlueprintLibrary.DisableLandscapeEditLayers
// 0x0008 (0x0008 - 0x0000)
struct JunoProceduralWorldBlueprintLibrary_DisableLandscapeEditLayers final
{
public:
	class ALandscape*                             Landscape;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_JunoProceduralWorldBlueprintLibrary_DisableLandscapeEditLayers;

// Function JunoProceduralWorld.JunoProceduralWorldBlueprintLibrary.EnableLandscapeNaniteSkirts
// 0x0010 (0x0010 - 0x0000)
struct JunoProceduralWorldBlueprintLibrary_EnableLandscapeNaniteSkirts final
{
public:
	class ALandscape*                             Landscape;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnable;                                           // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         SkirtDepth;                                        // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_JunoProceduralWorldBlueprintLibrary_EnableLandscapeNaniteSkirts;

// Function JunoProceduralWorld.JunoProceduralWorldBlueprintLibrary.FindAllResourcesInFolder
// 0x0028 (0x0028 - 0x0000)
struct JunoProceduralWorldBlueprintLibrary_FindAllResourcesInFolder final
{
public:
	class FString                                 Folder;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UClass*                                 AssetClass;                                        // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FSoftObjectPath>                OutPaths;                                          // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_JunoProceduralWorldBlueprintLibrary_FindAllResourcesInFolder;

// Function JunoProceduralWorld.JunoProceduralWorldBlueprintLibrary.FindNextMatchingPOIResource
// 0x0200 (0x0200 - 0x0000)
struct JunoProceduralWorldBlueprintLibrary_FindNextMatchingPOIResource final
{
public:
	struct FJunoRandomTableKeysIterator           Iterator;                                          // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	const class UDataTable*                       DataTable;                                         // 0x0018(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EJunoPOISize                                  SlotPOISize;                                       // 0x0020(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           SlotTags;                                          // 0x0028(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	struct FPCGJunoWorldTilePOI                   FoundPOI;                                          // 0x0038(0x01C0)(Parm, OutParm, NativeAccessSpecifierPublic)
	EJunoFindNextMatchingPOIResourceResult        Result;                                            // 0x01F8(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRemoveFromIterator;                               // 0x01F9(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1FA[0x6];                                      // 0x01FA(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_JunoProceduralWorldBlueprintLibrary_FindNextMatchingPOIResource;

// Function JunoProceduralWorld.JunoProceduralWorldBlueprintLibrary.FindNextMatchingPOIResourceEx
// 0x01F0 (0x01F0 - 0x0000)
struct JunoProceduralWorldBlueprintLibrary_FindNextMatchingPOIResourceEx final
{
public:
	struct FJunoRandomTableKeysIterator           Iterator;                                          // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	const class UDataTable*                       DataTable;                                         // 0x0018(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EJunoPOISize                                  Size;                                              // 0x0020(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EJunoBiome                                    Biome;                                             // 0x0021(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPCGJunoWorldTilePOI                   FoundPOI;                                          // 0x0028(0x01C0)(Parm, OutParm, NativeAccessSpecifierPublic)
	EJunoFindNextMatchingPOIResourceResult        Result;                                            // 0x01E8(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1E9[0x7];                                      // 0x01E9(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_JunoProceduralWorldBlueprintLibrary_FindNextMatchingPOIResourceEx;

// Function JunoProceduralWorld.JunoProceduralWorldBlueprintLibrary.GetJunoWorldRegistry
// 0x0010 (0x0010 - 0x0000)
struct JunoProceduralWorldBlueprintLibrary_GetJunoWorldRegistry final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UJunoWorldRegistryManager*              ReturnValue;                                       // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_JunoProceduralWorldBlueprintLibrary_GetJunoWorldRegistry;

// Function JunoProceduralWorld.JunoProceduralWorldBlueprintLibrary.JunoCreateLevel
// 0x0068 (0x0068 - 0x0000)
struct JunoProceduralWorldBlueprintLibrary_JunoCreateLevel final
{
public:
	struct FJunoCreateLevelParams                 Params_0;                                          // 0x0000(0x0040)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UWorld>                  CreatedLevel;                                      // 0x0040(0x0020)(Parm, OutParm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EJunoCreateLevelResult                        Result;                                            // 0x0060(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_JunoProceduralWorldBlueprintLibrary_JunoCreateLevel;

// Function JunoProceduralWorld.JunoProceduralWorldBlueprintLibrary.RunParallelCommandlets
// 0x0030 (0x0030 - 0x0000)
struct JunoProceduralWorldBlueprintLibrary_RunParallelCommandlets final
{
public:
	class FText                                   DialogueTitle;                                     // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<class FString>                         Commands;                                          // 0x0018(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	int32                                         MaxProcesses;                                      // 0x0028(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_JunoProceduralWorldBlueprintLibrary_RunParallelCommandlets;

// Function JunoProceduralWorld.JunoProceduralWorldBlueprintLibrary.SaveCurrentLevelAs
// 0x0018 (0x0018 - 0x0000)
struct JunoProceduralWorldBlueprintLibrary_SaveCurrentLevelAs final
{
public:
	class FString                                 NewPackageName;                                    // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_JunoProceduralWorldBlueprintLibrary_SaveCurrentLevelAs;

// Function JunoProceduralWorld.JunoProceduralWorldBlueprintLibrary.SetBoxBrushSize
// 0x0020 (0x0020 - 0x0000)
struct JunoProceduralWorldBlueprintLibrary_SetBoxBrushSize final
{
public:
	class AActor*                                 Volume;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Size;                                              // 0x0008(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_JunoProceduralWorldBlueprintLibrary_SetBoxBrushSize;

// Function JunoProceduralWorld.JunoProceduralWorldBlueprintLibrary.SetGridCellSize
// 0x0028 (0x0028 - 0x0000)
struct JunoProceduralWorldBlueprintLibrary_SetGridCellSize final
{
public:
	class AActor*                                 WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   GridName;                                          // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CellSize;                                          // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LoadingRange;                                      // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              Origin;                                            // 0x0018(0x0010)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_JunoProceduralWorldBlueprintLibrary_SetGridCellSize;

// Function JunoProceduralWorld.JunoProceduralWorldBlueprintLibrary.UnionActorBounds
// 0x0048 (0x0048 - 0x0000)
struct JunoProceduralWorldBlueprintLibrary_UnionActorBounds final
{
public:
	TArray<class AActor*>                         Actors;                                            // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	struct FBox                                   ReturnValue;                                       // 0x0010(0x0038)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_JunoProceduralWorldBlueprintLibrary_UnionActorBounds;

// Function JunoProceduralWorld.LandmassFunctionLibrary.GetControlPointLayerWidthRatio
// 0x0010 (0x0010 - 0x0000)
struct LandmassFunctionLibrary_GetControlPointLayerWidthRatio final
{
public:
	class ULandscapeSplineControlPoint*           InControlPoint;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_LandmassFunctionLibrary_GetControlPointLayerWidthRatio;

// Function JunoProceduralWorld.LandmassFunctionLibrary.GetControlPointLocation
// 0x0020 (0x0020 - 0x0000)
struct LandmassFunctionLibrary_GetControlPointLocation final
{
public:
	class ULandscapeSplineControlPoint*           InControlPoint;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ReturnValue;                                       // 0x0008(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LandmassFunctionLibrary_GetControlPointLocation;

// Function JunoProceduralWorld.LandmassFunctionLibrary.GetControlPointRotation
// 0x0020 (0x0020 - 0x0000)
struct LandmassFunctionLibrary_GetControlPointRotation final
{
public:
	class ULandscapeSplineControlPoint*           InControlPoint;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               ReturnValue;                                       // 0x0008(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LandmassFunctionLibrary_GetControlPointRotation;

// Function JunoProceduralWorld.LandmassFunctionLibrary.GetControlPointSideFalloff
// 0x0010 (0x0010 - 0x0000)
struct LandmassFunctionLibrary_GetControlPointSideFalloff final
{
public:
	class ULandscapeSplineControlPoint*           InControlPoint;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_LandmassFunctionLibrary_GetControlPointSideFalloff;

// Function JunoProceduralWorld.LandmassFunctionLibrary.GetControlPointWidth
// 0x0010 (0x0010 - 0x0000)
struct LandmassFunctionLibrary_GetControlPointWidth final
{
public:
	class ULandscapeSplineControlPoint*           InControlPoint;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_LandmassFunctionLibrary_GetControlPointWidth;

// Function JunoProceduralWorld.LandmassFunctionLibrary.GetLandscapeGradientAtLocation
// 0x0030 (0x0030 - 0x0000)
struct LandmassFunctionLibrary_GetLandscapeGradientAtLocation final
{
public:
	class ALandscapeProxy*                        LandscapeProxy;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Location;                                          // 0x0008(0x0018)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              ReturnValue;                                       // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LandmassFunctionLibrary_GetLandscapeGradientAtLocation;

// Function JunoProceduralWorld.LandmassFunctionLibrary.GetLandscapeHeightAtLocation
// 0x0028 (0x0028 - 0x0000)
struct LandmassFunctionLibrary_GetLandscapeHeightAtLocation final
{
public:
	class ALandscapeProxy*                        LandscapeProxy;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Location;                                          // 0x0008(0x0018)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsValidLocation;                                  // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ReturnValue;                                       // 0x0024(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LandmassFunctionLibrary_GetLandscapeHeightAtLocation;

// Function JunoProceduralWorld.LandmassFunctionLibrary.LevelInstanceSetAndUpdateWorldAsset
// 0x0028 (0x0028 - 0x0000)
struct LandmassFunctionLibrary_LevelInstanceSetAndUpdateWorldAsset final
{
public:
	class ALevelInstance*                         LevelInstance;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UWorld>                  WorldAsset;                                        // 0x0008(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LandmassFunctionLibrary_LevelInstanceSetAndUpdateWorldAsset;

// Function JunoProceduralWorld.LandmassFunctionLibrary.ProjectLocationOnLandscape
// 0x0040 (0x0040 - 0x0000)
struct LandmassFunctionLibrary_ProjectLocationOnLandscape final
{
public:
	class ALandscapeProxy*                        LandscapeProxy;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Location;                                          // 0x0008(0x0018)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsValidLocation;                                  // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                ReturnValue;                                       // 0x0028(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LandmassFunctionLibrary_ProjectLocationOnLandscape;

// Function JunoProceduralWorld.LandmassFunctionLibrary.SetControlPointLayerWidthRatio
// 0x0010 (0x0010 - 0x0000)
struct LandmassFunctionLibrary_SetControlPointLayerWidthRatio final
{
public:
	class ULandscapeSplineControlPoint*           InControlPoint;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InLayerWidthRatio;                                 // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_LandmassFunctionLibrary_SetControlPointLayerWidthRatio;

// Function JunoProceduralWorld.LandmassFunctionLibrary.SetControlPointLocation
// 0x0020 (0x0020 - 0x0000)
struct LandmassFunctionLibrary_SetControlPointLocation final
{
public:
	class ULandscapeSplineControlPoint*           InControlPoint;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                InLocation;                                        // 0x0008(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LandmassFunctionLibrary_SetControlPointLocation;

// Function JunoProceduralWorld.LandmassFunctionLibrary.SetControlPointRotation
// 0x0020 (0x0020 - 0x0000)
struct LandmassFunctionLibrary_SetControlPointRotation final
{
public:
	class ULandscapeSplineControlPoint*           InControlPoint;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               InRotation;                                        // 0x0008(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LandmassFunctionLibrary_SetControlPointRotation;

// Function JunoProceduralWorld.LandmassFunctionLibrary.SetControlPointSideFalloff
// 0x0010 (0x0010 - 0x0000)
struct LandmassFunctionLibrary_SetControlPointSideFalloff final
{
public:
	class ULandscapeSplineControlPoint*           InControlPoint;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InSideFalloff;                                     // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_LandmassFunctionLibrary_SetControlPointSideFalloff;

// Function JunoProceduralWorld.LandmassFunctionLibrary.SetControlPointWidth
// 0x0010 (0x0010 - 0x0000)
struct LandmassFunctionLibrary_SetControlPointWidth final
{
public:
	class ULandscapeSplineControlPoint*           InControlPoint;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InWidth;                                           // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_LandmassFunctionLibrary_SetControlPointWidth;

// Function JunoProceduralWorld.LandmassFunctionLibrary.SetStaticMeshAffectDistanceField
// 0x0010 (0x0010 - 0x0000)
struct LandmassFunctionLibrary_SetStaticMeshAffectDistanceField final
{
public:
	class UStaticMeshComponent*                   Mesh;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bNewValue;                                         // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_LandmassFunctionLibrary_SetStaticMeshAffectDistanceField;

// Function JunoProceduralWorld.JunoBridgePOISelectorComponent.BeginBridgeSelection
// 0x0018 (0x0018 - 0x0000)
struct JunoBridgePOISelectorComponent_BeginBridgeSelection final
{
public:
	struct FJunoBridgePOISelectorParams           Param_Params_0;                                    // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_JunoBridgePOISelectorComponent_BeginBridgeSelection;

// Function JunoProceduralWorld.JunoCaveGeneratorDataMergerInterface.MergeCaveData
// 0x0038 (0x0038 - 0x0000)
struct JunoCaveGeneratorDataMergerInterface_MergeCaveData final
{
public:
	struct FJunoCaveGeneratorData                 CaveData;                                          // 0x0000(0x0038)(Parm, OutParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_JunoCaveGeneratorDataMergerInterface_MergeCaveData;

// Function JunoProceduralWorld.JunoCaveGeneratorPlayspaceComponent.GenerateCaveData
// 0x00E8 (0x00E8 - 0x0000)
struct JunoCaveGeneratorPlayspaceComponent_GenerateCaveData final
{
public:
	struct FJunoCaveGeneratorData                 ResourceData;                                      // 0x0000(0x0038)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FDataRegistryType                      POIDataRegistry_0;                                 // 0x0038(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRandomStream                          RandomStream;                                      // 0x003C(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJunoCaveSurfaceData                   CaveSurfaceData;                                   // 0x0048(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	EJunoBiome                                    Biome;                                             // 0x0078(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBox                                   Bounds;                                            // 0x0080(0x0038)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	TSubclassOf<class AJunoTeleporter>            SurfaceTeleporterClass;                            // 0x00B8(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FJunoGeneratedCaveShellData>    Shells;                                            // 0x00C0(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FJunoPOIData>                   POIs;                                              // 0x00D0(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x00E0(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_JunoCaveGeneratorPlayspaceComponent_GenerateCaveData;

// Function JunoProceduralWorld.JunoCaveGeneratorPlayspaceComponent.GetMergedCaveDataRegistryData
// 0x0048 (0x0048 - 0x0000)
struct JunoCaveGeneratorPlayspaceComponent_GetMergedCaveDataRegistryData final
{
public:
	struct FDataRegistryType                      CaveGeneratorDataRegistry;                         // 0x0000(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJunoCaveGeneratorData                 ResourceData;                                      // 0x0008(0x0038)(Parm, OutParm, NativeAccessSpecifierPublic)
	EJunoGetMergedCaveDataRegistryDataResult      Result;                                            // 0x0040(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_JunoCaveGeneratorPlayspaceComponent_GetMergedCaveDataRegistryData;

// Function JunoProceduralWorld.JunoCaveGeneratorPlayspaceComponent.GetMergedMultiCaveDataRegistryData
// 0x0050 (0x0050 - 0x0000)
struct JunoCaveGeneratorPlayspaceComponent_GetMergedMultiCaveDataRegistryData final
{
public:
	struct FDataRegistryType                      ShellRegistry;                                     // 0x0000(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDataRegistryType                      ThemeRegistry;                                     // 0x0004(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDataRegistryType                      TypeRegistry;                                      // 0x0008(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDataRegistryType                      RuleRegistry;                                      // 0x000C(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FJunoCaveGeneratorData                 ResourceData;                                      // 0x0010(0x0038)(Parm, OutParm, NativeAccessSpecifierPublic)
	EJunoGetMergedCaveDataRegistryDataResult      Result;                                            // 0x0048(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_JunoCaveGeneratorPlayspaceComponent_GetMergedMultiCaveDataRegistryData;

// Function JunoProceduralWorld.JunoCaveGeneratorPlayspaceComponent.GetRootCaveGeneratorComponent
// 0x0010 (0x0010 - 0x0000)
struct JunoCaveGeneratorPlayspaceComponent_GetRootCaveGeneratorComponent final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UJunoCaveGeneratorPlayspaceComponent*   ReturnValue;                                       // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_JunoCaveGeneratorPlayspaceComponent_GetRootCaveGeneratorComponent;

// Function JunoProceduralWorld.JunoCaveGeneratorPlayspaceComponent.IsNativeCaveGeneratorEnabled
// 0x0001 (0x0001 - 0x0000)
struct JunoCaveGeneratorPlayspaceComponent_IsNativeCaveGeneratorEnabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_JunoCaveGeneratorPlayspaceComponent_IsNativeCaveGeneratorEnabled;

// Function JunoProceduralWorld.JunoCaveGeneratorPlayspaceComponent.SortCaveGeneratorRules
// 0x0020 (0x0020 - 0x0000)
struct JunoCaveGeneratorPlayspaceComponent_SortCaveGeneratorRules final
{
public:
	TArray<struct FJunoCaveGeneratorRule>         Rules;                                             // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<struct FJunoCaveGeneratorRule>         SortedRules;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_JunoCaveGeneratorPlayspaceComponent_SortCaveGeneratorRules;

// Function JunoProceduralWorld.JunoCaveGeneratorPlayspaceComponent.SortCaveGeneratorShells
// 0x0020 (0x0020 - 0x0000)
struct JunoCaveGeneratorPlayspaceComponent_SortCaveGeneratorShells final
{
public:
	TArray<struct FJunoCaveGeneratorShellData>    Shells;                                            // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<struct FJunoCaveGeneratorShellData>    SortedShells;                                      // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_JunoCaveGeneratorPlayspaceComponent_SortCaveGeneratorShells;

// Function JunoProceduralWorld.JunoCaveGeneratorPlayspaceComponent.SortCaveGeneratorThemes
// 0x0020 (0x0020 - 0x0000)
struct JunoCaveGeneratorPlayspaceComponent_SortCaveGeneratorThemes final
{
public:
	TArray<struct FJunoCaveGeneratorThemeEntry>   Themes;                                            // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<struct FJunoCaveGeneratorThemeEntry>   SortedThemes;                                      // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_JunoCaveGeneratorPlayspaceComponent_SortCaveGeneratorThemes;

// Function JunoProceduralWorld.JunoCaveGeneratorPlayspaceComponent.SortCaveGeneratorTypes
// 0x0020 (0x0020 - 0x0000)
struct JunoCaveGeneratorPlayspaceComponent_SortCaveGeneratorTypes final
{
public:
	TArray<struct FJunoCaveGeneratorTypeData>     Types;                                             // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<struct FJunoCaveGeneratorTypeData>     SortedTypes;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_JunoCaveGeneratorPlayspaceComponent_SortCaveGeneratorTypes;

// Function JunoProceduralWorld.JunoCaveGeneratorPlayspaceComponent.GenerateCave
// 0x0088 (0x0088 - 0x0000)
struct JunoCaveGeneratorPlayspaceComponent_GenerateCave final
{
public:
	class AActor*                                 WorldActor;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRandomStream                          RandomStream;                                      // 0x0008(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FJunoCaveSurfaceData                   CaveSurfaceData;                                   // 0x0010(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	EJunoBiome                                    Biome;                                             // 0x0040(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBox                                   Bounds;                                            // 0x0048(0x0038)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	TSubclassOf<class AJunoTeleporter>            SurfaceTeleporterClass;                            // 0x0080(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_JunoCaveGeneratorPlayspaceComponent_GenerateCave;

// Function JunoProceduralWorld.JunoCaveGeneratorPlayspaceComponent.SetMergedData
// 0x0038 (0x0038 - 0x0000)
struct JunoCaveGeneratorPlayspaceComponent_SetMergedData final
{
public:
	struct FJunoCaveGeneratorData                 Data;                                              // 0x0000(0x0038)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_JunoCaveGeneratorPlayspaceComponent_SetMergedData;

// Function JunoProceduralWorld.JunoLivingWorldStaticPointProvider.AppendFiltersTags
// 0x0020 (0x0020 - 0x0000)
struct JunoLivingWorldStaticPointProvider_AppendFiltersTags final
{
public:
	struct FGameplayTagContainer                  Container;                                         // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_JunoLivingWorldStaticPointProvider_AppendFiltersTags;

// Function JunoProceduralWorld.JunoCaveLivingWorldStaticPointProvider.GetCaveShellInstanceData
// 0x0080 (0x0080 - 0x0000)
struct JunoCaveLivingWorldStaticPointProvider_GetCaveShellInstanceData final
{
public:
	struct FJunoCaveShellInstanceData             Data;                                              // 0x0000(0x0078)(Parm, OutParm, NativeAccessSpecifierPublic)
	EJunoGetCaveShellInstanceDataResult           Result;                                            // 0x0078(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_JunoCaveLivingWorldStaticPointProvider_GetCaveShellInstanceData;

// Function JunoProceduralWorld.JunoStreamingGameplayVolume.SetBounds
// 0x0030 (0x0030 - 0x0000)
struct JunoStreamingGameplayVolume_SetBounds final
{
public:
	struct FVector                                Offset;                                            // 0x0000(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Extent;                                            // 0x0018(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_JunoStreamingGameplayVolume_SetBounds;

// Function JunoProceduralWorld.JunoTileSubsystem.HandlePossessedPawnChanged
// 0x0010 (0x0010 - 0x0000)
struct JunoTileSubsystem_HandlePossessedPawnChanged final
{
public:
	class APawn*                                  OldPawn;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class APawn*                                  Pawn;                                              // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_JunoTileSubsystem_HandlePossessedPawnChanged;

// Function JunoProceduralWorld.JunoTileSubsystem.OnCellActivate
// 0x0008 (0x0008 - 0x0000)
struct JunoTileSubsystem_OnCellActivate final
{
public:
	const class UJunoDynamicRuntimeCell*          Cell;                                              // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_JunoTileSubsystem_OnCellActivate;

// Function JunoProceduralWorld.JunoTileSubsystem.OnCellDeactivate
// 0x0008 (0x0008 - 0x0000)
struct JunoTileSubsystem_OnCellDeactivate final
{
public:
	const class UJunoDynamicRuntimeCell*          Cell;                                              // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_JunoTileSubsystem_OnCellDeactivate;

// Function JunoProceduralWorld.JunoTileSubsystem.OnCellLoad
// 0x0008 (0x0008 - 0x0000)
struct JunoTileSubsystem_OnCellLoad final
{
public:
	const class UJunoDynamicRuntimeCell*          Cell;                                              // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_JunoTileSubsystem_OnCellLoad;

// Function JunoProceduralWorld.JunoTileSubsystem.OnCellUnload
// 0x0008 (0x0008 - 0x0000)
struct JunoTileSubsystem_OnCellUnload final
{
public:
	const class UJunoDynamicRuntimeCell*          Cell;                                              // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_JunoTileSubsystem_OnCellUnload;

// Function JunoProceduralWorld.JunoCaveBlueprintLibrary.CalculateCaveShellDistance
// 0x0020 (0x0020 - 0x0000)
struct JunoCaveBlueprintLibrary_CalculateCaveShellDistance final
{
public:
	struct FJunoCave                              Cave;                                              // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FName                                   ShellID_A;                                         // 0x0010(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ShellID_B;                                         // 0x0014(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Distance;                                          // 0x0018(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EJunoCalculateCaveDistanceResult              Result;                                            // 0x001C(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_JunoCaveBlueprintLibrary_CalculateCaveShellDistance;

// Function JunoProceduralWorld.JunoCaveBlueprintLibrary.CreateCaveInstanceData
// 0x0030 (0x0030 - 0x0000)
struct JunoCaveBlueprintLibrary_CreateCaveInstanceData final
{
public:
	const class AActor*                           CaveSlotActor;                                     // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  CaveSlotGuid;                                      // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FJunoGeneratedCaveShellData>    CaveShellData;                                     // 0x0018(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	EJunoCreateCaveResult                         Result;                                            // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_JunoCaveBlueprintLibrary_CreateCaveInstanceData;

// Function JunoProceduralWorld.JunoCaveBlueprintLibrary.CreateCaveInstanceDataForSurfaceData
// 0x0050 (0x0050 - 0x0000)
struct JunoCaveBlueprintLibrary_CreateCaveInstanceDataForSurfaceData final
{
public:
	const class AActor*                           POISlotActor;                                      // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FJunoCaveSurfaceData                   SurfaceData;                                       // 0x0008(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<struct FJunoGeneratedCaveShellData>    CaveShellData;                                     // 0x0038(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	EJunoCreateCaveResult                         Result;                                            // 0x0048(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_JunoCaveBlueprintLibrary_CreateCaveInstanceDataForSurfaceData;

// Function JunoProceduralWorld.JunoCaveBlueprintLibrary.CreateExitsUsedMaskFromArray
// 0x0018 (0x0018 - 0x0000)
struct JunoCaveBlueprintLibrary_CreateExitsUsedMaskFromArray final
{
public:
	TArray<int32>                                 ExitsUsed;                                         // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_JunoCaveBlueprintLibrary_CreateExitsUsedMaskFromArray;

// Function JunoProceduralWorld.JunoCaveBlueprintLibrary.ExitsUsedMaskToArray
// 0x0018 (0x0018 - 0x0000)
struct JunoCaveBlueprintLibrary_ExitsUsedMaskToArray final
{
public:
	int32                                         ExitsUsedMask;                                     // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_JunoCaveBlueprintLibrary_ExitsUsedMaskToArray;

// Function JunoProceduralWorld.JunoCaveBlueprintLibrary.GetBestCaveShellFromArea
// 0x0068 (0x0068 - 0x0000)
struct JunoCaveBlueprintLibrary_GetBestCaveShellFromArea final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FBox                                   Area;                                              // 0x0008(0x0038)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FJunoCave                              Cave;                                              // 0x0040(0x0010)(Parm, OutParm, NativeAccessSpecifierPublic)
	struct FGuid                                  CaveGuid;                                          // 0x0050(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ShellID;                                           // 0x0060(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EJunoGetBestCaveResult                        Result;                                            // 0x0064(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_JunoCaveBlueprintLibrary_GetBestCaveShellFromArea;

