#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: JunoMusicRuntime

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "JunoMusicRuntime_structs.hpp"
#include "MetasoundFrontend_structs.hpp"


namespace SDK::Params
{

// Function JunoMusicRuntime.ActiveJunoMusicPlayer.OnDayNightPhaseChangeSignature
// 0x0003 (0x0003 - 0x0000)
struct ActiveJunoMusicPlayer_OnDayNightPhaseChangeSignature final
{
public:
	EFortDayPhase                                 CurrentDayPhaseIn;                                 // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EFortDayPhase                                 PreviousDayPhaseIn;                                // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAtCreationIn;                                     // 0x0002(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ActiveJunoMusicPlayer_OnDayNightPhaseChangeSignature;

// Function JunoMusicRuntime.JunoMusicDataCollector.BP_OnRegistered
// 0x0008 (0x0008 - 0x0000)
struct JunoMusicDataCollector_BP_OnRegistered final
{
public:
	class UMetasoundParameterPack*                AggregatedData;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_JunoMusicDataCollector_BP_OnRegistered;

// Function JunoMusicRuntime.JunoMusicDataCollector.BP_OnUpdate
// 0x0010 (0x0010 - 0x0000)
struct JunoMusicDataCollector_BP_OnUpdate final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMetasoundParameterPack*                AggregatedData;                                    // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_JunoMusicDataCollector_BP_OnUpdate;

// Function JunoMusicRuntime.JunoMusicDataCollector_Combat.SetThreatLevelMultiplier
// 0x0004 (0x0004 - 0x0000)
struct JunoMusicDataCollector_Combat_SetThreatLevelMultiplier final
{
public:
	float                                         InThreatLevelMultiplier;                           // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_JunoMusicDataCollector_Combat_SetThreatLevelMultiplier;

// Function JunoMusicRuntime.JunoMusicManager.AddJunoMusicPlaylist
// 0x0008 (0x0008 - 0x0000)
struct JunoMusicManager_AddJunoMusicPlaylist final
{
public:
	class UJunoMusicPlaylistDataAsset*            JunoMusicPlaylist;                                 // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_JunoMusicManager_AddJunoMusicPlaylist;

// Function JunoMusicRuntime.JunoMusicManager.RemoveJunoMusicPlaylist
// 0x0008 (0x0008 - 0x0000)
struct JunoMusicManager_RemoveJunoMusicPlaylist final
{
public:
	class UJunoMusicPlaylistDataAsset*            JunoMusicPlaylist;                                 // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_JunoMusicManager_RemoveJunoMusicPlaylist;

// Function JunoMusicRuntime.JunoMusicManager.SetActiveJunoMusicManagerData
// 0x0010 (0x0010 - 0x0000)
struct JunoMusicManager_SetActiveJunoMusicManagerData final
{
public:
	struct FActiveJunoMusicManagerData            ActiveJunoMusicManagerDataIn;                      // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_JunoMusicManager_SetActiveJunoMusicManagerData;

// Function JunoMusicRuntime.JunoMusicManager.SetSuspendActiveMusicPlayback
// 0x0002 (0x0002 - 0x0000)
struct JunoMusicManager_SetSuspendActiveMusicPlayback final
{
public:
	bool                                          bSuspendPlayback;                                  // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bStopCurrentlyPlayingMusic;                        // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_JunoMusicManager_SetSuspendActiveMusicPlayback;

// Function JunoMusicRuntime.JunoMusicManager.SetSuspendWorldActiveMusicPlayback
// 0x0010 (0x0010 - 0x0000)
struct JunoMusicManager_SetSuspendWorldActiveMusicPlayback final
{
public:
	class UWorld*                                 World;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSuspendPlayback;                                  // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bStopCurrentlyPlayingMusic;                        // 0x0009(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_JunoMusicManager_SetSuspendWorldActiveMusicPlayback;

// Function JunoMusicRuntime.JunoMusicManager.StartWorldMusicSystem
// 0x0008 (0x0008 - 0x0000)
struct JunoMusicManager_StartWorldMusicSystem final
{
public:
	class UWorld*                                 World;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_JunoMusicManager_StartWorldMusicSystem;

// Function JunoMusicRuntime.JunoMusicManager.StopWorldMusicSystem
// 0x0008 (0x0008 - 0x0000)
struct JunoMusicManager_StopWorldMusicSystem final
{
public:
	class UWorld*                                 World;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_JunoMusicManager_StopWorldMusicSystem;

// Function JunoMusicRuntime.JunoMusicManager.GetCollectedBool
// 0x0010 (0x0010 - 0x0000)
struct JunoMusicManager_GetCollectedBool final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ParameterName;                                     // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESetParamResult                               Result;                                            // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x000D(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_JunoMusicManager_GetCollectedBool;

// Function JunoMusicRuntime.JunoMusicManager.GetCollectedFloat
// 0x0018 (0x0018 - 0x0000)
struct JunoMusicManager_GetCollectedFloat final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ParameterName;                                     // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESetParamResult                               Result;                                            // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_JunoMusicManager_GetCollectedFloat;

// Function JunoMusicRuntime.JunoMusicManager.GetCollectedInt
// 0x0018 (0x0018 - 0x0000)
struct JunoMusicManager_GetCollectedInt final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ParameterName;                                     // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESetParamResult                               Result;                                            // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_JunoMusicManager_GetCollectedInt;

// Function JunoMusicRuntime.JunoMusicManager.GetCollectedString
// 0x0020 (0x0020 - 0x0000)
struct JunoMusicManager_GetCollectedString final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ParameterName;                                     // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESetParamResult                               Result;                                            // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_JunoMusicManager_GetCollectedString;

// Function JunoMusicRuntime.JunoMusicPlaybackCondition.BP_ShouldPlay
// 0x0001 (0x0001 - 0x0000)
struct JunoMusicPlaybackCondition_BP_ShouldPlay final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_JunoMusicPlaybackCondition_BP_ShouldPlay;

}

