#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: JunoFrontendUI

#include "Basic.hpp"

#include "FortniteUI_classes.hpp"
#include "CoreUObject_classes.hpp"
#include "FortniteGame_classes.hpp"
#include "ModelViewViewModel_classes.hpp"


namespace SDK
{

// Class JunoFrontendUI.JunoFrontendExperienceFlow
// 0x00D0 (0x00F8 - 0x0028)
class UJunoFrontendExperienceFlow final : public UObject
{
public:
	uint8                                         Pad_28[0x20];                                      // 0x0028(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortStreamMediaSource*                 VideoStream_Source;                                // 0x0048(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftClassPtr<class UClass>                   VideoPlayerClass;                                  // 0x0050(0x0020)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class FString>                         FlowStepArray;                                     // 0x0070(0x0010)(ZeroConstructor, Config, NativeAccessSpecifierPrivate)
	bool                                          bEnableTrailer;                                    // 0x0080(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CinematicTrailerVUID;                              // 0x0088(0x0010)(ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   CinematicTrailerString;                            // 0x0098(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FString, class FString>            CinematicTrailerRating;                            // 0x00A0(0x0050)(Config, NativeAccessSpecifierPrivate)
	uint8                                         Pad_F0[0x8];                                       // 0x00F0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JunoFrontendExperienceFlow")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JunoFrontendExperienceFlow")
	}
	static class UJunoFrontendExperienceFlow* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoFrontendExperienceFlow>();
	}
};
DUMPER7_ASSERTS_UJunoFrontendExperienceFlow;

// Class JunoFrontendUI.JunoMatchmakingUtilityExtension
// 0x0000 (0x0028 - 0x0028)
class UJunoMatchmakingUtilityExtension final : public UMatchmakingUtilityExtensionBase
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JunoMatchmakingUtilityExtension")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JunoMatchmakingUtilityExtension")
	}
	static class UJunoMatchmakingUtilityExtension* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoMatchmakingUtilityExtension>();
	}
};
DUMPER7_ASSERTS_UJunoMatchmakingUtilityExtension;

// Class JunoFrontendUI.JunoMatchmakingWidgetExtension
// 0x0020 (0x0048 - 0x0028)
class UJunoMatchmakingWidgetExtension final : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UFortActivityModeSetSelectionModalBase> GameSelectionOverride;                 // 0x0030(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UUserWidget>                CustomHeadingWidget;                               // 0x0038(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bDisplayGameSelectionOnContentStack;               // 0x0040(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JunoMatchmakingWidgetExtension")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JunoMatchmakingWidgetExtension")
	}
	static class UJunoMatchmakingWidgetExtension* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoMatchmakingWidgetExtension>();
	}
};
DUMPER7_ASSERTS_UJunoMatchmakingWidgetExtension;

// Class JunoFrontendUI.JunoTabGroupButtonViewModel
// 0x0000 (0x0098 - 0x0098)
class UJunoTabGroupButtonViewModel final : public UUIKitTabGroupButtonViewModel
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JunoTabGroupButtonViewModel")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JunoTabGroupButtonViewModel")
	}
	static class UJunoTabGroupButtonViewModel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoTabGroupButtonViewModel>();
	}
};
DUMPER7_ASSERTS_UJunoTabGroupButtonViewModel;

// Class JunoFrontendUI.JunoWorldManagementViewModel
// 0x00E0 (0x0148 - 0x0068)
class UJunoWorldManagementViewModel final : public UMVVMViewModelBase
{
public:
	bool                                          bAllowWorldCreation;                               // 0x0068(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MaxWorldSlots;                                     // 0x006C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsModeratorModeEnabled;                           // 0x0070(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UJunoWorldDataViewModel*>        OwnerWorlds;                                       // 0x0078(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<class UJunoWorldDataViewModel*>        SharedWorlds;                                      // 0x0088(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<class UJunoWorldDataViewModel*>        WorldSlots;                                        // 0x0098(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	class UJunoWorldDataViewModel*                SelectedWorld;                                     // 0x00A8(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UJunoWorldDataViewModel*                EmptyWorld;                                        // 0x00B0(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_B8[0x20];                                      // 0x00B8(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DataRefreshFrequency;                              // 0x00D8(0x0004)(ZeroConstructor, Transient, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_DC[0x54];                                      // 0x00DC(0x0054)(Fixing Size After Last Property [ Dumper-7 ])
	class UDataTable*                             SettingDataTable;                                  // 0x0130(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class UJunoWorldImageObject*>          WorldImageList;                                    // 0x0138(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)

public:
	void DisableDataRefresh();
	void EnableDataRefresh();
	void FetchWorldData();
	void InitWorldData(const TSoftObjectPtr<class UDataTable>& InSettingDataTable, const TSoftObjectPtr<class UDataTable>& InWorldImageDataTable);
	void RemoveSelectedWorldFromList();
	void StartMatchmakingInModeratorMode(const class FString& InWorldId);

	bool GetIsCreateFlowSelected() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JunoWorldManagementViewModel")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JunoWorldManagementViewModel")
	}
	static class UJunoWorldManagementViewModel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoWorldManagementViewModel>();
	}
};
DUMPER7_ASSERTS_UJunoWorldManagementViewModel;

}

