#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: JunoAdventuresRuntime

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "GameplayAbilities_structs.hpp"
#include "JunoAdventuresRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "CommonConversationRuntime_classes.hpp"
#include "WorldConditions_structs.hpp"
#include "WorldConditions_classes.hpp"
#include "JunoGameNative_structs.hpp"
#include "ModularGameplay_classes.hpp"
#include "FortniteAI_classes.hpp"


namespace SDK
{

// Class JunoAdventuresRuntime.JunoAdventuresAnalytics
// 0x0000 (0x0028 - 0x0028)
class UJunoAdventuresAnalytics final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JunoAdventuresAnalytics")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JunoAdventuresAnalytics")
	}
	static class UJunoAdventuresAnalytics* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoAdventuresAnalytics>();
	}
};
DUMPER7_ASSERTS_UJunoAdventuresAnalytics;

// Class JunoAdventuresRuntime.JunoContextualMessageConfigCollection
// 0x0030 (0x0060 - 0x0030)
class UJunoContextualMessageConfigCollection final : public UDataAsset
{
public:
	TArray<struct FJunoSpecializedContextualMessageConfig> SpecializedConfigs;                       // 0x0030(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FJunoContextualMessageConfig           GeneralConfig;                                     // 0x0040(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FDataTableRowHandle                    GeneralConfigTableRow;                             // 0x0050(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JunoContextualMessageConfigCollection")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JunoContextualMessageConfigCollection")
	}
	static class UJunoContextualMessageConfigCollection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoContextualMessageConfigCollection>();
	}
};
DUMPER7_ASSERTS_UJunoContextualMessageConfigCollection;

// Class JunoAdventuresRuntime.JunoControllerComponent_ConversationHistory
// 0x00A8 (0x02A0 - 0x01F8)
class UJunoControllerComponent_ConversationHistory final : public UFortControllerComponent_ConversationHistory
{
public:
	uint8                                         Pad_1F8[0xA8];                                     // 0x01F8(0x00A8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Client_SetCachedContextualMessageResult(const struct FJunoContextualMessageQueryResult& Result);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JunoControllerComponent_ConversationHistory")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JunoControllerComponent_ConversationHistory")
	}
	static class UJunoControllerComponent_ConversationHistory* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoControllerComponent_ConversationHistory>();
	}
};
DUMPER7_ASSERTS_UJunoControllerComponent_ConversationHistory;

// Class JunoAdventuresRuntime.JunoControllerRequirement
// 0x0000 (0x0030 - 0x0030)
class UJunoControllerRequirement : public UFortControllerRequirement
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JunoControllerRequirement")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JunoControllerRequirement")
	}
	static class UJunoControllerRequirement* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoControllerRequirement>();
	}
};
DUMPER7_ASSERTS_UJunoControllerRequirement;

// Class JunoAdventuresRuntime.JunoControllerRequirement_CampResidentsHaveTag
// 0x0010 (0x0040 - 0x0030)
class UJunoControllerRequirement_CampResidentsHaveTag final : public UJunoControllerRequirement
{
public:
	struct FGameplayTag                           RoleTagToValidate;                                 // 0x0030(0x0004)(Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTag                           UniqueIdentifierTagToValidate;                     // 0x0034(0x0004)(Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIncludeSpeakingNpcInQueries;                      // 0x0038(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool ValidateRoleTag(const struct FGameplayTag& OtherResidentIdentifier, const class UPlayspaceComponent_JunoAIPersistence* RootAIPersistenceComp) const;
	bool ValidateUniqueResidentTag(const struct FGameplayTag& OtherResidentIdentifier) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JunoControllerRequirement_CampResidentsHaveTag")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JunoControllerRequirement_CampResidentsHaveTag")
	}
	static class UJunoControllerRequirement_CampResidentsHaveTag* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoControllerRequirement_CampResidentsHaveTag>();
	}
};
DUMPER7_ASSERTS_UJunoControllerRequirement_CampResidentsHaveTag;

// Class JunoAdventuresRuntime.JunoControllerRequirement_HasCompletedQuestObjective
// 0x0020 (0x0050 - 0x0030)
class UJunoControllerRequirement_HasCompletedQuestObjective final : public UFortControllerRequirement
{
public:
	struct FSoftObjectPath                        QuestDefinition;                                   // 0x0030(0x0018)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ObjectiveBackendName;                              // 0x0048(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	TArray<class FName> Editor_GetValidObjectives() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JunoControllerRequirement_HasCompletedQuestObjective")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JunoControllerRequirement_HasCompletedQuestObjective")
	}
	static class UJunoControllerRequirement_HasCompletedQuestObjective* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoControllerRequirement_HasCompletedQuestObjective>();
	}
};
DUMPER7_ASSERTS_UJunoControllerRequirement_HasCompletedQuestObjective;

// Class JunoAdventuresRuntime.JunoControllerRequirement_HasEntryTag
// 0x0008 (0x0038 - 0x0030)
class UJunoControllerRequirement_HasEntryTag final : public UFortControllerRequirement
{
public:
	struct FGameplayTag                           QueryTag;                                          // 0x0030(0x0004)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JunoControllerRequirement_HasEntryTag")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JunoControllerRequirement_HasEntryTag")
	}
	static class UJunoControllerRequirement_HasEntryTag* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoControllerRequirement_HasEntryTag>();
	}
};
DUMPER7_ASSERTS_UJunoControllerRequirement_HasEntryTag;

// Class JunoAdventuresRuntime.JunoControllerRequirement_IsFirstConversationWithNPC
// 0x0000 (0x0030 - 0x0030)
class UJunoControllerRequirement_IsFirstConversationWithNPC final : public UJunoControllerRequirement
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JunoControllerRequirement_IsFirstConversationWithNPC")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JunoControllerRequirement_IsFirstConversationWithNPC")
	}
	static class UJunoControllerRequirement_IsFirstConversationWithNPC* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoControllerRequirement_IsFirstConversationWithNPC>();
	}
};
DUMPER7_ASSERTS_UJunoControllerRequirement_IsFirstConversationWithNPC;

// Class JunoAdventuresRuntime.JunoControllerRequirement_IsFollowingAnotherPlayer
// 0x0000 (0x0030 - 0x0030)
class UJunoControllerRequirement_IsFollowingAnotherPlayer final : public UJunoControllerRequirement
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JunoControllerRequirement_IsFollowingAnotherPlayer")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JunoControllerRequirement_IsFollowingAnotherPlayer")
	}
	static class UJunoControllerRequirement_IsFollowingAnotherPlayer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoControllerRequirement_IsFollowingAnotherPlayer>();
	}
};
DUMPER7_ASSERTS_UJunoControllerRequirement_IsFollowingAnotherPlayer;

// Class JunoAdventuresRuntime.JunoControllerRequirement_IsGeneratingResourcesAndEmpty
// 0x0008 (0x0038 - 0x0030)
class UJunoControllerRequirement_IsGeneratingResourcesAndEmpty final : public UJunoControllerRequirement
{
public:
	bool                                          bRequiresGeneratedPercentageWhenNoLootGenerated;   // 0x0030(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JunoControllerRequirement_IsGeneratingResourcesAndEmpty")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JunoControllerRequirement_IsGeneratingResourcesAndEmpty")
	}
	static class UJunoControllerRequirement_IsGeneratingResourcesAndEmpty* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoControllerRequirement_IsGeneratingResourcesAndEmpty>();
	}
};
DUMPER7_ASSERTS_UJunoControllerRequirement_IsGeneratingResourcesAndEmpty;

// Class JunoAdventuresRuntime.JunoControllerRequirement_MerchantHasStock
// 0x0000 (0x0030 - 0x0030)
class UJunoControllerRequirement_MerchantHasStock final : public UJunoControllerRequirement
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JunoControllerRequirement_MerchantHasStock")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JunoControllerRequirement_MerchantHasStock")
	}
	static class UJunoControllerRequirement_MerchantHasStock* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoControllerRequirement_MerchantHasStock>();
	}
};
DUMPER7_ASSERTS_UJunoControllerRequirement_MerchantHasStock;

// Class JunoAdventuresRuntime.JunoConversationRequirementDatabase
// 0x0008 (0x0100 - 0x00F8)
class UJunoConversationRequirementDatabase final : public UFortPlayspaceComponent
{
public:
	class UJunoConversationRequirementMappings*   ConversationRequirementMappingData;                // 0x00F8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JunoConversationRequirementDatabase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JunoConversationRequirementDatabase")
	}
	static class UJunoConversationRequirementDatabase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoConversationRequirementDatabase>();
	}
};
DUMPER7_ASSERTS_UJunoConversationRequirementDatabase;

// Class JunoAdventuresRuntime.JunoConversationRequirementMappings
// 0x0050 (0x0080 - 0x0030)
class UJunoConversationRequirementMappings final : public UDataAsset
{
public:
	TMap<struct FGameplayTag, class UFortControllerRequirement*> ConversationRequirementMappings;    // 0x0030(0x0050)(Edit, ExportObject, DisableEditOnInstance, ContainsInstancedReference, Protected, UObjectWrapper, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JunoConversationRequirementMappings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JunoConversationRequirementMappings")
	}
	static class UJunoConversationRequirementMappings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoConversationRequirementMappings>();
	}
};
DUMPER7_ASSERTS_UJunoConversationRequirementMappings;

// Class JunoAdventuresRuntime.JunoConversationRequirement_NearestCampWorldConditionSchema
// 0x0010 (0x0048 - 0x0038)
class UJunoConversationRequirement_NearestCampWorldConditionSchema final : public UWorldConditionSchema
{
public:
	uint8                                         Pad_38[0x10];                                      // 0x0038(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JunoConversationRequirement_NearestCampWorldConditionSchema")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JunoConversationRequirement_NearestCampWorldConditionSchema")
	}
	static class UJunoConversationRequirement_NearestCampWorldConditionSchema* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoConversationRequirement_NearestCampWorldConditionSchema>();
	}
};
DUMPER7_ASSERTS_UJunoConversationRequirement_NearestCampWorldConditionSchema;

// Class JunoAdventuresRuntime.JunoConversationRequirement_NearestCampWorldCondition
// 0x0048 (0x00A0 - 0x0058)
class UJunoConversationRequirement_NearestCampWorldCondition final : public UConversationRequirementNode
{
public:
	int32                                         CampSlot;                                          // 0x0058(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         MaxDistanceFromCamp;                               // 0x0060(0x0028)(Edit, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	struct FWorldConditionQueryDefinition         Conditions;                                        // 0x0088(0x0018)(Edit, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JunoConversationRequirement_NearestCampWorldCondition")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JunoConversationRequirement_NearestCampWorldCondition")
	}
	static class UJunoConversationRequirement_NearestCampWorldCondition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoConversationRequirement_NearestCampWorldCondition>();
	}
};
DUMPER7_ASSERTS_UJunoConversationRequirement_NearestCampWorldCondition;

// Class JunoAdventuresRuntime.JunoConversationTaskNode_CampFollowerAssignment
// 0x0008 (0x0198 - 0x0190)
class UJunoConversationTaskNode_CampFollowerAssignment final : public UFortConversationTaskNode_Service
{
public:
	bool                                          bEnableFollower;                                   // 0x0190(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bCampRecruitment;                                  // 0x0191(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_192[0x6];                                      // 0x0192(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JunoConversationTaskNode_CampFollowerAssignment")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JunoConversationTaskNode_CampFollowerAssignment")
	}
	static class UJunoConversationTaskNode_CampFollowerAssignment* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoConversationTaskNode_CampFollowerAssignment>();
	}
};
DUMPER7_ASSERTS_UJunoConversationTaskNode_CampFollowerAssignment;

// Class JunoAdventuresRuntime.JunoConversationTaskNode_CampJobAssignment
// 0x0008 (0x0198 - 0x0190)
class UJunoConversationTaskNode_CampJobAssignment final : public UFortConversationTaskNode_Service
{
public:
	struct FGameplayTag                           JobTag;                                            // 0x0190(0x0004)(Edit, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bRemoveJob;                                        // 0x0194(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_195[0x3];                                      // 0x0195(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JunoConversationTaskNode_CampJobAssignment")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JunoConversationTaskNode_CampJobAssignment")
	}
	static class UJunoConversationTaskNode_CampJobAssignment* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoConversationTaskNode_CampJobAssignment>();
	}
};
DUMPER7_ASSERTS_UJunoConversationTaskNode_CampJobAssignment;

// Class JunoAdventuresRuntime.JunoConversationTaskNode_CampRecruitment
// 0x0000 (0x0190 - 0x0190)
class UJunoConversationTaskNode_CampRecruitment final : public UFortConversationTaskNode_Service
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JunoConversationTaskNode_CampRecruitment")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JunoConversationTaskNode_CampRecruitment")
	}
	static class UJunoConversationTaskNode_CampRecruitment* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoConversationTaskNode_CampRecruitment>();
	}
};
DUMPER7_ASSERTS_UJunoConversationTaskNode_CampRecruitment;

// Class JunoAdventuresRuntime.JunoConversationTaskNode_GetResource
// 0x0038 (0x01C8 - 0x0190)
class UJunoConversationTaskNode_GetResource final : public UFortConversationTaskNode_Service
{
public:
	int32                                         ResourceSlot;                                      // 0x0190(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_194[0x4];                                      // 0x0194(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   GetTextFormat;                                     // 0x0198(0x0018)(Edit, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	class FText                                   FinishedTextFormat;                                // 0x01B0(0x0018)(Edit, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JunoConversationTaskNode_GetResource")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JunoConversationTaskNode_GetResource")
	}
	static class UJunoConversationTaskNode_GetResource* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoConversationTaskNode_GetResource>();
	}
};
DUMPER7_ASSERTS_UJunoConversationTaskNode_GetResource;

// Class JunoAdventuresRuntime.JunoConversationTaskNode_GiftNPC
// 0x0030 (0x01A0 - 0x0170)
class UJunoConversationTaskNode_GiftNPC final : public UFortConversationTaskNode
{
public:
	class FText                                   GiftTextFormat;                                    // 0x0170(0x0018)(Edit, BlueprintReadOnly, NativeAccessSpecifierPrivate)
	int32                                         MaxChoiceNodesToGenerate;                          // 0x0188(0x0004)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_18C[0x4];                                      // 0x018C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FGameplayTag>                   InventoryGroupTypesToPickItemsFrom;                // 0x0190(0x0010)(Edit, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JunoConversationTaskNode_GiftNPC")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JunoConversationTaskNode_GiftNPC")
	}
	static class UJunoConversationTaskNode_GiftNPC* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoConversationTaskNode_GiftNPC>();
	}
};
DUMPER7_ASSERTS_UJunoConversationTaskNode_GiftNPC;

// Class JunoAdventuresRuntime.JunoConversationTaskNode_GrantAwesomePoints
// 0x0008 (0x0178 - 0x0170)
class UJunoConversationTaskNode_GrantAwesomePoints final : public UFortConversationTaskNode
{
public:
	struct FGameplayTag                           AwesomeInteractionTag;                             // 0x0170(0x0004)(Edit, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_174[0x4];                                      // 0x0174(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JunoConversationTaskNode_GrantAwesomePoints")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JunoConversationTaskNode_GrantAwesomePoints")
	}
	static class UJunoConversationTaskNode_GrantAwesomePoints* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoConversationTaskNode_GrantAwesomePoints>();
	}
};
DUMPER7_ASSERTS_UJunoConversationTaskNode_GrantAwesomePoints;

// Class JunoAdventuresRuntime.JunoConversationTaskNode_GrantNPCCampReward
// 0x0000 (0x0190 - 0x0190)
class UJunoConversationTaskNode_GrantNPCCampReward final : public UFortConversationTaskNode_Service
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JunoConversationTaskNode_GrantNPCCampReward")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JunoConversationTaskNode_GrantNPCCampReward")
	}
	static class UJunoConversationTaskNode_GrantNPCCampReward* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoConversationTaskNode_GrantNPCCampReward>();
	}
};
DUMPER7_ASSERTS_UJunoConversationTaskNode_GrantNPCCampReward;

// Class JunoAdventuresRuntime.JunoConversationTaskNode_MarkFirstConversationComplete
// 0x0000 (0x0170 - 0x0170)
class UJunoConversationTaskNode_MarkFirstConversationComplete final : public UFortConversationTaskNode
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JunoConversationTaskNode_MarkFirstConversationComplete")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JunoConversationTaskNode_MarkFirstConversationComplete")
	}
	static class UJunoConversationTaskNode_MarkFirstConversationComplete* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoConversationTaskNode_MarkFirstConversationComplete>();
	}
};
DUMPER7_ASSERTS_UJunoConversationTaskNode_MarkFirstConversationComplete;

// Class JunoAdventuresRuntime.JunoConversationTaskNode_NukeVillager
// 0x0000 (0x0190 - 0x0190)
class UJunoConversationTaskNode_NukeVillager final : public UFortConversationTaskNode_Service
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JunoConversationTaskNode_NukeVillager")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JunoConversationTaskNode_NukeVillager")
	}
	static class UJunoConversationTaskNode_NukeVillager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoConversationTaskNode_NukeVillager>();
	}
};
DUMPER7_ASSERTS_UJunoConversationTaskNode_NukeVillager;

// Class JunoAdventuresRuntime.JunoConversationTaskNode_RemoteCampRecruitment
// 0x0048 (0x01D8 - 0x0190)
class UJunoConversationTaskNode_RemoteCampRecruitment final : public UFortConversationTaskNode_Service
{
public:
	int32                                         CampSlot;                                          // 0x0190(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_194[0x4];                                      // 0x0194(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   JoinCampTextFormat;                                // 0x0198(0x0018)(Edit, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         MaxDistanceFromCamp;                               // 0x01B0(0x0028)(Edit, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JunoConversationTaskNode_RemoteCampRecruitment")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JunoConversationTaskNode_RemoteCampRecruitment")
	}
	static class UJunoConversationTaskNode_RemoteCampRecruitment* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoConversationTaskNode_RemoteCampRecruitment>();
	}
};
DUMPER7_ASSERTS_UJunoConversationTaskNode_RemoteCampRecruitment;

// Class JunoAdventuresRuntime.JunoConversationTaskNode_Speech
// 0x0090 (0x0200 - 0x0170)
class UJunoConversationTaskNode_Speech final : public UFortConversationTaskNode
{
public:
	class FString                                 MetaIdentifier_Animations;                         // 0x0170(0x0010)(Edit, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTag                           SpeakerTag;                                        // 0x0180(0x0004)(Edit, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTag                           ListenerTag;                                       // 0x0184(0x0004)(Edit, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTag                           DefaultMoodReactionTag;                            // 0x0188(0x0004)(Edit, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_18C[0x4];                                      // 0x018C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   StyledParticipantNameFormat;                       // 0x0190(0x0018)(Edit, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	bool                                          bUseInlineConfig;                                  // 0x01A8(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1A9[0x7];                                      // 0x01A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJunoContextualMessageConfigCollection* ExternalContextualMessageCollection;               // 0x01B0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FJunoSpecializedContextualMessageConfig> SpecializedConfigs;                       // 0x01B8(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	struct FJunoContextualMessageConfig           GeneralConfig;                                     // 0x01C8(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                    GeneralConfigTableRow;                             // 0x01D8(0x0010)(Edit, BlueprintReadOnly, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_1E8[0x18];                                     // 0x01E8(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void PlayClientVoiceLine(const struct FConversationContext& Context, const struct FJunoContextualMessageQueryResult& MessageParams) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JunoConversationTaskNode_Speech")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JunoConversationTaskNode_Speech")
	}
	static class UJunoConversationTaskNode_Speech* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoConversationTaskNode_Speech>();
	}
};
DUMPER7_ASSERTS_UJunoConversationTaskNode_Speech;

// Class JunoAdventuresRuntime.JunoConversationTaskNode_TagCurrentConversation
// 0x0020 (0x0190 - 0x0170)
class UJunoConversationTaskNode_TagCurrentConversation final : public UFortConversationTaskNode
{
public:
	struct FGameplayTagContainer                  TagsToApply;                                       // 0x0170(0x0020)(Edit, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JunoConversationTaskNode_TagCurrentConversation")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JunoConversationTaskNode_TagCurrentConversation")
	}
	static class UJunoConversationTaskNode_TagCurrentConversation* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoConversationTaskNode_TagCurrentConversation>();
	}
};
DUMPER7_ASSERTS_UJunoConversationTaskNode_TagCurrentConversation;

// Class JunoAdventuresRuntime.JunoConversationTaskNode_TradeWithMerchant
// 0x0068 (0x01D8 - 0x0170)
class UJunoConversationTaskNode_TradeWithMerchant final : public UFortConversationTaskNode
{
public:
	class FText                                   TradeTextFormat_Single;                            // 0x0170(0x0018)(Edit, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	class FText                                   TradeTextFormat_Plural;                            // 0x0188(0x0018)(Edit, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	class FText                                   NotEnoughForTradeTextFormat_Single;                // 0x01A0(0x0018)(Edit, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	class FText                                   NotEnoughForTradeTextFormat_Plural;                // 0x01B8(0x0018)(Edit, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	int32                                         MaxChoiceNodesToGenerate;                          // 0x01D0(0x0004)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1D4[0x4];                                      // 0x01D4(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JunoConversationTaskNode_TradeWithMerchant")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JunoConversationTaskNode_TradeWithMerchant")
	}
	static class UJunoConversationTaskNode_TradeWithMerchant* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoConversationTaskNode_TradeWithMerchant>();
	}
};
DUMPER7_ASSERTS_UJunoConversationTaskNode_TradeWithMerchant;

// Class JunoAdventuresRuntime.JunoNPCConversationParticipantComponent
// 0x0098 (0x06C0 - 0x0628)
class UJunoNPCConversationParticipantComponent final : public UFortNPCConversationParticipantComponent
{
public:
	TMulticastInlineDelegate<void(const TSoftObjectPtr<class UTexture2D>& Icon)> OnJunoConversationParticipantIconChangedDelegate; // 0x0628(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UTexture2D>              ParticipantIconSmall;                              // 0x0638(0x0020)(Net, Transient, RepNotify, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_658[0x68];                                     // 0x0658(0x0068)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnRep_ParticipantIconSmall();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JunoNPCConversationParticipantComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JunoNPCConversationParticipantComponent")
	}
	static class UJunoNPCConversationParticipantComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoNPCConversationParticipantComponent>();
	}
};
DUMPER7_ASSERTS_UJunoNPCConversationParticipantComponent;

// Class JunoAdventuresRuntime.JunoChangeInventoryHelper
// 0x0010 (0x0038 - 0x0028)
class UJunoChangeInventoryHelper final : public UObject
{
public:
	uint8                                         Pad_28[0x10];                                      // 0x0028(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleInventoryChangedEvent(const struct FJunoItemSlot& ItemSlot, const EJunoItemChangeType ChangeType);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JunoChangeInventoryHelper")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JunoChangeInventoryHelper")
	}
	static class UJunoChangeInventoryHelper* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoChangeInventoryHelper>();
	}
};
DUMPER7_ASSERTS_UJunoChangeInventoryHelper;

// Class JunoAdventuresRuntime.JunoConversationTaskNode_CompleteQuestObjective
// 0x0028 (0x0198 - 0x0170)
class UJunoConversationTaskNode_CompleteQuestObjective final : public UFortConversationTaskNode
{
public:
	TSoftObjectPtr<class UFortQuestItemDefinition_Athena> QuestToProgress;                           // 0x0170(0x0020)(Edit, BlueprintReadOnly, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   ObjectiveBackendName;                              // 0x0190(0x0004)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_194[0x4];                                      // 0x0194(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	TArray<class FName> Editor_GetValidObjectives() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JunoConversationTaskNode_CompleteQuestObjective")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JunoConversationTaskNode_CompleteQuestObjective")
	}
	static class UJunoConversationTaskNode_CompleteQuestObjective* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoConversationTaskNode_CompleteQuestObjective>();
	}
};
DUMPER7_ASSERTS_UJunoConversationTaskNode_CompleteQuestObjective;

// Class JunoAdventuresRuntime.JunoConversationTaskNode_GrantQuest
// 0x0020 (0x0190 - 0x0170)
class UJunoConversationTaskNode_GrantQuest final : public UFortConversationTaskNode
{
public:
	TSoftObjectPtr<class UFortQuestItemDefinition_Athena> QuestToGrant;                              // 0x0170(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JunoConversationTaskNode_GrantQuest")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JunoConversationTaskNode_GrantQuest")
	}
	static class UJunoConversationTaskNode_GrantQuest* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoConversationTaskNode_GrantQuest>();
	}
};
DUMPER7_ASSERTS_UJunoConversationTaskNode_GrantQuest;

// Class JunoAdventuresRuntime.JunoConversationTaskNode_TurnInQuest
// 0x0020 (0x0190 - 0x0170)
class UJunoConversationTaskNode_TurnInQuest final : public UFortConversationTaskNode
{
public:
	TSoftObjectPtr<class UFortQuestItemDefinition_Athena> QuestToTurnIn;                             // 0x0170(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JunoConversationTaskNode_TurnInQuest")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JunoConversationTaskNode_TurnInQuest")
	}
	static class UJunoConversationTaskNode_TurnInQuest* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoConversationTaskNode_TurnInQuest>();
	}
};
DUMPER7_ASSERTS_UJunoConversationTaskNode_TurnInQuest;

// Class JunoAdventuresRuntime.JunoControllerRequirement_HasCompletedNumQuestObjectives
// 0x0048 (0x0078 - 0x0030)
class UJunoControllerRequirement_HasCompletedNumQuestObjectives final : public UFortControllerRequirement
{
public:
	struct FSoftObjectPath                        QuestDefinition;                                   // 0x0030(0x0018)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FThresholdTestConfig                   RequiredCount;                                     // 0x0048(0x0030)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JunoControllerRequirement_HasCompletedNumQuestObjectives")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JunoControllerRequirement_HasCompletedNumQuestObjectives")
	}
	static class UJunoControllerRequirement_HasCompletedNumQuestObjectives* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoControllerRequirement_HasCompletedNumQuestObjectives>();
	}
};
DUMPER7_ASSERTS_UJunoControllerRequirement_HasCompletedNumQuestObjectives;

// Class JunoAdventuresRuntime.JunoControllerRequirement_IsQuestActive
// 0x0018 (0x0048 - 0x0030)
class UJunoControllerRequirement_IsQuestActive final : public UFortControllerRequirement
{
public:
	struct FSoftObjectPath                        QuestDefinition;                                   // 0x0030(0x0018)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JunoControllerRequirement_IsQuestActive")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JunoControllerRequirement_IsQuestActive")
	}
	static class UJunoControllerRequirement_IsQuestActive* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoControllerRequirement_IsQuestActive>();
	}
};
DUMPER7_ASSERTS_UJunoControllerRequirement_IsQuestActive;

// Class JunoAdventuresRuntime.JunoTokenReceiver
// 0x0000 (0x0000 - 0x0000)
class IJunoTokenReceiver final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JunoTokenReceiver")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JunoTokenReceiver")
	}
	static class IJunoTokenReceiver* GetDefaultObj()
	{
		return GetDefaultObjImpl<IJunoTokenReceiver>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IJunoTokenReceiver;

// Class JunoAdventuresRuntime.JunoQuestGiverComponent
// 0x0030 (0x00D0 - 0x00A0)
class UJunoQuestGiverComponent final : public UGameFrameworkComponent
{
public:
	class FString                                 GrantableQuestID;                                  // 0x00A0(0x0010)(Net, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FGameplayTagContainer                  GrantableQuestTags;                                // 0x00B0(0x0020)(Edit, NativeAccessSpecifierPrivate)

public:
	void BindToQuestManagerDelegates();
	void HandleOnJunoQuestComplete(TScriptInterface<class IQuestInstanceInterface>* QuestInstance);
	void RollGrantableQuestID();

	class FString GetGrantableQuestID() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JunoQuestGiverComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JunoQuestGiverComponent")
	}
	static class UJunoQuestGiverComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoQuestGiverComponent>();
	}
};
DUMPER7_ASSERTS_UJunoQuestGiverComponent;

// Class JunoAdventuresRuntime.JunoQuestSpawnPointComponent
// 0x0000 (0x00A0 - 0x00A0)
class UJunoQuestSpawnPointComponent final : public UGameFrameworkComponent
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JunoQuestSpawnPointComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JunoQuestSpawnPointComponent")
	}
	static class UJunoQuestSpawnPointComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoQuestSpawnPointComponent>();
	}
};
DUMPER7_ASSERTS_UJunoQuestSpawnPointComponent;

// Class JunoAdventuresRuntime.JunoTokenHandlerAIComponent
// 0x0010 (0x00B8 - 0x00A8)
class UJunoTokenHandlerAIComponent final : public UFortPawnComponent
{
public:
	uint8                                         Pad_A8[0x10];                                      // 0x00A8(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ReceiveToken(const struct FGameplayTag& JunoToken);

	const struct FGameplayTagContainer GetSavedTokens() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JunoTokenHandlerAIComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JunoTokenHandlerAIComponent")
	}
	static class UJunoTokenHandlerAIComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoTokenHandlerAIComponent>();
	}
};
DUMPER7_ASSERTS_UJunoTokenHandlerAIComponent;

// Class JunoAdventuresRuntime.JunoQuestPoolDataAsset
// 0x0018 (0x0048 - 0x0030)
class UJunoQuestPoolDataAsset final : public UDataAsset
{
public:
	TArray<struct FJunoQuestPoolDataAssetEntry>   QuestEntries;                                      // 0x0030(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FGameplayTag                           QuestPoolTag;                                      // 0x0040(0x0004)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JunoQuestPoolDataAsset")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JunoQuestPoolDataAsset")
	}
	static class UJunoQuestPoolDataAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoQuestPoolDataAsset>();
	}
};
DUMPER7_ASSERTS_UJunoQuestPoolDataAsset;

// Class JunoAdventuresRuntime.JunoQuestDatabaseComponent
// 0x00B0 (0x01A8 - 0x00F8)
class UJunoQuestDatabaseComponent final : public UFortPlayspaceComponent
{
public:
	uint8                                         Pad_F8[0xA0];                                      // 0x00F8(0x00A0)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UJunoQuestPoolDataAsset*>        QuestPoolAssets;                                   // 0x0198(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, UObjectWrapper, NativeAccessSpecifierPrivate)

public:
	EJunoQuestState GetJunoQuestState(const class FString& QuestID) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JunoQuestDatabaseComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JunoQuestDatabaseComponent")
	}
	static class UJunoQuestDatabaseComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoQuestDatabaseComponent>();
	}
};
DUMPER7_ASSERTS_UJunoQuestDatabaseComponent;

// Class JunoAdventuresRuntime.JunoQuestManagerComponent
// 0x0060 (0x04B0 - 0x0450)
class UJunoQuestManagerComponent final : public UFortPlayspaceComponent_Quests
{
public:
	uint8                                         Pad_450[0x60];                                     // 0x0450(0x0060)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ActivateQuest(const class UFortQuestItemDefinition_Athena* QuestDefinition, class AActor* QuestGiver);
	void SendQuestStatEvent(EFortQuestObjectiveStatEvent Type, const struct FGameplayTagContainer& SourceTags, const struct FGameplayTagContainer& TargetTags, int32 Count);

	const class AActor* GetQuestGiverForQuestID(const class FString& QuestID) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JunoQuestManagerComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JunoQuestManagerComponent")
	}
	static class UJunoQuestManagerComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoQuestManagerComponent>();
	}
};
DUMPER7_ASSERTS_UJunoQuestManagerComponent;

// Class JunoAdventuresRuntime.JunoEncounterManagerComponent
// 0x0000 (0x00F8 - 0x00F8)
class UJunoEncounterManagerComponent final : public UFortPlayspaceComponent
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JunoEncounterManagerComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JunoEncounterManagerComponent")
	}
	static class UJunoEncounterManagerComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoEncounterManagerComponent>();
	}
};
DUMPER7_ASSERTS_UJunoEncounterManagerComponent;

// Class JunoAdventuresRuntime.JunoPOIQuestComponent
// 0x0000 (0x0450 - 0x0450)
class UJunoPOIQuestComponent final : public UFortPlayspaceComponent_Quests
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JunoPOIQuestComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JunoPOIQuestComponent")
	}
	static class UJunoPOIQuestComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoPOIQuestComponent>();
	}
};
DUMPER7_ASSERTS_UJunoPOIQuestComponent;

// Class JunoAdventuresRuntime.JunoActionsDB
// 0x0050 (0x0078 - 0x0028)
class UJunoActionsDB final : public UObject
{
public:
	TMap<struct FGameplayTag, struct FMappedJunoActions> JunoTokenToJunoActions;                     // 0x0028(0x0050)(Edit, ContainsInstancedReference, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JunoActionsDB")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JunoActionsDB")
	}
	static class UJunoActionsDB* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoActionsDB>();
	}
};
DUMPER7_ASSERTS_UJunoActionsDB;

// Class JunoAdventuresRuntime.PlayspaceComponent_JunoActionsDB
// 0x0010 (0x0108 - 0x00F8)
class UPlayspaceComponent_JunoActionsDB final : public UFortPlayspaceComponent
{
public:
	TArray<TSubclassOf<class UJunoActionsDB>>     JunoActionsDBs;                                    // 0x00F8(0x0010)(Edit, ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PlayspaceComponent_JunoActionsDB")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PlayspaceComponent_JunoActionsDB")
	}
	static class UPlayspaceComponent_JunoActionsDB* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlayspaceComponent_JunoActionsDB>();
	}
};
DUMPER7_ASSERTS_UPlayspaceComponent_JunoActionsDB;

// Class JunoAdventuresRuntime.FortQuestDefinitionComponent_Juno
// 0x00A8 (0x0120 - 0x0078)
class UFortQuestDefinitionComponent_Juno : public UFortQuestDefinitionComponent
{
public:
	struct FJunoQuestData                         JunoQuestData;                                     // 0x0078(0x00A8)(Edit, NativeAccessSpecifierPublic)

public:
	TArray<class FName> Editor_GetValidObjectiveNames() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortQuestDefinitionComponent_Juno")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortQuestDefinitionComponent_Juno")
	}
	static class UFortQuestDefinitionComponent_Juno* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortQuestDefinitionComponent_Juno>();
	}
};
DUMPER7_ASSERTS_UFortQuestDefinitionComponent_Juno;

// Class JunoAdventuresRuntime.FortQuestDefinitionComponent_JunoEncounter
// 0x0000 (0x0120 - 0x0120)
class UFortQuestDefinitionComponent_JunoEncounter final : public UFortQuestDefinitionComponent_Juno
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortQuestDefinitionComponent_JunoEncounter")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortQuestDefinitionComponent_JunoEncounter")
	}
	static class UFortQuestDefinitionComponent_JunoEncounter* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortQuestDefinitionComponent_JunoEncounter>();
	}
};
DUMPER7_ASSERTS_UFortQuestDefinitionComponent_JunoEncounter;

// Class JunoAdventuresRuntime.FortQuestItemComponent_Juno
// 0x0000 (0x0030 - 0x0030)
class UFortQuestItemComponent_Juno : public UFortQuestItemComponent
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortQuestItemComponent_Juno")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortQuestItemComponent_Juno")
	}
	static class UFortQuestItemComponent_Juno* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortQuestItemComponent_Juno>();
	}
};
DUMPER7_ASSERTS_UFortQuestItemComponent_Juno;

// Class JunoAdventuresRuntime.FortQuestItemComponent_JunoEncounter
// 0x0000 (0x0030 - 0x0030)
class UFortQuestItemComponent_JunoEncounter final : public UFortQuestItemComponent_Juno
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortQuestItemComponent_JunoEncounter")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortQuestItemComponent_JunoEncounter")
	}
	static class UFortQuestItemComponent_JunoEncounter* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortQuestItemComponent_JunoEncounter>();
	}
};
DUMPER7_ASSERTS_UFortQuestItemComponent_JunoEncounter;

// Class JunoAdventuresRuntime.FortAthenaAISpawnerDataComponent_JunoConversation
// 0x0030 (0x0298 - 0x0268)
class UFortAthenaAISpawnerDataComponent_JunoConversation final : public UFortAthenaAISpawnerDataComponent_AIBotConversation
{
public:
	class UProxyTable*                            NPCMoodReactionAnimTable;                          // 0x0268(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FGameplayTagContainer                  GrantableQuestTags;                                // 0x0270(0x0020)(Edit, NativeAccessSpecifierPrivate)
	bool                                          bShouldCreateMerchantComponent;                    // 0x0290(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_291[0x7];                                      // 0x0291(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortAthenaAISpawnerDataComponent_JunoConversation")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortAthenaAISpawnerDataComponent_JunoConversation")
	}
	static class UFortAthenaAISpawnerDataComponent_JunoConversation* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAthenaAISpawnerDataComponent_JunoConversation>();
	}
};
DUMPER7_ASSERTS_UFortAthenaAISpawnerDataComponent_JunoConversation;

// Class JunoAdventuresRuntime.JunoAdventuresBlueprintLibrary
// 0x0000 (0x0028 - 0x0028)
class UJunoAdventuresBlueprintLibrary final : public UBlueprintFunctionLibrary
{
public:
	static class UJunoQuestDatabaseComponent* GetJunoQuestDatabase(const class UObject* WorldContextObject);
	static class UJunoQuestManagerComponent* GetJunoQuestManager(const class UObject* WorldContextObject);

public:
