#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: JunoWorldManagement

#include "Basic.hpp"

#include "JsonUtilities_structs.hpp"
#include "McpProfileSys_structs.hpp"


namespace SDK::Params
{

// Function JunoWorldManagement.JunoWorldMCPProto_Profile.ProtoJuno_CreateWorld
// 0x00A0 (0x00A0 - 0x0000)
struct JunoWorldMCPProto_Profile_ProtoJuno_CreateWorld final
{
public:
	struct FJsonObjectWrapper                     world_metadata;                                    // 0x0000(0x0020)(ConstParm, Parm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FClientUrlContext                      Context;                                           // 0x0020(0x0080)(Parm, OutParm, RepSkip, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_JunoWorldMCPProto_Profile_ProtoJuno_CreateWorld;

// Function JunoWorldManagement.JunoWorldMCPProto_Profile.ProtoJuno_DeleteAllWorlds
// 0x0080 (0x0080 - 0x0000)
struct JunoWorldMCPProto_Profile_ProtoJuno_DeleteAllWorlds final
{
public:
	struct FClientUrlContext                      Context;                                           // 0x0000(0x0080)(Parm, OutParm, RepSkip, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_JunoWorldMCPProto_Profile_ProtoJuno_DeleteAllWorlds;

// Function JunoWorldManagement.JunoWorldMCPProto_Profile.ProtoJuno_DeleteWorld
// 0x0090 (0x0090 - 0x0000)
struct JunoWorldMCPProto_Profile_ProtoJuno_DeleteWorld final
{
public:
	class FString                                 WorldId;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FClientUrlContext                      Context;                                           // 0x0010(0x0080)(Parm, OutParm, RepSkip, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_JunoWorldMCPProto_Profile_ProtoJuno_DeleteWorld;

// Function JunoWorldManagement.JunoWorldMCPProto_Profile.ProtoJuno_MarkWorldDeleted
// 0x0090 (0x0090 - 0x0000)
struct JunoWorldMCPProto_Profile_ProtoJuno_MarkWorldDeleted final
{
public:
	class FString                                 WorldId;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FClientUrlContext                      Context;                                           // 0x0010(0x0080)(Parm, OutParm, RepSkip, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_JunoWorldMCPProto_Profile_ProtoJuno_MarkWorldDeleted;

// Function JunoWorldManagement.JunoWorldMCPProto_Profile.ProtoJuno_SetWorldName
// 0x00A0 (0x00A0 - 0x0000)
struct JunoWorldMCPProto_Profile_ProtoJuno_SetWorldName final
{
public:
	class FString                                 WorldId;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Name_0;                                            // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FClientUrlContext                      Context;                                           // 0x0020(0x0080)(Parm, OutParm, RepSkip, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_JunoWorldMCPProto_Profile_ProtoJuno_SetWorldName;

// Function JunoWorldManagement.JunoWorldMCPProto_Profile.ProtoJuno_UpdateWorldLastAccessTime
// 0x0090 (0x0090 - 0x0000)
struct JunoWorldMCPProto_Profile_ProtoJuno_UpdateWorldLastAccessTime final
{
public:
	class FString                                 WorldId;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FClientUrlContext                      Context;                                           // 0x0010(0x0080)(Parm, OutParm, RepSkip, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_JunoWorldMCPProto_Profile_ProtoJuno_UpdateWorldLastAccessTime;

// Function JunoWorldManagement.JunoWorldMCPProto_Profile.ProtoJuno_UpdateWorldMetadata
// 0x00B0 (0x00B0 - 0x0000)
struct JunoWorldMCPProto_Profile_ProtoJuno_UpdateWorldMetadata final
{
public:
	class FString                                 WorldId;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FJsonObjectWrapper                     WorldMetadata;                                     // 0x0010(0x0020)(ConstParm, Parm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FClientUrlContext                      Context;                                           // 0x0030(0x0080)(Parm, OutParm, RepSkip, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_JunoWorldMCPProto_Profile_ProtoJuno_UpdateWorldMetadata;

// Function JunoWorldManagement.JunoWorldMCPProto_Profile.ProtoJuno_UpdateWorldSysMetadata
// 0x00B0 (0x00B0 - 0x0000)
struct JunoWorldMCPProto_Profile_ProtoJuno_UpdateWorldSysMetadata final
{
public:
	class FString                                 WorldId;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FJsonObjectWrapper                     SysMetadata;                                       // 0x0010(0x0020)(ConstParm, Parm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FDedicatedServerUrlContext             Context;                                           // 0x0030(0x0080)(Parm, OutParm, RepSkip, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_JunoWorldMCPProto_Profile_ProtoJuno_UpdateWorldSysMetadata;

}

