#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: JunoAIRuntime

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function JunoAIRuntime.JunoAICampPawnComponent.ConvertAIRoleToDisplayText
// 0x0020 (0x0020 - 0x0000)
struct JunoAICampPawnComponent_ConvertAIRoleToDisplayText final
{
public:
	struct FGameplayTag                           AIRole;                                            // 0x0000(0x0004)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   ReturnValue;                                       // 0x0008(0x0018)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_JunoAICampPawnComponent_ConvertAIRoleToDisplayText;

// Function JunoAIRuntime.JunoAICampPawnComponent.GetAIRole
// 0x0004 (0x0004 - 0x0000)
struct JunoAICampPawnComponent_GetAIRole final
{
public:
	struct FGameplayTag                           ReturnValue;                                       // 0x0000(0x0004)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_JunoAICampPawnComponent_GetAIRole;

// Function JunoAIRuntime.JunoAICampPawnComponent.GetAIRoleDisplayText
// 0x0018 (0x0018 - 0x0000)
struct JunoAICampPawnComponent_GetAIRoleDisplayText final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_JunoAICampPawnComponent_GetAIRoleDisplayText;

// Function JunoAIRuntime.JunoAICampPawnComponent.GetSoftRemovedReasons
// 0x0020 (0x0020 - 0x0000)
struct JunoAICampPawnComponent_GetSoftRemovedReasons final
{
public:
	struct FGameplayTagContainer                  ReturnValue;                                       // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_JunoAICampPawnComponent_GetSoftRemovedReasons;

// Function JunoAIRuntime.PlayspaceComponent_Root_JunoAIManagement.HandleFTUENPCSpawned
// 0x0008 (0x0008 - 0x0000)
struct PlayspaceComponent_Root_JunoAIManagement_HandleFTUENPCSpawned final
{
public:
	const class AActor*                           FTUENPC;                                           // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PlayspaceComponent_Root_JunoAIManagement_HandleFTUENPCSpawned;

// Function JunoAIRuntime.JunoAISafetyBubbleComponent.OnTimeOfDayPhaseChanged
// 0x0003 (0x0003 - 0x0000)
struct JunoAISafetyBubbleComponent_OnTimeOfDayPhaseChanged final
{
public:
	EFortDayPhase                                 CurrentDayPhase;                                   // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EFortDayPhase                                 PreviousDayPhase;                                  // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAtCreation;                                       // 0x0002(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_JunoAISafetyBubbleComponent_OnTimeOfDayPhaseChanged;

// Function JunoAIRuntime.JunoAICheatManager.JunoEnableFriendlyCreatures
// 0x0001 (0x0001 - 0x0000)
struct JunoAICheatManager_JunoEnableFriendlyCreatures final
{
public:
	bool                                          bEnable;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_JunoAICheatManager_JunoEnableFriendlyCreatures;

// Function JunoAIRuntime.JunoAICheatManager.JunoEnableFriendlyNPCs
// 0x0001 (0x0001 - 0x0000)
struct JunoAICheatManager_JunoEnableFriendlyNPCs final
{
public:
	bool                                          bEnable;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_JunoAICheatManager_JunoEnableFriendlyNPCs;

// Function JunoAIRuntime.JunoAICheatManager.JunoEnableHostileCreatures
// 0x0001 (0x0001 - 0x0000)
struct JunoAICheatManager_JunoEnableHostileCreatures final
{
public:
	bool                                          bEnable;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_JunoAICheatManager_JunoEnableHostileCreatures;

}

