#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: JunoAIRuntime

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "GameplayAbilities_structs.hpp"
#include "FortniteAI_structs.hpp"
#include "FortniteAI_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "JunoAIRuntime_structs.hpp"
#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "JunoGameNative_classes.hpp"
#include "CoreUObject_classes.hpp"
#include "FortniteAIServer_classes.hpp"
#include "LagerRuntime_structs.hpp"
#include "LagerRuntime_classes.hpp"
#include "WorldConditions_structs.hpp"
#include "WorldConditions_classes.hpp"


namespace SDK
{

// Class JunoAIRuntime.JunoAIBotController
// 0x0200 (0x1950 - 0x1750)
class AJunoAIBotController final : public AFortAthenaAIBotController
{
public:
	class UJunoAIInventoryComponent*              JunoAIInventoryComponent;                          // 0x1750(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<struct FItemAndCount>                  DefaultItemsToAdd;                                 // 0x1758(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1768[0x89];                                    // 0x1768(0x0089)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bRequiresPersistentInventory;                      // 0x17F1(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_17F2[0x6];                                     // 0x17F2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         EnableDurabilityOnInventory;                       // 0x17F8(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         UseRoleCheckForDurability;                         // 0x1820(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FGameplayTagQuery                      RequiredRoleForDurability;                         // 0x1848(0x0048)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	bool                                          bUseFocusedActorEyeLocationForFocalPoint;          // 0x1890(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bUseValidItemsPerType;                             // 0x1891(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1892[0x6];                                     // 0x1892(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         EffectivenessMultiplierForWeaponSelectionOnPickedOrAddedItem; // 0x1898(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	TMap<struct FGameplayTag, struct FValidItemSlotConfiguration> ValidItemsTablePerType;            // 0x18C0(0x0050)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	class UFortItemDefinition*                    AutomaticallyEquippedWeaponOnDurabilityBreak;      // 0x1910(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         DurabilityMultiplier;                              // 0x1918(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FGameplayTag                           TagToApplyWhenAddingFallbackItemForDurabilityBreak; // 0x1940(0x0004)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1944[0xC];                                     // 0x1944(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JunoAIBotController")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JunoAIBotController")
	}
	static class AJunoAIBotController* GetDefaultObj()
	{
		return GetDefaultObjImpl<AJunoAIBotController>();
	}
};
DUMPER7_ASSERTS_AJunoAIBotController;

// Class JunoAIRuntime.JunoAIBotEvaluator_FallbackBehavior
// 0x0080 (0x0228 - 0x01A8)
class UJunoAIBotEvaluator_FallbackBehavior final : public UFortAthenaAIBotEvaluator_Movement
{
public:
	uint8                                         Pad_1A8[0x18];                                     // 0x01A8(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEQSParametrizedQueryExecutionRequest  EQSRequest;                                        // 0x01C0(0x0048)(Edit, NativeAccessSpecifierPrivate)
	TSubclassOf<class UNavigationQueryFilter>     NavigationQueryFilterClass;                        // 0x0208(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bFallbackToPointWithNoCustomNavigationQueryFilter; // 0x0210(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_211[0x3];                                      // 0x0211(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   BestTargetActorName;                               // 0x0214(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_218[0x4];                                      // 0x0218(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   EnableKeyName;                                     // 0x021C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_220[0x8];                                      // 0x0220(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JunoAIBotEvaluator_FallbackBehavior")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JunoAIBotEvaluator_FallbackBehavior")
	}
	static class UJunoAIBotEvaluator_FallbackBehavior* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoAIBotEvaluator_FallbackBehavior>();
	}
};
DUMPER7_ASSERTS_UJunoAIBotEvaluator_FallbackBehavior;

// Class JunoAIRuntime.JunoAIBotEvaluator_FTUENPC
// 0x00C0 (0x0168 - 0x00A8)
class UJunoAIBotEvaluator_FTUENPC final : public UFortAthenaAIBotEvaluator
{
public:
	uint8                                         Pad_A8[0x24];                                      // 0x00A8(0x0024)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   TeleportDestinationKeyName;                        // 0x00CC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_D0[0x4];                                       // 0x00D0(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ShouldTeleportKeyName;                             // 0x00D4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_D8[0x8];                                       // 0x00D8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJunoAIFTUERuntimeConfiguration        FTUERuntimeConfiguration;                          // 0x00E0(0x0088)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JunoAIBotEvaluator_FTUENPC")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JunoAIBotEvaluator_FTUENPC")
	}
	static class UJunoAIBotEvaluator_FTUENPC* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoAIBotEvaluator_FTUENPC>();
	}
};
DUMPER7_ASSERTS_UJunoAIBotEvaluator_FTUENPC;

// Class JunoAIRuntime.JunoAIBotEvaluator_HardRemovalStart
// 0x0088 (0x0230 - 0x01A8)
class UJunoAIBotEvaluator_HardRemovalStart final : public UFortAthenaAIBotEvaluator_Movement
{
public:
	uint8                                         Pad_1A8[0x18];                                     // 0x01A8(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEQSParametrizedQueryExecutionRequest  EQSRequest;                                        // 0x01C0(0x0048)(Edit, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         RequestHardRemovalOnSuccess;                       // 0x0208(0x0028)(Edit, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JunoAIBotEvaluator_HardRemovalStart")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JunoAIBotEvaluator_HardRemovalStart")
	}
	static class UJunoAIBotEvaluator_HardRemovalStart* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoAIBotEvaluator_HardRemovalStart>();
	}
};
DUMPER7_ASSERTS_UJunoAIBotEvaluator_HardRemovalStart;

// Class JunoAIRuntime.JunoAIBotEvaluator_OffhandWeapon
// 0x0068 (0x0110 - 0x00A8)
class UJunoAIBotEvaluator_OffhandWeapon final : public UFortAthenaAIBotEvaluator
{
public:
	uint8                                         Pad_A8[0x18];                                      // 0x00A8(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           TorchWeaponTag;                                    // 0x00C0(0x0004)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FGameplayTag                           MinTemperatureStateToAlwaysEquipTorch;             // 0x00C4(0x0004)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FGameplayTag                           TemperatureStateUsedToDecideSpecialTimeTorchUsage; // 0x00C8(0x0004)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         MaxDeltaFromHotTemperatureToEquipTorch;            // 0x00CC(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class FName>                           ExecutionStatusesToCheckedToHolsterKeyNames;       // 0x00D0(0x0010)(Edit, ZeroConstructor, AdvancedDisplay, NativeAccessSpecifierPrivate)
	uint8                                         Pad_E0[0x10];                                      // 0x00E0(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           BoolsToCheckToHolsterKeyNames;                     // 0x00F0(0x0010)(Edit, ZeroConstructor, AdvancedDisplay, NativeAccessSpecifierPrivate)
	uint8                                         Pad_100[0x10];                                     // 0x0100(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JunoAIBotEvaluator_OffhandWeapon")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JunoAIBotEvaluator_OffhandWeapon")
	}
	static class UJunoAIBotEvaluator_OffhandWeapon* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoAIBotEvaluator_OffhandWeapon>();
	}
};
DUMPER7_ASSERTS_UJunoAIBotEvaluator_OffhandWeapon;

// Class JunoAIRuntime.JunoAIBotEvaluator_UnderThunderBehavior
// 0x0110 (0x02B8 - 0x01A8)
class UJunoAIBotEvaluator_UnderThunderBehavior final : public UFortAthenaAIBotEvaluator_Movement
{
public:
	uint8                                         Pad_1A8[0x30];                                     // 0x01A8(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         IsEnabled;                                         // 0x01D8(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         UseTagForShelterCheck;                             // 0x0200(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTag                           TagToCheckForSheltered;                            // 0x0228(0x0004)(Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_22C[0x4];                                      // 0x022C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EObjectTypeQuery>                      ShelterQueryTypes;                                 // 0x0230(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         MaxShelterDistance;                                // 0x0240(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         MinDistanceFromShelterLocationToKeepItValid;       // 0x0268(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                  ShelterCollidingActorRequiresAnyTag;               // 0x0290(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTag                           TagToApplyForShelteredNPC;                         // 0x02B0(0x0004)(Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTag                           TagToApplyForNonShelteredNPC;                      // 0x02B4(0x0004)(Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JunoAIBotEvaluator_UnderThunderBehavior")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JunoAIBotEvaluator_UnderThunderBehavior")
	}
	static class UJunoAIBotEvaluator_UnderThunderBehavior* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoAIBotEvaluator_UnderThunderBehavior>();
	}
};
DUMPER7_ASSERTS_UJunoAIBotEvaluator_UnderThunderBehavior;

// Class JunoAIRuntime.JunoAIBotEvaluator_UnstuckFailsafe
// 0x0110 (0x01B8 - 0x00A8)
class UJunoAIBotEvaluator_UnstuckFailsafe final : public UFortAthenaAIBotEvaluator
{
public:
	uint8                                         Pad_A8[0x18];                                      // 0x00A8(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   TeleportDestinationKeyName;                        // 0x00C0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   ShouldTeleportKeyName;                             // 0x00C4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_C8[0x8];                                       // 0x00C8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJunoAIUnstuckFailsafeConfiguration    Configuration;                                     // 0x00D0(0x00E8)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JunoAIBotEvaluator_UnstuckFailsafe")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JunoAIBotEvaluator_UnstuckFailsafe")
	}
	static class UJunoAIBotEvaluator_UnstuckFailsafe* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoAIBotEvaluator_UnstuckFailsafe>();
	}
};
DUMPER7_ASSERTS_UJunoAIBotEvaluator_UnstuckFailsafe;

// Class JunoAIRuntime.JunoAICampPawnComponent
// 0x0280 (0x0328 - 0x00A8)
class UJunoAICampPawnComponent final : public UFortPawnComponent
{
public:
	TMulticastInlineDelegate<void(const struct FGameplayTagContainer& NewSoftRemovedReason)> OnJunoAICampPawnComponentChangedSoftRemovedReason; // 0x00A8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPrivate)
	uint8                                         Pad_B8[0xF0];                                      // 0x00B8(0x00F0)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TSubclassOf<class UFortAthenaAIBotSkillSet>> PreFTUESkillSetClasses;                      // 0x01A8(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1B8[0x50];                                     // 0x01B8(0x0050)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<struct FGameplayTag, class FText>        AIRoleToDisplayText;                               // 0x0208(0x0050)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	TArray<TSubclassOf<class UFortAthenaAIBotSkillSet>> FTUESkillSetClasses;                         // 0x0258(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, UObjectWrapper, NativeAccessSpecifierPrivate)
	struct FGameplayTagContainer                  FTUETagsToAdd;                                     // 0x0268(0x0020)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         FTUEOverrideTileGenerationRadius;                  // 0x0288(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         FTUEOverrideTileRemovalRadius;                     // 0x02B0(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         TimeToGoInHardRemovalStartStateBeforeHardRemovalInRealSeconds; // 0x02D8(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         TimeForVisitorsToGoInHardRemovalStartStateBeforeHardRemovalInRealSeconds; // 0x0300(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)

public:
	const class FText ConvertAIRoleToDisplayText(const struct FGameplayTag& AIRole) const;
	const struct FGameplayTag GetAIRole() const;
	const class FText GetAIRoleDisplayText() const;
	const struct FGameplayTagContainer GetSoftRemovedReasons() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JunoAICampPawnComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JunoAICampPawnComponent")
	}
	static class UJunoAICampPawnComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoAICampPawnComponent>();
	}
};
DUMPER7_ASSERTS_UJunoAICampPawnComponent;

// Class JunoAIRuntime.JunoAIInventoryComponent
// 0x0010 (0x0328 - 0x0318)
class UJunoAIInventoryComponent final : public UJunoInventoryComponent
{
public:
	uint8                                         Pad_318[0x10];                                     // 0x0318(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JunoAIInventoryComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JunoAIInventoryComponent")
	}
	static class UJunoAIInventoryComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoAIInventoryComponent>();
	}
};
DUMPER7_ASSERTS_UJunoAIInventoryComponent;

// Class JunoAIRuntime.JunoAIMerchantComponent
// 0x0050 (0x00F8 - 0x00A8)
class UJunoAIMerchantComponent final : public UFortPawnComponent
{
public:
	uint8                                         Pad_A8[0x50];                                      // 0x00A8(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JunoAIMerchantComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JunoAIMerchantComponent")
	}
	static class UJunoAIMerchantComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoAIMerchantComponent>();
	}
};
DUMPER7_ASSERTS_UJunoAIMerchantComponent;

// Class JunoAIRuntime.JunoAIRuntimeAnalytics
// 0x0000 (0x0028 - 0x0028)
class UJunoAIRuntimeAnalytics final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JunoAIRuntimeAnalytics")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JunoAIRuntimeAnalytics")
	}
	static class UJunoAIRuntimeAnalytics* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoAIRuntimeAnalytics>();
	}
};
DUMPER7_ASSERTS_UJunoAIRuntimeAnalytics;

// Class JunoAIRuntime.JunoBTTask_FTUENPC
// 0x0008 (0x00F0 - 0x00E8)
class UJunoBTTask_FTUENPC final : public UFortBTTask_ExecuteGameplayAbility
{
public:
	class FName                                   FTUENPCStatusKeyName;                              // 0x00E8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   ShouldTeleportKeyName;                             // 0x00EC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JunoBTTask_FTUENPC")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JunoBTTask_FTUENPC")
	}
	static class UJunoBTTask_FTUENPC* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoBTTask_FTUENPC>();
	}
};
DUMPER7_ASSERTS_UJunoBTTask_FTUENPC;

// Class JunoAIRuntime.JunoBTTask_ReactToVerb
// 0x0008 (0x0088 - 0x0080)
class UJunoBTTask_ReactToVerb final : public UFortAthenaBTTask_ReactToVerb
{
public:
	class FName                                   MoodReactionTagKeyName;                            // 0x0080(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JunoBTTask_ReactToVerb")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JunoBTTask_ReactToVerb")
	}
	static class UJunoBTTask_ReactToVerb* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoBTTask_ReactToVerb>();
	}
};
DUMPER7_ASSERTS_UJunoBTTask_ReactToVerb;

// Class JunoAIRuntime.JunoBTTask_RunMoodReaction
// 0x0010 (0x0080 - 0x0070)
class UJunoBTTask_RunMoodReaction final : public UBTTaskNode
{
public:
	TArray<struct FRandomizedMoodReactionConfig>  PossibleMoodReactions;                             // 0x0070(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JunoBTTask_RunMoodReaction")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JunoBTTask_RunMoodReaction")
	}
	static class UJunoBTTask_RunMoodReaction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoBTTask_RunMoodReaction>();
	}
};
DUMPER7_ASSERTS_UJunoBTTask_RunMoodReaction;

// Class JunoAIRuntime.FJunoAICampManagementVisitorWorldConditionSchema
// 0x0000 (0x0040 - 0x0040)
class UFJunoAICampManagementVisitorWorldConditionSchema final : public UJunoCampWorldConditionSchema
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FJunoAICampManagementVisitorWorldConditionSchema")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FJunoAICampManagementVisitorWorldConditionSchema")
	}
	static class UFJunoAICampManagementVisitorWorldConditionSchema* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFJunoAICampManagementVisitorWorldConditionSchema>();
	}
};
DUMPER7_ASSERTS_UFJunoAICampManagementVisitorWorldConditionSchema;

// Class JunoAIRuntime.JunoAICampManagementRewardsWorldConditionSchema
// 0x0000 (0x0040 - 0x0040)
class UJunoAICampManagementRewardsWorldConditionSchema final : public UJunoCampWorldConditionSchema
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JunoAICampManagementRewardsWorldConditionSchema")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JunoAICampManagementRewardsWorldConditionSchema")
	}
	static class UJunoAICampManagementRewardsWorldConditionSchema* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoAICampManagementRewardsWorldConditionSchema>();
	}
};
DUMPER7_ASSERTS_UJunoAICampManagementRewardsWorldConditionSchema;

// Class JunoAIRuntime.JunoCampAIManagementComponent
// 0x0728 (0x07C8 - 0x00A0)
class UJunoCampAIManagementComponent final : public UJunoCampComponentBase
{
public:
	uint8                                         Pad_A0[0x118];                                     // 0x00A0(0x0118)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TScriptInterface<class IFortAthenaLivingWorldPointProviderInterface>> PointProviders;     // 0x01B8(0x0010)(ZeroConstructor, Transient, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	class UFortAthenaLivingWorldEncounterInstance* Encounter;                                        // 0x01C8(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FJunoAICampManagementVisitorsConfigurationDigested VisitorsConfigurationDigested;         // 0x01D0(0x0018)(Transient, Protected, NativeAccessSpecifierProtected)
	struct FJunoAICampManagementVisitorsPickingConfiguration CachedVisitorsPickingConfigurationAtCurrentAwesomenessLevel; // 0x01E8(0x0020)(Transient, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_208[0x8];                                      // 0x0208(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJunoAICampManagementLWMConfiguration  LWMConfiguration;                                  // 0x0210(0x03A0)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FJunoAICampManagementVisitorsConfiguration VisitorsConfiguration;                         // 0x05B0(0x0030)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TMap<int32, struct FDataTableRowHandle>       AwesomenessLevelToVisitorsPickingConfiguration;    // 0x05E0(0x0050)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TMap<int32, class UDataTable*>                AwesomenessLevelToNPCRewards;                      // 0x0630(0x0050)(Edit, DisableEditOnInstance, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	struct FScalableFloat                         InitialIngameHoursDelayBeforeFirstRewardRoll;      // 0x0680(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         MinimumIngameHoursBetweenRewardRolls;              // 0x06A8(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         PassiveResourceGatheringTime;                      // 0x06D0(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         MultiplierForSimulatedGeneration;                  // 0x06F8(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         MaximumAllocableSOPerAIForSimulation;              // 0x0720(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FNavAgentSelector                      SupportedAgents;                                   // 0x0748(0x0004)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_74C[0x4];                                      // 0x074C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         ShouldCheckWCForRemoteRecruitment;                 // 0x0750(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         RequireNPCToBeInVisitorsListForRemoteRecruitment;  // 0x0778(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         SpawnDelayFromCampSpawn;                           // 0x07A0(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JunoCampAIManagementComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JunoCampAIManagementComponent")
	}
	static class UJunoCampAIManagementComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoCampAIManagementComponent>();
	}
};
DUMPER7_ASSERTS_UJunoCampAIManagementComponent;

// Class JunoAIRuntime.JunoCaveLivingWorldEventData
// 0x0058 (0x01A8 - 0x0150)
class UJunoCaveLivingWorldEventData final : public UFortAthenaLivingWorldEventData
{
public:
	uint8                                         Pad_150[0x8];                                      // 0x0150(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         CaveRoomDistanceMin;                               // 0x0158(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         CaveRoomDistanceMax;                               // 0x0180(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JunoCaveLivingWorldEventData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JunoCaveLivingWorldEventData")
	}
	static class UJunoCaveLivingWorldEventData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoCaveLivingWorldEventData>();
	}
};
DUMPER7_ASSERTS_UJunoCaveLivingWorldEventData;

// Class JunoAIRuntime.JunoAIFTUEEndWorldConditionSchema
// 0x0000 (0x0038 - 0x0038)
class UJunoAIFTUEEndWorldConditionSchema final : public UWorldConditionSchema
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JunoAIFTUEEndWorldConditionSchema")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JunoAIFTUEEndWorldConditionSchema")
	}
	static class UJunoAIFTUEEndWorldConditionSchema* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoAIFTUEEndWorldConditionSchema>();
	}
};
DUMPER7_ASSERTS_UJunoAIFTUEEndWorldConditionSchema;

// Class JunoAIRuntime.PlayspaceComponent_Root_JunoAIManagement
// 0x0E60 (0x0F58 - 0x00F8)
class UPlayspaceComponent_Root_JunoAIManagement final : public UFortPlayspaceComponent
{
public:
	struct FJunoAIFollowerLWMConfiguration        LWMConfiguration;                                  // 0x00F8(0x03A0)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FJunoAITemporaryGlobalEncounterLWMConfiguration TemporaryGlobalEncounterLWMConfiguration; // 0x0498(0x0398)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FJunoAIFTUEConfiguration               FTUEConfiguration;                                 // 0x0830(0x0480)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         MaxNoInteractionTimeBeforeSoftRemovalInJunoGameTimeHours; // 0x0CB0(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         TimeBeforeSoftRemovedAIBecomesHardRemovedInJunoGameTimeHours; // 0x0CD8(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         TimeToRemoveStaleFollowersFromDisconnectedPlayersInRealHours; // 0x0D00(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         SecondsToWaitBeforeRemovingStaleFollowers;         // 0x0D28(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         GlobalRecruitableNPCsCap;                          // 0x0D50(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	uint8                                         Pad_D78[0x20];                                     // 0x0D78(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FJunoAIFollowerManagedData>     ManagedFollowers;                                  // 0x0D98(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	TScriptInterface<class IFortAthenaLivingWorldPointProviderInterface> TemporaryGlobalEncounterPointProvider; // 0x0DA8(0x0010)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortAthenaLivingWorldEncounterInstance* TemporaryGlobalEncounter;                         // 0x0DB8(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TScriptInterface<class IFortAthenaLivingWorldPointProviderInterface> FTUEEncounterPointProvider; // 0x0DC0(0x0010)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortAthenaLivingWorldEncounterInstance* FTUEEncounter;                                    // 0x0DD0(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FWorldConditionQueryState              FTUEEndQueryState;                                 // 0x0DD8(0x0030)(Transient, NativeAccessSpecifierPrivate)
	uint8                                         Pad_E08[0xB0];                                     // 0x0E08(0x00B0)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<struct FGameplayTag, struct FJunoAIWorldNPCSpawningData> WorldAssignedNPCs;                 // 0x0EB8(0x0050)(Transient, NativeAccessSpecifierPrivate)
	uint8                                         Pad_F08[0x50];                                     // 0x0F08(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleFTUENPCSpawned(const class AActor* FTUENPC);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PlayspaceComponent_Root_JunoAIManagement")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PlayspaceComponent_Root_JunoAIManagement")
	}
	static class UPlayspaceComponent_Root_JunoAIManagement* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlayspaceComponent_Root_JunoAIManagement>();
	}
};
DUMPER7_ASSERTS_UPlayspaceComponent_Root_JunoAIManagement;

// Class JunoAIRuntime.JunoAISafetyBubbleComponent
// 0x00A8 (0x0148 - 0x00A0)
class UJunoAISafetyBubbleComponent final : public UActorComponent
{
public:
	TArray<struct FFortAthenaLivingWorldEventTagDensityRegistration> TagsData;                       // 0x00A0(0x0010)(Edit, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         InGameHoursDuration;                               // 0x00B0(0x0028)(Edit, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         SafetyBubbleRadius;                                // 0x00D8(0x0028)(Edit, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_100[0x48];                                     // 0x0100(0x0048)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnTimeOfDayPhaseChanged(EFortDayPhase CurrentDayPhase, EFortDayPhase PreviousDayPhase, bool bAtCreation);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JunoAISafetyBubbleComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JunoAISafetyBubbleComponent")
	}
	static class UJunoAISafetyBubbleComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoAISafetyBubbleComponent>();
	}
};
DUMPER7_ASSERTS_UJunoAISafetyBubbleComponent;

// Class JunoAIRuntime.EnvQueryTest_JunoIsNearBuilding
// 0x00A0 (0x0298 - 0x01F8)
class UEnvQueryTest_JunoIsNearBuilding final : public UEnvQueryTest
{
public:
	struct FEnvOverlapData                        OverlapData;                                       // 0x01F8(0x0030)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	struct FAIDataProviderBoolValue               GenerateOnlyInsideClusterBounds;                   // 0x0228(0x0038)(Edit, DisableEditOnInstance, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FAIDataProviderFloatValue              MinimumBuildingClusterVolume;                      // 0x0260(0x0038)(Edit, DisableEditOnInstance, ContainsInstancedReference, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EnvQueryTest_JunoIsNearBuilding")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EnvQueryTest_JunoIsNearBuilding")
	}
	static class UEnvQueryTest_JunoIsNearBuilding* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEnvQueryTest_JunoIsNearBuilding>();
	}
};
DUMPER7_ASSERTS_UEnvQueryTest_JunoIsNearBuilding;

// Class JunoAIRuntime.EnvQueryTest_JunoIsUnderCeiling
// 0x0068 (0x0260 - 0x01F8)
class UEnvQueryTest_JunoIsUnderCeiling final : public UEnvQueryTest
{
public:
	struct FEnvOverlapData                        SweepData;                                         // 0x01F8(0x0030)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	struct FAIDataProviderFloatValue              SweepHeight;                                       // 0x0228(0x0038)(Edit, DisableEditOnInstance, ContainsInstancedReference, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EnvQueryTest_JunoIsUnderCeiling")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EnvQueryTest_JunoIsUnderCeiling")
	}
	static class UEnvQueryTest_JunoIsUnderCeiling* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEnvQueryTest_JunoIsUnderCeiling>();
	}
};
DUMPER7_ASSERTS_UEnvQueryTest_JunoIsUnderCeiling;

// Class JunoAIRuntime.JunoAIBotEvaluator_ReactToVerb
// 0x0010 (0x0400 - 0x03F0)
class UJunoAIBotEvaluator_ReactToVerb final : public UFortAthenaAIBotEvaluator_ReactToVerb
{
public:
	class FName                                   MoodReactionTagKeyName;                            // 0x03F0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3F4[0xC];                                      // 0x03F4(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JunoAIBotEvaluator_ReactToVerb")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JunoAIBotEvaluator_ReactToVerb")
	}
	static class UJunoAIBotEvaluator_ReactToVerb* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoAIBotEvaluator_ReactToVerb>();
	}
};
DUMPER7_ASSERTS_UJunoAIBotEvaluator_ReactToVerb;

// Class JunoAIRuntime.JunoAICheatManager
// 0x0000 (0x0028 - 0x0028)
class UJunoAICheatManager final : public UChildCheatManager
{
public:
	void JunoEnableFriendlyCreatures(bool bEnable);
	void JunoEnableFriendlyNPCs(bool bEnable);
	void JunoEnableHostileCreatures(bool bEnable);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JunoAICheatManager")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JunoAICheatManager")
	}
	static class UJunoAICheatManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoAICheatManager>();
	}
};
DUMPER7_ASSERTS_UJunoAICheatManager;

// Class JunoAIRuntime.PlayspaceComponent_JunoAISafetyBubble
// 0x0010 (0x0108 - 0x00F8)
class UPlayspaceComponent_JunoAISafetyBubble final : public UFortPlayspaceComponent
{
public:
	TSubclassOf<class UJunoAISafetyBubbleComponent> SafetyBubbleComponent;                           // 0x00F8(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bPreventSafetyBubbleInCamp;                        // 0x0100(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PlayspaceComponent_JunoAISafetyBubble")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PlayspaceComponent_JunoAISafetyBubble")
	}
	static class UPlayspaceComponent_JunoAISafetyBubble* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlayspaceComponent_JunoAISafetyBubble>();
	}
};
DUMPER7_ASSERTS_UPlayspaceComponent_JunoAISafetyBubble;

// Class JunoAIRuntime.AITask_JunoMoveTo
// 0x0018 (0x0130 - 0x0118)
class UAITask_JunoMoveTo final : public UAITask_MoveTo
{
public:
	struct FJunoMoveConfig                        MoveConfig;                                        // 0x0118(0x000C)(NoDestructor, Protected, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class AActor>                  BlockedByActor;                                    // 0x0124(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_12C[0x4];                                      // 0x012C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AITask_JunoMoveTo")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AITask_JunoMoveTo")
	}
	static class UAITask_JunoMoveTo* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAITask_JunoMoveTo>();
	}
};
DUMPER7_ASSERTS_UAITask_JunoMoveTo;

// Class JunoAIRuntime.BTTask_JunoMoveTo
// 0x00B8 (0x0178 - 0x00C0)
class UBTTask_JunoMoveTo final : public UFortAthenaBTTask_MoveTo
{
public:
	uint8                                         bOnUnreachableGoalFindBlockingBuilding : 1;        // 0x00C0(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bAssignFoundBlockingBuildingAsTarget : 1;          // 0x00C0(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         BlockingBuildingTraceDistance;                     // 0x00C8(0x0028)(Edit, NativeAccessSpecifierPublic)
	struct FScalableFloat                         BlockingBuildingTraceCooldown;                     // 0x00F0(0x0028)(Edit, NativeAccessSpecifierPublic)
	struct FBlackboardKeySelector                 BlockedByBuildingKeySelector;                      // 0x0118(0x0028)(Edit, NativeAccessSpecifierPublic)
	struct FBlackboardKeySelector                 LastBlockingBuildingTraceTimeKeySelector;          // 0x0140(0x0028)(Edit, NativeAccessSpecifierPublic)
	EPathObstacleAction                           PathObstacleAction;                                // 0x0168(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_169[0x3];                                      // 0x0169(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	uint8                                         bApplyCostLimit : 1;                               // 0x016C(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_16D[0x3];                                      // 0x016D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         PathingCostLimitFactor;                            // 0x0170(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PathingMinimumCostLimit;                           // 0x0174(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BTTask_JunoMoveTo")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BTTask_JunoMoveTo")
	}
	static class UBTTask_JunoMoveTo* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTTask_JunoMoveTo>();
	}
};
DUMPER7_ASSERTS_UBTTask_JunoMoveTo;

// Class JunoAIRuntime.JunoWorldCondition_AIWorldSettings_State
// 0x0028 (0x0050 - 0x0028)
class UJunoWorldCondition_AIWorldSettings_State final : public UObject
{
public:
	uint8                                         Pad_28[0x28];                                      // 0x0028(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JunoWorldCondition_AIWorldSettings_State")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JunoWorldCondition_AIWorldSettings_State")
	}
	static class UJunoWorldCondition_AIWorldSettings_State* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoWorldCondition_AIWorldSettings_State>();
	}
};
DUMPER7_ASSERTS_UJunoWorldCondition_AIWorldSettings_State;

}

