#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: KeepPlayingTogetherOverlay

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass KeepPlayingTogetherOverlay.KeepPlayingTogetherOverlay_C
// 0x0058 (0x03F0 - 0x0398)
class UKeepPlayingTogetherOverlay_C final : public UAthenaKeepPlayingTogetherScreenOverlay
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0398(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       InitialCountdownState;                             // 0x03A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Countdown;                                         // 0x03A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UAthenaServerShutdownWidget_C*          AthenaServerShutdownWidget;                        // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPostGameBottomBarWidget_C*             PostGameBottomBarWidget;                           // 0x03B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         SquadBox;                                          // 0x03C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_ErrorHeader;                                  // 0x03C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_Waiting;                                      // 0x03D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   CachedErrorText;                                   // 0x03D8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void UpdateExitToLobbyCountdownText(double CountdownValue);
	void PreConstruct(bool IsDesignTime);
	void OnPreMatchmakingCountdownStarted();
	void OnPreMatchmakingCountdownProgressed();
	void OnMatchmakingStarted();
	void OnMatchmakingFinished(bool bSuccess);
	void OnKeepPlayingTogetherScreenOverlayDeactivated();
	void OnKeepPlayingTogetherScreenOverlayActivated();
	void OnExitToLobbyCountdownProgressed(float CountdownValue);
	void ExecuteUbergraph_KeepPlayingTogetherOverlay(int32 EntryPoint);
	void Destruct();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("KeepPlayingTogetherOverlay_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KeepPlayingTogetherOverlay_C")
	}
	static class UKeepPlayingTogetherOverlay_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKeepPlayingTogetherOverlay_C>();
	}
};
DUMPER7_ASSERTS_UKeepPlayingTogetherOverlay_C;

}

