#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: KillerInfoWeaponWidget

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function KillerInfoWeaponWidget.KillerInfoWeaponWidget_C.Set Icon And Name
// 0x0028 (0x0028 - 0x0000)
struct KillerInfoWeaponWidget_C_Set_Icon_And_Name final
{
public:
	class UTexture2D*                             Weapon_Icon;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   Weapon_Name;                                       // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	EFortRarity                                   Weapon_Rarity;                                     // 0x0020(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_KillerInfoWeaponWidget_C_Set_Icon_And_Name;

// Function KillerInfoWeaponWidget.KillerInfoWeaponWidget_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct KillerInfoWeaponWidget_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_KillerInfoWeaponWidget_C_PreConstruct;

// Function KillerInfoWeaponWidget.KillerInfoWeaponWidget_C.ExecuteUbergraph_KillerInfoWeaponWidget
// 0x01C8 (0x01C8 - 0x0000)
struct KillerInfoWeaponWidget_C_ExecuteUbergraph_KillerInfoWeaponWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortRarity                                   K2Node_CustomEvent_Rarity;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortRarityItemData                    CallFunc_BPGetRarityData_ReturnValue;              // 0x0008(0x0080)()
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_CustomEvent_Weapon_Icon;                    // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_CustomEvent_Weapon_Name;                    // 0x0098(0x0018)()
	EFortRarity                                   K2Node_CustomEvent_Weapon_Rarity;                  // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B2[0x6];                                       // 0x00B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortRarityItemData                    CallFunc_BPGetRarityData_ReturnValue_1;            // 0x00B8(0x0080)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0138(0x0014)()
	uint8                                         Pad_14C[0x4];                                      // 0x014C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0150(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x01A0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x01B0(0x0018)()
};
DUMPER7_ASSERTS_KillerInfoWeaponWidget_C_ExecuteUbergraph_KillerInfoWeaponWidget;

// Function KillerInfoWeaponWidget.KillerInfoWeaponWidget_C.Colorize
// 0x0001 (0x0001 - 0x0000)
struct KillerInfoWeaponWidget_C_Colorize final
{
public:
	EFortRarity                                   Rarity;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_KillerInfoWeaponWidget_C_Colorize;

}

