#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LimeNative

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "LimeNative_structs.hpp"
#include "GameFeatures_classes.hpp"
#include "CoreUObject_classes.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK
{

// Class LimeNative.LimeAnalytics
// 0x0030 (0x0058 - 0x0028)
class ULimeAnalytics : public UObject
{
public:
	TArray<struct FLimeAnalyticsContext>          AnalyticsContexts;                                 // 0x0028(0x0010)(Edit, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_38[0x20];                                      // 0x0038(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LimeAnalytics")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LimeAnalytics")
	}
	static class ULimeAnalytics* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULimeAnalytics>();
	}
};
DUMPER7_ASSERTS_ULimeAnalytics;

// Class LimeNative.LimeBaseLayerAnimInstance
// 0x0010 (0x0470 - 0x0460)
#pragma pack(push, 0x1)
class alignas(0x10) ULimeBaseLayerAnimInstance : public UFortBaseAnimInstance
{
public:
	uint8                                         bHasIsTargetingTag : 1;                            // 0x0458(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (BlueprintVisible, BlueprintReadOnly, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_459[0x3];                                      // 0x0459(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TWeakObjectPtr<class UJunoPlayerAnimInstance> MainAnimInstanceWeakPtr;                           // 0x045C(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_464[0x4];                                      // 0x0464(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LimeBaseLayerAnimInstance")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LimeBaseLayerAnimInstance")
	}
	static class ULimeBaseLayerAnimInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULimeBaseLayerAnimInstance>();
	}
};
#pragma pack(pop)
DUMPER7_ASSERTS_ULimeBaseLayerAnimInstance;

// Class LimeNative.LimeDBNOAnimInstance
// 0x0030 (0x04A0 - 0x0470)
class ULimeDBNOAnimInstance final : public ULimeBaseLayerAnimInstance
{
public:
	EFortPlayerAnimBodyType                       AnimBodyType;                                      // 0x0468(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_469[0x3];                                      // 0x0469(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         LeanAngle;                                         // 0x046C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SpeedAdjustedPlayrate;                             // 0x0470(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LeanAdditiveAlpha;                                 // 0x0474(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Speed2D;                                           // 0x0478(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MovementBlendSpaceSpeed2D;                         // 0x047C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxMovementBlendSpaceSpeed;                        // 0x0480(0x0004)(Edit, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LocalVelocityYawAngle;                             // 0x0484(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DBNOTurnPlayRate;                                  // 0x0488(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         YawDeltaCurrentTick;                               // 0x048C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         YawDeltaLastTick;                                  // 0x0490(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         YawDeltaSmoothed;                                  // 0x0494(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bIsOnGround : 1;                                   // 0x0498(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (BlueprintVisible, BlueprintReadOnly, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bTransition_FullBody_DBNOMove : 1;                 // 0x0498(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (BlueprintVisible, BlueprintReadOnly, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bTransition_FullBody_DBNOTurn : 1;                 // 0x0498(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (BlueprintVisible, BlueprintReadOnly, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bIsLargeBodyType : 1;                              // 0x0498(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (BlueprintVisible, BlueprintReadOnly, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_499[0x7];                                      // 0x0499(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LimeDBNOAnimInstance")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LimeDBNOAnimInstance")
	}
	static class ULimeDBNOAnimInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULimeDBNOAnimInstance>();
	}
};
DUMPER7_ASSERTS_ULimeDBNOAnimInstance;

// Class LimeNative.LimeOverrideManager
// 0x0068 (0x0090 - 0x0028)
class ULimeOverrideManager final : public UObject
{
public:
	uint8                                         Pad_28[0x68];                                      // 0x0028(0x0068)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnEndPlay(class AActor* Actor, EEndPlayReason EndPlayReason);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LimeOverrideManager")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LimeOverrideManager")
	}
	static class ULimeOverrideManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULimeOverrideManager>();
	}
};
DUMPER7_ASSERTS_ULimeOverrideManager;

// Class LimeNative.LimePawnComponentOverrides
// 0x00A8 (0x0150 - 0x00A8)
class ULimePawnComponentOverrides final : public UFortPawnComponent
{
public:
	TArray<struct FLimePawnComponentOverride>     ObjectOverrides;                                   // 0x00A8(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TSubclassOf<class UFortMovementMode_ExtClambering> ClamberingMME;                                // 0x00B8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnLevelSettingsChanged;                            // 0x00C0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMap<struct FGameplayTag, TSubclassOf<class UAnimInstance>> VehicleAnimLayerOverlayClass;        // 0x00D0(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TSubclassOf<class UAnimInstance>              DBNOAnimLayerClass;                                // 0x0120(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UAnimInstance>              DBNOCarriedAnimLayerClass;                         // 0x0128(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UAnimInstance>              SkydiveAnimLayerClass;                             // 0x0130(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_138[0x10];                                     // 0x0138(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UAnimInstance>              CurrentAnimLayerClass;                             // 0x0148(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void HandleEnterVehicle();
	void OnLimeSettingsEndPlay(class AActor* Actor, EEndPlayReason EndPlayReason);

	bool AreJunoControlsEnabled() const;
	bool IsOrbitCameraEnabled() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LimePawnComponentOverrides")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LimePawnComponentOverrides")
	}
	static class ULimePawnComponentOverrides* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULimePawnComponentOverrides>();
	}
};
DUMPER7_ASSERTS_ULimePawnComponentOverrides;

// Class LimeNative.LimeSkydivingAnimInstance
// 0x0090 (0x0500 - 0x0470)
class ULimeSkydivingAnimInstance final : public ULimeBaseLayerAnimInstance
{
public:
	struct FFortAnimInput_Skydiving               Skydiving;                                         // 0x0468(0x0080)(Edit, BlueprintVisible, BlueprintReadOnly, Transient, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	float                                         FreeFall_AimPitch;                                 // 0x04E8(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AimPitch;                                          // 0x04EC(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bIsAccelerating2D : 1;                             // 0x04F0(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, Transient, DisableEditOnInstance, EditConst, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_4F1[0xF];                                      // 0x04F1(0x000F)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LimeSkydivingAnimInstance")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LimeSkydivingAnimInstance")
	}
	static class ULimeSkydivingAnimInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULimeSkydivingAnimInstance>();
	}
};
DUMPER7_ASSERTS_ULimeSkydivingAnimInstance;

// Class LimeNative.LimeGameFeatureAction_AddLimeAnalytics
// 0x0028 (0x0050 - 0x0028)
class ULimeGameFeatureAction_AddLimeAnalytics final : public UGameFeatureAction
{
public:
	TSoftClassPtr<class UClass>                   LimeAnalyticsClass;                                // 0x0028(0x0020)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class ULimeAnalytics*                         LimeAnalyticsInstance;                             // 0x0048(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LimeGameFeatureAction_AddLimeAnalytics")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LimeGameFeatureAction_AddLimeAnalytics")
	}
	static class ULimeGameFeatureAction_AddLimeAnalytics* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULimeGameFeatureAction_AddLimeAnalytics>();
	}
};
DUMPER7_ASSERTS_ULimeGameFeatureAction_AddLimeAnalytics;

// Class LimeNative.LimePlayerAnimInstance
// 0x0000 (0x1B40 - 0x1B40)
class ULimePlayerAnimInstance final : public UFortPlayerAnimInstance
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LimePlayerAnimInstance")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LimePlayerAnimInstance")
	}
	static class ULimePlayerAnimInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULimePlayerAnimInstance>();
	}
};
DUMPER7_ASSERTS_ULimePlayerAnimInstance;

// Class LimeNative.LimePlayerAnimInstanceProxy
// 0x0000 (0x1620 - 0x1620)
class ULimePlayerAnimInstanceProxy final : public UFortPlayerAnimInstanceProxy
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LimePlayerAnimInstanceProxy")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LimePlayerAnimInstanceProxy")
	}
	static class ULimePlayerAnimInstanceProxy* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULimePlayerAnimInstanceProxy>();
	}
};
DUMPER7_ASSERTS_ULimePlayerAnimInstanceProxy;

// Class LimeNative.LimeCameraMode_OrbitCam
// 0x0000 (0x1BA0 - 0x1BA0)
class ULimeCameraMode_OrbitCam : public UFortCameraMode_ThirdPerson
{
public:
	void OnBecomeActiveBP(class AActor* ViewTarget);
	void UpdateCameraBP(class AActor* ViewTarget, float DeltaTime, struct FTViewTarget& OutVT);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LimeCameraMode_OrbitCam")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LimeCameraMode_OrbitCam")
	}
	static class ULimeCameraMode_OrbitCam* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULimeCameraMode_OrbitCam>();
	}
};
DUMPER7_ASSERTS_ULimeCameraMode_OrbitCam;

// Class LimeNative.LimeCameraModeOverrideComponent
// 0x0010 (0x00B8 - 0x00A8)
class ULimeCameraModeOverrideComponent final : public UFortCameraModeOverrideComponent
{
public:
	uint8                                         Pad_A8[0x8];                                       // 0x00A8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class ULimePawnComponentOverrides*            LimePawnComponentOverrides;                        // 0x00B0(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void UpdateIsOrbitCameraEnabled();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LimeCameraModeOverrideComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LimeCameraModeOverrideComponent")
	}
	static class ULimeCameraModeOverrideComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULimeCameraModeOverrideComponent>();
	}
};
DUMPER7_ASSERTS_ULimeCameraModeOverrideComponent;

// Class LimeNative.DebugObserveLimePlugin
// 0x0008 (0x0030 - 0x0028)
class UDebugObserveLimePlugin final : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DebugObserveLimePlugin")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DebugObserveLimePlugin")
	}
	static class UDebugObserveLimePlugin* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDebugObserveLimePlugin>();
	}
};
DUMPER7_ASSERTS_UDebugObserveLimePlugin;

// Class LimeNative.GameFeatureAction_LimeDebug
// 0x0010 (0x0038 - 0x0028)
class UGameFeatureAction_LimeDebug final : public UGameFeatureAction
{
public:
	TArray<class UGameFeatureAction*>             ForcePawnActions;                                  // 0x0028(0x0010)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameFeatureAction_LimeDebug")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameFeatureAction_LimeDebug")
	}
	static class UGameFeatureAction_LimeDebug* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameFeatureAction_LimeDebug>();
	}
};
DUMPER7_ASSERTS_UGameFeatureAction_LimeDebug;

// Class LimeNative.LimePawnComponentMood
// 0x0030 (0x00D8 - 0x00A8)
class ULimePawnComponentMood final : public UFortPawnComponent
{
public:
	TMulticastInlineDelegate<void(const struct FLimeMoodStateData& NewMood)> OnLimeMoodChangedDelegate; // 0x00A8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_B8[0x18];                                      // 0x00B8(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLimeMoodStateData                     CurrentMoodState;                                  // 0x00D0(0x0004)(Net, RepNotify, NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnRep_CurrentMoodState();

	const struct FLimeMoodStateData GetCurrentMoodState() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LimePawnComponentMood")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LimePawnComponentMood")
	}
	static class ULimePawnComponentMood* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULimePawnComponentMood>();
	}
};
DUMPER7_ASSERTS_ULimePawnComponentMood;

// Class LimeNative.LimePawnComponent
// 0x0000 (0x00A8 - 0x00A8)
class ULimePawnComponent final : public UFortPawnComponent
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LimePawnComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LimePawnComponent")
	}
	static class ULimePawnComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULimePawnComponent>();
	}
};
DUMPER7_ASSERTS_ULimePawnComponent;

// Class LimeNative.LimePawnComponent_EmotionalState
// 0x0090 (0x0138 - 0x00A8)
class ULimePawnComponent_EmotionalState final : public UFortPawnComponent
{
public:
	TMulticastInlineDelegate<void(ELimePawnEmotionalState NewEmotion)> OnLimeCurrentEmotionalStateChangedDelegate; // 0x00A8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(ELimePawnEmotionalState NewEmotion)> OnLimeCurrentEmotionalStateStartedChange; // 0x00B8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(float NewEmotionPercent)> OnLimeCurrentEmotionChangeFinished;      // 0x00C8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(uint8 EmotionIndex)> OnCheatEmotionIndexChanged;                   // 0x00D8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	ELimePawnEmotionalState                       CurrentEmotionalState;                             // 0x00E8(0x0001)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_E9[0x3];                                       // 0x00E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLimeEmotionalStateData                TargetEmotionalState;                              // 0x00EC(0x0010)(Net, RepNotify, NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                         CheatEmotionIndex;                                 // 0x00FC(0x0001)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_FD[0x3];                                       // 0x00FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FLimePawnEmotionalStateMappingFromAwesomeLevel> LimePawnEmotionalStateMappingFromAwesomeLevel; // 0x0100(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_110[0x8];                                      // 0x0110(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ResetToDefaultEmotionRate;                         // 0x0118(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         TimeToStayAtEmotionInSeconds;                      // 0x011C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_120[0x8];                                      // 0x0120(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           DefaultEmotionHandle;                              // 0x0128(0x0008)(Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_130[0x8];                                      // 0x0130(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleLimeAwesomeLevelChanged(const int32 NewAwesomeLevel);
	void OnRep_CheatEmotionIndex();
	void OnRep_CurrentEmotionalState();
	void OnRep_TargetEmotionalState();
	void ResetToDefaultEmotionalState();
	void SetCurrentEmotionalState(const ELimePawnEmotionalState NewEmotion);
	void SetEmotionalState(const struct FLimeEmotionalStateData& Emotion);

	ELimePawnEmotionalState GetCurrentEmotionalState() const;
	float GetCurrentEmotionalStateValue() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LimePawnComponent_EmotionalState")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LimePawnComponent_EmotionalState")
	}
	static class ULimePawnComponent_EmotionalState* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULimePawnComponent_EmotionalState>();
	}
};
DUMPER7_ASSERTS_ULimePawnComponent_EmotionalState;

// Class LimeNative.LimeGlobals
// 0x0000 (0x0028 - 0x0028)
class ULimeGlobals final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LimeGlobals")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LimeGlobals")
	}
	static class ULimeGlobals* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULimeGlobals>();
	}
};
DUMPER7_ASSERTS_ULimeGlobals;

}

