#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LiveEditObject

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "CoreUObject_classes.hpp"
#include "LiveEditObject_structs.hpp"


namespace SDK
{

// Class LiveEditObject.LiveEditNetworkStreamChannel
// 0x0000 (0x0068 - 0x0068)
class ULiveEditNetworkStreamChannel : public UChannel
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LiveEditNetworkStreamChannel")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LiveEditNetworkStreamChannel")
	}
	static class ULiveEditNetworkStreamChannel* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULiveEditNetworkStreamChannel>();
	}
};
DUMPER7_ASSERTS_ULiveEditNetworkStreamChannel;

// Class LiveEditObject.LiveEditLargeNetworkMessageChannel
// 0x0048 (0x00B0 - 0x0068)
class ULiveEditLargeNetworkMessageChannel : public ULiveEditNetworkStreamChannel
{
public:
	uint8                                         Pad_68[0x48];                                      // 0x0068(0x0048)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LiveEditLargeNetworkMessageChannel")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LiveEditLargeNetworkMessageChannel")
	}
	static class ULiveEditLargeNetworkMessageChannel* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULiveEditLargeNetworkMessageChannel>();
	}
};
DUMPER7_ASSERTS_ULiveEditLargeNetworkMessageChannel;

// Class LiveEditObject.LiveEditObjectChannel
// 0x00F8 (0x01A8 - 0x00B0)
class ULiveEditObjectChannel final : public ULiveEditLargeNetworkMessageChannel
{
public:
	uint8                                         Pad_B0[0xF8];                                      // 0x00B0(0x00F8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LiveEditObjectChannel")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LiveEditObjectChannel")
	}
	static class ULiveEditObjectChannel* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULiveEditObjectChannel>();
	}
};
DUMPER7_ASSERTS_ULiveEditObjectChannel;

// Class LiveEditObject.LiveEditObjectConnection
// 0x0378 (0x03A0 - 0x0028)
class ULiveEditObjectConnection final : public UObject
{
public:
	uint8                                         Pad_28[0x378];                                     // 0x0028(0x0378)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LiveEditObjectConnection")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LiveEditObjectConnection")
	}
	static class ULiveEditObjectConnection* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULiveEditObjectConnection>();
	}
};
DUMPER7_ASSERTS_ULiveEditObjectConnection;

// Class LiveEditObject.LiveEditObjectSubsystemState
// 0x0250 (0x0278 - 0x0028)
class ULiveEditObjectSubsystemState final : public UObject
{
public:
	uint8                                         Pad_28[0x10];                                      // 0x0028(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ULiveEditObjectConnection*>      Connections;                                       // 0x0038(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPublic)
	uint8                                         Pad_48[0x230];                                     // 0x0048(0x0230)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LiveEditObjectSubsystemState")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LiveEditObjectSubsystemState")
	}
	static class ULiveEditObjectSubsystemState* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULiveEditObjectSubsystemState>();
	}
};
DUMPER7_ASSERTS_ULiveEditObjectSubsystemState;

// Class LiveEditObject.LiveEditObjectSubsystem
// 0x0158 (0x0188 - 0x0030)
class ULiveEditObjectSubsystem final : public UEngineSubsystem
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MaxBytesQueuedForReplication;                      // 0x0038(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         NumPackageMapBunchesToDelayTickFor;                // 0x003C(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class ULiveEditObjectSubsystemState*>  NetDriverStates;                                   // 0x0040(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                         Pad_50[0x138];                                     // 0x0050(0x0138)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LiveEditObjectSubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LiveEditObjectSubsystem")
	}
	static class ULiveEditObjectSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULiveEditObjectSubsystem>();
	}
};
DUMPER7_ASSERTS_ULiveEditObjectSubsystem;

// Class LiveEditObject.LiveEditObjectTestObject
// 0x0158 (0x0180 - 0x0028)
class ULiveEditObjectTestObject final : public UObject
{
public:
	int32                                         int32_0[0x3];                                      // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLiveEditObjectTestStruct              StructProperty;                                    // 0x0038(0x0148)(NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LiveEditObjectTestObject")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LiveEditObjectTestObject")
	}
	static class ULiveEditObjectTestObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULiveEditObjectTestObject>();
	}
};
DUMPER7_ASSERTS_ULiveEditObjectTestObject;

}

