#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LocomotionInitiativeRuntime

#include "Basic.hpp"

#include "PoseSearch_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "LocomotionInitiativeRuntime_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "MotionTrajectory_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// Class LocomotionInitiativeRuntime.FortLocomotionLayerMaskDataAsset
// 0x0020 (0x0050 - 0x0030)
class UFortLocomotionLayerMaskDataAsset final : public UDataAsset
{
public:
	float                                         MaskingHeadTorsoAlpha;                             // 0x0030(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaskingLeftArmAlpha;                               // 0x0034(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaskingRightArmAlpha;                              // 0x0038(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaskingWeaponAlpha;                                // 0x003C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MutingHeadTorsoAlpha;                              // 0x0040(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MutingLeftArmAlpha;                                // 0x0044(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MutingRightArmAlpha;                               // 0x0048(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MutingWeaponAlpha;                                 // 0x004C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	void ApplyTo(struct FFortLocomotionLayerMaskDataSet* DataAsset) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortLocomotionLayerMaskDataAsset")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortLocomotionLayerMaskDataAsset")
	}
	static class UFortLocomotionLayerMaskDataAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortLocomotionLayerMaskDataAsset>();
	}
};
DUMPER7_ASSERTS_UFortLocomotionLayerMaskDataAsset;

// Class LocomotionInitiativeRuntime.FortPlayerMotionMatchingLocomotionAnimInstance
// 0x0460 (0x1A80 - 0x1620)
class UFortPlayerMotionMatchingLocomotionAnimInstance final : public UFortPlayerAnimInstanceProxy
{
public:
	struct FCachedAnimStateArray                  IdleStatesData;                                    // 0x1620(0x0018)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FVector                                FutureRootMotionVelocity;                          // 0x1638(0x0018)(Edit, BlueprintVisible, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMotionMatchingLODConfig               HighEndConfig;                                     // 0x1650(0x0038)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FMotionMatchingLODConfig               LowEndConfig;                                      // 0x1688(0x0038)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FMotionMatchingLODConfig               CurrentLODConfig;                                  // 0x16C0(0x0038)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	class UAnimSequence*                          SelectedIdleBreak;                                 // 0x16F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UProxyAsset*                            MotionMatchingLODProxyAsset;                       // 0x1700(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MotionMatchingLOD;                                 // 0x1708(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMotionMatchingBlendInfo               MotionMatchingBlendInfo;                           // 0x170C(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_1714[0x4];                                     // 0x1714(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UAnimNotifyState>           StopBranchOutWindowNotifyClass;                    // 0x1718(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EFortMotionMatchingLocomotionState            LocomotionState;                                   // 0x1720(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1721[0x3];                                     // 0x1721(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         StartToLoopSearchDelaySeconds;                     // 0x1724(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PivotToLoopSearchDelaySeconds;                     // 0x1728(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PivotSpeedThreshold;                               // 0x172C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PivotDotProductThresholdRun;                       // 0x1730(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DiagonalDetectionThreshold;                        // 0x1734(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PivotDotProductThresholdWalk;                      // 0x1738(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LocomotionStateTime;                               // 0x173C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         VelocityDirection;                                 // 0x1740(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MotionMatchingWeight;                              // 0x1744(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPoseSearchInterruptMode                      DatabaseSearchInterruptMode;                       // 0x1748(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseOrientationWarping;                            // 0x1749(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseFutureForOrientationWarping;                   // 0x174A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsLowEnd;                                         // 0x174B(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseLocomotionBlendspace;                          // 0x174C(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShouldPlayIdle;                                   // 0x174D(0x0001)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShouldPlayIdleBreak;                              // 0x174E(0x0001)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShouldExitIdleBreak;                              // 0x174F(0x0001)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShouldExitIdleBreakSlow;                          // 0x1750(0x0001)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1751[0x3];                                     // 0x1751(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         IdleTransitionTimer;                               // 0x1754(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         IdleBreakTimer;                                    // 0x1758(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bBothHandsIKInHandSpace;                           // 0x175C(0x0001)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsCrouchedTransition;                             // 0x175D(0x0001)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bWasCrouching;                                     // 0x175E(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShouldPlayStandToCrouchTransition;                // 0x175F(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShouldPlayCrouchToStandTransition;                // 0x1760(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShouldExitCrouchTransition;                       // 0x1761(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsLocallyControlled;                              // 0x1762(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1763[0x1];                                     // 0x1763(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CameraSpamYawThreshold;                            // 0x1764(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CameraSpamCoolDownSeconds;                         // 0x1768(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CameraSpamSearchThrottleTime;                      // 0x176C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DefaultSearchThrottleTime;                         // 0x1770(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SearchThrottleTime;                                // 0x1774(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AdditiveLeanAlpha;                                 // 0x1778(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableAdditiveLeans;                              // 0x177C(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableAdditiveRunLeans;                           // 0x177D(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDisableArcs;                                      // 0x177E(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDisableDiamonds;                                  // 0x177F(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIdleToMotionMatchingNoInertialization;            // 0x1780(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRelaxedStateChanged;                              // 0x1781(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsMelee;                                          // 0x1782(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseRelaxedMotionMatchingData;                     // 0x1783(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1784[0x4];                                     // 0x1784(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPoseSearchQueryTrajectory             Trajectory;                                        // 0x1788(0x0010)(BlueprintVisible, BlueprintReadOnly, Transient, NativeAccessSpecifierPublic)
	struct FTrajectorySamplingData                TrajectorySamplingData;                            // 0x1798(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_17B8[0x8];                                     // 0x17B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCharacterTrajectoryData               CharacterTrajectoryData;                           // 0x17C0(0x01E0)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	float                                         TrajectorySpeedMultiplier;                         // 0x19A0(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LowFrictionCustomMaxSpeed;                         // 0x19A4(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LowFrictionCustomBrakingDeceleration;              // 0x19A8(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LowFrictionCustomFriction;                         // 0x19AC(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFortMotionMatchingAngleSpamTracker    AccelerationSpamTracker;                           // 0x19B0(0x0048)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	uint8                                         Pad_19F8[0x80];                                    // 0x19F8(0x0080)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bIsPlayingInterruptibleStop;                       // 0x1A78(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsPlayingIdleDatabase;                            // 0x1A79(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHasReachedIdle;                                   // 0x1A7A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1A7B[0x5];                                     // 0x1A7B(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnUpdateMotionMatching(const struct FAnimUpdateContext& Context, const struct FAnimNodeReference& Node);
	void OnUpdateMotionMatchingState(const struct FAnimUpdateContext& Context, const struct FAnimNodeReference& Node);

	class UBlendProfile* GetMotionMatchingBlendProfile() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortPlayerMotionMatchingLocomotionAnimInstance")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortPlayerMotionMatchingLocomotionAnimInstance")
	}
	static class UFortPlayerMotionMatchingLocomotionAnimInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortPlayerMotionMatchingLocomotionAnimInstance>();
	}
};
DUMPER7_ASSERTS_UFortPlayerMotionMatchingLocomotionAnimInstance;

// Class LocomotionInitiativeRuntime.LocomotionInitiativeComponent
// 0x0058 (0x00F8 - 0x00A0)
class ULocomotionInitiativeComponent final : public UActorComponent
{
public:
	uint8                                         Pad_A0[0x8];                                       // 0x00A0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UAnimInstance>              MotionMatchingLocomotionAnimBlueprintClass;        // 0x00A8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UAnimInstance>              RigidBodyPBA_AnimBlueprintClass;                   // 0x00B0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FScalableFloat                         IsLocomotionInitiativeEnabled;                     // 0x00B8(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	class UAnimSequence*                          CrouchShuffleInPlaceAnim;                          // 0x00E0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E8[0x10];                                      // 0x00E8(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LocomotionInitiativeComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LocomotionInitiativeComponent")
	}
	static class ULocomotionInitiativeComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULocomotionInitiativeComponent>();
	}
};
DUMPER7_ASSERTS_ULocomotionInitiativeComponent;

// Class LocomotionInitiativeRuntime.LocomotionInitiativeGameFeatureData
// 0x0008 (0x0538 - 0x0530)
class ULocomotionInitiativeGameFeatureData final : public UFortGameFeatureData
{
public:
	struct FPerPlatformBool                       SkydivingEnablePhysicsBasedAnimationByDefault;     // 0x0530(0x0001)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_531[0x7];                                      // 0x0531(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LocomotionInitiativeGameFeatureData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LocomotionInitiativeGameFeatureData")
	}
	static class ULocomotionInitiativeGameFeatureData* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULocomotionInitiativeGameFeatureData>();
	}
};
DUMPER7_ASSERTS_ULocomotionInitiativeGameFeatureData;

}

