#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LowMemoryFallbackRuntime

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"
#include "LowMemoryFallbackRuntime_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class LowMemoryFallbackRuntime.LowMemoryFallbackStrategy
// 0x0010 (0x0038 - 0x0028)
class ULowMemoryFallbackStrategy : public UObject
{
public:
	class FString                                 FriendlyNameForAnalytics;                          // 0x0028(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LowMemoryFallbackStrategy")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LowMemoryFallbackStrategy")
	}
	static class ULowMemoryFallbackStrategy* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULowMemoryFallbackStrategy>();
	}
};
DUMPER7_ASSERTS_ULowMemoryFallbackStrategy;

// Class LowMemoryFallbackRuntime.BootToFrontend_LowMemoryFallbackStrategy
// 0x0018 (0x0050 - 0x0038)
class UBootToFrontend_LowMemoryFallbackStrategy final : public ULowMemoryFallbackStrategy
{
public:
	class FText                                   Message;                                           // 0x0038(0x0018)(Edit, Config, DisableEditOnInstance, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BootToFrontend_LowMemoryFallbackStrategy")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BootToFrontend_LowMemoryFallbackStrategy")
	}
	static class UBootToFrontend_LowMemoryFallbackStrategy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBootToFrontend_LowMemoryFallbackStrategy>();
	}
};
DUMPER7_ASSERTS_UBootToFrontend_LowMemoryFallbackStrategy;

// Class LowMemoryFallbackRuntime.LowMemoryFallbackWorldSubsystem
// 0x00E0 (0x0110 - 0x0030)
class ULowMemoryFallbackWorldSubsystem : public UWorldSubsystem
{
public:
	uint8                                         Pad_30[0x90];                                      // 0x0030(0x0090)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 PluginName;                                        // 0x00C0(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<struct FLowMemoryFallbackThreshold>    Thresholds;                                        // 0x00D0(0x0010)(Edit, ZeroConstructor, Config, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	TArray<struct FLowMemoryFallbackThresholdState> ThresholdStates;                                 // 0x00E0(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	uint8                                         Pad_F0[0x20];                                      // 0x00F0(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LowMemoryFallbackWorldSubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LowMemoryFallbackWorldSubsystem")
	}
	static class ULowMemoryFallbackWorldSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULowMemoryFallbackWorldSubsystem>();
	}
};
DUMPER7_ASSERTS_ULowMemoryFallbackWorldSubsystem;

// Class LowMemoryFallbackRuntime.Toast_LowMemoryFallbackStrategy
// 0x0050 (0x0088 - 0x0038)
class UToast_LowMemoryFallbackStrategy final : public ULowMemoryFallbackStrategy
{
public:
	class FText                                   ToastTitle;                                        // 0x0038(0x0018)(Edit, Config, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	class FText                                   ToastDescription;                                  // 0x0050(0x0018)(Edit, Config, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	TSoftObjectPtr<class UObject>                 ToastIcon;                                         // 0x0068(0x0020)(Edit, Config, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("Toast_LowMemoryFallbackStrategy")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Toast_LowMemoryFallbackStrategy")
	}
	static class UToast_LowMemoryFallbackStrategy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UToast_LowMemoryFallbackStrategy>();
	}
};
DUMPER7_ASSERTS_UToast_LowMemoryFallbackStrategy;

}

