#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LumenEmissiveLight_Component

#include "Basic.hpp"


namespace SDK::Params
{

// Function LumenEmissiveLight_Component.LumenEmissiveLight_Component_C.pushValuesToPrimData
// 0x0008 (0x0008 - 0x0000)
struct LumenEmissiveLight_Component_C_pushValuesToPrimData final
{
public:
	float                                         CallFunc_SetCustomPrimitiveDataFloat_Value_ImplicitCast; // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetCustomPrimitiveDataFloat_Value_ImplicitCast_1; // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_LumenEmissiveLight_Component_C_pushValuesToPrimData;

// Function LumenEmissiveLight_Component.LumenEmissiveLight_Component_C.MakeConfigurable
// 0x0010 (0x0010 - 0x0000)
struct LumenEmissiveLight_Component_C_MakeConfigurable final
{
public:
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_1; // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_LumenEmissiveLight_Component_C_MakeConfigurable;

}

