#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LumenEmissiveLight_Component

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass LumenEmissiveLight_Component.LumenEmissiveLight_Component_C
// 0x0020 (0x05E0 - 0x05C0)
class ULumenEmissiveLight_Component_C final : public UStaticMeshComponent
{
public:
	bool                                          OverrideWithCustomValues_;                         // 0x05C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_5C1[0x7];                                      // 0x05C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp;                                              // 0x05C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Brightness;                                        // 0x05D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LowerBrightness;                                   // 0x05D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void pushValuesToPrimData();
	void MakeConfigurable();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("LumenEmissiveLight_Component_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LumenEmissiveLight_Component_C")
	}
	static class ULumenEmissiveLight_Component_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULumenEmissiveLight_Component_C>();
	}
};
DUMPER7_ASSERTS_ULumenEmissiveLight_Component_C;

}

