#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MassSmartObjects

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "SmartObjectsModule_classes.hpp"
#include "MassEntity_classes.hpp"
#include "ZoneGraph_structs.hpp"
#include "ZoneGraphAnnotations_classes.hpp"
#include "MassSpawner_classes.hpp"
#include "MassSmartObjects_structs.hpp"


namespace SDK
{

// Class MassSmartObjects.SmartObjectMassBehaviorDefinition
// 0x0008 (0x0030 - 0x0028)
class USmartObjectMassBehaviorDefinition final : public USmartObjectBehaviorDefinition
{
public:
	float                                         UseTime;                                           // 0x0028(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SmartObjectMassBehaviorDefinition")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SmartObjectMassBehaviorDefinition")
	}
	static class USmartObjectMassBehaviorDefinition* GetDefaultObj()
	{
		return GetDefaultObjImpl<USmartObjectMassBehaviorDefinition>();
	}
};
DUMPER7_ASSERTS_USmartObjectMassBehaviorDefinition;

// Class MassSmartObjects.MassSmartObjectCandidatesFinderProcessor
// 0x0550 (0x0610 - 0x00C0)
class UMassSmartObjectCandidatesFinderProcessor final : public UMassProcessor
{
public:
	float                                         SearchExtents;                                     // 0x00C0(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_C4[0x54C];                                     // 0x00C4(0x054C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MassSmartObjectCandidatesFinderProcessor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MassSmartObjectCandidatesFinderProcessor")
	}
	static class UMassSmartObjectCandidatesFinderProcessor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassSmartObjectCandidatesFinderProcessor>();
	}
};
DUMPER7_ASSERTS_UMassSmartObjectCandidatesFinderProcessor;

// Class MassSmartObjects.MassSmartObjectTimedBehaviorProcessor
// 0x02A0 (0x0360 - 0x00C0)
class UMassSmartObjectTimedBehaviorProcessor final : public UMassProcessor
{
public:
	uint8                                         Pad_C0[0x2A0];                                     // 0x00C0(0x02A0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MassSmartObjectTimedBehaviorProcessor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MassSmartObjectTimedBehaviorProcessor")
	}
	static class UMassSmartObjectTimedBehaviorProcessor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassSmartObjectTimedBehaviorProcessor>();
	}
};
DUMPER7_ASSERTS_UMassSmartObjectTimedBehaviorProcessor;

// Class MassSmartObjects.MassSmartObjectUserFragmentDeinitializer
// 0x02A8 (0x0380 - 0x00D8)
class UMassSmartObjectUserFragmentDeinitializer final : public UMassObserverProcessor
{
public:
	uint8                                         Pad_D8[0x2A8];                                     // 0x00D8(0x02A8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MassSmartObjectUserFragmentDeinitializer")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MassSmartObjectUserFragmentDeinitializer")
	}
	static class UMassSmartObjectUserFragmentDeinitializer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassSmartObjectUserFragmentDeinitializer>();
	}
};
DUMPER7_ASSERTS_UMassSmartObjectUserFragmentDeinitializer;

// Class MassSmartObjects.MassSmartObjectSettings
// 0x0008 (0x0030 - 0x0028)
class UMassSmartObjectSettings final : public UMassModuleSettings
{
public:
	struct FZoneGraphTag                          SmartObjectTag;                                    // 0x0028(0x0001)(Edit, Config, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         SearchExtents;                                     // 0x002C(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MassSmartObjectSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MassSmartObjectSettings")
	}
	static class UMassSmartObjectSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassSmartObjectSettings>();
	}
};
DUMPER7_ASSERTS_UMassSmartObjectSettings;

// Class MassSmartObjects.MassSmartObjectUserTrait
// 0x0020 (0x0048 - 0x0028)
class UMassSmartObjectUserTrait final : public UMassEntityTraitBase
{
public:
	struct FGameplayTagContainer                  UserTags;                                          // 0x0028(0x0020)(Edit, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MassSmartObjectUserTrait")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MassSmartObjectUserTrait")
	}
	static class UMassSmartObjectUserTrait* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassSmartObjectUserTrait>();
	}
};
DUMPER7_ASSERTS_UMassSmartObjectUserTrait;

// Class MassSmartObjects.SmartObjectZoneAnnotations
// 0x0030 (0x05A0 - 0x0570)
class USmartObjectZoneAnnotations final : public UZoneGraphAnnotationComponent
{
public:
	struct FZoneGraphTagFilter                    AffectedLaneTags;                                  // 0x0570(0x000C)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_57C[0x4];                                      // 0x057C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSmartObjectAnnotationData>     SmartObjectAnnotationDataArray;                    // 0x0580(0x0010)(Edit, ZeroConstructor, EditConst, Protected, NativeAccessSpecifierProtected)
	struct FZoneGraphTag                          BehaviorTag;                                       // 0x0590(0x0001)(Edit, EditConst, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_591[0x7];                                      // 0x0591(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USmartObjectSubsystem*                  SmartObjectSubsystem;                              // 0x0598(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SmartObjectZoneAnnotations")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SmartObjectZoneAnnotations")
	}
	static class USmartObjectZoneAnnotations* GetDefaultObj()
	{
		return GetDefaultObjImpl<USmartObjectZoneAnnotations>();
	}
};
DUMPER7_ASSERTS_USmartObjectZoneAnnotations;

}

