#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MatchObjectivesUI

#include "Basic.hpp"

#include "UMG_classes.hpp"
#include "FortniteUI_classes.hpp"
#include "FortniteGame_structs.hpp"
#include "MatchObjectivesUI_structs.hpp"
#include "DynamicUI_classes.hpp"


namespace SDK
{

// Class MatchObjectivesUI.FortMobileButtonBehaviorComponent_MatchObjectivePicker
// 0x0010 (0x0148 - 0x0138)
class UFortMobileButtonBehaviorComponent_MatchObjectivePicker final : public UFortMobileActionButtonBehavior
{
public:
	class UFortControllerComponent_SkydiveFeedback* SkydiveFeedbackComp;                             // 0x0138(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_140[0x8];                                      // 0x0140(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleSkydiveModeChanged(ESkydiveFeedbackPhase Phase);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortMobileButtonBehaviorComponent_MatchObjectivePicker")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortMobileButtonBehaviorComponent_MatchObjectivePicker")
	}
	static class UFortMobileButtonBehaviorComponent_MatchObjectivePicker* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortMobileButtonBehaviorComponent_MatchObjectivePicker>();
	}
};
DUMPER7_ASSERTS_UFortMobileButtonBehaviorComponent_MatchObjectivePicker;

// Class MatchObjectivesUI.FortMobileHUDElement_ObjectiveSelectorWrapper
// 0x0020 (0x0370 - 0x0350)
class UFortMobileHUDElement_ObjectiveSelectorWrapper final : public UFortMobileHUDElement
{
public:
	class UMatchObjectivesSelectorWidget*         WBP_MatchQuests_Selector;                          // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USpacer*                                Spacer_ReservedSpace;                              // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UOverlay*                               Overlay_WrapperContents;                           // 0x0360(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_368[0x8];                                      // 0x0368(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleSkydiveModeChanged(ESkydiveFeedbackPhase Phase);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortMobileHUDElement_ObjectiveSelectorWrapper")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortMobileHUDElement_ObjectiveSelectorWrapper")
	}
	static class UFortMobileHUDElement_ObjectiveSelectorWrapper* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortMobileHUDElement_ObjectiveSelectorWrapper>();
	}
};
DUMPER7_ASSERTS_UFortMobileHUDElement_ObjectiveSelectorWrapper;

// Class MatchObjectivesUI.MatchObjectivesOptionEntryWidget
// 0x0038 (0x02F8 - 0x02C0)
class UMatchObjectivesOptionEntryWidget final : public UUserWidget
{
public:
	bool                                          bIsOptionSelected;                                 // 0x02C0(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsOptionFocused;                                  // 0x02C1(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2C2[0x16];                                     // 0x02C2(0x0016)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      Button_TapSelect;                                  // 0x02D8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2E0[0x18];                                     // 0x02E0(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnMatchObjectiveEntrySetup(const struct FUrgentQuestData& UrgentQuestData, const struct FFortItemQuantityPair& VisibleReward, const int32 ObjectiveCount);
	void OnOptionFocusedStateChanged(bool bIsFocused);
	void OnOptionSelectedStateChanged(bool bIsSelected);
	void OnTeammateSelectionUpdated(const TArray<class AFortPlayerState*>& PlayersThatHaveSelectedThis);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MatchObjectivesOptionEntryWidget")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MatchObjectivesOptionEntryWidget")
	}
	static class UMatchObjectivesOptionEntryWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMatchObjectivesOptionEntryWidget>();
	}
};
DUMPER7_ASSERTS_UMatchObjectivesOptionEntryWidget;

// Class MatchObjectivesUI.MatchObjectivesSocialAvatar
// 0x0008 (0x02C8 - 0x02C0)
class UMatchObjectivesSocialAvatar final : public UUserWidget
{
public:
	class UFortSocialAvatarIcon*                  Icon_SocialAvatar;                                 // 0x02C0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void SetSocialAvatar(const class AFortPlayerState* PlayerState);
	void SetSocialAvatarTexture(const TSoftObjectPtr<class UTexture2D>& AvatarTexture);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MatchObjectivesSocialAvatar")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MatchObjectivesSocialAvatar")
	}
	static class UMatchObjectivesSocialAvatar* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMatchObjectivesSocialAvatar>();
	}
};
DUMPER7_ASSERTS_UMatchObjectivesSocialAvatar;

// Class MatchObjectivesUI.MatchObjectivesUIDirectorBase
// 0x0010 (0x02C0 - 0x02B0)
class AMatchObjectivesUIDirectorBase final : public ADynamicUIDirectorBase
{
public:
	uint8                                         Pad_2B0[0x10];                                     // 0x02B0(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleSkydiveModeChanged(ESkydiveFeedbackPhase Phase);
	void OnFinishSkydiving();

	bool IsAnyChallengeAvailable() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MatchObjectivesUIDirectorBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MatchObjectivesUIDirectorBase")
	}
	static class AMatchObjectivesUIDirectorBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMatchObjectivesUIDirectorBase>();
	}
};
DUMPER7_ASSERTS_AMatchObjectivesUIDirectorBase;

// Class MatchObjectivesUI.MatchObjectivesSelectorWidget
// 0x0048 (0x0370 - 0x0328)
class UMatchObjectivesSelectorWidget final : public UFortHUDElementWidget
{
public:
	class UDynamicEntryBox*                       DynamicEntryBox_OptionEntries;                     // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UImage*                                 Image_MenuBG;                                      // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EMatchQuestsSelectorState                     WidgetSelectorState;                               // 0x0338(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_339[0x7];                                      // 0x0339(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UInputComponent*                        MatchObjectivesInputComponent;                     // 0x0340(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_HeaderToggle;                               // 0x0348(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_350[0x20];                                     // 0x0350(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void GetDailyChallengesFromMCP();
	void OnQuestEntrySelected(class UUserWidget* SelectedEntry);
	void OnSelectorOpenStateChanged();
	void SetSelectorState(const EMatchQuestsSelectorState State);
	void UpdateKeybindings();

	bool IsOpenByDefault() const;
	void PopulateChallengeEntries(const TArray<TScriptInterface<class IQuestDefinitionInterface>>& QuestOffering) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MatchObjectivesSelectorWidget")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MatchObjectivesSelectorWidget")
	}
	static class UMatchObjectivesSelectorWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMatchObjectivesSelectorWidget>();
	}
};
DUMPER7_ASSERTS_UMatchObjectivesSelectorWidget;

}

