#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MatchQuestsRuntime

#include "Basic.hpp"

#include "FortniteGame_classes.hpp"
#include "ModularGameplay_classes.hpp"
#include "MatchQuestsRuntime_structs.hpp"


namespace SDK
{

// Class MatchQuestsRuntime.ControllerComponent_MatchQuests
// 0x0088 (0x0128 - 0x00A0)
class UControllerComponent_MatchQuests final : public UControllerComponent
{
public:
	uint8                                         Pad_A0[0x18];                                      // 0x00A0(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TScriptInterface<class IQuestDefinitionInterface>> QuestOffering;                         // 0x00B8(0x0010)(Net, ZeroConstructor, RepNotify, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                         Pad_C8[0x60];                                      // 0x00C8(0x0060)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnLandedFromBus(class AFortPlayerControllerZone* PlayerController);
	void Server_SetSelectedQuest(const TScriptInterface<class IQuestDefinitionInterface>& Quest);
	void TryToGrantSelectedQuest(const struct FFortGamePhaseUpdatedEvent& Event);
	void TryToRollOffer(const struct FFortGamePhaseUpdatedEvent& Event);

	void OnRep_QuestOffering() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ControllerComponent_MatchQuests")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ControllerComponent_MatchQuests")
	}
	static class UControllerComponent_MatchQuests* GetDefaultObj()
	{
		return GetDefaultObjImpl<UControllerComponent_MatchQuests>();
	}
};
DUMPER7_ASSERTS_UControllerComponent_MatchQuests;

// Class MatchQuestsRuntime.FortGameStateComponent_SquadMatchQuests
// 0x0098 (0x0138 - 0x00A0)
class UFortGameStateComponent_SquadMatchQuests final : public UFortGameStateComponent
{
public:
	uint8                                         Pad_A0[0x18];                                      // 0x00A0(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<uint8, struct FSquadMatchQuests>         SquadQuestsMap;                                    // 0x00B8(0x0050)(NativeAccessSpecifierPrivate)
	uint8                                         Pad_108[0x30];                                     // 0x0108(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortGameStateComponent_SquadMatchQuests")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortGameStateComponent_SquadMatchQuests")
	}
	static class UFortGameStateComponent_SquadMatchQuests* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortGameStateComponent_SquadMatchQuests>();
	}
};
DUMPER7_ASSERTS_UFortGameStateComponent_SquadMatchQuests;

// Class MatchQuestsRuntime.FortPlayerStateComponent_MatchQuests
// 0x0090 (0x0130 - 0x00A0)
class UFortPlayerStateComponent_MatchQuests final : public UFortPlayerStateComponent
{
public:
	uint8                                         Pad_A0[0x30];                                      // 0x00A0(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TScriptInterface<class IQuestDefinitionInterface>> QuestOffering;                         // 0x00D0(0x0010)(Net, ZeroConstructor, RepNotify, UObjectWrapper, NativeAccessSpecifierPrivate)
	TArray<struct FSquadMemberSelection>          SquadSelections;                                   // 0x00E0(0x0010)(Net, ZeroConstructor, RepNotify, NativeAccessSpecifierPrivate)
	uint8                                         Pad_F0[0x40];                                      // 0x00F0(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnLandedFromBus(class AFortPlayerControllerZone* PlayerController);
	void Server_SetSelectedQuest(const TScriptInterface<class IQuestDefinitionInterface>& Quest);
	void TryToGrantSelectedQuest(const struct FFortGamePhaseUpdatedEvent& FortGamePhaseUpdatedEvent);

	void OnRep_QuestOffering() const;
	void OnRep_SquadSelections() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortPlayerStateComponent_MatchQuests")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortPlayerStateComponent_MatchQuests")
	}
	static class UFortPlayerStateComponent_MatchQuests* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortPlayerStateComponent_MatchQuests>();
	}
};
DUMPER7_ASSERTS_UFortPlayerStateComponent_MatchQuests;

// Class MatchQuestsRuntime.FortQuestDefinitionComponent_MatchQuests
// 0x0000 (0x0078 - 0x0078)
class UFortQuestDefinitionComponent_MatchQuests final : public UFortQuestDefinitionComponent
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortQuestDefinitionComponent_MatchQuests")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortQuestDefinitionComponent_MatchQuests")
	}
	static class UFortQuestDefinitionComponent_MatchQuests* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortQuestDefinitionComponent_MatchQuests>();
	}
};
DUMPER7_ASSERTS_UFortQuestDefinitionComponent_MatchQuests;

// Class MatchQuestsRuntime.FortQuestItemComponent_MatchQuests
// 0x0010 (0x0040 - 0x0030)
class UFortQuestItemComponent_MatchQuests final : public UFortQuestItemComponent
{
public:
	uint8                                         Pad_30[0x10];                                      // 0x0030(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortQuestItemComponent_MatchQuests")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortQuestItemComponent_MatchQuests")
	}
	static class UFortQuestItemComponent_MatchQuests* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortQuestItemComponent_MatchQuests>();
	}
};
DUMPER7_ASSERTS_UFortQuestItemComponent_MatchQuests;

// Class MatchQuestsRuntime.MatchQuestsCheatManager
// 0x0000 (0x0028 - 0x0028)
class UMatchQuestsCheatManager final : public UChildCheatManager
{
public:
	void MatchQuests_LogAvailableQuestsPool();
	void MatchQuests_LogRNGSeeds();

	void MatchQuests_LogReportSimulatedRolls(const int32 RollsToSimulate) const;
	void MatchQuests_LogSquadSelections() const;
	void MatchQuests_RollNewOffer() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MatchQuestsCheatManager")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MatchQuestsCheatManager")
	}
	static class UMatchQuestsCheatManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMatchQuestsCheatManager>();
	}
};
DUMPER7_ASSERTS_UMatchQuestsCheatManager;

}

