#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MetaHumanUEFNRuntime

#include "Basic.hpp"

#include "MetaHumanUEFNRuntime_structs.hpp"
#include "GameFeatures_classes.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class MetaHumanUEFNRuntime.GameFeatureAction_MetaHuman
// 0x00B0 (0x00D8 - 0x0028)
class UGameFeatureAction_MetaHuman final : public UGameFeatureAction
{
public:
	TMap<EMetaHumanBodyType, TSoftClassPtr<class UClass>> BodyPostAnimBPs;                           // 0x0028(0x0050)(Edit, UObjectWrapper, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UClass>                   Face_AnimBP;                                       // 0x0078(0x0020)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UClass>                   Face_PostAnimBP;                                   // 0x0098(0x0020)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UClass>                   RigidBodyAnimBP;                                   // 0x00B8(0x0020)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameFeatureAction_MetaHuman")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameFeatureAction_MetaHuman")
	}
	static class UGameFeatureAction_MetaHuman* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameFeatureAction_MetaHuman>();
	}
};
DUMPER7_ASSERTS_UGameFeatureAction_MetaHuman;

// Class MetaHumanUEFNRuntime.MetaHumanComponent
// 0x0030 (0x00D0 - 0x00A0)
class UMetaHumanComponent final : public UActorComponent
{
public:
	class USkeletalMeshComponent*                 Body;                                              // 0x00A0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USkeletalMeshComponent*                 Face;                                              // 0x00A8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USkeletalMeshComponent*                 Torso;                                             // 0x00B0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USkeletalMeshComponent*                 Legs;                                              // 0x00B8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USkeletalMeshComponent*                 Feet;                                              // 0x00C0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	EMetaHumanBodyType                            BodyType;                                          // 0x00C8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MetaHumanComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MetaHumanComponent")
	}
	static class UMetaHumanComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMetaHumanComponent>();
	}
};
DUMPER7_ASSERTS_UMetaHumanComponent;

}

