#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MilkshakeEarthquakeInfoStruct

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK
{

// UserDefinedStruct MilkshakeEarthquakeInfoStruct.MilkshakeEarthquakeInfoStruct
// 0x00E0 (0x00E0 - 0x0000)
struct FMilkshakeEarthquakeInfoStruct final
{
public:
	struct FScalableFloat                         Enabled_104_9E9BD6984687100AE0FD3CB84B7E6A76;      // 0x0000(0x0028)(Edit, BlueprintVisible)
	struct FVector2D                              CalendarEventRatio_116_DB14DEA24C94389F1DED8FAD08F78569; // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              EarthquakeSplineMoveNormalizedLength_110_2E9091BE45B8E7FF70C161AE980C69A9; // 0x0038(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              DelayBetweenEarthquakes_91_C25849394C195BDA2B398D9BEC9E0B9D; // 0x0048(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              NumberOfEarthquakes_93_299C58AD466ABA23C371AEB841D710A5; // 0x0058(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              EarthquakeDuration_95_A139A81E4EA551F5BBD8C5AB7705588B; // 0x0068(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              EarthquakeRadius_98_1E491F714C8AF8BBEADEE384F2595AD4; // 0x0078(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              BuildingDamageBaseHealthPercentage_123_380AF5A644D702698FE805B9517BE16C; // 0x0088(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         BuildingDamageDestroyChanceWeight_120_AF0EE3B646DBA906F0732C8DC472022D; // 0x0098(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<bool>                                  SafeZonePhase_106_F9A528FA4C9CFAF4C009FD820928814E; // 0x00A0(0x0010)(Edit, BlueprintVisible)
	class UCurveFloat*                            NormalizedStrengthCurve_26_C1C0A94845E1806FB67B70B9BD380EFE; // 0x00B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCurveFloat*                            NormalizedDistanceFallOffCurve_27_A4FE975840A1FA7E6D0EBB85FDDDFE6B; // 0x00B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  RequiredPlaylistTags_113_33DFD1284D4FDA8A1D11D8804B982C77; // 0x00C0(0x0020)(Edit, BlueprintVisible)
};
DUMPER7_ASSERTS_FMilkshakeEarthquakeInfoStruct;

}

