#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MilkshakeEarthquakeRepInfoStruct

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct MilkshakeEarthquakeRepInfoStruct.MilkshakeEarthquakeRepInfoStruct
// 0x0020 (0x0020 - 0x0000)
struct FMilkshakeEarthquakeRepInfoStruct final
{
public:
	float                                         EarthquakeStartGameTime_111_1F928CA54731F603A460A7B5E81D3536; // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         EarthquakeEndGameTime_109_A139A81E4EA551F5BBD8C5AB7705588B; // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         EarthquakeRadius_108_1E491F714C8AF8BBEADEE384F2595AD4; // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCurveFloat*                            NormalizedStrengthCurve_26_C1C0A94845E1806FB67B70B9BD380EFE; // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCurveFloat*                            NormalizedDistanceFallOffCurve_27_A4FE975840A1FA7E6D0EBB85FDDDFE6B; // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FMilkshakeEarthquakeRepInfoStruct;

}

