#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MinimapOverlay

#include "Basic.hpp"


namespace SDK::Params
{

// Function MinimapOverlay.MinimapOverlay_C.OnExtensionWidgetCreated
// 0x0008 (0x0008 - 0x0000)
struct MinimapOverlay_C_OnExtensionWidgetCreated final
{
public:
	class UUserWidget*                            InUserWidget;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_MinimapOverlay_C_OnExtensionWidgetCreated;

// Function MinimapOverlay.MinimapOverlay_C.ExecuteUbergraph_MinimapOverlay
// 0x0018 (0x0018 - 0x0000)
struct MinimapOverlay_C_ExecuteUbergraph_MinimapOverlay final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            K2Node_Event_InUserWidget;                         // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UOverlaySlot*                           CallFunc_AddChildToOverlay_ReturnValue;            // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_MinimapOverlay_C_ExecuteUbergraph_MinimapOverlay;

}

