#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MLDeformerRuntime

#include "Basic.hpp"

#include "FortniteGame_classes.hpp"
#include "MLDeformerFramework_classes.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class MLDeformerRuntime.FortMLDeformerComponent
// 0x0020 (0x0100 - 0x00E0)
class UFortMLDeformerComponent final : public UMLDeformerComponent
{
public:
	class UMLDeformerAsset*                       RequestedMLDeformerAsset;                          // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UMeshDeformer*                          RequestedMeshDeformerAsset;                        // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_F0[0x10];                                      // 0x00F0(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortMLDeformerComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortMLDeformerComponent")
	}
	static class UFortMLDeformerComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortMLDeformerComponent>();
	}
};
DUMPER7_ASSERTS_UFortMLDeformerComponent;

// Class MLDeformerRuntime.MLDeformerGameFeatureData
// 0x0008 (0x0538 - 0x0530)
class UMLDeformerGameFeatureData final : public UFortGameFeatureData
{
public:
	bool                                          bDisableWhenOwnerIsNotViewTarget;                  // 0x0530(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShouldRampUpWeightWhenEnabled;                    // 0x0531(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_532[0x2];                                      // 0x0532(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         WeightIncreasePerSecond;                           // 0x0534(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MLDeformerGameFeatureData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MLDeformerGameFeatureData")
	}
	static class UMLDeformerGameFeatureData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMLDeformerGameFeatureData>();
	}
};
DUMPER7_ASSERTS_UMLDeformerGameFeatureData;

// Class MLDeformerRuntime.MLDeformerAssetMapping
// 0x0130 (0x0160 - 0x0030)
class UMLDeformerAssetMapping final : public UPrimaryDataAsset
{
public:
	TArray<TSoftObjectPtr<class UAthenaCharacterItemDefinition>> CharacterItemDefinitionToMLDeformerAssetMappingKeys; // 0x0030(0x0010)(Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<TSoftObjectPtr<class UMLDeformerAsset>> CharacterItemDefinitionToMLDeformerAssetMappingValues; // 0x0040(0x0010)(Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<TSoftObjectPtr<class UCustomCharacterPart>> CharacterPartToMLDeformerAssetMappingKeys;    // 0x0050(0x0010)(Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<TSoftObjectPtr<class UMLDeformerAsset>> CharacterPartToMLDeformerAssetMappingValues;      // 0x0060(0x0010)(Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	TMap<TSoftObjectPtr<class UMLDeformerAsset>, TSoftObjectPtr<class UMeshDeformer>> MLDeformerToMeshDeformerAssetMap; // 0x0070(0x0050)(Edit, UObjectWrapper, NativeAccessSpecifierPublic)
	TMap<TSoftObjectPtr<class UAthenaCharacterItemDefinition>, TSoftObjectPtr<class UMLDeformerAsset>> CharacterItemDefinitionToMLDeformerAssetMap; // 0x00C0(0x0050)(Deprecated, UObjectWrapper, NativeAccessSpecifierPublic)
	TMap<TSoftObjectPtr<class UCustomCharacterPart>, TSoftObjectPtr<class UMLDeformerAsset>> CharacterPartToMLDeformerAssetMap; // 0x0110(0x0050)(Deprecated, UObjectWrapper, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MLDeformerAssetMapping")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MLDeformerAssetMapping")
	}
	static class UMLDeformerAssetMapping* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMLDeformerAssetMapping>();
	}
};
DUMPER7_ASSERTS_UMLDeformerAssetMapping;

// Class MLDeformerRuntime.MLDeformerComponentManager
// 0x0028 (0x00C8 - 0x00A0)
class UMLDeformerComponentManager final : public UActorComponent
{
public:
	uint8                                         Pad_A0[0x28];                                      // 0x00A0(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MLDeformerComponentManager")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MLDeformerComponentManager")
	}
	static class UMLDeformerComponentManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMLDeformerComponentManager>();
	}
};
DUMPER7_ASSERTS_UMLDeformerComponentManager;

}

