#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Mover

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Mover_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function Mover.TurnGeneratorInterface.GetTurn
// 0x0200 (0x0200 - 0x0000)
struct TurnGeneratorInterface_GetTurn final
{
public:
	struct FRotator                               TargetOrientation;                                 // 0x0000(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FMoverTickStartData                    FullStartState;                                    // 0x0018(0x0038)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FMoverDefaultSyncState                 MoverState;                                        // 0x0050(0x00F0)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FMoverTimeStep                         TimeStep;                                          // 0x0140(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FProposedMove                          ProposedMove;                                      // 0x0150(0x0088)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	class UMoverBlackboard*                       SimBlackboard;                                     // 0x01D8(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               ReturnValue;                                       // 0x01E0(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_1F8[0x8];                                      // 0x01F8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_TurnGeneratorInterface_GetTurn;

// Function Mover.MoverBasePawn.GetMoverComponent
// 0x0008 (0x0008 - 0x0000)
struct MoverBasePawn_GetMoverComponent final
{
public:
	class UMoverComponent*                        ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MoverBasePawn_GetMoverComponent;

// Function Mover.MoverDataModelBlueprintLibrary.GetLocationFromSyncState
// 0x0110 (0x0110 - 0x0000)
struct MoverDataModelBlueprintLibrary_GetLocationFromSyncState final
{
public:
	struct FMoverDefaultSyncState                 SyncState;                                         // 0x0000(0x00F0)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FVector                                ReturnValue;                                       // 0x00F0(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_108[0x8];                                      // 0x0108(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_MoverDataModelBlueprintLibrary_GetLocationFromSyncState;

// Function Mover.MoverDataModelBlueprintLibrary.GetMoveDirectionIntentFromInputs
// 0x0088 (0x0088 - 0x0000)
struct MoverDataModelBlueprintLibrary_GetMoveDirectionIntentFromInputs final
{
public:
	struct FKinematicDefaultInputs                Inputs;                                            // 0x0000(0x0070)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FVector                                ReturnValue;                                       // 0x0070(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MoverDataModelBlueprintLibrary_GetMoveDirectionIntentFromInputs;

// Function Mover.MoverDataModelBlueprintLibrary.GetMoveDirectionIntentFromSyncState
// 0x0110 (0x0110 - 0x0000)
struct MoverDataModelBlueprintLibrary_GetMoveDirectionIntentFromSyncState final
{
public:
	struct FMoverDefaultSyncState                 SyncState;                                         // 0x0000(0x00F0)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FVector                                ReturnValue;                                       // 0x00F0(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_108[0x8];                                      // 0x0108(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_MoverDataModelBlueprintLibrary_GetMoveDirectionIntentFromSyncState;

// Function Mover.MoverDataModelBlueprintLibrary.GetOrientationFromSyncState
// 0x0110 (0x0110 - 0x0000)
struct MoverDataModelBlueprintLibrary_GetOrientationFromSyncState final
{
public:
	struct FMoverDefaultSyncState                 SyncState;                                         // 0x0000(0x00F0)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FRotator                               ReturnValue;                                       // 0x00F0(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_108[0x8];                                      // 0x0108(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_MoverDataModelBlueprintLibrary_GetOrientationFromSyncState;

// Function Mover.MoverDataModelBlueprintLibrary.GetVelocityFromSyncState
// 0x0110 (0x0110 - 0x0000)
struct MoverDataModelBlueprintLibrary_GetVelocityFromSyncState final
{
public:
	struct FMoverDefaultSyncState                 SyncState;                                         // 0x0000(0x00F0)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FVector                                ReturnValue;                                       // 0x00F0(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_108[0x8];                                      // 0x0108(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_MoverDataModelBlueprintLibrary_GetVelocityFromSyncState;

// Function Mover.MoverDebugComponent.OnHistoryTrackingRollback
// 0x0020 (0x0020 - 0x0000)
struct MoverDebugComponent_OnHistoryTrackingRollback final
{
public:
	struct FMoverTimeStep                         NewTimeStep;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FMoverTimeStep                         InvalidatedTimeStep;                               // 0x0010(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MoverDebugComponent_OnHistoryTrackingRollback;

// Function Mover.MoverDebugComponent.OnMovementSimRollback
// 0x0020 (0x0020 - 0x0000)
struct MoverDebugComponent_OnMovementSimRollback final
{
public:
	struct FMoverTimeStep                         NewTimeStep;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FMoverTimeStep                         InvalidatedTimeStep;                               // 0x0010(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MoverDebugComponent_OnMovementSimRollback;

// Function Mover.MoverDebugComponent.OnMovementSimTick
// 0x0010 (0x0010 - 0x0000)
struct MoverDebugComponent_OnMovementSimTick final
{
public:
	struct FMoverTimeStep                         TimeStep;                                          // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MoverDebugComponent_OnMovementSimTick;

// Function Mover.MoverDebugComponent.SetHistoryTracking
// 0x0008 (0x0008 - 0x0000)
struct MoverDebugComponent_SetHistoryTracking final
{
public:
	float                                         SecondsToTrack;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SamplesPerSecond;                                  // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MoverDebugComponent_SetHistoryTracking;

// Function Mover.MoverDebugComponent.GetFutureTrajectory
// 0x0018 (0x0018 - 0x0000)
struct MoverDebugComponent_GetFutureTrajectory final
{
public:
	float                                         FutureSeconds;                                     // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SamplesPerSecond;                                  // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FTrajectorySampleInfo>          ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MoverDebugComponent_GetFutureTrajectory;

// Function Mover.MoverDebugComponent.GetPastTrajectory
// 0x0010 (0x0010 - 0x0000)
struct MoverDebugComponent_GetPastTrajectory final
{
public:
	TArray<struct FTrajectorySampleInfo>          ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MoverDebugComponent_GetPastTrajectory;

// Function Mover.MoverInputProducerInterface.ProduceInput
// 0x0020 (0x0020 - 0x0000)
struct MoverInputProducerInterface_ProduceInput final
{
public:
	int32                                         SimTimeMs;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMoverInputCmdContext                  InputCmdResult;                                    // 0x0008(0x0018)(Parm, OutParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MoverInputProducerInterface_ProduceInput;

// Function Mover.MoverDataCollectionLibrary.K2_AddDataToCollection
// 0x0020 (0x0020 - 0x0000)
struct MoverDataCollectionLibrary_K2_AddDataToCollection final
{
public:
	struct FMoverDataCollection                   Collection;                                        // 0x0000(0x0018)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	int32                                         SourceAsRawBytes;                                  // 0x0018(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_MoverDataCollectionLibrary_K2_AddDataToCollection;

// Function Mover.MoverDataCollectionLibrary.K2_GetDataFromCollection
// 0x0028 (0x0028 - 0x0000)
struct MoverDataCollectionLibrary_K2_GetDataFromCollection final
{
public:
	bool                                          DidSucceed;                                        // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMoverDataCollection                   Collection;                                        // 0x0008(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	int32                                         TargetAsRawBytes;                                  // 0x0020(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_MoverDataCollectionLibrary_K2_GetDataFromCollection;

// Function Mover.BaseMovementMode.K2_OnRegistered
// 0x0004 (0x0004 - 0x0000)
struct BaseMovementMode_K2_OnRegistered final
{
public:
	class FName                                   ModeName;                                          // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BaseMovementMode_K2_OnRegistered;

// Function Mover.BaseMovementMode.K2_OnSimulationTick
// 0x0150 (0x0150 - 0x0000)
struct BaseMovementMode_K2_OnSimulationTick final
{
public:
	struct FSimulationTickParams                  Params_0;                                          // 0x0000(0x00E0)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FMoverTickEndData                      ReturnValue;                                       // 0x00E0(0x0070)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BaseMovementMode_K2_OnSimulationTick;

// Function Mover.BaseMovementMode.GetBlackboard
// 0x0008 (0x0008 - 0x0000)
struct BaseMovementMode_GetBlackboard final
{
public:
	const class UMoverBlackboard*                 ReturnValue;                                       // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BaseMovementMode_GetBlackboard;

// Function Mover.BaseMovementMode.GetBlackboard_Mutable
// 0x0008 (0x0008 - 0x0000)
struct BaseMovementMode_GetBlackboard_Mutable final
{
public:
	class UMoverBlackboard*                       ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BaseMovementMode_GetBlackboard_Mutable;

// Function Mover.BaseMovementMode.GetMoverComponent
// 0x0008 (0x0008 - 0x0000)
struct BaseMovementMode_GetMoverComponent final
{
public:
	class UMoverComponent*                        ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BaseMovementMode_GetMoverComponent;

// Function Mover.BaseMovementMode.K2_OnGenerateMove
// 0x00D0 (0x00D0 - 0x0000)
struct BaseMovementMode_K2_OnGenerateMove final
{
public:
	struct FMoverTickStartData                    StartState;                                        // 0x0000(0x0038)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FMoverTimeStep                         TimeStep;                                          // 0x0038(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FProposedMove                          ReturnValue;                                       // 0x0048(0x0088)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BaseMovementMode_K2_OnGenerateMove;

// Function Mover.FallingMode.OnSimulationTick
// 0x0150 (0x0150 - 0x0000)
struct FallingMode_OnSimulationTick final
{
public:
	struct FSimulationTickParams                  Params_0;                                          // 0x0000(0x00E0)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FMoverTickEndData                      OutputState;                                       // 0x00E0(0x0070)(Parm, OutParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FallingMode_OnSimulationTick;

// Function Mover.FallingMode.OnGenerateMove
// 0x00D0 (0x00D0 - 0x0000)
struct FallingMode_OnGenerateMove final
{
public:
	struct FMoverTickStartData                    StartState;                                        // 0x0000(0x0038)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FMoverTimeStep                         TimeStep;                                          // 0x0038(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FProposedMove                          OutProposedMove;                                   // 0x0048(0x0088)(Parm, OutParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FallingMode_OnGenerateMove;

// Function Mover.FallingMode.ProcessLanded
// 0x01F0 (0x01F0 - 0x0000)
struct FallingMode_ProcessLanded final
{
public:
	struct FFloorCheckResult                      FloorResult;                                       // 0x0000(0x00F8)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FVector                                Velocity;                                          // 0x00F8(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRelativeBaseInfo                      BaseInfo;                                          // 0x0110(0x0070)(Parm, OutParm, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FMoverTickEndData                      TickEndData;                                       // 0x0180(0x0070)(Parm, OutParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FallingMode_ProcessLanded;

// Function Mover.FlyingMode.OnSimulationTick
// 0x0150 (0x0150 - 0x0000)
struct FlyingMode_OnSimulationTick final
{
public:
	struct FSimulationTickParams                  Params_0;                                          // 0x0000(0x00E0)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FMoverTickEndData                      OutputState;                                       // 0x00E0(0x0070)(Parm, OutParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FlyingMode_OnSimulationTick;

// Function Mover.FlyingMode.OnGenerateMove
// 0x00D0 (0x00D0 - 0x0000)
struct FlyingMode_OnGenerateMove final
{
public:
	struct FMoverTickStartData                    StartState;                                        // 0x0000(0x0038)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FMoverTimeStep                         TimeStep;                                          // 0x0038(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FProposedMove                          OutProposedMove;                                   // 0x0048(0x0088)(Parm, OutParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FlyingMode_OnGenerateMove;

// Function Mover.SwimmingMode.OnSimulationTick
// 0x0150 (0x0150 - 0x0000)
struct SwimmingMode_OnSimulationTick final
{
public:
	struct FSimulationTickParams                  Params_0;                                          // 0x0000(0x00E0)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FMoverTickEndData                      OutputState;                                       // 0x00E0(0x0070)(Parm, OutParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SwimmingMode_OnSimulationTick;

// Function Mover.SwimmingMode.OnGenerateMove
// 0x00D0 (0x00D0 - 0x0000)
struct SwimmingMode_OnGenerateMove final
{
public:
	struct FMoverTickStartData                    StartState;                                        // 0x0000(0x0038)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FMoverTimeStep                         TimeStep;                                          // 0x0038(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FProposedMove                          OutProposedMove;                                   // 0x0048(0x0088)(Parm, OutParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SwimmingMode_OnGenerateMove;

// Function Mover.WalkingMode.OnSimulationTick
// 0x0150 (0x0150 - 0x0000)
struct WalkingMode_OnSimulationTick final
{
public:
	struct FSimulationTickParams                  Params_0;                                          // 0x0000(0x00E0)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FMoverTickEndData                      OutputState;                                       // 0x00E0(0x0070)(Parm, OutParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_WalkingMode_OnSimulationTick;

// Function Mover.WalkingMode.OnGenerateMove
// 0x00D0 (0x00D0 - 0x0000)
struct WalkingMode_OnGenerateMove final
{
public:
	struct FMoverTickStartData                    StartState;                                        // 0x0000(0x0038)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FMoverTimeStep                         TimeStep;                                          // 0x0038(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FProposedMove                          OutProposedMove;                                   // 0x0048(0x0088)(Parm, OutParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_WalkingMode_OnGenerateMove;

// Function Mover.MovementBaseUtils.GetMovementBaseTransform
// 0x0060 (0x0060 - 0x0000)
struct MovementBaseUtils_GetMovementBaseTransform final
{
public:
	const class UPrimitiveComponent*              MovementBase;                                      // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   BoneName;                                          // 0x0008(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                OutLocation;                                       // 0x0010(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQuat                                  OutQuat;                                           // 0x0030(0x0020)(Parm, OutParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0050(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_51[0xF];                                       // 0x0051(0x000F)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_MovementBaseUtils_GetMovementBaseTransform;

// Function Mover.MovementBaseUtils.IsADynamicBase
// 0x0010 (0x0010 - 0x0000)
struct MovementBaseUtils_IsADynamicBase final
{
public:
	const class UPrimitiveComponent*              MovementBase;                                      // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_MovementBaseUtils_IsADynamicBase;

// Function Mover.MovementBaseUtils.TransformBasedDirectionToWorld
// 0x0048 (0x0048 - 0x0000)
struct MovementBaseUtils_TransformBasedDirectionToWorld final
{
public:
	const class UPrimitiveComponent*              MovementBase;                                      // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   BoneName;                                          // 0x0008(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                LocalDirection;                                    // 0x0010(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                OutDirectionWorldSpace;                            // 0x0028(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0040(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_MovementBaseUtils_TransformBasedDirectionToWorld;

// Function Mover.MovementBaseUtils.TransformBasedLocationToWorld
// 0x0048 (0x0048 - 0x0000)
struct MovementBaseUtils_TransformBasedLocationToWorld final
{
public:
	const class UPrimitiveComponent*              MovementBase;                                      // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   BoneName;                                          // 0x0008(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                LocalLocation;                                     // 0x0010(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                OutLocationWorldSpace;                             // 0x0028(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0040(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_MovementBaseUtils_TransformBasedLocationToWorld;

// Function Mover.MovementBaseUtils.TransformBasedRotatorToWorld
// 0x0048 (0x0048 - 0x0000)
struct MovementBaseUtils_TransformBasedRotatorToWorld final
{
public:
	const class UPrimitiveComponent*              MovementBase;                                      // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   BoneName;                                          // 0x0008(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               LocalRotator;                                      // 0x0010(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FRotator                               OutWorldSpaceRotator;                              // 0x0028(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0040(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_MovementBaseUtils_TransformBasedRotatorToWorld;

// Function Mover.MovementBaseUtils.TransformDirectionToLocal
// 0x0050 (0x0050 - 0x0000)
struct MovementBaseUtils_TransformDirectionToLocal final
{
public:
	struct FQuat                                  BaseQuat;                                          // 0x0000(0x0020)(Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                WorldSpaceDirection;                               // 0x0020(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                OutLocalDirection;                                 // 0x0038(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MovementBaseUtils_TransformDirectionToLocal;

// Function Mover.MovementBaseUtils.TransformDirectionToWorld
// 0x0050 (0x0050 - 0x0000)
struct MovementBaseUtils_TransformDirectionToWorld final
{
public:
	struct FQuat                                  BaseQuat;                                          // 0x0000(0x0020)(Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                LocalDirection;                                    // 0x0020(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                OutDirectionWorldSpace;                            // 0x0038(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MovementBaseUtils_TransformDirectionToWorld;

// Function Mover.MovementBaseUtils.TransformLocationToLocal
// 0x0070 (0x0070 - 0x0000)
struct MovementBaseUtils_TransformLocationToLocal final
{
public:
	struct FVector                                BasePos;                                           // 0x0000(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_18[0x8];                                       // 0x0018(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQuat                                  BaseQuat;                                          // 0x0020(0x0020)(Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                WorldSpaceLocation;                                // 0x0040(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                OutLocalLocation;                                  // 0x0058(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MovementBaseUtils_TransformLocationToLocal;

// Function Mover.MovementBaseUtils.TransformLocationToWorld
// 0x0070 (0x0070 - 0x0000)
struct MovementBaseUtils_TransformLocationToWorld final
{
public:
	struct FVector                                BasePos;                                           // 0x0000(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_18[0x8];                                       // 0x0018(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQuat                                  BaseQuat;                                          // 0x0020(0x0020)(Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                LocalLocation;                                     // 0x0040(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                OutLocationWorldSpace;                             // 0x0058(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MovementBaseUtils_TransformLocationToWorld;

// Function Mover.MovementBaseUtils.TransformRotatorToLocal
// 0x0050 (0x0050 - 0x0000)
struct MovementBaseUtils_TransformRotatorToLocal final
{
public:
	struct FQuat                                  BaseQuat;                                          // 0x0000(0x0020)(Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               WorldSpaceRotator;                                 // 0x0020(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FRotator                               OutLocalRotator;                                   // 0x0038(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MovementBaseUtils_TransformRotatorToLocal;

// Function Mover.MovementBaseUtils.TransformRotatorToWorld
// 0x0050 (0x0050 - 0x0000)
struct MovementBaseUtils_TransformRotatorToWorld final
{
public:
	struct FQuat                                  BaseQuat;                                          // 0x0000(0x0020)(Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               LocalRotator;                                      // 0x0020(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FRotator                               OutWorldSpaceRotator;                              // 0x0038(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MovementBaseUtils_TransformRotatorToWorld;

// Function Mover.MovementBaseUtils.TransformWorldDirectionToBased
// 0x0048 (0x0048 - 0x0000)
struct MovementBaseUtils_TransformWorldDirectionToBased final
{
public:
	const class UPrimitiveComponent*              MovementBase;                                      // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   BoneName;                                          // 0x0008(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                WorldSpaceDirection;                               // 0x0010(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                OutLocalDirection;                                 // 0x0028(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0040(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_MovementBaseUtils_TransformWorldDirectionToBased;

// Function Mover.MovementBaseUtils.TransformWorldLocationToBased
// 0x0048 (0x0048 - 0x0000)
struct MovementBaseUtils_TransformWorldLocationToBased final
{
public:
	const class UPrimitiveComponent*              MovementBase;                                      // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   BoneName;                                          // 0x0008(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                WorldSpaceLocation;                                // 0x0010(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                OutLocalLocation;                                  // 0x0028(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0040(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_MovementBaseUtils_TransformWorldLocationToBased;

// Function Mover.MovementBaseUtils.TransformWorldRotatorToBased
// 0x0048 (0x0048 - 0x0000)
struct MovementBaseUtils_TransformWorldRotatorToBased final
{
public:
	const class UPrimitiveComponent*              MovementBase;                                      // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   BoneName;                                          // 0x0008(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               WorldSpaceRotator;                                 // 0x0010(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FRotator                               OutLocalRotator;                                   // 0x0028(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0040(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_MovementBaseUtils_TransformWorldRotatorToBased;

// Function Mover.MovementUtils.CanEscapeGravity
// 0x0050 (0x0050 - 0x0000)
struct MovementUtils_CanEscapeGravity final
{
public:
	struct FVector                                PriorVelocity;                                     // 0x0000(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                NewVelocity;                                       // 0x0018(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                GravityAccel;                                      // 0x0030(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DeltaSeconds;                                      // 0x0048(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x004C(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_MovementUtils_CanEscapeGravity;

// Function Mover.MovementUtils.CanStepUpOnHitSurface
// 0x00F0 (0x00F0 - 0x0000)
struct MovementUtils_CanStepUpOnHitSurface final
{
public:
	struct FHitResult                             Hit;                                               // 0x0000(0x00E8)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x00E8(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_MovementUtils_CanStepUpOnHitSurface;

// Function Mover.MovementUtils.ComputeAngularVelocity
// 0x0050 (0x0050 - 0x0000)
struct MovementUtils_ComputeAngularVelocity final
{
public:
	struct FRotator                               From;                                              // 0x0000(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FRotator                               To;                                                // 0x0018(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	float                                         DeltaSeconds;                                      // 0x0030(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TurningRateLimit;                                  // 0x0034(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               ReturnValue;                                       // 0x0038(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MovementUtils_ComputeAngularVelocity;

// Function Mover.MovementUtils.ComputeControlledFreeMove
// 0x0108 (0x0108 - 0x0000)
struct MovementUtils_ComputeControlledFreeMove final
{
public:
	struct FFreeMoveParams                        InParams;                                          // 0x0000(0x0080)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FProposedMove                          ReturnValue;                                       // 0x0080(0x0088)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MovementUtils_ComputeControlledFreeMove;

// Function Mover.MovementUtils.ComputeControlledGroundMove
// 0x0128 (0x0128 - 0x0000)
struct MovementUtils_ComputeControlledGroundMove final
{
public:
	struct FGroundMoveParams                      InParams;                                          // 0x0000(0x00A0)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FProposedMove                          ReturnValue;                                       // 0x00A0(0x0088)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MovementUtils_ComputeControlledGroundMove;

// Function Mover.MovementUtils.ComputeDeflectedMoveOntoRamp
// 0x0120 (0x0120 - 0x0000)
struct MovementUtils_ComputeDeflectedMoveOntoRamp final
{
public:
	struct FVector                                OrigMoveDelta;                                     // 0x0000(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FHitResult                             RampHitResult;                                     // 0x0018(0x00E8)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	float                                         MaxWalkSlopeCosine;                                // 0x0100(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHitFromLineTrace;                                 // 0x0104(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_105[0x3];                                      // 0x0105(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                ReturnValue;                                       // 0x0108(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MovementUtils_ComputeDeflectedMoveOntoRamp;

// Function Mover.MovementUtils.ComputeDirectionIntent
// 0x0038 (0x0038 - 0x0000)
struct MovementUtils_ComputeDirectionIntent final
{
public:
	struct FVector                                MoveInput;                                         // 0x0000(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMoveInputType                                MoveInputType;                                     // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                ReturnValue;                                       // 0x0020(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MovementUtils_ComputeDirectionIntent;

// Function Mover.MovementUtils.ComputeSlideDelta
// 0x0138 (0x0138 - 0x0000)
struct MovementUtils_ComputeSlideDelta final
{
public:
	struct FVector                                Delta;                                             // 0x0000(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PctOfDeltaToMove;                                  // 0x0018(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Normal;                                            // 0x0020(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FHitResult                             Hit;                                               // 0x0038(0x00E8)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FVector                                ReturnValue;                                       // 0x0120(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MovementUtils_ComputeSlideDelta;

// Function Mover.MovementUtils.ComputeVelocity
// 0x0068 (0x0068 - 0x0000)
struct MovementUtils_ComputeVelocity final
{
public:
	struct FComputeVelocityParams                 InParams;                                          // 0x0000(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                ReturnValue;                                       // 0x0050(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MovementUtils_ComputeVelocity;

// Function Mover.MovementUtils.ComputeVelocityFromGravity
// 0x0038 (0x0038 - 0x0000)
struct MovementUtils_ComputeVelocityFromGravity final
{
public:
	struct FVector                                GravityAccel;                                      // 0x0000(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DeltaSeconds;                                      // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                ReturnValue;                                       // 0x0020(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MovementUtils_ComputeVelocityFromGravity;

// Function Mover.MovementUtils.ComputeVelocityFromPositions
// 0x0050 (0x0050 - 0x0000)
struct MovementUtils_ComputeVelocityFromPositions final
{
public:
	struct FVector                                FromPos;                                           // 0x0000(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ToPos;                                             // 0x0018(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DeltaSeconds;                                      // 0x0030(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                ReturnValue;                                       // 0x0038(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MovementUtils_ComputeVelocityFromPositions;

// Function Mover.MovementUtils.ConstrainToPlane
// 0x0060 (0x0060 - 0x0000)
struct MovementUtils_ConstrainToPlane final
{
public:
	struct FVector                                Vector;                                            // 0x0000(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_18[0x8];                                       // 0x0018(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPlane                                 MovementPlane;                                     // 0x0020(0x0020)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bMaintainMagnitude;                                // 0x0040(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                ReturnValue;                                       // 0x0048(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MovementUtils_ConstrainToPlane;

// Function Mover.MovementUtils.IsExceedingMaxSpeed
// 0x0020 (0x0020 - 0x0000)
struct MovementUtils_IsExceedingMaxSpeed final
{
public:
	struct FVector                                Velocity;                                          // 0x0000(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InMaxSpeed;                                        // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x001C(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_MovementUtils_IsExceedingMaxSpeed;

// Function Mover.MovementUtils.IsHitSurfaceWalkable
// 0x00F0 (0x00F0 - 0x0000)
struct MovementUtils_IsHitSurfaceWalkable final
{
public:
	struct FHitResult                             Hit;                                               // 0x0000(0x00E8)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	float                                         MaxWalkSlopeCosine;                                // 0x00E8(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x00EC(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_ED[0x3];                                       // 0x00ED(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_MovementUtils_IsHitSurfaceWalkable;

// Function Mover.MovementUtils.IsValidLandingSpot
// 0x0218 (0x0218 - 0x0000)
struct MovementUtils_IsValidLandingSpot final
{
public:
	class USceneComponent*                        UpdatedComponent;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    UpdatedPrimitive;                                  // 0x0008(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Location;                                          // 0x0010(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FHitResult                             Hit;                                               // 0x0028(0x00E8)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	float                                         FloorSweepDistance;                                // 0x0110(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxWalkSlopeCosine;                                // 0x0114(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFloorCheckResult                      OutFloorResult;                                    // 0x0118(0x00F8)(Parm, OutParm, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0210(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_211[0x7];                                      // 0x0211(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_MovementUtils_IsValidLandingSpot;

// Function Mover.MovementUtils.TryMoveToFallAlongSurface
// 0x02C0 (0x02C0 - 0x0000)
struct MovementUtils_TryMoveToFallAlongSurface final
{
public:
