#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MusicPartyPropComponent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass MusicPartyPropComponent.MusicPartyPropComponent_C
// 0x00D0 (0x0170 - 0x00A0)
class UMusicPartyPropComponent_C final : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USoundBase*                             SoundToPlay;                                       // 0x00A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        AudioComponent;                                    // 0x00B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           MusicEventTag;                                     // 0x00B8(0x0004)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	class FName                                   MusicEventGroupName;                               // 0x00BC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             OnSpeakerDamagedSound;                             // 0x00C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             OnSpeakerDestroyedSound;                           // 0x00C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             OnAllSpeakersDestroyedSound;                       // 0x00D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 ControllerClass;                                   // 0x00D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        AutoStopFadeOutTime;                               // 0x00E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<TSoftObjectPtr<class ABuildingActor>>  SpeakerActors;                                     // 0x00E8(0x0010)(Edit, BlueprintVisible)
	TMulticastInlineDelegate<void(class AActor* Speaker_Actor)> OnSpeakerRemoved;                    // 0x00F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void(class AActor* Speaker_Actor)> OnSpeakerDamaged;                    // 0x0108(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void(class AActor* Speaker_Actor)> OnAllSpeakersDestroyed;              // 0x0118(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          bAutoUpdateAudioPosition;                          // 0x0128(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bAutoUpdateAudioSpread;                            // 0x0129(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12A[0x6];                                      // 0x012A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABuildingActor*>                 SpeakerActorsResolved;                             // 0x0130(0x0010)(Edit, BlueprintVisible, Net, DisableEditOnTemplate, DisableEditOnInstance, RepNotify)
	class AGameStateBase*                         GameState;                                         // 0x0140(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMusicPartyManagerComponent_C*          ManagerComponent;                                  // 0x0148(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          bShouldBePlaying;                                  // 0x0150(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsRegistered;                                     // 0x0151(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsAudibleRefCountRegistered;                      // 0x0152(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsAudible;                                        // 0x0153(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bDelayOnVirtualized;                               // 0x0154(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_155[0x3];                                      // 0x0155(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              PlaybackStartTimeRange;                            // 0x0158(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bAllowInFNE;                                       // 0x0168(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bAllowInCreative;                                  // 0x0169(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UpdateAudioAttenuation();
	void UpdateAudibleRefCount();
	void Stop_Party(double FadeOutDuration);
	void Start_Party(class UAudioComponent* Audio_Component, float FadeInDuration);
	void SetupAutoActivate();
	void SetSpeakerRegistered(bool Registered);
	void ResolveSpeakerActors();
	void RemoveSpeakerServer(const class ABuildingActor*& Speaker);
	void RegisterControllerClass();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void ReceiveBeginPlay();
	void OnRep_SpeakerActorsResolved();
	void OnReady_B7E1905644E79B07D290FBA948678C8B(class AFortGameStateAthena* GameState_0, const class UFortPlaylist* Playlist, const struct FGameplayTagContainer& PlaylistContextTags);
	void OnOwnerDeathEffectsClient(float Damage, const struct FGameplayTagContainer& DamageTags, const struct FVector& Momentum, const struct FHitResult& HitInfo, class AFortPawn* InstigatedBy, class AActor* DamageCauser, const struct FGameplayEffectContextHandle& EffectContext);
	void OnDiedServer(class AActor* DamagedActor, float Damage, class AController* InstigatedBy, class AActor* DamageCauser, const struct FVector& HitLocation, class UPrimitiveComponent* FHitComponent, class FName BoneName, const struct FVector& Momentum);
	void OnDamagedServer(class AActor* DamagedActor, float Damage, class AController* InstigatedBy, class AActor* DamageCauser, const struct FVector& HitLocation, class UPrimitiveComponent* FHitComponent, class FName BoneName, const struct FVector& Momentum);
	void OnBuildingHealthChangedClient();
	void On_Virtualization_Changed_Delay();
	void On_Virtualization_Changed(bool bIsVirtualized);
	void On_Speaker_Removed_Rep(const struct FVector& Location);
	void On_Speaker_Damaged_Rep(const struct FVector& Location);
	void On_Manager_Ready();
	void On_All_Speakers_Removed_Rep(const struct FVector& Location);
	void IsOwnedByBuildingActor(bool* Result);
	void GetControllerClass(class UClass** ControllerClass_0);
	void ExecuteUbergraph_MusicPartyPropComponent(int32 EntryPoint);
	void CanStartParty(bool* OutCanStartParty);
	void BindToSpeakerDestruction();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("MusicPartyPropComponent_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MusicPartyPropComponent_C")
	}
	static class UMusicPartyPropComponent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMusicPartyPropComponent_C>();
	}
};
DUMPER7_ASSERTS_UMusicPartyPropComponent_C;

}

