#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NetDebugUI

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "NetUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass NetDebugUI.NetDebugUI_C
// 0x0030 (0x03D8 - 0x03A8)
class UNetDebugUI_C final : public UNetDebugWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_1;                                           // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_2;                                           // 0x03B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_2;                                     // 0x03C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UCommonTextBlock*>               NetDisplayText;                                    // 0x03C8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)

public:
	void TestMobileNetHUDAdjustments();
	void SetTextStyleForMobile(bool bIsMobile);
	void ExecuteUbergraph_NetDebugUI(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("NetDebugUI_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NetDebugUI_C")
	}
	static class UNetDebugUI_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNetDebugUI_C>();
	}
};
DUMPER7_ASSERTS_UNetDebugUI_C;

}

