#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PCGBP_IsPartitioned

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "PCG_structs.hpp"


namespace SDK::Params
{

// Function PCGBP_IsPartitioned.PCGBP_IsPartitioned_C.ExecuteWithContext
// 0x01C8 (0x01C8 - 0x0000)
struct PCGBP_IsPartitioned_C_ExecuteWithContext final
{
public:
	struct FPCGContext                            InContext;                                         // 0x0000(0x00B0)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FPCGDataCollection                     Input;                                             // 0x00B0(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FPCGDataCollection                     Output;                                            // 0x00D0(0x0020)(Parm, OutParm)
	class UPCGMetadata*                           OutMetadata;                                       // 0x00F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPCGComponent*                          CallFunc_GetComponent_ReturnValue;                 // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPCGParamData*                          CallFunc_SpawnObject_ReturnValue;                  // 0x0100(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPCGTaggedData                         K2Node_MakeStruct_PCGTaggedData;                   // 0x0110(0x0060)()
	class APartitionActor*                        K2Node_DynamicCast_AsPartition_Actor;              // 0x0170(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_179[0x7];                                      // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FPCGTaggedData>                 K2Node_MakeArray_Array;                            // 0x0180(0x0010)(ReferenceParm)
	class UPCGMetadata*                           CallFunc_MutableMetadata_ReturnValue;              // 0x0190(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPCGDataCollection                     K2Node_MakeStruct_PCGDataCollection;               // 0x0198(0x0020)()
	class UPCGMetadata*                           CallFunc_CreateBoolAttribute_ReturnValue;          // 0x01B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_AddEntry_ReturnValue;                     // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_PCGBP_IsPartitioned_C_ExecuteWithContext;

// Function PCGBP_IsPartitioned.PCGBP_IsPartitioned_C.NodeTitleOverride
// 0x0004 (0x0004 - 0x0000)
struct PCGBP_IsPartitioned_C_NodeTitleOverride final
{
public:
	class FName                                   ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_PCGBP_IsPartitioned_C_NodeTitleOverride;

// Function PCGBP_IsPartitioned.PCGBP_IsPartitioned_C.NodeColorOverride
// 0x0010 (0x0010 - 0x0000)
struct PCGBP_IsPartitioned_C_NodeColorOverride final
{
public:
	struct FLinearColor                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_PCGBP_IsPartitioned_C_NodeColorOverride;

}

