#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PictureInPictureFNEventsOverlay

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "SlateCore_structs.hpp"
#include "PictureInPictureDescriptors_structs.hpp"
#include "PictureInPictureUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass PictureInPictureFNEventsOverlay.PictureInPictureFNEventsOverlay_C
// 0x02C0 (0x09E8 - 0x0728)
class UPictureInPictureFNEventsOverlay_C final : public UPictureInPicturePanelWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0728(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       SlideVidDown;                                      // 0x0730(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       SlideVidUp;                                        // 0x0738(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Intro;                                             // 0x0740(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                ErrorMessage;                                      // 0x0748(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                HideInstructions;                                  // 0x0750(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Highlight;                                         // 0x0758(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Shadow;                                            // 0x0760(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   Text_ErrorInstructions;                            // 0x0768(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   Text_HideInstructions;                             // 0x0770(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FString                                 LoginState;                                        // 0x0778(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	struct FGameplayTagContainer                  ShowForPiPTags;                                    // 0x0788(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTagContainer                  HideForPiPTags;                                    // 0x07A8(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FMargin                                FrontendPadding;                                   // 0x07C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FPiPPartnerSource                      ErrorSource;                                       // 0x07D8(0x01F0)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class FText                                   Text_BaseErrorMessage;                             // 0x09C8(0x0018)(Edit, BlueprintVisible)
	bool                                          InstructionsShown;                                 // 0x09E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ShowHideInstructions();
	void ShowError(int32 ErrorNumber, const class FString& ErrorMessage_0);
	void Set_PIP_Location();
	void OnMouseLeave(const struct FPointerEvent& MouseEvent);
	void OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void OnInitialized();
	void ExecuteUbergraph_PictureInPictureFNEventsOverlay(int32 EntryPoint);
	void Construct();
	void BP_OnDeactivated();
	void BP_OnActivated();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("PictureInPictureFNEventsOverlay_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PictureInPictureFNEventsOverlay_C")
	}
	static class UPictureInPictureFNEventsOverlay_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPictureInPictureFNEventsOverlay_C>();
	}
};
DUMPER7_ASSERTS_UPictureInPictureFNEventsOverlay_C;

}

