#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PilgrimQuickplayUI

#include "Basic.hpp"

#include "PilgrimCoreRuntime_structs.hpp"
#include "CommonUI_classes.hpp"
#include "DynamicUI_classes.hpp"
#include "FortniteUI_classes.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// Class PilgrimQuickplayUI.FestivalPassTrackingWidget
// 0x0010 (0x02F8 - 0x02E8)
class UFestivalPassTrackingWidget final : public UCommonUserWidget
{
public:
	int32                                         CurrentProgress;                                   // 0x02E8(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2EC[0x4];                                      // 0x02EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortPersistentResourceItemDefinition*  TrackedItem;                                       // 0x02F0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void HandleMCPInventoryChanged(const TSet<class FString>& ItemChangeFlags, int64 ProfileRevision);
	void OnProgressUpdated();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FestivalPassTrackingWidget")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FestivalPassTrackingWidget")
	}
	static class UFestivalPassTrackingWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFestivalPassTrackingWidget>();
	}
};
DUMPER7_ASSERTS_UFestivalPassTrackingWidget;

// Class PilgrimQuickplayUI.PilgrimDynamicUIDirector
// 0x0028 (0x02D8 - 0x02B0)
class APilgrimDynamicUIDirector final : public ADynamicUIDirectorBase
{
public:
	uint8                                         Pad_2B0[0x28];                                     // 0x02B0(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleCursorModeChanging(bool bCursorModeEnabled, class FName ActionName);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PilgrimDynamicUIDirector")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PilgrimDynamicUIDirector")
	}
	static class APilgrimDynamicUIDirector* GetDefaultObj()
	{
		return GetDefaultObjImpl<APilgrimDynamicUIDirector>();
	}
};
DUMPER7_ASSERTS_APilgrimDynamicUIDirector;

// Class PilgrimQuickplayUI.PilgrimHUDBase
// 0x0020 (0x0478 - 0x0458)
class UPilgrimHUDBase final : public UFortNullHUD
{
public:
	TSoftClassPtr<class UClass>                   EmotePickerClass;                                  // 0x0458(0x0020)(Edit, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void HandlePickerOpenRequest(EFortPickerMode Mode, int32 InitialOption, bool bIgnoreFirstAccept);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PilgrimHUDBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PilgrimHUDBase")
	}
	static class UPilgrimHUDBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPilgrimHUDBase>();
	}
};
DUMPER7_ASSERTS_UPilgrimHUDBase;

// Class PilgrimQuickplayUI.PilgrimPostGameQuestList
// 0x0060 (0x0348 - 0x02E8)
class UPilgrimPostGameQuestList final : public UCommonUserWidget
{
public:
	class UDynamicEntryBox*                       EntryBox_Quests;                                   // 0x02E8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TMap<class FString, TWeakObjectPtr<class UPilgrimQuestNotificationEntry>> QuestWidgetMap;        // 0x02F0(0x0050)(ExportObject, Transient, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPrivate)
	bool                                          bShowCompletedQuests;                              // 0x0340(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bShowUpdatedQuests;                                // 0x0341(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bShowUnchangedQuests;                              // 0x0342(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_343[0x5];                                      // 0x0343(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetShowQuests(const bool bNewShowCompleted, const bool bNewShowUpdated, const bool bNewShowUnchanged);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PilgrimPostGameQuestList")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PilgrimPostGameQuestList")
	}
	static class UPilgrimPostGameQuestList* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPilgrimPostGameQuestList>();
	}
};
DUMPER7_ASSERTS_UPilgrimPostGameQuestList;

// Class PilgrimQuickplayUI.PilgrimQuickplayInfoModal
// 0x0028 (0x0428 - 0x0400)
class UPilgrimQuickplayInfoModal final : public UCommonActivatableWidget
{
public:
	class UVerticalBox*                           Vbox_Panels;                                       // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                      Button_Close;                                      // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                      Button_Close_Alt;                                  // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                      Button_CloseTouch;                                 // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAthenaScrollBox*                       ScrollBox_Panels;                                  // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void BP_OnScrollCompleted(bool bScrolledDown);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PilgrimQuickplayInfoModal")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PilgrimQuickplayInfoModal")
	}
	static class UPilgrimQuickplayInfoModal* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPilgrimQuickplayInfoModal>();
	}
};
DUMPER7_ASSERTS_UPilgrimQuickplayInfoModal;

// Class PilgrimQuickplayUI.PilgrimQuickplaySpotlightList
// 0x0020 (0x0308 - 0x02E8)
class UPilgrimQuickplaySpotlightList final : public UCommonUserWidget
{
public:
	TArray<struct FPilgrimSpotlightCompetition>   SpotlightCompetitions;                             // 0x02E8(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	int32                                         MaxSpotlights;                                     // 0x02F8(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         SelectedIndex;                                     // 0x02FC(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDynamicEntryBox*                       EntryBox_SpotlightCompetitions;                    // 0x0300(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnSpotlightListUpdated();
	void PopulateSpotlightCompetitionList();
	void SelectNextIndex();
	void SelectPrevIndex();
	void SetMaxSpotlights(int32 NewMaxSpotlights);
	void SetSelectedIndex(int32 NewSelectedIndex);
	void UpdateSpotlightList();

	int32 GetSelectedIndex() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PilgrimQuickplaySpotlightList")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PilgrimQuickplaySpotlightList")
	}
	static class UPilgrimQuickplaySpotlightList* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPilgrimQuickplaySpotlightList>();
	}
};
DUMPER7_ASSERTS_UPilgrimQuickplaySpotlightList;

// Class PilgrimQuickplayUI.PilgrimQuickplay_UIResultBase
// 0x0008 (0x0408 - 0x0400)
class UPilgrimQuickplay_UIResultBase final : public UCommonActivatableWidget
{
public:
	uint8                                         Pad_400[0x8];                                      // 0x0400(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PilgrimQuickplay_UIResultBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PilgrimQuickplay_UIResultBase")
	}
	static class UPilgrimQuickplay_UIResultBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPilgrimQuickplay_UIResultBase>();
	}
};
DUMPER7_ASSERTS_UPilgrimQuickplay_UIResultBase;

// Class PilgrimQuickplayUI.PilgrimQuestNotificationEntry
// 0x0030 (0x0318 - 0x02E8)
class UPilgrimQuestNotificationEntry final : public UCommonUserWidget
{
public:
	class UCommonTextBlock*                       Text_Description;                                  // 0x02E8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonTextBlock*                       Text_CategoryDisplay;                              // 0x02F0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonTextBlock*                       Text_FlavorText;                                   // 0x02F8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class URichTextBlock*                         RichText_ObjectivesCompleted;                      // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UImage*                                 Image_Completion;                                  // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAthenaChallengeRewards*                UserWidget_Rewards;                                // 0x0310(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void InitializeQuestNotification(TScriptInterface<class IQuestInstanceInterface> InQuest);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PilgrimQuestNotificationEntry")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PilgrimQuestNotificationEntry")
	}
	static class UPilgrimQuestNotificationEntry* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPilgrimQuestNotificationEntry>();
	}
};
DUMPER7_ASSERTS_UPilgrimQuestNotificationEntry;

// Class PilgrimQuickplayUI.PilgrimQuickplaySpotlightEntry
// 0x00A8 (0x0390 - 0x02E8)
class UPilgrimQuickplaySpotlightEntry final : public UCommonUserWidget
{
public:
	uint8                                         bEmptySpotlight : 1;                               // 0x02E8(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         Pad_2E9[0x7];                                      // 0x02E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortLazyImage*                         Image_SongArt;                                     // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonTextBlock*                       Text_SongTitle;                                    // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonTextBlock*                       Text_SongArtist;                                   // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonTextBlock*                       Text_Constraints;                                  // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FPilgrimSpotlightCompetition           SpotlightData;                                     // 0x0310(0x0070)(BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	TArray<class UPilgrimSongMetadata*>           SpotlightSongMetadatas;                            // 0x0380(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)

public:
	void OnSpotlightInitialized();
	void SetEmptySpotlight();
	void SpotlightEntryUpdated();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PilgrimQuickplaySpotlightEntry")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PilgrimQuickplaySpotlightEntry")
	}
	static class UPilgrimQuickplaySpotlightEntry* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPilgrimQuickplaySpotlightEntry>();
	}
};
DUMPER7_ASSERTS_UPilgrimQuickplaySpotlightEntry;

}

