#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PilgrimCoreUI

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"
#include "UMG_classes.hpp"
#include "FortniteUI_classes.hpp"
#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"
#include "PilgrimCoreRuntime_classes.hpp"
#include "ModelViewViewModel_classes.hpp"


namespace SDK
{

// Class PilgrimCoreUI.FortSettingRegistryExtension_Pilgrim
// 0x0078 (0x00A0 - 0x0028)
class UFortSettingRegistryExtension_Pilgrim final : public UFortGameSettingRegistryExtension
{
public:
	uint8                                         Pad_28[0x20];                                      // 0x0028(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	class UPilgrimPresetSelector*                 PilgrimPresetSelectorInstance;                     // 0x0048(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_50[0x50];                                      // 0x0050(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortSettingRegistryExtension_Pilgrim")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortSettingRegistryExtension_Pilgrim")
	}
	static class UFortSettingRegistryExtension_Pilgrim* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortSettingRegistryExtension_Pilgrim>();
	}
};
DUMPER7_ASSERTS_UFortSettingRegistryExtension_Pilgrim;

// Class PilgrimCoreUI.PilgrimPlayerInfoWidgetBase
// 0x0000 (0x02C0 - 0x02C0)
class UPilgrimPlayerInfoWidgetBase final : public UUserWidget
{
public:
	void HookUpVoiceIcon(class UFortVoiceChatStatusIcon* Icon, class AFortPlayerStateAthena* Player);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PilgrimPlayerInfoWidgetBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PilgrimPlayerInfoWidgetBase")
	}
	static class UPilgrimPlayerInfoWidgetBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPilgrimPlayerInfoWidgetBase>();
	}
};
DUMPER7_ASSERTS_UPilgrimPlayerInfoWidgetBase;

// Class PilgrimCoreUI.PilgrimPostGameProgressWidget
// 0x0000 (0x02E8 - 0x02E8)
class UPilgrimPostGameProgressWidget final : public UFortSeasonDataWidget
{
public:
	int32 GetMatchXP() const;
	int32 GetTotalXP() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PilgrimPostGameProgressWidget")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PilgrimPostGameProgressWidget")
	}
	static class UPilgrimPostGameProgressWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPilgrimPostGameProgressWidget>();
	}
};
DUMPER7_ASSERTS_UPilgrimPostGameProgressWidget;

// Class PilgrimCoreUI.PilgrimPresetSelector
// 0x0028 (0x0050 - 0x0028)
class UPilgrimPresetSelector final : public UPilgrimPresetSelectorBase
{
public:
	uint8                                         Pad_28[0x10];                                      // 0x0028(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         NumLanes;                                          // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EHardwareDevicePrimaryType                    DeviceType;                                        // 0x003C(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3D[0xB];                                       // 0x003D(0x000B)(Fixing Size After Last Property [ Dumper-7 ])
	class UPilgrimPresetConfiguration*            PilgrimPresetConfiguration;                        // 0x0048(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void OnPresetSelected(int32 SelectedNumLanes, int32 SelectedPresetIndex);
	void OnPresetSelectionCancelled();
	void OnPresetSelectionRequested(class APlayerController* Player);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PilgrimPresetSelector")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PilgrimPresetSelector")
	}
	static class UPilgrimPresetSelector* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPilgrimPresetSelector>();
	}
};
DUMPER7_ASSERTS_UPilgrimPresetSelector;

// Class PilgrimCoreUI.PilgrimPresetSwitcher
// 0x0028 (0x0310 - 0x02E8)
class UPilgrimPresetSwitcher final : public UCommonUserWidget
{
public:
	int32                                         NumLanes;                                          // 0x02E8(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2EC[0x4];                                      // 0x02EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortSettingsRotator*                   Rotator_Preset;                                    // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonLegacy*                    Button_Decrease_Preset;                            // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonLegacy*                    Button_Increase_Preset;                            // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_308[0x8];                                      // 0x0308(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void GetSelectedItems(int32* OutSelectedLaneNum, int32* OutSelectedIndex);
	void InitializeForLanes(int32 NewNumLanes, const TArray<class UFortInputMappingContext*>& InputMappingContexts);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PilgrimPresetSwitcher")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PilgrimPresetSwitcher")
	}
	static class UPilgrimPresetSwitcher* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPilgrimPresetSwitcher>();
	}
};
DUMPER7_ASSERTS_UPilgrimPresetSwitcher;

// Class PilgrimCoreUI.PilgrimSongSortVM
// 0x0048 (0x00D0 - 0x0088)
class UPilgrimSongSortVM : public UFortSortItemVM
{
public:
	uint8                                         Pad_88[0x48];                                      // 0x0088(0x0048)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PilgrimSongSortVM")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PilgrimSongSortVM")
	}
	static class UPilgrimSongSortVM* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPilgrimSongSortVM>();
	}
};
DUMPER7_ASSERTS_UPilgrimSongSortVM;

// Class PilgrimCoreUI.PilgrimSongAlphaSortVM
// 0x0010 (0x00E0 - 0x00D0)
class UPilgrimSongAlphaSortVM final : public UPilgrimSongSortVM
{
public:
	uint8                                         Pad_D0[0x10];                                      // 0x00D0(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PilgrimSongAlphaSortVM")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PilgrimSongAlphaSortVM")
	}
	static class UPilgrimSongAlphaSortVM* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPilgrimSongAlphaSortVM>();
	}
};
DUMPER7_ASSERTS_UPilgrimSongAlphaSortVM;

// Class PilgrimCoreUI.PilgrimSongFilterItemVM
// 0x0048 (0x00D0 - 0x0088)
class UPilgrimSongFilterItemVM : public UFortFilterItemVM
{
public:
	uint8                                         Pad_88[0x48];                                      // 0x0088(0x0048)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PilgrimSongFilterItemVM")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PilgrimSongFilterItemVM")
	}
	static class UPilgrimSongFilterItemVM* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPilgrimSongFilterItemVM>();
	}
};
DUMPER7_ASSERTS_UPilgrimSongFilterItemVM;

// Class PilgrimCoreUI.PilgrimSongFilterOwnedVM
// 0x0000 (0x00D0 - 0x00D0)
class UPilgrimSongFilterOwnedVM final : public UPilgrimSongFilterItemVM
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PilgrimSongFilterOwnedVM")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PilgrimSongFilterOwnedVM")
	}
	static class UPilgrimSongFilterOwnedVM* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPilgrimSongFilterOwnedVM>();
	}
};
DUMPER7_ASSERTS_UPilgrimSongFilterOwnedVM;

// Class PilgrimCoreUI.PilgrimSongFilterAvailableVM
// 0x0000 (0x00D0 - 0x00D0)
class UPilgrimSongFilterAvailableVM final : public UPilgrimSongFilterItemVM
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PilgrimSongFilterAvailableVM")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PilgrimSongFilterAvailableVM")
	}
	static class UPilgrimSongFilterAvailableVM* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPilgrimSongFilterAvailableVM>();
	}
};
DUMPER7_ASSERTS_UPilgrimSongFilterAvailableVM;

// Class PilgrimCoreUI.PilgrimSongSearchTextVM
// 0x0040 (0x00C0 - 0x0080)
class UPilgrimSongSearchTextVM final : public UFortSortFilterSearchTextVM
{
public:
	uint8                                         Pad_80[0x40];                                      // 0x0080(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PilgrimSongSearchTextVM")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PilgrimSongSearchTextVM")
	}
	static class UPilgrimSongSearchTextVM* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPilgrimSongSearchTextVM>();
	}
};
DUMPER7_ASSERTS_UPilgrimSongSearchTextVM;

// Class PilgrimCoreUI.PilgrimSongFilterVM
// 0x0020 (0x0088 - 0x0068)
class UPilgrimSongFilterVM final : public UMVVMViewModelBase
{
public:
	class UFortSortFilterVM*                      SortFilter;                                        // 0x0068(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class UPilgrimSongMetadata*>           FilteredItems;                                     // 0x0070(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	class APlayerController*                      OwningController;                                  // 0x0080(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void Initialize(class APlayerController* InOwningController);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PilgrimSongFilterVM")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PilgrimSongFilterVM")
	}
	static class UPilgrimSongFilterVM* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPilgrimSongFilterVM>();
	}
};
DUMPER7_ASSERTS_UPilgrimSongFilterVM;

// Class PilgrimCoreUI.PilgrimCoreUIGlobals
// 0x0000 (0x0028 - 0x0028)
class UPilgrimCoreUIGlobals final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PilgrimCoreUIGlobals")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PilgrimCoreUIGlobals")
	}
	static class UPilgrimCoreUIGlobals* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPilgrimCoreUIGlobals>();
	}
};
DUMPER7_ASSERTS_UPilgrimCoreUIGlobals;

}

