#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PilgrimCoreRuntime

#include "Basic.hpp"

#include "PilgrimCoreRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "EpicMediaBasePlayer_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "InputCore_structs.hpp"
#include "Harmonix_structs.hpp"
#include "SparksCoreRuntime_structs.hpp"
#include "CommonInput_structs.hpp"
#include "MetasoundEngine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "PlayspaceSystem_structs.hpp"
#include "FMCoreRuntime_structs.hpp"


namespace SDK::Params
{

// Function PilgrimCoreRuntime.NetworkedMusicClockManager.OnBar
// 0x0004 (0x0004 - 0x0000)
struct NetworkedMusicClockManager_OnBar final
{
public:
	int32                                         BarNumber;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NetworkedMusicClockManager_OnBar;

// Function PilgrimCoreRuntime.NetworkedMusicClockManager.OnBeat
// 0x0008 (0x0008 - 0x0000)
struct NetworkedMusicClockManager_OnBeat final
{
public:
	int32                                         BeatNumber;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         BeatInBar;                                         // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NetworkedMusicClockManager_OnBeat;

// Function PilgrimCoreRuntime.NetworkedMusicClockManager.PlayServerAuthoritativeSong
// 0x0008 (0x0008 - 0x0000)
struct NetworkedMusicClockManager_PlayServerAuthoritativeSong final
{
public:
	class UPilgrimSongMetadata*                   SongToPlay;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NetworkedMusicClockManager_PlayServerAuthoritativeSong;

// Function PilgrimCoreRuntime.NetworkedMusicClockManager.SetClientAudioComponentsToUse
// 0x0010 (0x0010 - 0x0000)
struct NetworkedMusicClockManager_SetClientAudioComponentsToUse final
{
public:
	class UAudioComponent*                        InMetasoundPlayer;                                 // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAudioComponent*                        InMetasoundMixer;                                  // 0x0008(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NetworkedMusicClockManager_SetClientAudioComponentsToUse;

// Function PilgrimCoreRuntime.NetworkedMusicClockManager.GetOwnedMusicClock
// 0x0008 (0x0008 - 0x0000)
struct NetworkedMusicClockManager_GetOwnedMusicClock final
{
public:
	class UMusicClockComponent*                   ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NetworkedMusicClockManager_GetOwnedMusicClock;

// Function PilgrimCoreRuntime.PilgrimAbilityTask_WaitForBars.WaitForBars
// 0x0018 (0x0018 - 0x0000)
struct PilgrimAbilityTask_WaitForBars_WaitForBars final
{
public:
	class UGameplayAbility*                       OwningAbility;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         BarsToWaitFor;                                     // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         LoopFor;                                           // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPilgrimAbilityTask_WaitForBars*        ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PilgrimAbilityTask_WaitForBars_WaitForBars;

// Function PilgrimCoreRuntime.PilgrimAbilityTask_WaitForBeats.WaitForBeats
// 0x0018 (0x0018 - 0x0000)
struct PilgrimAbilityTask_WaitForBeats_WaitForBeats final
{
public:
	class UGameplayAbility*                       OwningAbility;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         BeatsToWaitFor;                                    // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         LoopFor;                                           // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPilgrimAbilityTask_WaitForBeats*       ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PilgrimAbilityTask_WaitForBeats_WaitForBeats;

// Function PilgrimCoreRuntime.PilgrimAbilityTask_WaitForSection.WaitForSection
// 0x0028 (0x0028 - 0x0000)
struct PilgrimAbilityTask_WaitForSection_WaitForSection final
{
public:
	class UGameplayAbility*                       OwningAbility;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShouldWaitForNextSection;                         // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 SectionName;                                       // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPilgrimAbilityTask_WaitForSection*     ReturnValue;                                       // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PilgrimAbilityTask_WaitForSection_WaitForSection;

// Function PilgrimCoreRuntime.PilgrimAbilityTask_WaitForSection.OnSectionEvent
// 0x0018 (0x0018 - 0x0000)
struct PilgrimAbilityTask_WaitForSection_OnSectionEvent final
{
public:
	class FString                                 SectionName;                                       // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SectionStartMs;                                    // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SectionLengthMs;                                   // 0x0014(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PilgrimAbilityTask_WaitForSection_OnSectionEvent;

// Function PilgrimCoreRuntime.PilgrimActorPool.InitPool
// 0x0010 (0x0010 - 0x0000)
struct PilgrimActorPool_InitPool final
{
public:
	struct FPilgrimActorPoolParams                PilgrimActorPoolParams;                            // 0x0000(0x0010)(Parm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PilgrimActorPool_InitPool;

// Function PilgrimCoreRuntime.PilgrimActorPool.TryReturnItem
// 0x0010 (0x0010 - 0x0000)
struct PilgrimActorPool_TryReturnItem final
{
public:
	class AActor*                                 ActorToPutBack;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_PilgrimActorPool_TryReturnItem;

// Function PilgrimCoreRuntime.PilgrimActorPool.GetNumAvailableItems
// 0x0004 (0x0004 - 0x0000)
struct PilgrimActorPool_GetNumAvailableItems final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PilgrimActorPool_GetNumAvailableItems;

// Function PilgrimCoreRuntime.PilgrimActorPool.GetNumInUseItems
// 0x0004 (0x0004 - 0x0000)
struct PilgrimActorPool_GetNumInUseItems final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PilgrimActorPool_GetNumInUseItems;

// Function PilgrimCoreRuntime.PilgrimAsyncAction_RequestLeaderboard.PilgrimRequestLeaderboard
// 0x0048 (0x0048 - 0x0000)
struct PilgrimAsyncAction_RequestLeaderboard_PilgrimRequestLeaderboard final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   SongShortName;                                     // 0x0008(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 SpotlightGroup;                                    // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPilgrimLeaderboardType                       LeaderboardType;                                   // 0x0020(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  RequestingPlayer;                                  // 0x0028(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFriendsOnly;                                      // 0x0030(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCenteredOnRequestingPlayer;                       // 0x0031(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_32[0x2];                                       // 0x0032(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Page;                                              // 0x0034(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsSpotlightCompetition;                           // 0x0038(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseCache;                                         // 0x0039(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UPilgrimAsyncAction_RequestLeaderboard* ReturnValue;                                       // 0x0040(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PilgrimAsyncAction_RequestLeaderboard_PilgrimRequestLeaderboard;

// Function PilgrimCoreRuntime.PilgrimAsyncAction_RequestPersonalBest.PilgrimRequestPersonalBest
// 0x0060 (0x0060 - 0x0000)
struct PilgrimAsyncAction_RequestPersonalBest_PilgrimRequestPersonalBest final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFortPlayerController*                  RequestingPlayer;                                  // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FUniqueNetIdRepl                       PlayerAccountId;                                   // 0x0010(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   SongShortName;                                     // 0x0040(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPilgrimTrackType                             InstrumentType;                                    // 0x0044(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         BandSize;                                          // 0x0048(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SetlistIndex;                                      // 0x004C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseCache;                                         // 0x0050(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPilgrimAsyncAction_RequestPersonalBest* ReturnValue;                                      // 0x0058(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PilgrimAsyncAction_RequestPersonalBest_PilgrimRequestPersonalBest;

// Function PilgrimCoreRuntime.PilgrimAsyncAction_RequestPlayerFeed.PilgrimRequestPlayerFeed
// 0x00A0 (0x00A0 - 0x0000)
struct PilgrimAsyncAction_RequestPlayerFeed_PilgrimRequestPlayerFeed final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFortPlayerController*                  RequestingPlayer;                                  // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTagQuery                      SongQuery;                                         // 0x0010(0x0048)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FSongShortNameMatcher                  SongShortNameMatcher;                              // 0x0058(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<EPilgrimLeaderboardType>               Leaderboards;                                      // 0x0070(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<struct FUniqueNetIdRepl>               FriendIds;                                         // 0x0080(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	EPilgrimPlayerFeedSortType                    SortType;                                          // 0x0090(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAllScores;                                        // 0x0091(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRequirePlayerScore;                               // 0x0092(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_93[0x5];                                       // 0x0093(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UPilgrimAsyncAction_RequestPlayerFeed*  ReturnValue;                                       // 0x0098(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PilgrimAsyncAction_RequestPlayerFeed_PilgrimRequestPlayerFeed;

// Function PilgrimCoreRuntime.PilgrimBeatMarker.SetupNumLanes
// 0x0004 (0x0004 - 0x0000)
struct PilgrimBeatMarker_SetupNumLanes final
{
public:
	int32                                         NumLanes;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PilgrimBeatMarker_SetupNumLanes;

// Function PilgrimCoreRuntime.PilgrimBeatValidatedAbility.OnBeatAbilityActivated
// 0x0001 (0x0001 - 0x0000)
struct PilgrimBeatValidatedAbility_OnBeatAbilityActivated final
{
public:
	bool                                          bOnBeat;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PilgrimBeatValidatedAbility_OnBeatAbilityActivated;

// Function PilgrimCoreRuntime.PilgrimClientSettingRecordPartition.SetSelectedGeneralControllerPreset
// 0x0010 (0x0010 - 0x0000)
struct PilgrimClientSettingRecordPartition_SetSelectedGeneralControllerPreset final
{
public:
	class FString                                 NewSelectedGeneralControllerPreset;                // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PilgrimClientSettingRecordPartition_SetSelectedGeneralControllerPreset;

// Function PilgrimCoreRuntime.PilgrimClientSettingRecordPartition.SetTrackBackgroundOpacity
// 0x0004 (0x0004 - 0x0000)
struct PilgrimClientSettingRecordPartition_SetTrackBackgroundOpacity final
{
public:
	float                                         NewOpacity;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PilgrimClientSettingRecordPartition_SetTrackBackgroundOpacity;

// Function PilgrimCoreRuntime.PilgrimClientSettingRecordPartition.SetTrackSpeedMultiplier
// 0x0004 (0x0004 - 0x0000)
struct PilgrimClientSettingRecordPartition_SetTrackSpeedMultiplier final
{
public:
	float                                         NewMultiplier;                                     // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PilgrimClientSettingRecordPartition_SetTrackSpeedMultiplier;

// Function PilgrimCoreRuntime.PilgrimClientSettingRecordPartition.SetUseAlternative5LaneTouchLayout
// 0x0001 (0x0001 - 0x0000)
struct PilgrimClientSettingRecordPartition_SetUseAlternative5LaneTouchLayout final
{
public:
	bool                                          NewUseAlternative5LaneTouchLayout;                 // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PilgrimClientSettingRecordPartition_SetUseAlternative5LaneTouchLayout;

// Function PilgrimCoreRuntime.PilgrimClientSettingRecordPartition.GetSelectedGeneralControllerPreset
// 0x0010 (0x0010 - 0x0000)
struct PilgrimClientSettingRecordPartition_GetSelectedGeneralControllerPreset final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PilgrimClientSettingRecordPartition_GetSelectedGeneralControllerPreset;

// Function PilgrimCoreRuntime.PilgrimClientSettingRecordPartition.GetTrackBackgroundOpacity
// 0x0004 (0x0004 - 0x0000)
struct PilgrimClientSettingRecordPartition_GetTrackBackgroundOpacity final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PilgrimClientSettingRecordPartition_GetTrackBackgroundOpacity;

// Function PilgrimCoreRuntime.PilgrimClientSettingRecordPartition.GetTrackSpeedMultiplier
// 0x0004 (0x0004 - 0x0000)
struct PilgrimClientSettingRecordPartition_GetTrackSpeedMultiplier final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PilgrimClientSettingRecordPartition_GetTrackSpeedMultiplier;

// Function PilgrimCoreRuntime.PilgrimClientSettingRecordPartition.GetUseAlternative5LaneTouchLayout
// 0x0001 (0x0001 - 0x0000)
struct PilgrimClientSettingRecordPartition_GetUseAlternative5LaneTouchLayout final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PilgrimClientSettingRecordPartition_GetUseAlternative5LaneTouchLayout;

// Function PilgrimCoreRuntime.PilgrimCoreBandStateComponent.GetCurrentSong
// 0x0008 (0x0008 - 0x0000)
struct PilgrimCoreBandStateComponent_GetCurrentSong final
{
public:
	class UPilgrimSongMetadata*                   ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PilgrimCoreBandStateComponent_GetCurrentSong;

// Function PilgrimCoreRuntime.PilgrimCoreBandStateComponent.GetNextSong
// 0x0008 (0x0008 - 0x0000)
struct PilgrimCoreBandStateComponent_GetNextSong final
{
public:
	class UPilgrimSongMetadata*                   ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PilgrimCoreBandStateComponent_GetNextSong;

// Function PilgrimCoreRuntime.PilgrimCoreBandStateComponent.GetSongAtIndex
// 0x0010 (0x0010 - 0x0000)
struct PilgrimCoreBandStateComponent_GetSongAtIndex final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPilgrimSongMetadata*                   ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PilgrimCoreBandStateComponent_GetSongAtIndex;

// Function PilgrimCoreRuntime.PilgrimCorePlayerStateComponent.GetPilgrimCorePlayerStateComponent
// 0x0010 (0x0010 - 0x0000)
struct PilgrimCorePlayerStateComponent_GetPilgrimCorePlayerStateComponent final
{
public:
	const class APlayerState*                     PlayerState;                                       // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPilgrimCorePlayerStateComponent*       ReturnValue;                                       // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PilgrimCorePlayerStateComponent_GetPilgrimCorePlayerStateComponent;

// Function PilgrimCoreRuntime.PilgrimCorePlayerStateComponent.OnRep_InstrumentChoice
// 0x0001 (0x0001 - 0x0000)
struct PilgrimCorePlayerStateComponent_OnRep_InstrumentChoice final
{
public:
	EPilgrimTrackType                             PrevInstrument;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PilgrimCorePlayerStateComponent_OnRep_InstrumentChoice;

// Function PilgrimCoreRuntime.PilgrimCorePlayerStateComponent.OnRep_IsReady
// 0x0001 (0x0001 - 0x0000)
struct PilgrimCorePlayerStateComponent_OnRep_IsReady final
{
public:
	bool                                          bPrevIsReady;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PilgrimCorePlayerStateComponent_OnRep_IsReady;

// Function PilgrimCoreRuntime.PilgrimCorePlayerStateComponent.OnRep_SongDifficulty
// 0x0001 (0x0001 - 0x0000)
struct PilgrimCorePlayerStateComponent_OnRep_SongDifficulty final
{
public:
	EPilgrimSongDifficulty                        PrevDifficulty;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PilgrimCorePlayerStateComponent_OnRep_SongDifficulty;

// Function PilgrimCoreRuntime.PilgrimCorePlayerStateComponent.ServerSetIsReady
// 0x0001 (0x0001 - 0x0000)
struct PilgrimCorePlayerStateComponent_ServerSetIsReady final
{
public:
	bool                                          bInIsReady;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PilgrimCorePlayerStateComponent_ServerSetIsReady;

// Function PilgrimCoreRuntime.PilgrimCorePlayerStateComponent.ServerSetIsUsingPlasticInstruments
// 0x0001 (0x0001 - 0x0000)
struct PilgrimCorePlayerStateComponent_ServerSetIsUsingPlasticInstruments final
{
public:
	bool                                          bIsPlasticAvailable;                               // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PilgrimCorePlayerStateComponent_ServerSetIsUsingPlasticInstruments;

// Function PilgrimCoreRuntime.PilgrimCorePlayerStateComponent.SetInstrumentChoice
// 0x0001 (0x0001 - 0x0000)
struct PilgrimCorePlayerStateComponent_SetInstrumentChoice final
{
public:
	EPilgrimTrackType                             Instrument;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PilgrimCorePlayerStateComponent_SetInstrumentChoice;

// Function PilgrimCoreRuntime.PilgrimCorePlayerStateComponent.SetSongDifficulty
// 0x0001 (0x0001 - 0x0000)
struct PilgrimCorePlayerStateComponent_SetSongDifficulty final
{
public:
	EPilgrimSongDifficulty                        Difficulty;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PilgrimCorePlayerStateComponent_SetSongDifficulty;

// Function PilgrimCoreRuntime.PilgrimCorePlayerStateComponent.GetInstrumentChoice
// 0x0001 (0x0001 - 0x0000)
struct PilgrimCorePlayerStateComponent_GetInstrumentChoice final
{
public:
	EPilgrimTrackType                             ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PilgrimCorePlayerStateComponent_GetInstrumentChoice;

// Function PilgrimCoreRuntime.PilgrimCorePlayerStateComponent.GetIsPlasticInstrumentAvailable
// 0x0001 (0x0001 - 0x0000)
struct PilgrimCorePlayerStateComponent_GetIsPlasticInstrumentAvailable final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PilgrimCorePlayerStateComponent_GetIsPlasticInstrumentAvailable;

// Function PilgrimCoreRuntime.PilgrimCorePlayerStateComponent.GetIsReady
// 0x0001 (0x0001 - 0x0000)
struct PilgrimCorePlayerStateComponent_GetIsReady final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PilgrimCorePlayerStateComponent_GetIsReady;

// Function PilgrimCoreRuntime.PilgrimCorePlayerStateComponent.GetSongDifficulty
// 0x0001 (0x0001 - 0x0000)
struct PilgrimCorePlayerStateComponent_GetSongDifficulty final
{
public:
	EPilgrimSongDifficulty                        ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PilgrimCorePlayerStateComponent_GetSongDifficulty;

// Function PilgrimCoreRuntime.PilgrimCorePlayerStateComponent.GetTrackTypeForGameplay
// 0x0001 (0x0001 - 0x0000)
struct PilgrimCorePlayerStateComponent_GetTrackTypeForGameplay final
{
public:
	EPilgrimTrackType                             ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PilgrimCorePlayerStateComponent_GetTrackTypeForGameplay;

// Function PilgrimCoreRuntime.PilgrimCore_BPFL.GetPlatformTimeSeconds
// 0x0004 (0x0004 - 0x0000)
struct PilgrimCore_BPFL_GetPlatformTimeSeconds final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PilgrimCore_BPFL_GetPlatformTimeSeconds;

// Function PilgrimCoreRuntime.PilgrimCore_BPFL.InstrumentTypesAreEqual
// 0x0003 (0x0003 - 0x0000)
struct PilgrimCore_BPFL_InstrumentTypesAreEqual final
{
public:
	ESparksInstrumentType                         SparksType;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPilgrimTrackType                             PilgrimType;                                       // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0002(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PilgrimCore_BPFL_InstrumentTypesAreEqual;

// Function PilgrimCoreRuntime.PilgrimCore_BPFL.MidiTrackNameToPilgrimTrackType
// 0x0018 (0x0018 - 0x0000)
struct PilgrimCore_BPFL_MidiTrackNameToPilgrimTrackType final
{
public:
	class FString                                 MidiTrackName;                                     // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPilgrimTrackType                             ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_PilgrimCore_BPFL_MidiTrackNameToPilgrimTrackType;

// Function PilgrimCoreRuntime.PilgrimCore_BPFL.PilgrimTrackTypeToMidiTrackName
// 0x0018 (0x0018 - 0x0000)
struct PilgrimCore_BPFL_PilgrimTrackTypeToMidiTrackName final
{
public:
	EPilgrimTrackType                             PilgrimType;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PilgrimCore_BPFL_PilgrimTrackTypeToMidiTrackName;

// Function PilgrimCoreRuntime.PilgrimCore_BPFL.PilgrimTrackTypeToSparksInstrument
// 0x0002 (0x0002 - 0x0000)
struct PilgrimCore_BPFL_PilgrimTrackTypeToSparksInstrument final
{
public:
	EPilgrimTrackType                             PilgrimType;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESparksInstrumentType                         ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PilgrimCore_BPFL_PilgrimTrackTypeToSparksInstrument;

// Function PilgrimCoreRuntime.PilgrimCore_BPFL.ShouldUseTouchUIForLocalPlayer
// 0x0010 (0x0010 - 0x0000)
struct PilgrimCore_BPFL_ShouldUseTouchUIForLocalPlayer final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_PilgrimCore_BPFL_ShouldUseTouchUIForLocalPlayer;

// Function PilgrimCoreRuntime.PilgrimCore_BPFL.SparksInstrumentToPilgrimTrackType
// 0x0002 (0x0002 - 0x0000)
struct PilgrimCore_BPFL_SparksInstrumentToPilgrimTrackType final
{
public:
	ESparksInstrumentType                         SparksType;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPilgrimTrackType                             ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PilgrimCore_BPFL_SparksInstrumentToPilgrimTrackType;

// Function PilgrimCoreRuntime.PilgrimCustomSetlist.OnRep_MaxSongsPerPlayer
// 0x0004 (0x0004 - 0x0000)
struct PilgrimCustomSetlist_OnRep_MaxSongsPerPlayer final
{
public:
	int32                                         PrevMax;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PilgrimCustomSetlist_OnRep_MaxSongsPerPlayer;

// Function PilgrimCoreRuntime.PilgrimCustomSetlist.ServerAddSongForPlayer
// 0x0010 (0x0010 - 0x0000)
struct PilgrimCustomSetlist_ServerAddSongForPlayer final
{
public:
	class FName                                   SongShortName;                                     // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerState*                           Player;                                            // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PilgrimCustomSetlist_ServerAddSongForPlayer;

// Function PilgrimCoreRuntime.PilgrimCustomSetlist.ServerRemoveAllSongsForPlayer
// 0x0008 (0x0008 - 0x0000)
struct PilgrimCustomSetlist_ServerRemoveAllSongsForPlayer final
{
public:
	class APlayerState*                           Player;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PilgrimCustomSetlist_ServerRemoveAllSongsForPlayer;

// Function PilgrimCoreRuntime.PilgrimCustomSetlist.ServerRemoveSongAtIndex
// 0x0010 (0x0010 - 0x0000)
struct PilgrimCustomSetlist_ServerRemoveSongAtIndex final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   SongShortName;                                     // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class APlayerState*                           Player;                                            // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PilgrimCustomSetlist_ServerRemoveSongAtIndex;

// Function PilgrimCoreRuntime.PilgrimCustomSetlist.ServerRemoveSongForPlayer
// 0x0018 (0x0018 - 0x0000)
struct PilgrimCustomSetlist_ServerRemoveSongForPlayer final
{
public:
	class FName                                   SongShortName;                                     // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerState*                           Player;                                            // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRemoveAll;                                        // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_PilgrimCustomSetlist_ServerRemoveSongForPlayer;

// Function PilgrimCoreRuntime.PilgrimCustomSetlist.ServerSetIsSetlistLocked
// 0x0001 (0x0001 - 0x0000)
struct PilgrimCustomSetlist_ServerSetIsSetlistLocked final
{
public:
	bool                                          bInIsLocked;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PilgrimCustomSetlist_ServerSetIsSetlistLocked;

// Function PilgrimCoreRuntime.PilgrimCustomSetlist.ServerSetMaxSongsPerPlayer
// 0x0004 (0x0004 - 0x0000)
struct PilgrimCustomSetlist_ServerSetMaxSongsPerPlayer final
{
public:
	int32                                         NewMax;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PilgrimCustomSetlist_ServerSetMaxSongsPerPlayer;

// Function PilgrimCoreRuntime.PilgrimCustomSetlist.CanAddSongForPlayer
// 0x0028 (0x0028 - 0x0000)
struct PilgrimCustomSetlist_CanAddSongForPlayer final
{
public:
	class FName                                   SongShortName;                                     // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerState*                           Player;                                            // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPilgrimCantAddSongReason                     OutReason;                                         // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerState*                           OutAddedByPlayer;                                  // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_PilgrimCustomSetlist_CanAddSongForPlayer;

// Function PilgrimCoreRuntime.PilgrimCustomSetlist.FindEntriesForPlayer
// 0x0018 (0x0018 - 0x0000)
struct PilgrimCustomSetlist_FindEntriesForPlayer final
{
public:
	class APlayerState*                           Player;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<int32>                                 OutMatchingEntryIndicies;                          // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PilgrimCustomSetlist_FindEntriesForPlayer;

// Function PilgrimCoreRuntime.PilgrimCustomSetlist.FindEntriesForSong
// 0x0018 (0x0018 - 0x0000)
struct PilgrimCustomSetlist_FindEntriesForSong final
{
public:
	class FName                                   SongShortName;                                     // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 OutMatchingEntryIndicies;                          // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PilgrimCustomSetlist_FindEntriesForSong;

// Function PilgrimCoreRuntime.PilgrimCustomSetlist.FindEntriesForSongAndPlayer
// 0x0020 (0x0020 - 0x0000)
struct PilgrimCustomSetlist_FindEntriesForSongAndPlayer final
{
public:
	class FName                                   SongShortName;                                     // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerState*                           Player;                                            // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<int32>                                 OutMatchingEntryIndicies;                          // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PilgrimCustomSetlist_FindEntriesForSongAndPlayer;

// Function PilgrimCoreRuntime.PilgrimCustomSetlist.GetIsSetlistLocked
// 0x0001 (0x0001 - 0x0000)
struct PilgrimCustomSetlist_GetIsSetlistLocked final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PilgrimCustomSetlist_GetIsSetlistLocked;

// Function PilgrimCoreRuntime.PilgrimCustomSetlist.GetMaxSongsPerPlayer
// 0x0004 (0x0004 - 0x0000)
struct PilgrimCustomSetlist_GetMaxSongsPerPlayer final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PilgrimCustomSetlist_GetMaxSongsPerPlayer;

// Function PilgrimCoreRuntime.PilgrimCustomSetlist.GetSetlistEntryAtIndex
// 0x0010 (0x0010 - 0x0000)
struct PilgrimCustomSetlist_GetSetlistEntryAtIndex final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   OutSongShortName;                                  // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class APlayerState*                           OutAddedByPlayer;                                  // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PilgrimCustomSetlist_GetSetlistEntryAtIndex;

// Function PilgrimCoreRuntime.PilgrimCustomSetlist.GetSongsAddedByPlayer
// 0x0018 (0x0018 - 0x0000)
struct PilgrimCustomSetlist_GetSongsAddedByPlayer final
{
public:
	class APlayerState*                           Player;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FName>                           ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PilgrimCustomSetlist_GetSongsAddedByPlayer;

// Function PilgrimCoreRuntime.PilgrimCustomSetlist.HasAnyoneAddedSong
// 0x0018 (0x0018 - 0x0000)
struct PilgrimCustomSetlist_HasAnyoneAddedSong final
{
public:
	class FName                                   SongShortName;                                     // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerState*                           OutAddedByPlayer;                                  // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_PilgrimCustomSetlist_HasAnyoneAddedSong;

// Function PilgrimCoreRuntime.PilgrimCustomSetlist.HasPlayerAddedSong
// 0x0018 (0x0018 - 0x0000)
struct PilgrimCustomSetlist_HasPlayerAddedSong final
{
public:
	class FName                                   SongShortName;                                     // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerState*                           Player;                                            // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_PilgrimCustomSetlist_HasPlayerAddedSong;

// Function PilgrimCoreRuntime.PilgrimDelayUntilTimeBeforeMidiTick.PilgrimDelayUntilTimeBeforeMidiTick
// 0x0028 (0x0028 - 0x0000)
struct PilgrimDelayUntilTimeBeforeMidiTick_PilgrimDelayUntilTimeBeforeMidiTick final
{
public:
	class UObject*                                PassthroughObject;                                 // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPilgrimGame*                           PilgrimGameContext;                                // 0x0008(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MidiTick;                                          // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SecondsBeforeTick;                                 // 0x0014(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECalibratedMusicTimebase                      Timebase;                                          // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPilgrimDelayUntilTimeBeforeMidiTick*   ReturnValue;                                       // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PilgrimDelayUntilTimeBeforeMidiTick_PilgrimDelayUntilTimeBeforeMidiTick;

// Function PilgrimCoreRuntime.PilgrimEventRouterLibrary.GetGameplayEventRouter
// 0x0010 (0x0010 - 0x0000)
struct PilgrimEventRouterLibrary_GetGameplayEventRouter final
{
public:
	class AActor*                                 ContextActor;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGameplayEventRouterComponent*          ReturnValue;                                       // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PilgrimEventRouterLibrary_GetGameplayEventRouter;

// Function PilgrimCoreRuntime.PilgrimGame.AddTrack
// 0x0008 (0x0008 - 0x0000)
struct PilgrimGame_AddTrack final
{
public:
	class APilgrimTrack*                          Track;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PilgrimGame_AddTrack;

// Function PilgrimCoreRuntime.PilgrimGame.ApplySettingsFromConfig
// 0x0008 (0x0008 - 0x0000)
struct PilgrimGame_ApplySettingsFromConfig final
{
public:
	const class UPilgrimGameConfig*               GameConfig;                                        // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PilgrimGame_ApplySettingsFromConfig;

// Function PilgrimCoreRuntime.PilgrimGame.CheatSetJumpMarkers
// 0x0020 (0x0020 - 0x0000)
struct PilgrimGame_CheatSetJumpMarkers final
{
public:
	class FString                                 FromTime;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ToTime;                                            // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PilgrimGame_CheatSetJumpMarkers;

// Function PilgrimCoreRuntime.PilgrimGame.CheatSetPerformanceData
// 0x000C (0x000C - 0x0000)
struct PilgrimGame_CheatSetPerformanceData final
{
public:
	struct FPilgrimCheatPerformanceArgument       PerformanceArgument;                               // 0x0000(0x000C)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PilgrimGame_CheatSetPerformanceData;

// Function PilgrimCoreRuntime.PilgrimGame.EndGame
// 0x0008 (0x0008 - 0x0000)
struct PilgrimGame_EndGame final
{
public:
	bool                                          bFadeOut;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FadeOutDurationSeconds;                            // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PilgrimGame_EndGame;

// Function PilgrimCoreRuntime.PilgrimGame.GetGameConfigSettings
// 0x02F0 (0x02F0 - 0x0000)
struct PilgrimGame_GetGameConfigSettings final
{
public:
	struct FPilgrimGameConfigSettings             ReturnValue;                                       // 0x0000(0x02F0)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PilgrimGame_GetGameConfigSettings;

// Function PilgrimCoreRuntime.PilgrimGame.GetNumLanes
// 0x0004 (0x0004 - 0x0000)
struct PilgrimGame_GetNumLanes final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PilgrimGame_GetNumLanes;

// Function PilgrimCoreRuntime.PilgrimGame.OnInputMethodChanged
// 0x0001 (0x0001 - 0x0000)
struct PilgrimGame_OnInputMethodChanged final
{
public:
	ECommonInputType                              CurrentInputType;                                  // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PilgrimGame_OnInputMethodChanged;

// Function PilgrimCoreRuntime.PilgrimGame.PlaySong
// 0x0020 (0x0020 - 0x0000)
struct PilgrimGame_PlaySong final
{
public:
	class UAudioComponent*                        InMetasoundPlayer;                                 // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAudioComponent*                        InMetasoundMixer;                                  // 0x0008(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMusicClockComponent*                   InMusicClock;                                      // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPilgrimSongMetadata*                   InSong;                                            // 0x0018(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PilgrimGame_PlaySong;

// Function PilgrimCoreRuntime.PilgrimGame.PlaySongStreamed
// 0x0020 (0x0020 - 0x0000)
struct PilgrimGame_PlaySongStreamed final
{
public:
	class UAudioComponent*                        InMetasoundPlayer;                                 // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAudioComponent*                        InMetasoundMixer;                                  // 0x0008(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMusicClockComponent*                   InMusicClock;                                      // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
