#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PilgrimQuickplayRuntime

#include "Basic.hpp"

#include "PilgrimQuickplayRuntime_structs.hpp"
#include "PlayspaceSystem_classes.hpp"
#include "SparksCameraDirectorRuntime_classes.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "SparksCoreRuntime_structs.hpp"
#include "PilgrimCoreRuntime_structs.hpp"
#include "PilgrimCoreRuntime_classes.hpp"
#include "DeveloperSettings_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "PilgrimQPSharedRuntime_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "GameplayStateMachine_classes.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK
{

// Class PilgrimQuickplayRuntime.PilgrimGreenRoomLayoutSwitcher
// 0x0010 (0x00B0 - 0x00A0)
class UPilgrimGreenRoomLayoutSwitcher final : public UPlayspaceComponent
{
public:
	int32                                         CurrentLayout;                                     // 0x00A0(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UEnum*                                  LayoutEnumType;                                    // 0x00A8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	void CycleLayout();
	void OnLayoutChanged(int32 NewLayout);
	void OnRep_CurrentLayout();
	void SetLayout(int32 NewLayout);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PilgrimGreenRoomLayoutSwitcher")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PilgrimGreenRoomLayoutSwitcher")
	}
	static class UPilgrimGreenRoomLayoutSwitcher* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPilgrimGreenRoomLayoutSwitcher>();
	}
};
DUMPER7_ASSERTS_UPilgrimGreenRoomLayoutSwitcher;

// Class PilgrimQuickplayRuntime.PilgrimLeaderboardScoreReporter
// 0x0000 (0x00A0 - 0x00A0)
class UPilgrimLeaderboardScoreReporter final : public UPlayspaceComponent
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PilgrimLeaderboardScoreReporter")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PilgrimLeaderboardScoreReporter")
	}
	static class UPilgrimLeaderboardScoreReporter* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPilgrimLeaderboardScoreReporter>();
	}
};
DUMPER7_ASSERTS_UPilgrimLeaderboardScoreReporter;

// Class PilgrimQuickplayRuntime.PilgrimPawnComponent
// 0x0008 (0x00B0 - 0x00A8)
class UPilgrimPawnComponent : public UFortPawnComponent
{
public:
	bool                                          bInteractionEffectsEnabled;                        // 0x00A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetInteractionEffectsEnabled(bool bEnable);

	bool GetInteractionEffectsEnabled() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PilgrimPawnComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PilgrimPawnComponent")
	}
	static class UPilgrimPawnComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPilgrimPawnComponent>();
	}
};
DUMPER7_ASSERTS_UPilgrimPawnComponent;

// Class PilgrimQuickplayRuntime.PilgrimPlayspaceComponent_IntroDirector
// 0x00F8 (0x01F0 - 0x00F8)
class alignas(0x10) UPilgrimPlayspaceComponent_IntroDirector final : public UFortPlayspaceComponent
{
public:
	TArray<class UFortMontageItemDefinitionBase*> GuitarSpotlights;                                  // 0x00F8(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<class UFortMontageItemDefinitionBase*> DrumSpotlights;                                    // 0x0108(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<class UFortMontageItemDefinitionBase*> BassSpotlights;                                    // 0x0118(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<class UFortMontageItemDefinitionBase*> MicSpotlights;                                     // 0x0128(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<class UFortMontageItemDefinitionBase*> KeytarSpotlights;                                  // 0x0138(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, UObjectWrapper, NativeAccessSpecifierPublic)
	uint8                                         Pad_148[0xA8];                                     // 0x0148(0x00A8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ClearSpotlightMontageHandles();
	bool EnqueueSpotlightMontages(ESparksInstrumentType InstrumentType);
	bool HasSpotlightMontageLoadFinished(int32 PlayerIndex);
	void OnSpotlightMontageLoaded(int32 PlayerIndex, class UAnimMontage* LoadedMontage);
	void RequestNextMontageForInstrument(ESparksInstrumentType InstrumentType, class AFortPlayerPawn* PlayerPawn, int32 PlayerIndex);

	bool EnableFloatingPawnFix() const;
	float GetFloatingPawnFixIntervalSeconds() const;
	void StartPlayerIntro(class APlayerState* PlayerState) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PilgrimPlayspaceComponent_IntroDirector")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PilgrimPlayspaceComponent_IntroDirector")
	}
	static class UPilgrimPlayspaceComponent_IntroDirector* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPilgrimPlayspaceComponent_IntroDirector>();
	}
};
DUMPER7_ASSERTS_UPilgrimPlayspaceComponent_IntroDirector;

// Class PilgrimQuickplayRuntime.PilgrimPlayspaceComponent_ServerExpiration
// 0x0000 (0x01B8 - 0x01B8)
class UPilgrimPlayspaceComponent_ServerExpiration final : public UPlayspaceComponent_ServerExpiration
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PilgrimPlayspaceComponent_ServerExpiration")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PilgrimPlayspaceComponent_ServerExpiration")
	}
	static class UPilgrimPlayspaceComponent_ServerExpiration* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPilgrimPlayspaceComponent_ServerExpiration>();
	}
};
DUMPER7_ASSERTS_UPilgrimPlayspaceComponent_ServerExpiration;

// Class PilgrimQuickplayRuntime.PilgrimQuickplayBandStateComponent
// 0x0078 (0x0128 - 0x00B0)
class UPilgrimQuickplayBandStateComponent final : public UPilgrimCoreBandStateComponent
{
public:
	TMulticastInlineDelegate<void(bool bIsReplaying)> OnSongReplayingChanged;                        // 0x00B0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UPilgrimPremadeSetlist*                 SetlistVoteWinner;                                 // 0x00C0(0x0008)(Net, ZeroConstructor, Transient, RepNotify, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         CurrentSetlistIndex;                               // 0x00C8(0x0004)(Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bIsReplayingPreviousSong;                          // 0x00CC(0x0001)(Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_CD[0x3];                                       // 0x00CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<int32, struct FPilgrimQuickplaySongResultData> SetlistResultMap;                            // 0x00D0(0x0050)(Transient, NativeAccessSpecifierPrivate)
	uint8                                         Pad_120[0x8];                                      // 0x0120(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UPilgrimQuickplayBandStateComponent* GetBandState(class AActor* ContextActor);

	void OnRep_CurrentSetlistIndex(int32 PrevSetlistIndex);
	void OnRep_IsReplayingPreviousSong();
	void OnRep_SetlistVoteWinner(class UPilgrimPremadeSetlist* PrevSetlist);
	void ServerAdvanceSetlistIndex();
	void ServerResetSetlistIndex();

	bool AreAllPlayersReady() const;
	TScriptInterface<class IPilgrimSetlistInterface> GetCurrentSetlist() const;
	int32 GetCurrentSetlistIndex() const;
	int32 GetCurrentSetlistLength() const;
	TArray<class APlayerState*> GetPlayersInBand(uint8 Team) const;
	TArray<class APlayerState*> GetPlayersInBandByController(class APlayerController* Controller) const;
	class UPilgrimPremadeSetlist* GetSetlistVoteWinner() const;
	int32 GetVoteCountForSetlist(class UPilgrimPremadeSetlist* Setlist) const;
	TArray<class APlayerState*> GetVotersForSetlist(class UPilgrimPremadeSetlist* Setlist) const;
	bool IsReplayingPreviousSong() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PilgrimQuickplayBandStateComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PilgrimQuickplayBandStateComponent")
	}
	static class UPilgrimQuickplayBandStateComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPilgrimQuickplayBandStateComponent>();
	}
};
DUMPER7_ASSERTS_UPilgrimQuickplayBandStateComponent;

// Class PilgrimQuickplayRuntime.PilgrimQuickplayCameraDataSource
// 0x0010 (0x00C0 - 0x00B0)
class UPilgrimQuickplayCameraDataSource final : public USparksCameraPluginDataProvider
{
public:
	bool                                          bCutOnMeasuresInsteadOfBeats;                      // 0x00B0(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B1[0x3];                                       // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TWeakObjectPtr<class UPilgrimGame>            PilgrimGame;                                       // 0x00B4(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PilgrimQuickplayCameraDataSource")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PilgrimQuickplayCameraDataSource")
	}
	static class UPilgrimQuickplayCameraDataSource* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPilgrimQuickplayCameraDataSource>();
	}
};
DUMPER7_ASSERTS_UPilgrimQuickplayCameraDataSource;

// Class PilgrimQuickplayRuntime.PilgrimQuickplayDeveloperSettings
// 0x00B8 (0x00E8 - 0x0030)
class UPilgrimQuickplayDeveloperSettings final : public UDeveloperSettings
{
public:
	bool                                          OverrideGamestateSettings;                         // 0x0030(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          SongGameplay_SkipToGreenRoom;                      // 0x0031(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_32[0x2];                                       // 0x0032(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         SongResults_TransitionTimeInSeconds;               // 0x0034(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          SongResults_OverrideSongData;                      // 0x0038(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPilgrimQuickplaySongResultData        SongResults_SongData;                              // 0x0040(0x0070)(Edit, BlueprintVisible, BlueprintReadOnly, Config, NativeAccessSpecifierPublic)
	bool                                          SongResults_OverrideSetlistResultData;             // 0x00B0(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FPilgrimQuickplaySetlistResultData> SongResults_SetlistResultsData;                // 0x00B8(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	bool                                          Gameplay_ShowSongStats;                            // 0x00C8(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          SongResults_SetlistChallengeOverrideConsole;       // 0x00C9(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          SongResults_SetlistChallengeDebug;                 // 0x00CA(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          SongResults_SetlistChallengeFilenameAbsolute;      // 0x00CB(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 SongResults_SetlistChallengeJSONDumpFilename;      // 0x00D0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          SongResults_SetlistChallengeIncludeHistogramData;  // 0x00E0(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PilgrimQuickplayDeveloperSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PilgrimQuickplayDeveloperSettings")
	}
	static class UPilgrimQuickplayDeveloperSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPilgrimQuickplayDeveloperSettings>();
	}
};
DUMPER7_ASSERTS_UPilgrimQuickplayDeveloperSettings;

// Class PilgrimQuickplayRuntime.PilgrimQuickplayEmoteBPFL
// 0x0000 (0x0028 - 0x0028)
class UPilgrimQuickplayEmoteBPFL final : public UBlueprintFunctionLibrary
{
public:
	static void GetEmoteActionBinding(const class FString& EmoteTemplateID, struct FEmoteActionBinding* OutCreatedEmote);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PilgrimQuickplayEmoteBPFL")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PilgrimQuickplayEmoteBPFL")
	}
	static class UPilgrimQuickplayEmoteBPFL* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPilgrimQuickplayEmoteBPFL>();
	}
};
DUMPER7_ASSERTS_UPilgrimQuickplayEmoteBPFL;

// Class PilgrimQuickplayRuntime.PilgrimQuickplayPlayerSpawningComponent
// 0x0020 (0x00D0 - 0x00B0)
class UPilgrimQuickplayPlayerSpawningComponent final : public UPlayspaceComponent_PlayerSpawning
{
public:
	struct FGameplayTagContainer                  PregameSpawnTags;                                  // 0x00B0(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PilgrimQuickplayPlayerSpawningComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PilgrimQuickplayPlayerSpawningComponent")
	}
	static class UPilgrimQuickplayPlayerSpawningComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPilgrimQuickplayPlayerSpawningComponent>();
	}
};
DUMPER7_ASSERTS_UPilgrimQuickplayPlayerSpawningComponent;

// Class PilgrimQuickplayRuntime.PilgrimQuickplayPlayerStateComponent
// 0x00C8 (0x0178 - 0x00B0)
class UPilgrimQuickplayPlayerStateComponent final : public UPilgrimCorePlayerStateComponent
{
public:
	class UPilgrimSongMetadata*                   SongVote;                                          // 0x00B0(0x0008)(Net, ZeroConstructor, Transient, RepNotify, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPilgrimPremadeSetlist*                 SetlistVote;                                       // 0x00B8(0x0008)(Net, ZeroConstructor, Transient, RepNotify, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TMap<int32, struct FPilgrimPersonalBestHistoryRpl> SetlistHighscoreMap;                          // 0x00C0(0x0050)(Transient, NativeAccessSpecifierPrivate)
	TMap<int32, class UPilgrimQuickplaySetlistResultProxyInstance*> SetlistResultMap;                // 0x0110(0x0050)(Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	float                                         CloseupCameraTime;                                 // 0x0160(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_164[0x4];                                      // 0x0164(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TScriptInterface<class IQuestInstanceInterface>> GrantedQuests;                           // 0x0168(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPrivate)

public:
	static class UPilgrimQuickplayPlayerStateComponent* GetPilgrimQuickplayPlayerStateComponent(const class APlayerState* PlayerState);
	static class UPilgrimSongMetadata* GetSongVote(class APlayerState* PlayerState);

	void BroadcastEvent_SongResultDataChanged(int32 SetlistIndex);
	void ClientMatchRecorded(int32 SetlistIndex, bool bIsSoloMatch);
	void MulticastBroadcastNewHighscore(int32 TotalScore, int32 DeltaScore, EPilgrimPersonalBestType BestType);
	void OnRep_SetlistVote(class UPilgrimPremadeSetlist* PrevSetlistVote);
	void OnRep_SongVote(class UPilgrimSongMetadata* PrevSongVote);
	void ResetSetlistResultData();
	void SendHighscoreToServer(const struct FPilgrimPersonalBestResult& Highscore, int32 SetlistIndex, bool bLoaded);
	void SendToClientsPerformanceData(int32 SetlistIndex, const struct FPilgrimQuickplayPlayerPerformanceData& NewPerformanceData);
	void SendToClientsResetSetlistResultData();
	void SendToClientsSongResultData(int32 SetlistIndex, const struct FPilgrimQuickplaySongResultData& NewPerformanceData);
	void SendToServerAllIntrosFinished(class UPilgrimQuickplayState_Intro* IntroState);
	void SendToServerPerformanceData(const struct FPilgrimQuickplayPlayerPerformanceData& NewPerformanceData);
	void Server_GrantDefaultQuests();
	void Server_ResetDefaultQuests();
	void ServerSetHighscore(const struct FPilgrimPersonalBestResultRpl& Highscore, int32 SetlistIndex, bool bLoaded);
	void SetCloseupCameraTime(float TotalTime);
	void SetHighscore(const struct FPilgrimPersonalBestResultRpl& Highscore, int32 SetlistIndex, bool bLoaded);
	void SetPerformanceData(const struct FPilgrimQuickplayPlayerPerformanceData& NewPerformanceData);
	void SetReachedNewHighscore(int32 TotalScore, int32 DeltaScore, EPilgrimPersonalBestType BestType);
	void SetSetlistVote(class UPilgrimPremadeSetlist* PlayerChosenSetlist);
	void SetSongResultData(const struct FPilgrimQuickplaySongResultData& NewSongResultData);
	void SetSongVote(class UPilgrimSongMetadata* PlayerChosenSong);

	class UPilgrimQuickplayBandStateComponent* GetBandState() const;
	float GetCloseupCameraTime() const;
	class UPilgrimPremadeSetlist* GetCurrentSetlistVote() const;
	class UPilgrimSongMetadata* GetCurrentSongVote() const;
	bool GetHighscoreResult(struct FPilgrimPersonalBestResultRpl* OutResult, int32 SetlistIndex, bool bLoaded) const;
	class UGameplayStateMachine* GetMainStateMachine() const;
	const struct FPilgrimQuickplayPlayerPerformanceData GetPerformanceData() const;
	bool GetReachedNewHighscore(EPilgrimPersonalBestType BestType, int32 SetlistIndex) const;
	struct FPilgrimQuickplaySetlistResultData GetSetlistResultDataByIndex(int32 SetlistIndex) const;
	void GetSetlistResultProxies(TArray<class UPilgrimQuickplaySetlistResultProxyInstance*>* SetlistProxy) const;
	const struct FPilgrimQuickplaySongResultData GetSongResultData() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PilgrimQuickplayPlayerStateComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PilgrimQuickplayPlayerStateComponent")
	}
	static class UPilgrimQuickplayPlayerStateComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPilgrimQuickplayPlayerStateComponent>();
	}
};
DUMPER7_ASSERTS_UPilgrimQuickplayPlayerStateComponent;

// Class PilgrimQuickplayRuntime.PilgrimQuickplayPlayspace
// 0x0030 (0x0800 - 0x07D0)
class APilgrimQuickplayPlayspace final : public APilgrimPlayspace
{
public:
	class UPilgrimStandinDirector*                StandinDirector;                                   // 0x07D0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UPilgrimQuickplayStateMachine> PilgrimQuickplayStateMachineClass;              // 0x07D8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UGameplayStateMachineManager*           StateMachineManager;                               // 0x07E0(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UGameplayStateMachine*                  MainStateMachine;                                  // 0x07E8(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UPilgrimQuickplayBandStateComponent*    BandState;                                         // 0x07F0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UPilgrimQuickplayCameraDataSource*      CameraDataSource;                                  // 0x07F8(0x0008)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void ForceActiveCameraDirector();
	void HandleDirectorResetEvent(const struct FSparksCommonResetCameraDirectorEvent& Payload);
	void HandleDirectorStartEvent(const struct FSparksCommonStartCameraDirectorEvent& Payload);
	void HandleDirectorStopEvent(const struct FSparksCommonStopCameraDirectorEvent& Payload);

	class UPilgrimQuickplayStateBase* GetActivePilgrimQuickplayState() const;
	EPilgrimQuickplayState GetActivePilgrimStateId() const;
	bool GetIsSinglePlayerGame() const;
	class UPilgrimQuickplayStateMachine* GetPilgrimQuickplayStateMachine() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PilgrimQuickplayPlayspace")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PilgrimQuickplayPlayspace")
	}
	static class APilgrimQuickplayPlayspace* GetDefaultObj()
	{
		return GetDefaultObjImpl<APilgrimQuickplayPlayspace>();
	}
};
DUMPER7_ASSERTS_APilgrimQuickplayPlayspace;

// Class PilgrimQuickplayRuntime.PilgrimQuickplayPlayspaceComponent_PlayerManager
// 0x0010 (0x0108 - 0x00F8)
class UPilgrimQuickplayPlayspaceComponent_PlayerManager final : public UFortPlayspaceComponent
{
public:
	uint8                                         Pad_F8[0x10];                                      // 0x00F8(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BP_OnAppResumed(float ElapsedTimeSeconds);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PilgrimQuickplayPlayspaceComponent_PlayerManager")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PilgrimQuickplayPlayspaceComponent_PlayerManager")
	}
	static class UPilgrimQuickplayPlayspaceComponent_PlayerManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPilgrimQuickplayPlayspaceComponent_PlayerManager>();
	}
};
DUMPER7_ASSERTS_UPilgrimQuickplayPlayspaceComponent_PlayerManager;

// Class PilgrimQuickplayRuntime.PilgrimQuickplaySetlistResultProxyInstance
// 0x00C0 (0x00E8 - 0x0028)
class UPilgrimQuickplaySetlistResultProxyInstance final : public UObject
{
public:
	struct FPilgrimQuickplaySetlistResultData     ResultData;                                        // 0x0028(0x00C0)(BlueprintVisible, BlueprintReadOnly, Transient, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PilgrimQuickplaySetlistResultProxyInstance")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PilgrimQuickplaySetlistResultProxyInstance")
	}
	static class UPilgrimQuickplaySetlistResultProxyInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPilgrimQuickplaySetlistResultProxyInstance>();
	}
};
DUMPER7_ASSERTS_UPilgrimQuickplaySetlistResultProxyInstance;

// Class PilgrimQuickplayRuntime.PilgrimQuickplayStateBase
// 0x0060 (0x00D8 - 0x0078)
class UPilgrimQuickplayStateBase : public UGameplayState
{
public:
	class UFortAbilitySet*                        AbilitySetForState;                                // 0x0078(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<TWeakObjectPtr<class APlayerState>, struct FFortAbilitySetHandle> GrantedAbilitySets;       // 0x0080(0x0050)(Transient, ContainsInstancedReference, NativeAccessSpecifierPublic)
	class UFortInputMappingContext*               InputMappingContext;                               // 0x00D0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	bool MarkStateDone();

	class UGameplayEventRouterComponent* GetEventRouter() const;
	class APilgrimQuickplayPlayspace* GetPilgrimPlayspace() const;
	EPilgrimQuickplayState GetPilgrimStateId() const;
	class UPilgrimQuickplayStateMachine* GetPilgrimStateMachine() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PilgrimQuickplayStateBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PilgrimQuickplayStateBase")
	}
	static class UPilgrimQuickplayStateBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPilgrimQuickplayStateBase>();
	}
};
DUMPER7_ASSERTS_UPilgrimQuickplayStateBase;

// Class PilgrimQuickplayRuntime.PilgrimQuickplayStateBPFL
// 0x0000 (0x0028 - 0x0028)
class UPilgrimQuickplayStateBPFL final : public UBlueprintFunctionLibrary
{
public:
	static EPilgrimQuickplayState GetPilgrimState(const struct FGameplayTag& tag);
	static struct FGameplayTag GetStateTag(const EPilgrimQuickplayState& State);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PilgrimQuickplayStateBPFL")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PilgrimQuickplayStateBPFL")
	}
	static class UPilgrimQuickplayStateBPFL* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPilgrimQuickplayStateBPFL>();
	}
};
DUMPER7_ASSERTS_UPilgrimQuickplayStateBPFL;

// Class PilgrimQuickplayRuntime.PilgrimQuickplayStateMachine
// 0x0010 (0x00D8 - 0x00C8)
class UPilgrimQuickplayStateMachine final : public UGameplayStateMachine
{
public:
	TArray<class UFortQuestItemDefinition*>       GrantedQuests;                                     // 0x00C8(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, UObjectWrapper, NativeAccessSpecifierPublic)

public:
	void CleanUpStageForPlayer(class AFortPlayerPawn* Pawn);
	void GetPlayerPawnsInPlayspace(TArray<class AFortPlayerPawn*>* PlayerPawns);
	void PrepareStageForPlayer(class AFortPlayerPawn* Pawn, const struct FVector& TeleportLocation, const struct FRotator& TeleportRotation);
	void TeleportAllPlayers(const struct FGameplayTagContainer& TeleportTagRequirements);

	EPilgrimQuickplayState GetActivePilgrimStateId() const;
	class UPilgrimQuickplayStateBase* GetActivePilgrimStateObject() const;
	void GetDailyQuests(TArray<class UFortQuestItemDefinition*>* OutDailyQuests) const;
	class UGameplayEventRouterComponent* GetEventRouter() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PilgrimQuickplayStateMachine")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PilgrimQuickplayStateMachine")
	}
	static class UPilgrimQuickplayStateMachine* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPilgrimQuickplayStateMachine>();
	}
};
DUMPER7_ASSERTS_UPilgrimQuickplayStateMachine;

// Class PilgrimQuickplayRuntime.PilgrimQuickplayState_Intro
// 0x00A0 (0x0178 - 0x00D8)
class UPilgrimQuickplayState_Intro final : public UPilgrimQuickplayStateBase
{
public:
	struct FGameplayTagContainer                  TeleportTagRequirements;                           // 0x00D8(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	float                                         CameraWaitTime;                                    // 0x00F8(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_FC[0x7C];                                      // 0x00FC(0x007C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void UpdateCameraWaitTime(const float NewWaitTime);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PilgrimQuickplayState_Intro")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PilgrimQuickplayState_Intro")
	}
	static class UPilgrimQuickplayState_Intro* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPilgrimQuickplayState_Intro>();
	}
};
DUMPER7_ASSERTS_UPilgrimQuickplayState_Intro;

// Class PilgrimQuickplayRuntime.PilgrimQuickplayState_Loading
// 0x0008 (0x00E0 - 0x00D8)
class UPilgrimQuickplayState_Loading final : public UPilgrimQuickplayStateBase
{
public:
	uint8                                         Pad_D8[0x8];                                       // 0x00D8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PilgrimQuickplayState_Loading")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PilgrimQuickplayState_Loading")
	}
	static class UPilgrimQuickplayState_Loading* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPilgrimQuickplayState_Loading>();
	}
};
DUMPER7_ASSERTS_UPilgrimQuickplayState_Loading;

// Class PilgrimQuickplayRuntime.PilgrimQuickplayState_Outro
// 0x0010 (0x00E8 - 0x00D8)
class UPilgrimQuickplayState_Outro final : public UPilgrimQuickplayStateBase
{
public:
	float                                         StateTTL;                                          // 0x00D8(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_DC[0xC];                                       // 0x00DC(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PilgrimQuickplayState_Outro")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PilgrimQuickplayState_Outro")
	}
	static class UPilgrimQuickplayState_Outro* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPilgrimQuickplayState_Outro>();
	}
};
DUMPER7_ASSERTS_UPilgrimQuickplayState_Outro;

// Class PilgrimQuickplayRuntime.PilgrimQuickplayState_Pregame
// 0x0040 (0x0118 - 0x00D8)
class UPilgrimQuickplayState_Pregame final : public UPilgrimQuickplayStateBase
{
public:
	struct FGameplayTagContainer                  TeleportTagRequirements;                           // 0x00D8(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_F8[0x20];                                      // 0x00F8(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PilgrimQuickplayState_Pregame")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PilgrimQuickplayState_Pregame")
	}
	static class UPilgrimQuickplayState_Pregame* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPilgrimQuickplayState_Pregame>();
	}
};
DUMPER7_ASSERTS_UPilgrimQuickplayState_Pregame;

// Class PilgrimQuickplayRuntime.PilgrimQuickplayState_PreIntro
// 0x0010 (0x00E8 - 0x00D8)
class UPilgrimQuickplayState_PreIntro final : public UPilgrimQuickplayStateBase
{
public:
	float                                         StateTTLSeconds;                                   // 0x00D8(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_DC[0xC];                                       // 0x00DC(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PilgrimQuickplayState_PreIntro")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PilgrimQuickplayState_PreIntro")
	}
	static class UPilgrimQuickplayState_PreIntro* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPilgrimQuickplayState_PreIntro>();
	}
};
DUMPER7_ASSERTS_UPilgrimQuickplayState_PreIntro;

// Class PilgrimQuickplayRuntime.PilgrimQuickplayState_SetResults
// 0x0000 (0x00D8 - 0x00D8)
class UPilgrimQuickplayState_SetResults final : public UPilgrimQuickplayStateBase
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PilgrimQuickplayState_SetResults")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PilgrimQuickplayState_SetResults")
	}
	static class UPilgrimQuickplayState_SetResults* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPilgrimQuickplayState_SetResults>();
	}
};
DUMPER7_ASSERTS_UPilgrimQuickplayState_SetResults;

// Class PilgrimQuickplayRuntime.PilgrimQuickplayState_SongGameplay
// 0x0048 (0x0120 - 0x00D8)
class UPilgrimQuickplayState_SongGameplay final : public UPilgrimQuickplayStateBase
{
public:
	struct FGameplayTagContainer                  StageTeleportTagRequirements;                      // 0x00D8(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TSubclassOf<class APilgrimMusicBattleInstance> PilgrimMusicBattleInstanceClass;                  // 0x00F8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bHaveTriggeredMBIFinished;                         // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_101[0x1F];                                     // 0x0101(0x001F)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BuildSongResultData();
	void OnMusicBattleFinished(EMusicBattleEndReason EndReason);
	void OnMusicBattleStoppedEarly(EMusicBattleEndReason EndReason);

	const TArray<class APilgrimMusicBattleInstance*> GetPilgrimMusicBattleInstances() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PilgrimQuickplayState_SongGameplay")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PilgrimQuickplayState_SongGameplay")
	}
	static class UPilgrimQuickplayState_SongGameplay* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPilgrimQuickplayState_SongGameplay>();
	}
};
DUMPER7_ASSERTS_UPilgrimQuickplayState_SongGameplay;

// Class PilgrimQuickplayRuntime.PilgrimQuickplayState_SongResults
// 0x0128 (0x0200 - 0x00D8)
class UPilgrimQuickplayState_SongResults final : public UPilgrimQuickplayStateBase
{
public:
	double                                        ServerEndTime;                                     // 0x00D8(0x0008)(BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FScalableFloat                         WaitTimeWithMoreSongs;                             // 0x00E0(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         WaitTimeWithNoMoreSongs;                           // 0x0108(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         WaitTimeAllPlayersReady;                           // 0x0130(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FTimerHandle                           WaitTimerHandle;                                   // 0x0158(0x0008)(BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSet<TWeakObjectPtr<class AFortPlayerStateAthena>> PlayerList;                                   // 0x0160(0x0050)(Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TSet<TWeakObjectPtr<class AFortPlayerStateAthena>> ReadyPlayers;                                 // 0x01B0(0x0050)(Protected, UObjectWrapper, NativeAccessSpecifierProtected)

public:
	void ClientUpdateStateEndTime(float ServerWorldEndTimeSeconds);
	void GoToNextState();
	void HandleTimerFinished();
	void OnPlayerDisconnected(class AFortPlayerStateAthena* PlayerState, bool bIsDisconnected);
	void OnRep_ServerEndTime();
	void ServerRecievedPlayPreviousSongFromClient(class UPilgrimPlayerControllerComponent* ControllerComponent, EPilgrimStateMachineMessage StateMachineMessage);
	void ServerSetEndTime(float ServerWorldEndTimeSeconds);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PilgrimQuickplayState_SongResults")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PilgrimQuickplayState_SongResults")
	}
	static class UPilgrimQuickplayState_SongResults* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPilgrimQuickplayState_SongResults>();
	}
};
DUMPER7_ASSERTS_UPilgrimQuickplayState_SongResults;

// Class PilgrimQuickplayRuntime.PilgrimQuickplaySuspendHandleComponent
// 0x0028 (0x00C8 - 0x00A0)
class UPilgrimQuickplaySuspendHandleComponent final : public UActorComponent
{
public:
	uint8                                         Pad_A0[0x28];                                      // 0x00A0(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ServerOnTimedInputReceived(class UPilgrimPlayerControllerComponent* PilgrimPC, const struct FPilgrimTimedInput& TimedInput);
	void ServerSyncHeartbeatMessageReceived(class UPilgrimPlayerControllerComponent* PilgrimPC);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PilgrimQuickplaySuspendHandleComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PilgrimQuickplaySuspendHandleComponent")
	}
	static class UPilgrimQuickplaySuspendHandleComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPilgrimQuickplaySuspendHandleComponent>();
	}
};
DUMPER7_ASSERTS_UPilgrimQuickplaySuspendHandleComponent;

// Class PilgrimQuickplayRuntime.PilgrimStandinDirector
// 0x0090 (0x0188 - 0x00F8)
class UPilgrimStandinDirector final : public UFortPlayspaceComponent
{
public:
	TMap<ESparksInstrumentType, class UFortWeaponItemDefinition*> InstrumentToWeaponMap;             // 0x00F8(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	TSubclassOf<class UFortAthenaAISpawnerData>   AISpawnerData;                                     // 0x0148(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FPrimaryAssetId>                Emotes;                                            // 0x0150(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<TWeakObjectPtr<class AFortPlayerPawnAthena>> SpawnedStandinPawns;                         // 0x0160(0x0010)(Net, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate)
	TArray<TWeakObjectPtr<class AFortPlayerStateAthena>> SpawnedStandinStates;                       // 0x0170(0x0010)(Net, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                         Pad_180[0x8];                                      // 0x0180(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetupListeners(class UGameplayEventRouterComponent* EventRouter);
	void TeleportSpawnedStandins(const TArray<class AFortPlayerStart*>& Destinations);

	TArray<class AFortPlayerPawnAthena*> GetStandinPawns() const;
	TArray<class AFortPlayerStateAthena*> GetStandinStates() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PilgrimStandinDirector")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PilgrimStandinDirector")
	}
	static class UPilgrimStandinDirector* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPilgrimStandinDirector>();
	}
};
DUMPER7_ASSERTS_UPilgrimStandinDirector;

// Class PilgrimQuickplayRuntime.PilgrimStandinPawnComponent
// 0x0008 (0x00B8 - 0x00B0)
class UPilgrimStandinPawnComponent final : public UPilgrimPawnComponent
{
public:
	struct FGameplayTag                           SpawninEffect;                                     // 0x00B0(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetupListeners(class UGameplayEventRouterComponent* EventRouter);
	void StartInstrumentAnimation(class APlayerState* PlayerState, class ASparksMusicPlayspace* Playspace);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PilgrimStandinPawnComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PilgrimStandinPawnComponent")
	}
	static class UPilgrimStandinPawnComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPilgrimStandinPawnComponent>();
	}
};
DUMPER7_ASSERTS_UPilgrimStandinPawnComponent;

// Class PilgrimQuickplayRuntime.BandReplicationGraphNode
// 0x0010 (0x0060 - 0x0050)
class UBandReplicationGraphNode final : public UFortReplicationGraphNode_Custom
{
public:
	uint8                                         Pad_50[0x10];                                      // 0x0050(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BandReplicationGraphNode")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BandReplicationGraphNode")
	}
	static class UBandReplicationGraphNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBandReplicationGraphNode>();
	}
};
DUMPER7_ASSERTS_UBandReplicationGraphNode;

}

