#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PlayerAugmentsUI

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CommonInput_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function PlayerAugmentsUI.FortMobileButtonBehaviorComponent_AugmentsListIconPicker.OnAugmentToolViewSwap
// 0x0001 (0x0001 - 0x0000)
struct FortMobileButtonBehaviorComponent_AugmentsListIconPicker_OnAugmentToolViewSwap final
{
public:
	bool                                          bIsInInventoryView;                                // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortMobileButtonBehaviorComponent_AugmentsListIconPicker_OnAugmentToolViewSwap;

// Function PlayerAugmentsUI.FortMobileButtonBehaviorComponent_AugmentsListVisibility.HandleAugmentToolOpenedStatusChanged
// 0x0002 (0x0002 - 0x0000)
struct FortMobileButtonBehaviorComponent_AugmentsListVisibility_HandleAugmentToolOpenedStatusChanged final
{
public:
	bool                                          bIsOpened;                                         // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInIsInventoryView;                                // 0x0001(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortMobileButtonBehaviorComponent_AugmentsListVisibility_HandleAugmentToolOpenedStatusChanged;

// Function PlayerAugmentsUI.FortMobileButtonBehaviorComponent_AugmentsListVisibility.HandleAugmentToolViewSwap
// 0x0001 (0x0001 - 0x0000)
struct FortMobileButtonBehaviorComponent_AugmentsListVisibility_HandleAugmentToolViewSwap final
{
public:
	bool                                          bInIsInventoryView;                                // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortMobileButtonBehaviorComponent_AugmentsListVisibility_HandleAugmentToolViewSwap;

// Function PlayerAugmentsUI.FortPlayerAugmentHUDTimerWidget.HandleAugmentSelectorOpenedStatusChanged
// 0x0002 (0x0002 - 0x0000)
struct FortPlayerAugmentHUDTimerWidget_HandleAugmentSelectorOpenedStatusChanged final
{
public:
	bool                                          bIsOpened;                                         // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bViewingAugmentInventory;                          // 0x0001(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortPlayerAugmentHUDTimerWidget_HandleAugmentSelectorOpenedStatusChanged;

// Function PlayerAugmentsUI.FortPlayerAugmentHUDTimerWidget.HandleCanSelectAugmentChanged
// 0x0001 (0x0001 - 0x0000)
struct FortPlayerAugmentHUDTimerWidget_HandleCanSelectAugmentChanged final
{
public:
	bool                                          bCanSelectAugment;                                 // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortPlayerAugmentHUDTimerWidget_HandleCanSelectAugmentChanged;

// Function PlayerAugmentsUI.FortPlayerAugmentHUDTimerWidget.HandleHUDElementVisibilityChanged
// 0x0020 (0x0020 - 0x0000)
struct FortPlayerAugmentHUDTimerWidget_HandleHUDElementVisibilityChanged final
{
public:
	struct FGameplayTagContainer                  HiddenElementTagContainer;                         // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortPlayerAugmentHUDTimerWidget_HandleHUDElementVisibilityChanged;

// Function PlayerAugmentsUI.FortPlayerAugmentHUDTimerWidget.HandleNumPendingAugmentsToGrantUpdated
// 0x0001 (0x0001 - 0x0000)
struct FortPlayerAugmentHUDTimerWidget_HandleNumPendingAugmentsToGrantUpdated final
{
public:
	int8                                          NumPendingAugmentsToGrant;                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortPlayerAugmentHUDTimerWidget_HandleNumPendingAugmentsToGrantUpdated;

// Function PlayerAugmentsUI.FortPlayerAugmentHUDTimerWidget.HandleTimerUpdated
// 0x0008 (0x0008 - 0x0000)
struct FortPlayerAugmentHUDTimerWidget_HandleTimerUpdated final
{
public:
	float                                         TimeRemaining;                                     // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TimePercentage;                                    // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortPlayerAugmentHUDTimerWidget_HandleTimerUpdated;

// Function PlayerAugmentsUI.FortPlayerAugmentHUDTimerWidget.OnAugmentSelectorOpenedStatusChanged
// 0x0001 (0x0001 - 0x0000)
struct FortPlayerAugmentHUDTimerWidget_OnAugmentSelectorOpenedStatusChanged final
{
public:
	bool                                          bIsOpened;                                         // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortPlayerAugmentHUDTimerWidget_OnAugmentSelectorOpenedStatusChanged;

// Function PlayerAugmentsUI.FortPlayerAugmentHUDTimerWidget.OnCanSelectAugmentChanged
// 0x0001 (0x0001 - 0x0000)
struct FortPlayerAugmentHUDTimerWidget_OnCanSelectAugmentChanged final
{
public:
	bool                                          bCanSelectAugment;                                 // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortPlayerAugmentHUDTimerWidget_OnCanSelectAugmentChanged;

// Function PlayerAugmentsUI.FortPlayerAugmentHUDTimerWidget.OnHUDElementVisibilityChanged
// 0x0020 (0x0020 - 0x0000)
struct FortPlayerAugmentHUDTimerWidget_OnHUDElementVisibilityChanged final
{
public:
	struct FGameplayTagContainer                  HiddenElementTagContainer;                         // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortPlayerAugmentHUDTimerWidget_OnHUDElementVisibilityChanged;

// Function PlayerAugmentsUI.FortPlayerAugmentHUDTimerWidget.OnNumPendingAugmentsToGrantUpdated
// 0x0004 (0x0004 - 0x0000)
struct FortPlayerAugmentHUDTimerWidget_OnNumPendingAugmentsToGrantUpdated final
{
public:
	int32                                         NumPendingAugmentsToGrant;                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortPlayerAugmentHUDTimerWidget_OnNumPendingAugmentsToGrantUpdated;

// Function PlayerAugmentsUI.FortPlayerAugmentHUDTimerWidget.OnTimerUpdated
// 0x0008 (0x0008 - 0x0000)
struct FortPlayerAugmentHUDTimerWidget_OnTimerUpdated final
{
public:
	float                                         TimeRemaining;                                     // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TimePercentage;                                    // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortPlayerAugmentHUDTimerWidget_OnTimerUpdated;

// Function PlayerAugmentsUI.FortPlayerAugmentHUDTimerWidget.CanEquipSelectionTool
// 0x0001 (0x0001 - 0x0000)
struct FortPlayerAugmentHUDTimerWidget_CanEquipSelectionTool final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortPlayerAugmentHUDTimerWidget_CanEquipSelectionTool;

// Function PlayerAugmentsUI.FortPlayerAugmentHUDTimerWidget.CanSelectAugment
// 0x0001 (0x0001 - 0x0000)
struct FortPlayerAugmentHUDTimerWidget_CanSelectAugment final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortPlayerAugmentHUDTimerWidget_CanSelectAugment;

// Function PlayerAugmentsUI.FortPlayerAugmentHUDTimerWidget.FormatTime
// 0x0020 (0x0020 - 0x0000)
struct FortPlayerAugmentHUDTimerWidget_FormatTime final
{
public:
	float                                         TotalSeconds;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   ReturnValue;                                       // 0x0008(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortPlayerAugmentHUDTimerWidget_FormatTime;

// Function PlayerAugmentsUI.FortPlayerAugmentHUDTimerWidget.GetPendingAugmentsToGrant
// 0x0004 (0x0004 - 0x0000)
struct FortPlayerAugmentHUDTimerWidget_GetPendingAugmentsToGrant final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortPlayerAugmentHUDTimerWidget_GetPendingAugmentsToGrant;

// Function PlayerAugmentsUI.FortPlayerAugmentHUDSelectionTimerWidget.SetMobileProgressTimer
// 0x0004 (0x0004 - 0x0000)
struct FortPlayerAugmentHUDSelectionTimerWidget_SetMobileProgressTimer final
{
public:
	float                                         TimePercentage;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortPlayerAugmentHUDSelectionTimerWidget_SetMobileProgressTimer;

// Function PlayerAugmentsUI.FortPlayerAugmentHUDSelectionTimerWidget.UpdateCountdown
// 0x0004 (0x0004 - 0x0000)
struct FortPlayerAugmentHUDSelectionTimerWidget_UpdateCountdown final
{
public:
	float                                         TimeRemaining;                                     // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortPlayerAugmentHUDSelectionTimerWidget_UpdateCountdown;

// Function PlayerAugmentsUI.FortPlayerAugmentHUDSelectionTimerWidget.IsCountdownVisible
// 0x0001 (0x0001 - 0x0000)
struct FortPlayerAugmentHUDSelectionTimerWidget_IsCountdownVisible final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortPlayerAugmentHUDSelectionTimerWidget_IsCountdownVisible;

// Function PlayerAugmentsUI.FortMobilePlayerAugmentTimer.BP_OnHUDElementVisibilityChanged
// 0x0028 (0x0028 - 0x0000)
struct FortMobilePlayerAugmentTimer_BP_OnHUDElementVisibilityChanged final
{
public:
	struct FGameplayTagContainer                  HiddenElementTagContainer;                         // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          bIsSelectionItemEquipped;                          // 0x0020(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bForceCollapse;                                    // 0x0021(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FortMobilePlayerAugmentTimer_BP_OnHUDElementVisibilityChanged;

// Function PlayerAugmentsUI.FortMobilePlayerAugmentTimer.HandleHUDElementVisibilityChanged
// 0x0020 (0x0020 - 0x0000)
struct FortMobilePlayerAugmentTimer_HandleHUDElementVisibilityChanged final
{
public:
	struct FGameplayTagContainer                  HiddenElementTagContainer;                         // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortMobilePlayerAugmentTimer_HandleHUDElementVisibilityChanged;

// Function PlayerAugmentsUI.FortPlayerAugmentGranterWidget.HandleAugmentHighlighted
// 0x0004 (0x0004 - 0x0000)
struct FortPlayerAugmentGranterWidget_HandleAugmentHighlighted final
{
public:
	int32                                         HighlightedAugmentIndex;                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortPlayerAugmentGranterWidget_HandleAugmentHighlighted;

// Function PlayerAugmentsUI.FortPlayerAugmentGranterWidget.HandleAugmentSelectionStarted
// 0x0004 (0x0004 - 0x0000)
struct FortPlayerAugmentGranterWidget_HandleAugmentSelectionStarted final
{
public:
	int32                                         SelectedAugmentIndex;                              // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortPlayerAugmentGranterWidget_HandleAugmentSelectionStarted;

// Function PlayerAugmentsUI.FortPlayerAugmentGranterWidget.HandleAugmentSelectorOpenedStatusChanged
// 0x0002 (0x0002 - 0x0000)
struct FortPlayerAugmentGranterWidget_HandleAugmentSelectorOpenedStatusChanged final
{
public:
	bool                                          bIsOpened;                                         // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bViewingAugmentInventory;                          // 0x0001(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortPlayerAugmentGranterWidget_HandleAugmentSelectorOpenedStatusChanged;

// Function PlayerAugmentsUI.FortPlayerAugmentGranterWidget.HandleAugmentSelectorToolViewSwapped
// 0x0001 (0x0001 - 0x0000)
struct FortPlayerAugmentGranterWidget_HandleAugmentSelectorToolViewSwapped final
{
public:
	bool                                          bViewingAugmentsInventory;                         // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortPlayerAugmentGranterWidget_HandleAugmentSelectorToolViewSwapped;

// Function PlayerAugmentsUI.FortPlayerAugmentGranterWidget.HandleAvailableAugmentsForGrantingUpdated
// 0x0008 (0x0008 - 0x0000)
struct FortPlayerAugmentGranterWidget_HandleAvailableAugmentsForGrantingUpdated final
{
public:
	class UFortControllerComponent_AugmentGrantingSystem* GrantingComponent;                         // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortPlayerAugmentGranterWidget_HandleAvailableAugmentsForGrantingUpdated;

// Function PlayerAugmentsUI.FortPlayerAugmentGranterWidget.HandleCanSelectAugmentChanged
// 0x0001 (0x0001 - 0x0000)
struct FortPlayerAugmentGranterWidget_HandleCanSelectAugmentChanged final
{
public:
	bool                                          bCanSelectAugment;                                 // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortPlayerAugmentGranterWidget_HandleCanSelectAugmentChanged;

// Function PlayerAugmentsUI.FortPlayerAugmentGranterWidget.HandleNumPendingAugmentsToGrantUpdated
// 0x0001 (0x0001 - 0x0000)
struct FortPlayerAugmentGranterWidget_HandleNumPendingAugmentsToGrantUpdated final
{
public:
	int8                                          NumPendingAugmentsToGrant;                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortPlayerAugmentGranterWidget_HandleNumPendingAugmentsToGrantUpdated;

// Function PlayerAugmentsUI.FortPlayerAugmentGranterWidget.HandleSelectedAugmentForGrant
// 0x0008 (0x0008 - 0x0000)
struct FortPlayerAugmentGranterWidget_HandleSelectedAugmentForGrant final
{
public:
	class UFortPlayerAugmentItemDefinition*       SelectedAugment;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortPlayerAugmentGranterWidget_HandleSelectedAugmentForGrant;

// Function PlayerAugmentsUI.FortPlayerAugmentGranterWidget.HandleTimerUpdated
// 0x0008 (0x0008 - 0x0000)
struct FortPlayerAugmentGranterWidget_HandleTimerUpdated final
{
public:
	float                                         TimeRemaining;                                     // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TimePercentage;                                    // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortPlayerAugmentGranterWidget_HandleTimerUpdated;

// Function PlayerAugmentsUI.FortPlayerAugmentGranterWidget.OnAugmentHighlighted
// 0x0004 (0x0004 - 0x0000)
struct FortPlayerAugmentGranterWidget_OnAugmentHighlighted final
{
public:
	int32                                         HighlightedAugmentIndex;                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortPlayerAugmentGranterWidget_OnAugmentHighlighted;

// Function PlayerAugmentsUI.FortPlayerAugmentGranterWidget.OnAugmentSelectionStarted
// 0x0004 (0x0004 - 0x0000)
struct FortPlayerAugmentGranterWidget_OnAugmentSelectionStarted final
{
public:
	int32                                         SelectedAugmentIndex;                              // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortPlayerAugmentGranterWidget_OnAugmentSelectionStarted;

// Function PlayerAugmentsUI.FortPlayerAugmentGranterWidget.OnAugmentSelectorOpenedStatusChanged
// 0x0002 (0x0002 - 0x0000)
struct FortPlayerAugmentGranterWidget_OnAugmentSelectorOpenedStatusChanged final
{
public:
	bool                                          bIsOpened;                                         // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bViewingAugmentInventory;                          // 0x0001(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortPlayerAugmentGranterWidget_OnAugmentSelectorOpenedStatusChanged;

// Function PlayerAugmentsUI.FortPlayerAugmentGranterWidget.OnAugmentSelectorToolViewSwapped
// 0x0001 (0x0001 - 0x0000)
struct FortPlayerAugmentGranterWidget_OnAugmentSelectorToolViewSwapped final
{
public:
	bool                                          bViewingAugmentInventory;                          // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortPlayerAugmentGranterWidget_OnAugmentSelectorToolViewSwapped;

// Function PlayerAugmentsUI.FortPlayerAugmentGranterWidget.OnCanSelectAugmentChanged
// 0x0001 (0x0001 - 0x0000)
struct FortPlayerAugmentGranterWidget_OnCanSelectAugmentChanged final
{
public:
	bool                                          bCanSelectAugment;                                 // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortPlayerAugmentGranterWidget_OnCanSelectAugmentChanged;

// Function PlayerAugmentsUI.FortPlayerAugmentGranterWidget.OnInputTypeChanged
// 0x0001 (0x0001 - 0x0000)
struct FortPlayerAugmentGranterWidget_OnInputTypeChanged final
{
public:
	ECommonInputType                              NewInputType;                                      // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortPlayerAugmentGranterWidget_OnInputTypeChanged;

// Function PlayerAugmentsUI.FortPlayerAugmentGranterWidget.OnNumPendingAugmentsToGrantUpdated
// 0x0004 (0x0004 - 0x0000)
struct FortPlayerAugmentGranterWidget_OnNumPendingAugmentsToGrantUpdated final
{
public:
	int32                                         NumPendingAugmentsToGrant;                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortPlayerAugmentGranterWidget_OnNumPendingAugmentsToGrantUpdated;

// Function PlayerAugmentsUI.FortPlayerAugmentGranterWidget.OnPopulateAvailableAugmentsHUD
// 0x0010 (0x0010 - 0x0000)
struct FortPlayerAugmentGranterWidget_OnPopulateAvailableAugmentsHUD final
{
public:
	TArray<class UFortPlayerAugmentItemDefinition*> AugmentItemDefinition;                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortPlayerAugmentGranterWidget_OnPopulateAvailableAugmentsHUD;

// Function PlayerAugmentsUI.FortPlayerAugmentGranterWidget.OnSelectedAugmentForGrant
// 0x0008 (0x0008 - 0x0000)
struct FortPlayerAugmentGranterWidget_OnSelectedAugmentForGrant final
{
public:
	class UFortPlayerAugmentItemDefinition*       HighlightedAugment;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortPlayerAugmentGranterWidget_OnSelectedAugmentForGrant;

// Function PlayerAugmentsUI.FortPlayerAugmentGranterWidget.OnTimerUpdated
// 0x0008 (0x0008 - 0x0000)
struct FortPlayerAugmentGranterWidget_OnTimerUpdated final
{
public:
	float                                         TimeRemaining;                                     // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TimePercentage;                                    // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortPlayerAugmentGranterWidget_OnTimerUpdated;

// Function PlayerAugmentsUI.FortPlayerAugmentGranterWidget.GetPendingAugmentsToGrant
// 0x0004 (0x0004 - 0x0000)
struct FortPlayerAugmentGranterWidget_GetPendingAugmentsToGrant final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortPlayerAugmentGranterWidget_GetPendingAugmentsToGrant;

// Function PlayerAugmentsUI.FortPlayerAugmentHUDQuickbarWidget.OnAugmentsUpdated
// 0x0010 (0x0010 - 0x0000)
struct FortPlayerAugmentHUDQuickbarWidget_OnAugmentsUpdated final
{
public:
	TArray<class UFortPlayerAugmentItemDefinition*> ActiveAugments;                                  // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortPlayerAugmentHUDQuickbarWidget_OnAugmentsUpdated;

// Function PlayerAugmentsUI.FortPlayerAugmentHUDRerollWidget.HandleAugmentSelectorOpenedStatusChanged
// 0x0002 (0x0002 - 0x0000)
struct FortPlayerAugmentHUDRerollWidget_HandleAugmentSelectorOpenedStatusChanged final
{
public:
	bool                                          bIsOpened;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bViewingInventory;                                 // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortPlayerAugmentHUDRerollWidget_HandleAugmentSelectorOpenedStatusChanged;

// Function PlayerAugmentsUI.FortPlayerAugmentHUDRerollWidget.HandleFreeRerollsUpdated
// 0x0004 (0x0004 - 0x0000)
struct FortPlayerAugmentHUDRerollWidget_HandleFreeRerollsUpdated final
{
public:
	int32                                         NewNumFreeRerolls;                                 // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortPlayerAugmentHUDRerollWidget_HandleFreeRerollsUpdated;

// Function PlayerAugmentsUI.FortPlayerAugmentHUDRerollWidget.OnFreeRerollsUpdated
// 0x0004 (0x0004 - 0x0000)
struct FortPlayerAugmentHUDRerollWidget_OnFreeRerollsUpdated final
{
public:
	int32                                         NewNumFreeRerolls;                                 // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortPlayerAugmentHUDRerollWidget_OnFreeRerollsUpdated;

// Function PlayerAugmentsUI.FortPlayerAugmentHUDRerollWidget.OnUpdateCurrency
// 0x0008 (0x0008 - 0x0000)
struct FortPlayerAugmentHUDRerollWidget_OnUpdateCurrency final
{
public:
	int32                                         OwnedCurrency;                                     // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         RerollCost;                                        // 0x0004(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortPlayerAugmentHUDRerollWidget_OnUpdateCurrency;

// Function PlayerAugmentsUI.FortPlayerAugmentHUDRerollWidget.StartRerollHoldProgress
// 0x0004 (0x0004 - 0x0000)
struct FortPlayerAugmentHUDRerollWidget_StartRerollHoldProgress final
{
public:
	float                                         duration;                                          // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortPlayerAugmentHUDRerollWidget_StartRerollHoldProgress;

// Function PlayerAugmentsUI.FortPlayerAugmentInfoEntryWidget.OnItemNewOrBorrowedSet
// 0x0002 (0x0002 - 0x0000)
struct FortPlayerAugmentInfoEntryWidget_OnItemNewOrBorrowedSet final
{
public:
	bool                                          bIsNew;                                            // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsBorrowed;                                       // 0x0001(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortPlayerAugmentInfoEntryWidget_OnItemNewOrBorrowedSet;

// Function PlayerAugmentsUI.FortPlayerAugmentInfoEntryWidget.OnItemPinColorSet
// 0x0010 (0x0010 - 0x0000)
struct FortPlayerAugmentInfoEntryWidget_OnItemPinColorSet final
{
public:
	struct FLinearColor                           PinColor;                                          // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortPlayerAugmentInfoEntryWidget_OnItemPinColorSet;

// Function PlayerAugmentsUI.FortPlayerAugmentInfoEntryWidget.OnItemRaritySet
// 0x0088 (0x0088 - 0x0000)
struct FortPlayerAugmentInfoEntryWidget_OnItemRaritySet final
{
public:
	EFortRarity                                   Rarity;                                            // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortRarityItemData                    RarityItemData;                                    // 0x0008(0x0080)(ConstParm, Parm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortPlayerAugmentInfoEntryWidget_OnItemRaritySet;

// Function PlayerAugmentsUI.FortPlayerAugmentInfoEntryWidget.UpdateAugment
// 0x0008 (0x0008 - 0x0000)
struct FortPlayerAugmentInfoEntryWidget_UpdateAugment final
{
public:
	const class UFortPlayerAugmentItemDefinition* AugmentItemDefinition;                             // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortPlayerAugmentInfoEntryWidget_UpdateAugment;

// Function PlayerAugmentsUI.FortPlayerAugmentInGameCarriedWidget.HandleExitBus
// 0x0008 (0x0008 - 0x0000)
struct FortPlayerAugmentInGameCarriedWidget_HandleExitBus final
{
public:
	class AFortPlayerControllerZone*              FortPCZone;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortPlayerAugmentInGameCarriedWidget_HandleExitBus;

// Function PlayerAugmentsUI.FortPlayerAugmentInGameCarriedWidget.OnShowInitialAugment
// 0x0008 (0x0008 - 0x0000)
struct FortPlayerAugmentInGameCarriedWidget_OnShowInitialAugment final
{
public:
	const class UFortPlayerAugmentItemDefinition* PlayerAugmentItemDefinition;                       // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortPlayerAugmentInGameCarriedWidget_OnShowInitialAugment;

// Function PlayerAugmentsUI.FortPlayerAugmentInventoryExtensionRow.HandleNumPendingAugmentsToGrantUpdated
// 0x0001 (0x0001 - 0x0000)
struct FortPlayerAugmentInventoryExtensionRow_HandleNumPendingAugmentsToGrantUpdated final
{
public:
	int8                                          NumPendingAugmentsToGrant;                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortPlayerAugmentInventoryExtensionRow_HandleNumPendingAugmentsToGrantUpdated;

// Function PlayerAugmentsUI.FortPlayerAugmentInventoryExtensionRow.HandleTimerUpdated
// 0x0008 (0x0008 - 0x0000)
struct FortPlayerAugmentInventoryExtensionRow_HandleTimerUpdated final
{
public:
	float                                         TimeRemaining;                                     // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TimePercentage;                                    // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortPlayerAugmentInventoryExtensionRow_HandleTimerUpdated;

// Function PlayerAugmentsUI.FortPlayerAugmentInventoryExtensionRow.OnNumPendingAugmentsToGrantUpdated
// 0x0004 (0x0004 - 0x0000)
struct FortPlayerAugmentInventoryExtensionRow_OnNumPendingAugmentsToGrantUpdated final
{
public:
	int32                                         NumPendingAugmentsToGrant;                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortPlayerAugmentInventoryExtensionRow_OnNumPendingAugmentsToGrantUpdated;

// Function PlayerAugmentsUI.FortPlayerAugmentInventoryExtensionRow.OnTimerUpdated
// 0x0008 (0x0008 - 0x0000)
struct FortPlayerAugmentInventoryExtensionRow_OnTimerUpdated final
{
public:
	float                                         TimeRemaining;                                     // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TimePercentage;                                    // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortPlayerAugmentInventoryExtensionRow_OnTimerUpdated;

// Function PlayerAugmentsUI.FortPlayerAugmentInventoryExtensionRow.GetPendingAugmentsToGrant
// 0x0004 (0x0004 - 0x0000)
struct FortPlayerAugmentInventoryExtensionRow_GetPendingAugmentsToGrant final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortPlayerAugmentInventoryExtensionRow_GetPendingAugmentsToGrant;

// Function PlayerAugmentsUI.FortPlayerAugmentInventoryInfoWidget.OnItemNewOrBorrowedSet
// 0x0002 (0x0002 - 0x0000)
struct FortPlayerAugmentInventoryInfoWidget_OnItemNewOrBorrowedSet final
{
public:
	bool                                          bIsNew;                                            // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsBorrowed;                                       // 0x0001(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortPlayerAugmentInventoryInfoWidget_OnItemNewOrBorrowedSet;

// Function PlayerAugmentsUI.FortPlayerAugmentInventoryInfoWidget.OnItemRaritySet
// 0x0088 (0x0088 - 0x0000)
struct FortPlayerAugmentInventoryInfoWidget_OnItemRaritySet final
{
public:
	EFortRarity                                   Rarity;                                            // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortRarityItemData                    RarityItemData;                                    // 0x0008(0x0080)(ConstParm, Parm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortPlayerAugmentInventoryInfoWidget_OnItemRaritySet;

// Function PlayerAugmentsUI.FortPlayerAugmentInventoryListEntry.OnAugmentListItemSet
// 0x0008 (0x0008 - 0x0000)
struct FortPlayerAugmentInventoryListEntry_OnAugmentListItemSet final
{
public:
	const class UFortItemDefinition*              ItemDefinition;                                    // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortPlayerAugmentInventoryListEntry_OnAugmentListItemSet;

// Function PlayerAugmentsUI.FortPlayerAugmentInventoryTab.HandleNumPendingAugmentsToGrantUpdated
// 0x0001 (0x0001 - 0x0000)
struct FortPlayerAugmentInventoryTab_HandleNumPendingAugmentsToGrantUpdated final
{
public:
	int8                                          NumPendingAugmentsToGrant;                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortPlayerAugmentInventoryTab_HandleNumPendingAugmentsToGrantUpdated;

// Function PlayerAugmentsUI.FortPlayerAugmentInventoryTab.HandleTimerUpdated
// 0x0008 (0x0008 - 0x0000)
struct FortPlayerAugmentInventoryTab_HandleTimerUpdated final
{
public:
	float                                         TimeRemaining;                                     // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TimePercentage;                                    // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortPlayerAugmentInventoryTab_HandleTimerUpdated;

// Function PlayerAugmentsUI.FortPlayerAugmentInventoryTab.OnAugmentListUpdated
// 0x0004 (0x0004 - 0x0000)
struct FortPlayerAugmentInventoryTab_OnAugmentListUpdated final
{
public:
	int32                                         NumAugments;                                       // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortPlayerAugmentInventoryTab_OnAugmentListUpdated;

// Function PlayerAugmentsUI.FortPlayerAugmentInventoryTab.OnNumPendingAugmentsToGrantUpdated
// 0x0004 (0x0004 - 0x0000)
struct FortPlayerAugmentInventoryTab_OnNumPendingAugmentsToGrantUpdated final
{
public:
	int32                                         NumPendingAugmentsToGrant;                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortPlayerAugmentInventoryTab_OnNumPendingAugmentsToGrantUpdated;

// Function PlayerAugmentsUI.FortPlayerAugmentInventoryTab.OnTimerUpdated
// 0x0008 (0x0008 - 0x0000)
struct FortPlayerAugmentInventoryTab_OnTimerUpdated final
{
public:
	float                                         TimeRemaining;                                     // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TimePercentage;                                    // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortPlayerAugmentInventoryTab_OnTimerUpdated;

// Function PlayerAugmentsUI.FortPlayerAugmentInventoryTab.GetPendingAugmentsToGrant
// 0x0004 (0x0004 - 0x0000)
struct FortPlayerAugmentInventoryTab_GetPendingAugmentsToGrant final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortPlayerAugmentInventoryTab_GetPendingAugmentsToGrant;

// Function PlayerAugmentsUI.FortPlayerAugmentLobbyWidget.OnShowInitialAugment
// 0x0008 (0x0008 - 0x0000)
struct FortPlayerAugmentLobbyWidget_OnShowInitialAugment final
{
public:
	const class UFortPlayerAugmentItemDefinition* CarriedAugment;                                    // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortPlayerAugmentLobbyWidget_OnShowInitialAugment;

// Function PlayerAugmentsUI.FortPlayerAugmentPostMatchUnlocksWidget.OnShowUnlockedAugments
// 0x0010 (0x0010 - 0x0000)
struct FortPlayerAugmentPostMatchUnlocksWidget_OnShowUnlockedAugments final
{
public:
	TArray<class UFortPlayerAugmentItemDefinition*> UnlockedAugments;                                // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortPlayerAugmentPostMatchUnlocksWidget_OnShowUnlockedAugments;

// Function PlayerAugmentsUI.FortPlayerAugmentSpecialAcquiredNotificationWidget.OpenWidget
// 0x0008 (0x0008 - 0x0000)
struct FortPlayerAugmentSpecialAcquiredNotificationWidget_OpenWidget final
{
public:
	const class UFortPlayerAugmentItemDefinition* ItemDef;                                           // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortPlayerAugmentSpecialAcquiredNotificationWidget_OpenWidget;

// Function PlayerAugmentsUI.FortPlayerAugmentSpecialAcquiredNotificationWidget.ConstructEventDescription
// 0x0020 (0x0020 - 0x0000)
struct FortPlayerAugmentSpecialAcquiredNotificationWidget_ConstructEventDescription final
{
public:
	const class UFortPlayerAugmentItemDefinition* ItemDef;                                           // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   ReturnValue;                                       // 0x0008(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortPlayerAugmentSpecialAcquiredNotificationWidget_ConstructEventDescription;

// Function PlayerAugmentsUI.FortPlayerAugmentSpecialAcquiredNotificationWidget.HasMoreAugmentEvents
// 0x0001 (0x0001 - 0x0000)
struct FortPlayerAugmentSpecialAcquiredNotificationWidget_HasMoreAugmentEvents final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortPlayerAugmentSpecialAcquiredNotificationWidget_HasMoreAugmentEvents;

// Function PlayerAugmentsUI.FortPlayerAugmentInfoTouchWidget.SetAugmentIndexInList
// 0x0004 (0x0004 - 0x0000)
struct FortPlayerAugmentInfoTouchWidget_SetAugmentIndexInList final
{
public:
	int32                                         InAugmentIndexInList;                              // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortPlayerAugmentInfoTouchWidget_SetAugmentIndexInList;

}

