#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PlayerAugmentsUI

#include "Basic.hpp"

#include "CommonInput_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// Class PlayerAugmentsUI.FortMobileButtonBehaviorComponent_AugmentsListIconPicker
// 0x0010 (0x0058 - 0x0048)
class UFortMobileButtonBehaviorComponent_AugmentsListIconPicker final : public UFortMobileButtonBehaviorComponent_IconPicker
{
public:
	bool                                          bCachedIsInInventoryView;                          // 0x0048(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPaperSprite*                           ListViewSprite;                                    // 0x0050(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnAugmentToolViewSwap(const bool bIsInInventoryView);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortMobileButtonBehaviorComponent_AugmentsListIconPicker")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortMobileButtonBehaviorComponent_AugmentsListIconPicker")
	}
	static class UFortMobileButtonBehaviorComponent_AugmentsListIconPicker* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortMobileButtonBehaviorComponent_AugmentsListIconPicker>();
	}
};
DUMPER7_ASSERTS_UFortMobileButtonBehaviorComponent_AugmentsListIconPicker;

// Class PlayerAugmentsUI.FortMobileButtonBehaviorComponent_AugmentsListVisibility
// 0x0008 (0x0050 - 0x0048)
class UFortMobileButtonBehaviorComponent_AugmentsListVisibility : public UFortMobileButtonBehaviorComponent_Visibility
{
public:
	uint8                                         Pad_48[0x8];                                       // 0x0048(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleAugmentToolOpenedStatusChanged(const bool bIsOpened, const bool bInIsInventoryView);
	void HandleAugmentToolViewSwap(const bool bInIsInventoryView);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortMobileButtonBehaviorComponent_AugmentsListVisibility")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortMobileButtonBehaviorComponent_AugmentsListVisibility")
	}
	static class UFortMobileButtonBehaviorComponent_AugmentsListVisibility* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortMobileButtonBehaviorComponent_AugmentsListVisibility>();
	}
};
DUMPER7_ASSERTS_UFortMobileButtonBehaviorComponent_AugmentsListVisibility;

// Class PlayerAugmentsUI.FortMobileButtonBehaviorComponent_AugmentsListVisibility_Swap
// 0x0008 (0x0058 - 0x0050)
class UFortMobileButtonBehaviorComponent_AugmentsListVisibility_Swap final : public UFortMobileButtonBehaviorComponent_AugmentsListVisibility
{
public:
	uint8                                         Pad_50[0x8];                                       // 0x0050(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortMobileButtonBehaviorComponent_AugmentsListVisibility_Swap")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortMobileButtonBehaviorComponent_AugmentsListVisibility_Swap")
	}
	static class UFortMobileButtonBehaviorComponent_AugmentsListVisibility_Swap* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortMobileButtonBehaviorComponent_AugmentsListVisibility_Swap>();
	}
};
DUMPER7_ASSERTS_UFortMobileButtonBehaviorComponent_AugmentsListVisibility_Swap;

// Class PlayerAugmentsUI.FortPlayerAugmentHUDTimerWidget
// 0x0000 (0x0328 - 0x0328)
class UFortPlayerAugmentHUDTimerWidget : public UFortHUDElementWidget
{
public:
	void HandleAugmentGrantingTimersFinishedForMatch();
	void HandleAugmentGrantingTimersResetForMatch();
	void HandleAugmentSelectorOpenedStatusChanged(const bool bIsOpened, const bool bViewingAugmentInventory);
	void HandleCanSelectAugmentChanged(bool bCanSelectAugment);
	void HandleHUDElementVisibilityChanged(const struct FGameplayTagContainer& HiddenElementTagContainer);
	void HandleNumPendingAugmentsToGrantUpdated(int8 NumPendingAugmentsToGrant);
	void HandleTimerUpdated(float TimeRemaining, float TimePercentage);
	void OnAugmentGrantingTimersFinishedForMatch();
	void OnAugmentGrantingTimersResetForMatch();
	void OnAugmentSelectorOpenedStatusChanged(const bool bIsOpened);
	void OnCanSelectAugmentChanged(bool bCanSelectAugment);
	void OnHUDElementVisibilityChanged(const struct FGameplayTagContainer& HiddenElementTagContainer);
	void OnMovementModeChanged();
	void OnNumPendingAugmentsToGrantUpdated(int32 NumPendingAugmentsToGrant);
	void OnTimerUpdated(float TimeRemaining, float TimePercentage);

	bool CanEquipSelectionTool() const;
	bool CanSelectAugment() const;
	class FText FormatTime(float TotalSeconds) const;
	int32 GetPendingAugmentsToGrant() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortPlayerAugmentHUDTimerWidget")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortPlayerAugmentHUDTimerWidget")
	}
	static class UFortPlayerAugmentHUDTimerWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortPlayerAugmentHUDTimerWidget>();
	}
};
DUMPER7_ASSERTS_UFortPlayerAugmentHUDTimerWidget;

// Class PlayerAugmentsUI.FortPlayerAugmentHUDSelectionTimerWidget
// 0x0058 (0x0380 - 0x0328)
class UFortPlayerAugmentHUDSelectionTimerWidget : public UFortPlayerAugmentHUDTimerWidget
{
public:
	bool                                          bIsAugmentReadyVisible;                            // 0x0328(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsCountdownActive;                                // 0x0329(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsOffline;                                        // 0x032A(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_32B[0x5];                                      // 0x032B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           HideTimerHandle;                                   // 0x0330(0x0008)(BlueprintVisible, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMaterialInstanceDynamic*               TimerProgressDMI;                                  // 0x0338(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FScalableFloat                         CountdownStartTimeHF;                              // 0x0340(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	class UCommonTextBlock*                       NativeAugmentTimerText;                            // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UWidgetAnimation*                       NativeAnimTimerTextCountdownUpdated;               // 0x0370(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UWidgetAnimation*                       NativeAnimProgressBarCountdownUpdated;             // 0x0378(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void OnCountdownActivated();
	void SetMobileProgressTimer(float TimePercentage);
	void UpdateCountdown(float TimeRemaining);

	bool IsCountdownVisible() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortPlayerAugmentHUDSelectionTimerWidget")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortPlayerAugmentHUDSelectionTimerWidget")
	}
	static class UFortPlayerAugmentHUDSelectionTimerWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortPlayerAugmentHUDSelectionTimerWidget>();
	}
};
DUMPER7_ASSERTS_UFortPlayerAugmentHUDSelectionTimerWidget;

// Class PlayerAugmentsUI.FortMobileActionBBE_AugmentShoot
// 0x0010 (0x0090 - 0x0080)
class UFortMobileActionBBE_AugmentShoot : public UFortMobileActionButtonBehaviorExtension
{
public:
	class UPaperSprite*                           IconOverrideSprite;                                // 0x0080(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FGameplayTag                           IconOverrideTag;                                   // 0x0088(0x0004)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortMobileActionBBE_AugmentShoot")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortMobileActionBBE_AugmentShoot")
	}
	static class UFortMobileActionBBE_AugmentShoot* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortMobileActionBBE_AugmentShoot>();
	}
};
DUMPER7_ASSERTS_UFortMobileActionBBE_AugmentShoot;

// Class PlayerAugmentsUI.FortMobileActionButtonBehavior_RerollAugments
// 0x0008 (0x0140 - 0x0138)
class UFortMobileActionButtonBehavior_RerollAugments : public UFortMobileActionButtonBehavior
{
public:
	class UFortItemDefinition*                    RerollCurrency;                                    // 0x0138(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortMobileActionButtonBehavior_RerollAugments")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortMobileActionButtonBehavior_RerollAugments")
	}
	static class UFortMobileActionButtonBehavior_RerollAugments* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortMobileActionButtonBehavior_RerollAugments>();
	}
};
DUMPER7_ASSERTS_UFortMobileActionButtonBehavior_RerollAugments;

// Class PlayerAugmentsUI.FortMobilePlayerAugmentTimer
// 0x0020 (0x0370 - 0x0350)
class UFortMobilePlayerAugmentTimer : public UFortMobileHUDElement
{
public:
	TWeakObjectPtr<class UFortControllerComponent_AugmentGrantingSystem> AugmentControllerComponent; // 0x0350(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UUserWidget>                PlayerAugmentGranterWidgetClass;                   // 0x0358(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UUserWidget*                            PlayerAugmentGranterWidget;                        // 0x0360(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCommonButtonBase*                      Button_PlayerAugmentTimer;                         // 0x0368(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void BP_OnHUDElementVisibilityChanged(const struct FGameplayTagContainer& HiddenElementTagContainer, bool bIsSelectionItemEquipped, bool bForceCollapse);
	void HandleHUDElementVisibilityChanged(const struct FGameplayTagContainer& HiddenElementTagContainer);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortMobilePlayerAugmentTimer")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortMobilePlayerAugmentTimer")
	}
	static class UFortMobilePlayerAugmentTimer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortMobilePlayerAugmentTimer>();
	}
};
DUMPER7_ASSERTS_UFortMobilePlayerAugmentTimer;

// Class PlayerAugmentsUI.FortPickupInteractOverrideComponent_Augments
// 0x0020 (0x00E0 - 0x00C0)
class UFortPickupInteractOverrideComponent_Augments : public UFortPickupInteractOverrideComponent
{
public:
	struct FGameplayTagContainer                  AllowedAugmentGameplayTags;                        // 0x00C0(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortPickupInteractOverrideComponent_Augments")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortPickupInteractOverrideComponent_Augments")
	}
	static class UFortPickupInteractOverrideComponent_Augments* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortPickupInteractOverrideComponent_Augments>();
	}
};
DUMPER7_ASSERTS_UFortPickupInteractOverrideComponent_Augments;

// Class PlayerAugmentsUI.FortPlayerAugmentCollectionListEntry
// 0x0010 (0x1580 - 0x1570)
class UFortPlayerAugmentCollectionListEntry final : public UAthenaCollectionListEntry
{
public:
	class UImage*                                 Image_Background;                                  // 0x1570(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   ParamName_ItemIcon;                                // 0x1578(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   ParamName_IsDiscovered;                            // 0x157C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortPlayerAugmentCollectionListEntry")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortPlayerAugmentCollectionListEntry")
	}
	static class UFortPlayerAugmentCollectionListEntry* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortPlayerAugmentCollectionListEntry>();
	}
};
DUMPER7_ASSERTS_UFortPlayerAugmentCollectionListEntry;

// Class PlayerAugmentsUI.FortPlayerAugmentCollectionScreen
// 0x0080 (0x06E0 - 0x0660)
class UFortPlayerAugmentCollectionScreen final : public UAthenaCollectionScreenBase
{
public:
	struct FScalableFloat                         AugmentsEnabledViaHotfix;                          // 0x0660(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TMap<struct FGameplayTag, TSoftObjectPtr<class UObject>> TagToImageMap;                          // 0x0688(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	class UCommonTextBlock*                       Text_CategoryTitle;                                // 0x06D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortPlayerAugmentCollectionScreen")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortPlayerAugmentCollectionScreen")
	}
	static class UFortPlayerAugmentCollectionScreen* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortPlayerAugmentCollectionScreen>();
	}
};
DUMPER7_ASSERTS_UFortPlayerAugmentCollectionScreen;

// Class PlayerAugmentsUI.FortPlayerAugmentCollectionScreenContainer
// 0x0000 (0x0560 - 0x0560)
class UFortPlayerAugmentCollectionScreenContainer final : public UAthenaCollectionScreenContainer
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortPlayerAugmentCollectionScreenContainer")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortPlayerAugmentCollectionScreenContainer")
	}
	static class UFortPlayerAugmentCollectionScreenContainer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortPlayerAugmentCollectionScreenContainer>();
	}
};
DUMPER7_ASSERTS_UFortPlayerAugmentCollectionScreenContainer;

// Class PlayerAugmentsUI.FortPlayerAugmentCollectionScreenInfoOverlay
// 0x0020 (0x04E8 - 0x04C8)
class UFortPlayerAugmentCollectionScreenInfoOverlay final : public UAthenaCollectionScreenInfoOverlay
{
public:
	class FName                                   ParamName_Progress;                                // 0x04C8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_4CC[0x4];                                      // 0x04CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonTextBlock*                       Text_ItemCategory;                                 // 0x04D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortItemCategoryIndicator*             ItemCategoryIndicator;                             // 0x04D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UOverlay*                               Overlay_UndiscoveredText;                          // 0x04E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortPlayerAugmentCollectionScreenInfoOverlay")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortPlayerAugmentCollectionScreenInfoOverlay")
	}
	static class UFortPlayerAugmentCollectionScreenInfoOverlay* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortPlayerAugmentCollectionScreenInfoOverlay>();
	}
};
DUMPER7_ASSERTS_UFortPlayerAugmentCollectionScreenInfoOverlay;

// Class PlayerAugmentsUI.FortPlayerAugmentGranterWidget
// 0x0028 (0x0350 - 0x0328)
class UFortPlayerAugmentGranterWidget : public UFortHUDElementWidget
{
public:
	TArray<class UFortPlayerAugmentItemDefinition*> AvailableAugmentItemDefinitions;                 // 0x0328(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	class UWidget*                                Overlay_Reroll;                                    // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_340[0x10];                                     // 0x0340(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleAugmentHighlighted(int32 HighlightedAugmentIndex);
	void HandleAugmentSelectionStarted(const int32 SelectedAugmentIndex);
	void HandleAugmentSelectorOpenedStatusChanged(const bool bIsOpened, const bool bViewingAugmentInventory);
	void HandleAugmentSelectorToolViewSwapped(const bool bViewingAugmentsInventory);
	void HandleAvailableAugmentsForGrantingUpdated(class UFortControllerComponent_AugmentGrantingSystem* GrantingComponent);
	void HandleCanSelectAugmentChanged(bool bCanSelectAugment);
	void HandleNumPendingAugmentsToGrantUpdated(int8 NumPendingAugmentsToGrant);
	void HandleRerollAugments();
	void HandleSelectedAugmentForGrant(class UFortPlayerAugmentItemDefinition* SelectedAugment);
	void HandleTimerUpdated(float TimeRemaining, float TimePercentage);
	void OnAugmentHighlighted(int32 HighlightedAugmentIndex);
	void OnAugmentScrollDownEvent();
	void OnAugmentScrollUpEvent();
	void OnAugmentSelectionStarted(const int32 SelectedAugmentIndex);
	void OnAugmentSelectorOpenedStatusChanged(const bool bIsOpened, const bool bViewingAugmentInventory);
	void OnAugmentSelectorToolViewSwapped(const bool bViewingAugmentInventory);
	void OnCanSelectAugmentChanged(bool bCanSelectAugment);
	void OnInputTypeChanged(const ECommonInputType NewInputType);
	void OnNumPendingAugmentsToGrantUpdated(int32 NumPendingAugmentsToGrant);
	void OnPopulateAvailableAugmentsHUD(const TArray<class UFortPlayerAugmentItemDefinition*>& AugmentItemDefinition);
	void OnRerollAugments();
	void OnSelectedAugmentForGrant(class UFortPlayerAugmentItemDefinition* HighlightedAugment);
	void OnTimerUpdated(float TimeRemaining, float TimePercentage);

	int32 GetPendingAugmentsToGrant() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortPlayerAugmentGranterWidget")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortPlayerAugmentGranterWidget")
	}
	static class UFortPlayerAugmentGranterWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortPlayerAugmentGranterWidget>();
	}
};
DUMPER7_ASSERTS_UFortPlayerAugmentGranterWidget;

// Class PlayerAugmentsUI.FortPlayerAugmentHUDQuickbarWidget
// 0x0048 (0x0330 - 0x02E8)
class UFortPlayerAugmentHUDQuickbarWidget : public UCommonUserWidget
{
public:
	struct FGameplayTagContainer                  HiddenAugmentGameplayTags;                         // 0x02E8(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         NumAugmentGrantRoundsForPlaylist;                  // 0x0308(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)

public:
	void OnAugmentsUpdated(const TArray<class UFortPlayerAugmentItemDefinition*>& ActiveAugments);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortPlayerAugmentHUDQuickbarWidget")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortPlayerAugmentHUDQuickbarWidget")
	}
	static class UFortPlayerAugmentHUDQuickbarWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortPlayerAugmentHUDQuickbarWidget>();
	}
};
DUMPER7_ASSERTS_UFortPlayerAugmentHUDQuickbarWidget;

// Class PlayerAugmentsUI.FortPlayerAugmentHUDRerollWidget
// 0x0050 (0x0338 - 0x02E8)
class UFortPlayerAugmentHUDRerollWidget : public UCommonUserWidget
{
public:
	class UCommonLazyImage*                       Image_CurrencyIcon;                                // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortWorldItemDefinition*               RerollCurrency;                                    // 0x02F0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         CachedNumFreeRerolls;                              // 0x02F8(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   RerollHoldMaterialParamName;                       // 0x02FC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_300[0x8];                                      // 0x0300(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UImage*                                 Image_ProgressBar;                                 // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_OwnedCurrency;                                // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_RerollCost;                                   // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_320[0x18];                                     // 0x0320(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void EndRerollHoldProgress();
	void HandleAugmentSelectorOpenedStatusChanged(bool bIsOpened, bool bViewingInventory);
	void HandleFreeRerollsUpdated(const int32 NewNumFreeRerolls);
	void HandleRerollAugments();
	void OnFreeRerollsUpdated(const int32 NewNumFreeRerolls);
	void OnRerollAugments();
	void OnUpdateCurrency(const int32 OwnedCurrency, const int32 RerollCost);
	void StartRerollHoldProgress(const float duration);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortPlayerAugmentHUDRerollWidget")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortPlayerAugmentHUDRerollWidget")
	}
	static class UFortPlayerAugmentHUDRerollWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortPlayerAugmentHUDRerollWidget>();
	}
};
DUMPER7_ASSERTS_UFortPlayerAugmentHUDRerollWidget;

// Class PlayerAugmentsUI.FortPlayerAugmentInfoEntryWidget
// 0x0068 (0x0350 - 0x02E8)
class UFortPlayerAugmentInfoEntryWidget : public UCommonUserWidget
{
public:
	class FText                                   RarityTextFormat;                                  // 0x02E8(0x0018)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_AugmentName;                                  // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_AugmentRarity;                                // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_AugmentCategory;                              // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortItemCategoryIndicator*             ItemCategoryIndicator;                             // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortLazyImage*                         Image_CategoryAsImage;                             // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_AugmentDescription;                           // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortSocialAvatarIcon*                  Icon_LenderAvatarIcon;                             // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UWidget*                                Overlay_LenderAvatarIcon;                          // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortLazyImage*                         Image_LenderSquadColor;                            // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_BorrowingText;                                // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnItemNewOrBorrowedSet(const bool bIsNew, const bool bIsBorrowed);
	void OnItemPinColorSet(const struct FLinearColor& PinColor);
	void OnItemRaritySet(const EFortRarity Rarity, const struct FFortRarityItemData& RarityItemData);
	void UpdateAugment(const class UFortPlayerAugmentItemDefinition* AugmentItemDefinition);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortPlayerAugmentInfoEntryWidget")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortPlayerAugmentInfoEntryWidget")
	}
	static class UFortPlayerAugmentInfoEntryWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortPlayerAugmentInfoEntryWidget>();
	}
};
DUMPER7_ASSERTS_UFortPlayerAugmentInfoEntryWidget;

// Class PlayerAugmentsUI.FortPlayerAugmentInGameCarriedWidget
// 0x0000 (0x0328 - 0x0328)
class UFortPlayerAugmentInGameCarriedWidget final : public UFortHUDElementWidget
{
public:
	void HandleExitBus(class AFortPlayerControllerZone* FortPCZone);
	void OnShowInitialAugment(const class UFortPlayerAugmentItemDefinition* PlayerAugmentItemDefinition);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortPlayerAugmentInGameCarriedWidget")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortPlayerAugmentInGameCarriedWidget")
	}
	static class UFortPlayerAugmentInGameCarriedWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortPlayerAugmentInGameCarriedWidget>();
	}
};
DUMPER7_ASSERTS_UFortPlayerAugmentInGameCarriedWidget;

// Class PlayerAugmentsUI.FortPlayerAugmentInventoryExtensionRow
// 0x0050 (0x03A0 - 0x0350)
class UFortPlayerAugmentInventoryExtensionRow final : public UAthenaInventoryGroupBase
{
public:
	struct FScalableFloat                         AugmentsEnabledViaHotfix;                          // 0x0350(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                  BlockedGameplayTags;                               // 0x0378(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_398[0x8];                                      // 0x0398(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleAugmentGrantingTimersFinishedForMatch();
	void HandleAugmentGrantingTimersResetForMatch();
	void HandleNumPendingAugmentsToGrantUpdated(int8 NumPendingAugmentsToGrant);
	void HandleTimerUpdated(float TimeRemaining, float TimePercentage);
	void OnAugmentGrantingTimersFinishedForMatch();
	void OnAugmentGrantingTimersResetForMatch();
	void OnNumPendingAugmentsToGrantUpdated(int32 NumPendingAugmentsToGrant);
	void OnTimerUpdated(float TimeRemaining, float TimePercentage);
	void RequestOpenSelector();

	int32 GetPendingAugmentsToGrant() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortPlayerAugmentInventoryExtensionRow")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortPlayerAugmentInventoryExtensionRow")
	}
	static class UFortPlayerAugmentInventoryExtensionRow* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortPlayerAugmentInventoryExtensionRow>();
	}
};
DUMPER7_ASSERTS_UFortPlayerAugmentInventoryExtensionRow;

// Class PlayerAugmentsUI.FortPlayerAugmentInventoryInfoWidget
// 0x0060 (0x0460 - 0x0400)
class UFortPlayerAugmentInventoryInfoWidget final : public UCommonActivatableWidget
{
public:
	uint8                                         Pad_400[0x8];                                      // 0x0400(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   RarityTextFormat;                                  // 0x0408(0x0018)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_ItemName;                                     // 0x0420(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_ItemRarity;                                   // 0x0428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_ItemCategory;                                 // 0x0430(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortItemCategoryIndicator*             ItemCategoryIndicator;                             // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_ItemDescription;                              // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortSocialAvatarIcon*                  Icon_LenderAvatarIcon;                             // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortLazyImage*                         Image_LenderSquadColor;                            // 0x0450(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_BorrowingText;                                // 0x0458(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnItemNewOrBorrowedSet(const bool bIsNew, const bool bIsBorrowed);
	void OnItemRaritySet(const EFortRarity Rarity, const struct FFortRarityItemData& RarityItemData);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortPlayerAugmentInventoryInfoWidget")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortPlayerAugmentInventoryInfoWidget")
	}
	static class UFortPlayerAugmentInventoryInfoWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortPlayerAugmentInventoryInfoWidget>();
	}
};
DUMPER7_ASSERTS_UFortPlayerAugmentInventoryInfoWidget;

// Class PlayerAugmentsUI.FortPlayerAugmentInventoryListEntry
// 0x0010 (0x14A0 - 0x1490)
class UFortPlayerAugmentInventoryListEntry final : public UCommonButtonBase
{
public:
	uint8                                         Pad_1490[0x10];                                    // 0x1490(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnAugmentListItemSet(const class UFortItemDefinition* ItemDefinition);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortPlayerAugmentInventoryListEntry")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortPlayerAugmentInventoryListEntry")
	}
	static class UFortPlayerAugmentInventoryListEntry* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortPlayerAugmentInventoryListEntry>();
	}
};
DUMPER7_ASSERTS_UFortPlayerAugmentInventoryListEntry;

// Class PlayerAugmentsUI.FortPlayerAugmentInventoryTab
// 0x0180 (0x0580 - 0x0400)
class UFortPlayerAugmentInventoryTab final : public UCommonActivatableWidget
{
public:
	uint8                                         Pad_400[0x8];                                      // 0x0400(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         AugmentsEnabledViaHotfix;                          // 0x0408(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                  HiddenAugmentGameplayTags;                         // 0x0430(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	class FName                                   TabNameID;                                         // 0x0450(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_454[0xC];                                      // 0x0454(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortTabButtonLabelInfo                TabButtonLabelInfo;                                // 0x0460(0x0110)(Edit, NativeAccessSpecifierPrivate)
	class UFortPlayerAugmentInventoryInfoWidget*  AugmentInfo;                                       // 0x0570(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonListView*                        ListView_Augments;                                 // 0x0578(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void HandleAugmentGrantingTimersFinishedForMatch();
	void HandleAugmentGrantingTimersResetForMatch();
	void HandleNumPendingAugmentsToGrantUpdated(int8 NumPendingAugmentsToGrant);
	void HandleTimerUpdated(float TimeRemaining, float TimePercentage);
	void OnAugmentGrantingTimersFinishedForMatch();
	void OnAugmentGrantingTimersResetForMatch();
	void OnAugmentListUpdated(const int32 NumAugments);
	void OnNumPendingAugmentsToGrantUpdated(int32 NumPendingAugmentsToGrant);
	void OnTimerUpdated(float TimeRemaining, float TimePercentage);
	void RequestOpenSelector();

	int32 GetPendingAugmentsToGrant() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortPlayerAugmentInventoryTab")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortPlayerAugmentInventoryTab")
	}
	static class UFortPlayerAugmentInventoryTab* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortPlayerAugmentInventoryTab>();
	}
};
DUMPER7_ASSERTS_UFortPlayerAugmentInventoryTab;

// Class PlayerAugmentsUI.FortPlayerAugmentLobbyWidget
// 0x0000 (0x02E8 - 0x02E8)
class UFortPlayerAugmentLobbyWidget final : public UCommonUserWidget
{
public:
	void OnShowInitialAugment(const class UFortPlayerAugmentItemDefinition* CarriedAugment);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortPlayerAugmentLobbyWidget")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortPlayerAugmentLobbyWidget")
	}
	static class UFortPlayerAugmentLobbyWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortPlayerAugmentLobbyWidget>();
	}
};
DUMPER7_ASSERTS_UFortPlayerAugmentLobbyWidget;

// Class PlayerAugmentsUI.FortPlayerAugmentPostMatchUnlocksWidget
// 0x0028 (0x0350 - 0x0328)
class UFortPlayerAugmentPostMatchUnlocksWidget final : public UFortHUDElementWidget
{
public:
	struct FScalableFloat                         AugmentsEnabledViaHotfix;                          // 0x0328(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)

public:
	void OnShowUnlockedAugments(const TArray<class UFortPlayerAugmentItemDefinition*>& UnlockedAugments);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortPlayerAugmentPostMatchUnlocksWidget")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortPlayerAugmentPostMatchUnlocksWidget")
	}
	static class UFortPlayerAugmentPostMatchUnlocksWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortPlayerAugmentPostMatchUnlocksWidget>();
	}
};
DUMPER7_ASSERTS_UFortPlayerAugmentPostMatchUnlocksWidget;

// Class PlayerAugmentsUI.FortPlayerAugmentSpecialAcquiredNotificationWidget
// 0x0098 (0x03C0 - 0x0328)
class alignas(0x10) UFortPlayerAugmentSpecialAcquiredNotificationWidget final : public UFortHUDElementWidget
{
public:
	uint8                                         Pad_328[0x68];                                     // 0x0328(0x0068)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortPrioritizedWidgetData             PrioritizationData;                                // 0x0390(0x0002)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_392[0x6];                                      // 0x0392(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  TargetGameplayTags;                                // 0x0398(0x0020)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3B8[0x8];                                      // 0x03B8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void CloseWidget();
	void OnEventAdded();
	void OnStompedByOtherWidget();
	void OpenWidget(const class UFortPlayerAugmentItemDefinition* ItemDef);

	class FText ConstructEventDescription(const class UFortPlayerAugmentItemDefinition* ItemDef) const;
	bool HasMoreAugmentEvents() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortPlayerAugmentSpecialAcquiredNotificationWidget")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortPlayerAugmentSpecialAcquiredNotificationWidget")
	}
	static class UFortPlayerAugmentSpecialAcquiredNotificationWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortPlayerAugmentSpecialAcquiredNotificationWidget>();
	}
};
DUMPER7_ASSERTS_UFortPlayerAugmentSpecialAcquiredNotificationWidget;

// Class PlayerAugmentsUI.FortPlayerAugmentInfoTouchWidget
// 0x0008 (0x0390 - 0x0388)
class UFortPlayerAugmentInfoTouchWidget final : public UFortTouchUserWidget
{
public:
	uint8                                         Pad_388[0x8];                                      // 0x0388(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetAugmentIndexInList(const int32 InAugmentIndexInList);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortPlayerAugmentInfoTouchWidget")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortPlayerAugmentInfoTouchWidget")
	}
	static class UFortPlayerAugmentInfoTouchWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortPlayerAugmentInfoTouchWidget>();
	}
};
DUMPER7_ASSERTS_UFortPlayerAugmentInfoTouchWidget;

}

