#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Player_FirstPersonAdditives_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function Player_FirstPersonAdditives_AnimBP.Player_FirstPersonAdditives_AnimBP_C.AnimGraph
// 0x0020 (0x0020 - 0x0000)
struct Player_FirstPersonAdditives_AnimBP_C_AnimGraph final
{
public:
	struct FPoseLink                              InPose;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              AnimGraph_0;                                       // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_Player_FirstPersonAdditives_AnimBP_C_AnimGraph;

// Function Player_FirstPersonAdditives_AnimBP.Player_FirstPersonAdditives_AnimBP_C.ExecuteUbergraph_Player_FirstPersonAdditives_AnimBP
// 0x0008 (0x0008 - 0x0000)
struct Player_FirstPersonAdditives_AnimBP_C_ExecuteUbergraph_Player_FirstPersonAdditives_AnimBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Player_FirstPersonAdditives_AnimBP_C_ExecuteUbergraph_Player_FirstPersonAdditives_AnimBP;

}

