#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Player_ProceduralLayering_AnimBP

#include "Basic.hpp"

#include "PoseSearch_structs.hpp"
#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "AnimationLayeringRuntime_structs.hpp"
#include "Player_ProceduralLayering_AnimBP_structs.hpp"
#include "BlendStack_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass Player_ProceduralLayering_AnimBP.Player_ProceduralLayering_AnimBP_C
// 0x5950 (0x72A0 - 0x1950)
class UPlayer_ProceduralLayering_AnimBP_C final : public UFortPlayerProceduralLayeringAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1950(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct Player_ProceduralLayering_AnimBP::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables; // 0x1958(0x0028)(HasGetValueTypeHash)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Tag;                        // 0x1980(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x1988(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x1990(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root_8;                              // 0x1998(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_18;                  // 0x19B8(0x00B0)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_17;                  // 0x1A68(0x00B0)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_1;                 // 0x1B18(0x0040)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_6;                   // 0x1B58(0x0048)()
	struct FAnimNode_BoneMask                     AnimGraphNode_BoneMask_2;                          // 0x1BA0(0x00F8)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_4;                  // 0x1C98(0x00F0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_20;                   // 0x1D88(0x0078)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_40;                    // 0x1E00(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_39;                    // 0x1E28(0x0028)()
	struct FAnimNode_Root                         AnimGraphNode_Root_7;                              // 0x1E50(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_16;                  // 0x1E70(0x00B0)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_15;                  // 0x1F20(0x00B0)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_14;                  // 0x1FD0(0x00B0)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_7;             // 0x2080(0x0020)()
	struct FAnimNode_HandIKRetargeting            AnimGraphNode_HandIKRetargeting_1;                 // 0x20A0(0x0128)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_10;                         // 0x21C8(0x00E8)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_9;                          // 0x22B0(0x00E8)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_8;                          // 0x2398(0x00E8)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_15;            // 0x2480(0x0020)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_7;                          // 0x24A0(0x00E8)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_6;                          // 0x2588(0x00E8)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_5;                          // 0x2670(0x00E8)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_4;                          // 0x2758(0x00E8)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_3;                          // 0x2840(0x00E8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_38;                    // 0x2928(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_37;                    // 0x2950(0x0028)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_2;                          // 0x2978(0x00E8)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_1;                          // 0x2A60(0x00E8)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone;                            // 0x2B48(0x00E8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_36;                    // 0x2C30(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_35;                    // 0x2C58(0x0028)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_6;             // 0x2C80(0x0020)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_14;            // 0x2CA0(0x0020)()
	struct FAnimNode_LegIK                        AnimGraphNode_LegIK_1;                             // 0x2CC0(0x0100)()
	struct FAnimNode_LegIK                        AnimGraphNode_LegIK;                               // 0x2DC0(0x0100)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_34;                    // 0x2EC0(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_5;                   // 0x2EE8(0x0048)()
	struct FAnimNode_BlendStackInput              AnimGraphNode_BlendStackInput;                     // 0x2F30(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_33;                    // 0x2F58(0x0028)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_4;                   // 0x2F80(0x00C8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_32;                    // 0x3048(0x0028)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_3;                   // 0x3070(0x00C8)()
	struct FAnimNode_Root                         AnimGraphNode_BlendStackResult;                    // 0x3138(0x0020)()
	struct FAnimNode_BlendStack                   AnimGraphNode_BlendStack;                          // 0x3158(0x0110)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_19;                   // 0x3268(0x0078)()
	struct FAnimNode_PoseSearchHistoryCollector   AnimGraphNode_PoseSearchHistoryCollector;          // 0x32E0(0x0238)()
	uint8                                         Pad_3518[0x8];                                     // 0x3518(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_DeadBlending                 AnimGraphNode_DeadBlending;                        // 0x3520(0x0480)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_18;                   // 0x39A0(0x0078)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_17;                   // 0x3A18(0x0078)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_2;                   // 0x3A90(0x00C8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_16;                   // 0x3B58(0x0078)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_3;                  // 0x3BD0(0x00F0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_4;                   // 0x3CC0(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_15;                   // 0x3D08(0x0078)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_31;                    // 0x3D80(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_30;                    // 0x3DA8(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_14;                   // 0x3DD0(0x0078)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_29;                    // 0x3E48(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_28;                    // 0x3E70(0x0028)()
	struct FAnimNode_Root                         AnimGraphNode_Root_6;                              // 0x3E98(0x0020)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator;                   // 0x3EB8(0x0040)()
	struct FAnimNode_Root                         AnimGraphNode_Root_5;                              // 0x3EF8(0x0020)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_13;                   // 0x3F18(0x0078)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_12;                   // 0x3F90(0x0078)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_11;                   // 0x4008(0x0078)()
	struct FAnimNode_ModifyCurve                  AnimGraphNode_ModifyCurve_1;                       // 0x4080(0x0120)()
	struct FAnimNode_ModifyCurve                  AnimGraphNode_ModifyCurve;                         // 0x41A0(0x0120)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_13;                  // 0x42C0(0x00B0)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_12;                  // 0x4370(0x00B0)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_11;                  // 0x4420(0x00B0)()
	struct FAnimNode_CopyMotion                   AnimGraphNode_CopyMotion_3;                        // 0x44D0(0x01E0)()
	struct FAnimNode_CopyMotion                   AnimGraphNode_CopyMotion_2;                        // 0x46B0(0x01E0)()
	struct FAnimNode_CopyMotion                   AnimGraphNode_CopyMotion_1;                        // 0x4890(0x01E0)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_5;             // 0x4A70(0x0020)()
	struct FAnimNode_CopyMotion                   AnimGraphNode_CopyMotion;                          // 0x4A90(0x01E0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_3;                   // 0x4C70(0x0048)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_4;             // 0x4CB8(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_3;             // 0x4CD8(0x0020)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_13;            // 0x4CF8(0x0020)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_12;            // 0x4D18(0x0020)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_11;            // 0x4D38(0x0020)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_10;            // 0x4D58(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_27;                    // 0x4D78(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_26;                    // 0x4DA0(0x0028)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_9;             // 0x4DC8(0x0020)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_8;             // 0x4DE8(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_25;                    // 0x4E08(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_24;                    // 0x4E30(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_23;                    // 0x4E58(0x0028)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_7;             // 0x4E80(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_22;                    // 0x4EA0(0x0028)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_6;             // 0x4EC8(0x0020)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_5;             // 0x4EE8(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_21;                    // 0x4F08(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_20;                    // 0x4F30(0x0028)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_4;             // 0x4F58(0x0020)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_3;             // 0x4F78(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_19;                    // 0x4F98(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_18;                    // 0x4FC0(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_2;                   // 0x4FE8(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_17;                    // 0x5030(0x0028)()
	struct FAnimNode_Root                         AnimGraphNode_Root_4;                              // 0x5058(0x0020)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_10;                   // 0x5078(0x0078)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_10;                  // 0x50F0(0x00B0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_1;                   // 0x51A0(0x0048)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2;             // 0x51E8(0x0020)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_2;             // 0x5208(0x0020)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_1;             // 0x5228(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_16;                    // 0x5248(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_15;                    // 0x5270(0x0028)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_1;             // 0x5298(0x0020)()
	struct FAnimNode_CopyBoneAdvanced             AnimGraphNode_CopyBoneAdvanced_2;                  // 0x52B8(0x0128)()
	struct FAnimNode_CopyBoneAdvanced             AnimGraphNode_CopyBoneAdvanced_1;                  // 0x53E0(0x0128)()
	struct FAnimNode_CopyBoneAdvanced             AnimGraphNode_CopyBoneAdvanced;                    // 0x5508(0x0128)()
	struct FAnimNode_HandIKRetargeting            AnimGraphNode_HandIKRetargeting;                   // 0x5630(0x0128)()
	struct FAnimNode_Root                         AnimGraphNode_Root_3;                              // 0x5758(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_9;                   // 0x5778(0x00B0)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_8;                   // 0x5828(0x00B0)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_1;                   // 0x58D8(0x00C8)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer;                     // 0x59A0(0x00C8)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x5A68(0x0020)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_9;                    // 0x5A88(0x0078)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_14;                    // 0x5B00(0x0028)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x5B28(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_2;                        // 0x5B48(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1;                        // 0x5C70(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x5D98(0x0128)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_1;                       // 0x5EC0(0x00C0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_8;                    // 0x5F80(0x0078)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_13;                    // 0x5FF8(0x0028)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_7;                   // 0x6020(0x00B0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_12;                    // 0x60D0(0x0028)()
	struct FAnimNode_Root                         AnimGraphNode_Root_2;                              // 0x60F8(0x0020)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_7;                    // 0x6118(0x0078)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_6;                    // 0x6190(0x0078)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_5;                    // 0x6208(0x0078)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_6;                   // 0x6280(0x00B0)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_5;                   // 0x6330(0x00B0)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_4;                   // 0x63E0(0x00B0)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_3;                   // 0x6490(0x00B0)()
	struct FAnimNode_MakeDynamicAdditive          AnimGraphNode_MakeDynamicAdditive;                 // 0x6540(0x0038)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_4;                    // 0x6578(0x0078)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive;                       // 0x65F0(0x00C8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_11;                    // 0x66B8(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_3;                    // 0x66E0(0x0078)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_10;                    // 0x6758(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x6780(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_9;                     // 0x67C8(0x0028)()
	struct FAnimNode_BoneMask                     AnimGraphNode_BoneMask_1;                          // 0x67F0(0x00F8)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend;                         // 0x68E8(0x00C0)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_2;                   // 0x69A8(0x00B0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_2;                    // 0x6A58(0x0078)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_8;                     // 0x6AD0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_7;                     // 0x6AF8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_6;                     // 0x6B20(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_5;                     // 0x6B48(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_4;                     // 0x6B70(0x0028)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_2;                  // 0x6B98(0x00F0)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_1;                  // 0x6C88(0x00F0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_3;                     // 0x6D78(0x0028)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x6DA0(0x0020)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_1;                    // 0x6DC0(0x0078)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x6E38(0x0078)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_1;                   // 0x6EB0(0x00B0)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x6F60(0x00B0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_2;                     // 0x7010(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x7038(0x0028)()
	struct FAnimNode_BoneMask                     AnimGraphNode_BoneMask;                            // 0x7060(0x00F8)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend;                    // 0x7158(0x00F0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x7248(0x0028)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x7270(0x0020)()
	class UCurveVector*                           HipRemapCurve;                                     // 0x7290(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          IsSwinging;                                        // 0x7298(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsCrouchTransition;                                // 0x7299(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          NonAttachedHandSet;                                // 0x729A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AdditiveLayering(const struct FPoseLink& AddLayer_InLocomotionPose, const struct FPoseLink& AddLayer_InItemPose, const struct FPoseLink& AddLayer_InBasePose, const struct FPoseLink& AddLayer_InLayeredLocomotionPose, const struct FPoseLink& InPoseSourcePose, struct FPoseLink* AdditiveLayering_0);
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void BasePose(struct FPoseLink* BasePose_0);
	void CopyBoneLayer(const struct FPoseLink& InCopyBoneLayerPose, struct FPoseLink* CopyBoneLayer_0);
	void CopyMotionLayer(const struct FPoseLink& CopyMotion_InBaseLocomotionPose, const struct FPoseLink& CopyMotion_InBasePose, const struct FPoseLink& CopyMotion_InLayeredLocomotionPose, struct FPoseLink* CopyMotionLayer_0);
	void ExecuteUbergraph_Player_ProceduralLayering_AnimBP(int32 EntryPoint);
	void Layering(const struct FPoseLink& Layer_InBaseLocomotionPose, const struct FPoseLink& Layer_InItemPose, struct FPoseLink* Layering_0);
	void OnUpdateBlendStack_PreNativize(const struct FAnimUpdateContext& Context, const struct FAnimNodeReference& Node);
	void ProceduralAdditivePose(const struct FPoseLink& InSourceLocomotionPose, const struct FPoseLink& InMotionMatchingPose, const struct FPoseLink& InProceduralLayeredPose, struct FPoseLink* ProceduralAdditivePose_0);
	void ProceduralLayeredPose(const struct FPoseLink& InLocomotionPose, const struct FPoseLink& InPassThroughPose, struct FPoseLink* ProceduralLayeredPose_0);
	void ProceduralLayering(const struct FPoseLink& ProcLayer_InBaseLocomotionPose, const struct FPoseLink& ProcLayer_InLayeredLocomotionPose, const struct FPoseLink& ProcLayer_InBasePose, struct FPoseLink* ProceduralLayering_0);
	void UpdateNoWeaponBasePose_PreNativize(const struct FAnimUpdateContext& Context, const struct FAnimNodeReference& Node);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Player_ProceduralLayering_AnimBP_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Player_ProceduralLayering_AnimBP_C")
	}
	static class UPlayer_ProceduralLayering_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlayer_ProceduralLayering_AnimBP_C>();
	}
};
DUMPER7_ASSERTS_UPlayer_ProceduralLayering_AnimBP_C;

}

