#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PoseSearch

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "PoseSearch_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function PoseSearch.MotionMatchingAnimNodeLibrary.ConvertToMotionMatchingNode
// 0x0028 (0x0028 - 0x0000)
struct MotionMatchingAnimNodeLibrary_ConvertToMotionMatchingNode final
{
public:
	struct FAnimNodeReference                     Node;                                              // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	EAnimNodeReferenceConversionResult            Result;                                            // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMotionMatchingAnimNodeReference       ReturnValue;                                       // 0x0018(0x0010)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MotionMatchingAnimNodeLibrary_ConvertToMotionMatchingNode;

// Function PoseSearch.MotionMatchingAnimNodeLibrary.ConvertToMotionMatchingNodePure
// 0x0028 (0x0028 - 0x0000)
struct MotionMatchingAnimNodeLibrary_ConvertToMotionMatchingNodePure final
{
public:
	struct FAnimNodeReference                     Node;                                              // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FMotionMatchingAnimNodeReference       MotionMatchingNode;                                // 0x0010(0x0010)(Parm, OutParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          Result;                                            // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_MotionMatchingAnimNodeLibrary_ConvertToMotionMatchingNodePure;

// Function PoseSearch.MotionMatchingAnimNodeLibrary.GetMotionMatchingSearchResult
// 0x0058 (0x0058 - 0x0000)
struct MotionMatchingAnimNodeLibrary_GetMotionMatchingSearchResult final
{
public:
	struct FMotionMatchingAnimNodeReference       MotionMatchingNode;                                // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FPoseSearchBlueprintResult             Result;                                            // 0x0010(0x0040)(Parm, OutParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bIsResultValid;                                    // 0x0050(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_MotionMatchingAnimNodeLibrary_GetMotionMatchingSearchResult;

// Function PoseSearch.MotionMatchingAnimNodeLibrary.ResetDatabasesToSearch
// 0x0018 (0x0018 - 0x0000)
struct MotionMatchingAnimNodeLibrary_ResetDatabasesToSearch final
{
public:
	struct FMotionMatchingAnimNodeReference       MotionMatchingNode;                                // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	EPoseSearchInterruptMode                      InterruptMode;                                     // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_MotionMatchingAnimNodeLibrary_ResetDatabasesToSearch;

// Function PoseSearch.MotionMatchingAnimNodeLibrary.SetDatabasesToSearch
// 0x0028 (0x0028 - 0x0000)
struct MotionMatchingAnimNodeLibrary_SetDatabasesToSearch final
{
public:
	struct FMotionMatchingAnimNodeReference       MotionMatchingNode;                                // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	TArray<class UPoseSearchDatabase*>            Databases;                                         // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	EPoseSearchInterruptMode                      InterruptMode;                                     // 0x0020(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_MotionMatchingAnimNodeLibrary_SetDatabasesToSearch;

// Function PoseSearch.MotionMatchingAnimNodeLibrary.SetDatabaseToSearch
// 0x0020 (0x0020 - 0x0000)
struct MotionMatchingAnimNodeLibrary_SetDatabaseToSearch final
{
public:
	struct FMotionMatchingAnimNodeReference       MotionMatchingNode;                                // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	class UPoseSearchDatabase*                    Database;                                          // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPoseSearchInterruptMode                      InterruptMode;                                     // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_MotionMatchingAnimNodeLibrary_SetDatabaseToSearch;

// Function PoseSearch.MotionMatchingAnimNodeLibrary.SetInterruptMode
// 0x0018 (0x0018 - 0x0000)
struct MotionMatchingAnimNodeLibrary_SetInterruptMode final
{
public:
	struct FMotionMatchingAnimNodeReference       MotionMatchingNode;                                // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	EPoseSearchInterruptMode                      InterruptMode;                                     // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_MotionMatchingAnimNodeLibrary_SetInterruptMode;

// Function PoseSearch.PoseSearchFeatureChannel_Heading.BP_GetWorldRotation
// 0x0030 (0x0030 - 0x0000)
struct PoseSearchFeatureChannel_Heading_BP_GetWorldRotation final
{
public:
	const class UAnimInstance*                    AnimInstance;                                      // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQuat                                  ReturnValue;                                       // 0x0010(0x0020)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PoseSearchFeatureChannel_Heading_BP_GetWorldRotation;

// Function PoseSearch.PoseSearchFeatureChannel_Position.BP_GetWorldPosition
// 0x0020 (0x0020 - 0x0000)
struct PoseSearchFeatureChannel_Position_BP_GetWorldPosition final
{
public:
	const class UAnimInstance*                    AnimInstance;                                      // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ReturnValue;                                       // 0x0008(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PoseSearchFeatureChannel_Position_BP_GetWorldPosition;

// Function PoseSearch.PoseSearchFeatureChannel_Velocity.BP_GetWorldVelocity
// 0x0020 (0x0020 - 0x0000)
struct PoseSearchFeatureChannel_Velocity_BP_GetWorldVelocity final
{
public:
	const class UAnimInstance*                    AnimInstance;                                      // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ReturnValue;                                       // 0x0008(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PoseSearchFeatureChannel_Velocity_BP_GetWorldVelocity;

// Function PoseSearch.PoseSearchLibrary.MotionMatch
// 0x0070 (0x0070 - 0x0000)
struct PoseSearchLibrary_MotionMatch final
{
public:
	class UAnimInstance*                          AnimInstance;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class UPoseSearchDatabase*              Database;                                          // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   PoseHistoryName;                                   // 0x0010(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPoseSearchBlueprintResult             Result;                                            // 0x0018(0x0040)(Parm, OutParm, NoDestructor, NativeAccessSpecifierPublic)
	const class UAnimationAsset*                  FutureAnimation;                                   // 0x0058(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FutureAnimationStartTime;                          // 0x0060(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TimeToFutureAnimationStart;                        // 0x0064(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         DebugSessionUniqueIdentifier;                      // 0x0068(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_PoseSearchLibrary_MotionMatch;

}

