#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RandomColor_Prop

#include "Basic.hpp"

#include "RandomColorProp_MaterialApply_Enum_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass RandomColor_Prop.RandomColor_Prop_C
// 0x0078 (0x0C40 - 0x0BC8)
class ARandomColor_Prop_C : public ABuildingProp
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0BC8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          RandomizeSwatchByPosition;                         // 0x0BD0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BD1[0x7];                                      // 0x0BD1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 SwatchDataAsset;                                   // 0x0BD8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         SwatchIndex;                                       // 0x0BE0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BE4[0x4];                                      // 0x0BE4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        SwatchTransitionDistance;                          // 0x0BE8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RandomizeMeshByPosition;                           // 0x0BF0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BF1[0x7];                                      // 0x0BF1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TSoftObjectPtr<class UStaticMesh>>     MeshList;                                          // 0x0BF8(0x0010)(Edit, BlueprintVisible)
	int32                                         MeshIndex;                                         // 0x0C08(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C0C[0x4];                                      // 0x0C0C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        MeshTransitionDistance;                            // 0x0C10(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            CurrentStaticMeshLoaded;                           // 0x0C18(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CurrentLoadedMeshComponent;                        // 0x0C20(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	ERandomColorProp_MaterialApply_Enum           MeshMaterialOverride;                              // 0x0C28(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C29[0x7];                                      // 0x0C29(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class URandomColor_Prop_Palette_C*            currentPalette;                                    // 0x0C30(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          ApplySwatchToSecondDataOverride;                   // 0x0C38(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          OverrideStaticMeshMobility;                        // 0x0C39(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HideParentComponent;                               // 0x0C3A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ValidateVisuals_Swatches();
	void ValidateVisuals_Meshes();
	void ValidateMeshMaterials();
	void Validate_Visuals_All();
	void UserConstructionScript();
	bool Should_Randomize();
	void RunRandomization();
	void ReceiveBeginPlay();
	void RandomSwatchByPosition();
	void RandomMeshByPosition();
	void OnLoaded_421F013A4254CA01A98BB699996351FF(class UObject* Loaded);
	void LoadMesh();
	void GetSwatchArray(TArray<class UBuildingTextureData*>* Color_Swatches, int32* Swatch_Count);
	void ExecuteUbergraph_RandomColor_Prop(int32 EntryPoint);

	void GetSwatchArrayConst(TArray<class UBuildingTextureData*>* Color_Swatches, int32* Swatch_Count) const;
	void CollectExposedAssetProviderReferences(struct FFortExposedAssetReferenceCollector& Collector) const;
	void CollectClassReferencesToAllow(struct FFortExposedClassReferenceCollector& Collector) const;
	void CollectAssetReferencesToAllow(struct FFortExposedAssetReferenceCollector& Collector) const;
	void BuildExposedAssetProviderVersion(struct FFortExposedAssetProviderVersion& Version) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("RandomColor_Prop_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RandomColor_Prop_C")
	}
	static class ARandomColor_Prop_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ARandomColor_Prop_C>();
	}
};
DUMPER7_ASSERTS_ARandomColor_Prop_C;

}

