#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ReadyUpScreenOverlay

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ReadyUpScreenOverlay.ReadyUpScreenOverlay_C
// 0x0090 (0x0480 - 0x03F0)
class UReadyUpScreenOverlay_C final : public UAthenaReadyUpScreenOverlay
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       InitialCountdownState;                             // 0x03F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Countdown;                                         // 0x0400(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UAthenaServerShutdownWidget_C*          AthenaServerShutdownWidget;                        // 0x0408(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInGameSocialUserWidget_C*              inGameSlot_0;                                      // 0x0410(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInGameSocialUserWidget_C*              inGameSlot_1;                                      // 0x0418(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInGameSocialUserWidget_C*              inGameSlot_2;                                      // 0x0420(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInLobbySocialUserWidget_C*             LobbySlot_0;                                       // 0x0428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInLobbySocialUserWidget_C*             LobbySlot_1;                                       // 0x0430(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInLobbySocialUserWidget_C*             LobbySlot_2;                                       // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInGameSocialUserWidget_C*              LocalPlayerSlot;                                   // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPostGameBottomBarWidget_C*             PostGameBottomBarWidget;                           // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         SocialUserBox;                                     // 0x0450(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_ErrorHeader;                                  // 0x0458(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_Waiting;                                      // 0x0460(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   CachedErrorText;                                   // 0x0468(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void UpdateExitToLobbyCountdownText(double CountdownValue);
	void PreConstruct(bool IsDesignTime);
	void OnReadyUp();
	void OnMatchmakingStarted();
	void OnMatchmakingFinished(bool bSuccess);
	void OnExitToLobbyCountdownProgressed(float CountdownValue);
	void OnCountdownStarted();
	void OnCountdownProgressed();
	void OnCancelReadyUp();
	void ExecuteUbergraph_ReadyUpScreenOverlay(int32 EntryPoint);
	void Destruct();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ReadyUpScreenOverlay_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ReadyUpScreenOverlay_C")
	}
	static class UReadyUpScreenOverlay_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UReadyUpScreenOverlay_C>();
	}
};
DUMPER7_ASSERTS_UReadyUpScreenOverlay_C;

}

