#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ResourceCountWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ResourceCountWidget.ResourceCountWidget_C
// 0x0068 (0x0388 - 0x0320)
class UResourceCountWidget_C final : public UFortResourceWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0320(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                Background;                                        // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FSlateColor                            CanAffordTextColor;                                // 0x0330(0x0014)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateColor                            CanNotAffordTextColor;                             // 0x0344(0x0014)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateColor                            CanNotAffordBackgroundColor;                       // 0x0358(0x0014)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateColor                            CanAffordBackgroundColor;                          // 0x036C(0x0014)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          bUseBackgroundForAffordabilityFeedback;            // 0x0380(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void OnResourceCostSet(const int32 ResourceCount, const int32 ResourceCost, const bool bHasInfiniteResources);
	void ExecuteUbergraph_ResourceCountWidget(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ResourceCountWidget_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ResourceCountWidget_C")
	}
	static class UResourceCountWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UResourceCountWidget_C>();
	}
};
DUMPER7_ASSERTS_UResourceCountWidget_C;

}

