#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RockVehicleRuntime

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "RockVehicleRuntime_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "PhysicsCore_structs.hpp"
#include "VehicleAudioRuntime_classes.hpp"
#include "SrirachaRanch_classes.hpp"


namespace SDK
{

// Class RockVehicleRuntime.RockVehicle_InteractionOverrideComponent
// 0x0000 (0x00A0 - 0x00A0)
class URockVehicle_InteractionOverrideComponent final : public UFortVehicleInteractionOverrideComponent
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RockVehicle_InteractionOverrideComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RockVehicle_InteractionOverrideComponent")
	}
	static class URockVehicle_InteractionOverrideComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<URockVehicle_InteractionOverrideComponent>();
	}
};
DUMPER7_ASSERTS_URockVehicle_InteractionOverrideComponent;

// Class RockVehicleRuntime.FortCheatManager_RockVehicle
// 0x0000 (0x0028 - 0x0028)
class UFortCheatManager_RockVehicle final : public UChildCheatManager
{
public:
	void RockVehicleSetBalboaVelocity(float X, float Y, float Z);
	void RockVehicleSetLocation(float X, float Y, float Z);
	void RockVehicleSetRotation(float pitch, float Yaw, float Roll);
	void RockVehicleSetVelocity(float X, float Y, float Z);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortCheatManager_RockVehicle")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortCheatManager_RockVehicle")
	}
	static class UFortCheatManager_RockVehicle* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortCheatManager_RockVehicle>();
	}
};
DUMPER7_ASSERTS_UFortCheatManager_RockVehicle;

// Class RockVehicleRuntime.RockVehicle
// 0x0240 (0x2160 - 0x1F20)
class ARockVehicle final : public AFortAthenaSKVehicle
{
public:
	float                                         InputSwivelPitch;                                  // 0x1F18(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InputSwivelYaw;                                    // 0x1F1C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bInputReverseCamera : 1;                           // 0x1F20(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (BlueprintVisible, BlueprintReadOnly, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bHasDoubleJumped : 1;                              // 0x1F20(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bHasDodged : 1;                                    // 0x1F20(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	bool                                          bFreeLookCamera;                                   // 0x1F21(0x0001)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1F22[0x6];                                     // 0x1F22(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(bool bFreeCam)> OnFreeCamToggled;                                  // 0x1F28(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_1F38[0x1];                                     // 0x1F38(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRockRuntimeConfigOverrides            RockRuntimeConfigs;                                // 0x1F39(0x0004)(Net, Transient, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_1F3D[0x1B];                                    // 0x1F3D(0x001B)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(const class FName Socket, const float ImpactSpeed, const struct FHitResult& OutHit)> OnSpringImpact; // 0x1F58(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_1F68[0x78];                                    // 0x1F68(0x0078)(Fixing Size After Last Property [ Dumper-7 ])
	class URockVehicleAnalyticsComponent*         RockAnalyticsComp;                                 // 0x1FE0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class URockVehicleAbility*>            VehicleAbilities;                                  // 0x1FE8(0x0010)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TArray<TSoftClassPtr<class UClass>>           VehicleAbilityTickOrder;                           // 0x1FF8(0x0010)(Edit, ZeroConstructor, Config, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	class AFortVehicleAudioController*            CachedVehicleAudioController;                      // 0x2008(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class URockVehicleAbility_Supersonic*         SupersonicAbility;                                 // 0x2010(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class URockVehicleAnimInstance*               RockAnimInstance;                                  // 0x2018(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FFortAthenaVehicleInputState           PendingDriverInputState;                           // 0x2020(0x0040)(Transient, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FFortAthenaVehicleInputState           PrevDriverInputState;                              // 0x2060(0x0040)(Transient, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FVector                                EnterExitImpulse;                                  // 0x20A0(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_20B8[0xA8];                                    // 0x20B8(0x00A8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnRep_FreeLookCamera();
	void ServerSetLegacyDamageValues(bool bDamageFriendlyVehicles, bool bDamageOtherVehicles, bool bDamageOwnVehicle, bool bDamageAllowedFromOtherVehicle);
	void ServerToggleFreeCam();

	const struct FRockRuntimeConfigOverrides GetCurrentRockRuntimeConfigOverrides() const;
	struct FFortAthenaVehicleInputState GetDriverInput() const;
	float GetThrottleState() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RockVehicle")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RockVehicle")
	}
	static class ARockVehicle* GetDefaultObj()
	{
		return GetDefaultObjImpl<ARockVehicle>();
	}
};
DUMPER7_ASSERTS_ARockVehicle;

// Class RockVehicleRuntime.RockVehicleAbility
// 0x0010 (0x00B0 - 0x00A0)
class URockVehicleAbility : public UActorComponent
{
public:
	class ARockVehicle*                           Vehicle;                                           // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         ActiveSeconds;                                     // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         LastDeactivationTimeSeconds;                       // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	float GetActiveSeconds() const;
	float GetInactiveSeconds() const;
	class ARockVehicle* GetVehicle() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RockVehicleAbility")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RockVehicleAbility")
	}
	static class URockVehicleAbility* GetDefaultObj()
	{
		return GetDefaultObjImpl<URockVehicleAbility>();
	}
};
DUMPER7_ASSERTS_URockVehicleAbility;

// Class RockVehicleRuntime.RockVehicleAbility_Physics
// 0x0058 (0x0108 - 0x00B0)
class URockVehicleAbility_Physics : public URockVehicleAbility
{
public:
	bool                                          bShouldStayActive;                                 // 0x00B0(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortAthenaVehicleInputState           InputState;                                        // 0x00B8(0x0040)(Transient, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_F8[0x10];                                      // 0x00F8(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RockVehicleAbility_Physics")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RockVehicleAbility_Physics")
	}
	static class URockVehicleAbility_Physics* GetDefaultObj()
	{
		return GetDefaultObjImpl<URockVehicleAbility_Physics>();
	}
};
DUMPER7_ASSERTS_URockVehicleAbility_Physics;

// Class RockVehicleRuntime.RockVehicleAbility_AirControl
// 0x0060 (0x0168 - 0x0108)
class URockVehicleAbility_AirControl final : public URockVehicleAbility_Physics
{
public:
	uint8                                         Pad_108[0x18];                                     // 0x0108(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                TorqueAccel;                                       // 0x0120(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                TorqueDamping;                                     // 0x0138(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DisableForDodgeTime;                               // 0x0150(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAnyWheelsOnGround;                                // 0x0154(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bDodgeActive;                                      // 0x0155(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bAutoUprightActive;                                // 0x0156(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_157[0x1];                                      // 0x0157(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class URockVehicleAbility_Dodge*              DodgeAbility;                                      // 0x0158(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class URockVehicleAbility_AutoUpright*        AutoUprightAbility;                                // 0x0160(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RockVehicleAbility_AirControl")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RockVehicleAbility_AirControl")
	}
	static class URockVehicleAbility_AirControl* GetDefaultObj()
	{
		return GetDefaultObjImpl<URockVehicleAbility_AirControl>();
	}
};
DUMPER7_ASSERTS_URockVehicleAbility_AirControl;

// Class RockVehicleRuntime.RockVehicleAbility_AutoUpright
// 0x0108 (0x0210 - 0x0108)
class URockVehicleAbility_AutoUpright final : public URockVehicleAbility_Physics
{
public:
	uint8                                         Pad_108[0x18];                                     // 0x0108(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRockScalableFloat                     RollTorque;                                        // 0x0120(0x0030)(Edit, BlueprintVisible, Protected, NativeAccessSpecifierProtected)
	struct FRockScalableFloat                     PitchTorque;                                       // 0x0150(0x0030)(Edit, BlueprintVisible, Protected, NativeAccessSpecifierProtected)
	struct FRockScalableFloat                     PushForce;                                         // 0x0180(0x0030)(Edit, BlueprintVisible, Protected, NativeAccessSpecifierProtected)
	struct FRockScalableFloat                     MinActiveSeconds;                                  // 0x01B0(0x0030)(Edit, BlueprintVisible, Protected, NativeAccessSpecifierProtected)
	class URockVehicleAbility_Dodge*              DodgeAbility;                                      // 0x01E0(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         LastWorldContactFrame;                             // 0x01E8(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1EC[0x4];                                      // 0x01EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                LastContactNormal;                                 // 0x01F0(0x0018)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bWheelsOnGround;                                   // 0x0208(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bAnyWheelsOnGround;                                // 0x0209(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bDodgeActive;                                      // 0x020A(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bBodyContact;                                      // 0x020B(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         TimeSinceLastBodyContact;                          // 0x020C(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RockVehicleAbility_AutoUpright")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RockVehicleAbility_AutoUpright")
	}
	static class URockVehicleAbility_AutoUpright* GetDefaultObj()
	{
		return GetDefaultObjImpl<URockVehicleAbility_AutoUpright>();
	}
};
DUMPER7_ASSERTS_URockVehicleAbility_AutoUpright;

// Class RockVehicleRuntime.RockVehicleAbility_Boost
// 0x0068 (0x0170 - 0x0108)
class URockVehicleAbility_Boost final : public URockVehicleAbility_Physics
{
public:
	uint8                                         Pad_108[0x18];                                     // 0x0108(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRockScalableFloat                     BoostAccel;                                        // 0x0120(0x0030)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnBoostFailed;                                     // 0x0150(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class URockVehicleBoostTank*                  BoostTank;                                         // 0x0160(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bHasBoost;                                         // 0x0168(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RockVehicleAbility_Boost")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RockVehicleAbility_Boost")
	}
	static class URockVehicleAbility_Boost* GetDefaultObj()
	{
		return GetDefaultObjImpl<URockVehicleAbility_Boost>();
	}
};
DUMPER7_ASSERTS_URockVehicleAbility_Boost;

// Class RockVehicleRuntime.RockVehicleBoostTank
// 0x0088 (0x0128 - 0x00A0)
class URockVehicleBoostTank final : public UActorComponent
{
public:
	TMulticastInlineDelegate<void(float DeltaSeconds)> OnSecondsChanged;                             // 0x00A0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	struct FRockScalableFloat                     StartSeconds;                                      // 0x00B0(0x0030)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FRockScalableFloat                     MaxSeconds;                                        // 0x00E0(0x0030)(Edit, BlueprintVisible, Net, NativeAccessSpecifierPublic)
	ERockBoostLogic                               BoostLogic;                                        // 0x0110(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_111[0x3];                                      // 0x0111(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         BoostRechargeRate;                                 // 0x0114(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BoostRechargeDelay;                                // 0x0118(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SecondsRemaining;                                  // 0x011C(0x0004)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_120[0x8];                                      // 0x0120(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void GiveBoost(float Seconds);
	void OnRep_SecondsRemaining(float PrevValue);

	float GetMaxBoostInSeconds() const;
	float GetPercentRemaining() const;
	bool HasBoost() const;
	bool IsBoostFull() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RockVehicleBoostTank")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RockVehicleBoostTank")
	}
	static class URockVehicleBoostTank* GetDefaultObj()
	{
		return GetDefaultObjImpl<URockVehicleBoostTank>();
	}
};
DUMPER7_ASSERTS_URockVehicleBoostTank;

// Class RockVehicleRuntime.RockVehicleAbility_Dodge
// 0x0330 (0x0438 - 0x0108)
class URockVehicleAbility_Dodge final : public URockVehicleAbility_Physics
{
public:
	uint8                                         Pad_108[0x18];                                     // 0x0108(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRockDodgeImpulse                      ForwardImpulse;                                    // 0x0120(0x0060)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FRockDodgeImpulse                      BackwardImpulse;                                   // 0x0180(0x0060)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FRockDodgeImpulse                      SideImpulse;                                       // 0x01E0(0x0060)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FRockScalableFloat                     MinTimeAfterJump;                                  // 0x0240(0x0030)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FRockScalableFloat                     MinTorqueTime;                                     // 0x0270(0x0030)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FRockScalableFloat                     MaxTorqueTime;                                     // 0x02A0(0x0030)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FRockScalableFloat                     ForwardTorque;                                     // 0x02D0(0x0030)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FRockScalableFloat                     SideTorque;                                        // 0x0300(0x0030)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FRockScalableFloat                     ZLiftTime;                                         // 0x0330(0x0030)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FRockScalableFloat                     ZLiftAccel;                                        // 0x0360(0x0030)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FRockScalableFloat                     ZDampingTime;                                      // 0x0390(0x0030)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FRockScalableFloat                     ZDamping;                                          // 0x03C0(0x0030)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FRockScalableFloat                     InputThreshold;                                    // 0x03F0(0x0030)(NativeAccessSpecifierPublic)
	struct FVector2D                              DodgeInput;                                        // 0x0420(0x0010)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bWheelsOnGround;                                   // 0x0430(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_431[0x7];                                      // 0x0431(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RockVehicleAbility_Dodge")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RockVehicleAbility_Dodge")
	}
	static class URockVehicleAbility_Dodge* GetDefaultObj()
	{
		return GetDefaultObjImpl<URockVehicleAbility_Dodge>();
	}
};
DUMPER7_ASSERTS_URockVehicleAbility_Dodge;

// Class RockVehicleRuntime.RockVehicleAbility_DoubleJump
// 0x0050 (0x0158 - 0x0108)
class URockVehicleAbility_DoubleJump final : public URockVehicleAbility_Physics
{
public:
	uint8                                         Pad_108[0x18];                                     // 0x0108(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRockScalableFloat                     JumpVelocity;                                      // 0x0120(0x0030)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	class URockVehicleAbility_Jump*               JumpAbility;                                       // 0x0150(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RockVehicleAbility_DoubleJump")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RockVehicleAbility_DoubleJump")
	}
	static class URockVehicleAbility_DoubleJump* GetDefaultObj()
	{
		return GetDefaultObjImpl<URockVehicleAbility_DoubleJump>();
	}
};
DUMPER7_ASSERTS_URockVehicleAbility_DoubleJump;

// Class RockVehicleRuntime.RockVehicleAbility_Flip
// 0x00E8 (0x01F0 - 0x0108)
class URockVehicleAbility_Flip final : public URockVehicleAbility_Physics
{
public:
	uint8                                         Pad_108[0x18];                                     // 0x0108(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRockScalableFloat                     Impulse;                                           // 0x0120(0x0030)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FRockScalableFloat                     Torque;                                            // 0x0150(0x0030)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FRockScalableFloat                     duration;                                          // 0x0180(0x0030)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FRockScalableFloat                     ContactNormalThresholdDegrees;                     // 0x01B0(0x0030)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	bool                                          bWheelsOnGround;                                   // 0x01E0(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1E1[0xF];                                      // 0x01E1(0x000F)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RockVehicleAbility_Flip")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RockVehicleAbility_Flip")
	}
	static class URockVehicleAbility_Flip* GetDefaultObj()
	{
		return GetDefaultObjImpl<URockVehicleAbility_Flip>();
	}
};
DUMPER7_ASSERTS_URockVehicleAbility_Flip;

// Class RockVehicleRuntime.RockVehicleAbility_GroundTrails
// 0x0058 (0x0108 - 0x00B0)
class URockVehicleAbility_GroundTrails final : public URockVehicleAbility
{
public:
	struct FGroundTrailsMap                       GroundTrailsMap;                                   // 0x00B0(0x0018)(Edit, Protected, NativeAccessSpecifierProtected)
	TArray<class FName>                           GroundTrailSockets;                                // 0x00C8(0x0010)(Edit, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	class UNiagaraSystem*                         HandbrakeSystem;                                   // 0x00D8(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UNiagaraComponent*>              GroundTrailComponents;                             // 0x00E0(0x0010)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TArray<class UNiagaraComponent*>              HandbrakeComponents;                               // 0x00F0(0x0010)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	uint8                                         Pad_100[0x8];                                      // 0x0100(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnSurfaceChanged(EPhysicalSurface NewSurface);
	void SetEnabled(bool bValue);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RockVehicleAbility_GroundTrails")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RockVehicleAbility_GroundTrails")
	}
	static class URockVehicleAbility_GroundTrails* GetDefaultObj()
	{
		return GetDefaultObjImpl<URockVehicleAbility_GroundTrails>();
	}
};
DUMPER7_ASSERTS_URockVehicleAbility_GroundTrails;

// Class RockVehicleRuntime.RockVehicleAbility_Jump
// 0x00D8 (0x01E0 - 0x0108)
class URockVehicleAbility_Jump final : public URockVehicleAbility_Physics
{
public:
	uint8                                         Pad_108[0x18];                                     // 0x0108(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRockScalableFloat                     JumpVelocity;                                      // 0x0120(0x0030)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FRockScalableFloat                     JumpAccel;                                         // 0x0150(0x0030)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FRockScalableFloat                     MinJumpSeconds;                                    // 0x0180(0x0030)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FRockScalableFloat                     MaxJumpSeconds;                                    // 0x01B0(0x0030)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RockVehicleAbility_Jump")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RockVehicleAbility_Jump")
	}
	static class URockVehicleAbility_Jump* GetDefaultObj()
	{
		return GetDefaultObjImpl<URockVehicleAbility_Jump>();
	}
};
DUMPER7_ASSERTS_URockVehicleAbility_Jump;

// Class RockVehicleRuntime.RockVehicleAbility_StickyWheels
// 0x0098 (0x01A0 - 0x0108)
class URockVehicleAbility_StickyWheels final : public URockVehicleAbility_Physics
{
public:
	uint8                                         Pad_108[0x18];                                     // 0x0108(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRockScalableFloat                     StickyForceScaleGround;                            // 0x0120(0x0030)(Edit, BlueprintVisible, Protected, NativeAccessSpecifierProtected)
	struct FRockScalableFloat                     StickyForceScaleWall;                              // 0x0150(0x0030)(Edit, BlueprintVisible, Protected, NativeAccessSpecifierProtected)
	struct FVector                                ContactNormal;                                     // 0x0180(0x0018)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         Scale;                                             // 0x0198(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bAnyWheelsOnGround;                                // 0x019C(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_19D[0x3];                                      // 0x019D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RockVehicleAbility_StickyWheels")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RockVehicleAbility_StickyWheels")
	}
	static class URockVehicleAbility_StickyWheels* GetDefaultObj()
	{
		return GetDefaultObjImpl<URockVehicleAbility_StickyWheels>();
	}
};
DUMPER7_ASSERTS_URockVehicleAbility_StickyWheels;

// Class RockVehicleRuntime.RockVehicleAbility_Supersonic
// 0x00C8 (0x0178 - 0x00B0)
class URockVehicleAbility_Supersonic final : public URockVehicleAbility
{
public:
	TMulticastInlineDelegate<void()>              OnTrailsActivate;                                  // 0x00B0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnTrailsDeactivate;                                // 0x00C0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	struct FRockScalableFloat                     TurnOffTime;                                       // 0x00D0(0x0030)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FRockScalableFloat                     TurnOnTime;                                        // 0x0100(0x0030)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	bool                                          bUseTurnOnTimeRequirement;                         // 0x0130(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRockScalableFloat                     TurnOffSpeedBuffer;                                // 0x0138(0x0030)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	float                                         TimeBelowSupersonic;                               // 0x0168(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         WorldTimeSupersonicExceeded;                       // 0x016C(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_170[0x8];                                      // 0x0170(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RockVehicleAbility_Supersonic")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RockVehicleAbility_Supersonic")
	}
	static class URockVehicleAbility_Supersonic* GetDefaultObj()
	{
		return GetDefaultObjImpl<URockVehicleAbility_Supersonic>();
	}
};
DUMPER7_ASSERTS_URockVehicleAbility_Supersonic;

// Class RockVehicleRuntime.RockVehicleAnalyticsComponent
// 0x0038 (0x00D8 - 0x00A0)
class URockVehicleAnalyticsComponent final : public UActorComponent
{
public:
	uint8                                         Pad_A0[0x8];                                       // 0x00A0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRockVehicleAnalyticsSession           CurrentSession;                                    // 0x00A8(0x0028)(Transient, NoDestructor, NativeAccessSpecifierPrivate)
	class ARockVehicle*                           Vehicle;                                           // 0x00D0(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnDodged(class UActorComponent* InComp, bool bInReset);
	void OnDoubleJumped(class UActorComponent* InComp, bool bInReset);
	void OnJumped(class UActorComponent* InComp, bool bInReset);
	void OnPawnEnteredSeat(const TScriptInterface<class IFortVehicleInterface>& InVehicle, class AFortPawn* InPlayerPawn, int32 InSeatIndex);
	void OnPawnExitedSeat(const TScriptInterface<class IFortVehicleInterface>& InVehicle, class AFortPawn* InPlayerPawn, int32 InSeatIndex);
	void OnSupersonicEnd(class UActorComponent* InComp);
	void OnSupersonicStart(class UActorComponent* InComp, bool bInReset);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RockVehicleAnalyticsComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RockVehicleAnalyticsComponent")
	}
	static class URockVehicleAnalyticsComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<URockVehicleAnalyticsComponent>();
	}
};
DUMPER7_ASSERTS_URockVehicleAnalyticsComponent;

// Class RockVehicleRuntime.RockVehicleAnimInstance
// 0x0180 (0x07A0 - 0x0620)
class URockVehicleAnimInstance final : public UFortVehicleAnimInstance
{
public:
	struct FBouncyChassisState                    BouncyChassis;                                     // 0x0618(0x000C)(BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	struct FRockVehicleWheelAnimInfo              WheelInfoFR;                                       // 0x0624(0x0014)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FRockVehicleWheelAnimInfo              WheelInfoFL;                                       // 0x0638(0x0014)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FRockVehicleWheelAnimInfo              WheelInfoBR;                                       // 0x064C(0x0014)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FRockVehicleWheelAnimInfo              WheelInfoBL;                                       // 0x0660(0x0014)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	float                                         WheelLerpSpeed;                                    // 0x0674(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_678[0x128];                                    // 0x0678(0x0128)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RockVehicleAnimInstance")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RockVehicleAnimInstance")
	}
	static class URockVehicleAnimInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<URockVehicleAnimInstance>();
	}
};
DUMPER7_ASSERTS_URockVehicleAnimInstance;

// Class RockVehicleRuntime.RockVehicleAudioController
// 0x00F0 (0x03F0 - 0x0300)
class ARockVehicleAudioController final : public AFortVehicleAudioController
{
public:
	struct FRuntimeFloatCurve                     SideSpeedToSkidVolume;                             // 0x0300(0x0088)(Edit, NativeAccessSpecifierPublic)
	float                                         SurfaceTypeInterpSpeed;                            // 0x0388(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_38C[0x4];                                      // 0x038C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        TireSurfaceComponent;                              // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAudioComponent*                        AirLoopComponent;                                  // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAudioComponent*                        SuperSonicComponent;                               // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInWater;                                          // 0x03A8(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3A9[0x7];                                      // 0x03A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioMotorModelComponent*              MotorModel;                                        // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class ARockVehicle*                           CachedVehicle;                                     // 0x03B8(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3C0[0x30];                                     // 0x03C0(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnInAirUpdated(const bool bNewInAir);
	void SetBoosting(const bool bNewBoosting);
	void SetSurfaceTypeParam(const float NewSurfaceParam);

	class UAudioMotorModelComponent* GetMotorSimComponent() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RockVehicleAudioController")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RockVehicleAudioController")
	}
	static class ARockVehicleAudioController* GetDefaultObj()
	{
		return GetDefaultObjImpl<ARockVehicleAudioController>();
	}
};
DUMPER7_ASSERTS_ARockVehicleAudioController;

// Class RockVehicleRuntime.RockVehicleCameraMode
// 0x0200 (0x1DC0 - 0x1BC0)
class URockVehicleCameraMode final : public UFortCameraMode_AthenaVehicle
{
public:
	float                                         SwivelPitchMax;                                    // 0x1BB8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SwivelYawMax;                                      // 0x1BBC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         GroundNormalInterpRate;                            // 0x1BC0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         GroundNormalAirInterpRate;                         // 0x1BC4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         GroundYawRate;                                     // 0x1BC8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         WallYawRate;                                       // 0x1BCC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InterpToGroundTime;                                // 0x1BD0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InterpToAirTime;                                   // 0x1BD4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AverageVelocityInterpRate;                         // 0x1BD8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1BDC[0x4];                                     // 0x1BDC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRuntimeFloatCurve                     AirRotationInterpRateForSpeed;                     // 0x1BE0(0x0088)(Edit, BlueprintVisible, Config, NativeAccessSpecifierPublic)
	float                                         FocusOffsetInterpRate;                             // 0x1C68(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DistanceSpeedScale;                                // 0x1C6C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DistanceOffsetMin;                                 // 0x1C70(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DistanceOffsetMax;                                 // 0x1C74(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DistanceInterpRate;                                // 0x1C78(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxSpeedFOVOffset;                                 // 0x1C7C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SupersonicFOVOffset;                               // 0x1C80(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FOVInterpRate;                                     // 0x1C84(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRockCameraSettings                    CameraSettings;                                    // 0x1C88(0x001C)(Edit, BlueprintVisible, BlueprintReadOnly, Config, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_1CA4[0x4];                                     // 0x1CA4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ARockVehicle*                           VehicleTarget;                                     // 0x1CA8(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class URockVehicleAbility_Jump*               JumpAbility;                                       // 0x1CB0(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1CB8[0x108];                                   // 0x1CB8(0x0108)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RockVehicleCameraMode")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RockVehicleCameraMode")
	}
	static class URockVehicleCameraMode* GetDefaultObj()
	{
		return GetDefaultObjImpl<URockVehicleCameraMode>();
	}
};
DUMPER7_ASSERTS_URockVehicleCameraMode;

// Class RockVehicleRuntime.RockVehicleConfigs
// 0x0608 (0x0F50 - 0x0948)
class URockVehicleConfigs final : public UFortPhysicsVehicleConfigs
{
public:
	struct FRockVehicleAxleConfig                 FrontAxle;                                         // 0x0948(0x0034)(Edit, BlueprintVisible, Config, NoDestructor, NativeAccessSpecifierPublic)
	struct FRockVehicleAxleConfig                 BackAxle;                                          // 0x097C(0x0034)(Edit, BlueprintVisible, Config, NoDestructor, NativeAccessSpecifierPublic)
	struct FRockVehicleDriveConfig                Drive;                                             // 0x09B0(0x0510)(Edit, BlueprintVisible, Config, NativeAccessSpecifierPublic)
	struct FRockVehicleDemoConfig                 DemolitionConfiguration;                           // 0x0EC0(0x0028)(Edit, BlueprintVisible, Config, NativeAccessSpecifierPublic)
	struct FRockScalableFloat                     MaxLinearSpeed;                                    // 0x0EE8(0x0030)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FRockScalableFloat                     SupersonicSpeed;                                   // 0x0F18(0x0030)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	float                                         MaxAngularSpeed;                                   // 0x0F48(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SafeBuildingLandingDegrees;                        // 0x0F4C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RockVehicleConfigs")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RockVehicleConfigs")
	}
	static class URockVehicleConfigs* GetDefaultObj()
	{
		return GetDefaultObjImpl<URockVehicleConfigs>();
	}
};
DUMPER7_ASSERTS_URockVehicleConfigs;

// Class RockVehicleRuntime.RockVehicleManager
// 0x0020 (0x02B0 - 0x0290)
class ARockVehicleManager final : public AActor
{
public:
	uint8                                         Pad_290[0x10];                                     // 0x0290(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ARockVehicle*>                   RockVehicles;                                      // 0x02A0(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RockVehicleManager")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RockVehicleManager")
	}
	static class ARockVehicleManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<ARockVehicleManager>();
	}
};
DUMPER7_ASSERTS_ARockVehicleManager;

// Class RockVehicleRuntime.RockVehicleWorldSubsystem
// 0x0008 (0x0038 - 0x0030)
class URockVehicleWorldSubsystem final : public UWorldSubsystem
{
public:
	class ARockVehicleManager*                    VehicleManager;                                    // 0x0030(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RockVehicleWorldSubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RockVehicleWorldSubsystem")
	}
	static class URockVehicleWorldSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<URockVehicleWorldSubsystem>();
	}
};
DUMPER7_ASSERTS_URockVehicleWorldSubsystem;

// Class RockVehicleRuntime.StreamingRadioPlayerComponent_Rock
// 0x0000 (0x0478 - 0x0478)
class UStreamingRadioPlayerComponent_Rock : public UStreamingRadioPlayerComponent
{
public:
	void VehicleExploded(const class AController* LastDamageInstigator, class AFortAthenaVehicle* Vehicle);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("StreamingRadioPlayerComponent_Rock")
	}
	static const class FName& StaticName()
	{
