#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S18_PlayerBattlePassXpAndReward

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass S18_PlayerBattlePassXpAndReward.S18_PlayerBattlePassXpAndReward_C
// 0x0030 (0x0318 - 0x02E8)
class US18_PlayerBattlePassXpAndReward_C final : public UFortSeasonDataWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Collapse;                                          // 0x02F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_RaceTrack;                                   // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   RichText_CurrentLevel;                             // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   RichText_Level;                                    // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         Max_BPLevel_for_Rewards;                           // 0x0310(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Update_Text();
	void SetCollapsedMode(bool IsCollapsed);
	void OnSuperCharged();
	void OnProgressUpdated();
	void OnLevelChanged();
	void ExecuteUbergraph_S18_PlayerBattlePassXpAndReward(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("S18_PlayerBattlePassXpAndReward_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"S18_PlayerBattlePassXpAndReward_C")
	}
	static class US18_PlayerBattlePassXpAndReward_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<US18_PlayerBattlePassXpAndReward_C>();
	}
};
DUMPER7_ASSERTS_US18_PlayerBattlePassXpAndReward_C;

}

