#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ScoutDroneUI

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "ScoutDroneRuntime_structs.hpp"


namespace SDK::Params
{

// Function ScoutDroneUI.DronePickUpIndicatorComponent.Init
// 0x0008 (0x0008 - 0x0000)
struct DronePickUpIndicatorComponent_Init final
{
public:
	class AFortScoutDrone*                        Drone;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DronePickUpIndicatorComponent_Init;

// Function ScoutDroneUI.DronePickUpIndicatorComponent.OnDroneDestroyed
// 0x0008 (0x0008 - 0x0000)
struct DronePickUpIndicatorComponent_OnDroneDestroyed final
{
public:
	class AActor*                                 DestroyedActor;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DronePickUpIndicatorComponent_OnDroneDestroyed;

// Function ScoutDroneUI.ScoutDroneHUD.GetTargetConfirmationTime
// 0x0004 (0x0004 - 0x0000)
struct ScoutDroneHUD_GetTargetConfirmationTime final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ScoutDroneHUD_GetTargetConfirmationTime;

// Function ScoutDroneUI.ScoutDroneHUD.OnDroneEnergyChanged
// 0x0004 (0x0004 - 0x0000)
struct ScoutDroneHUD_OnDroneEnergyChanged final
{
public:
	float                                         EnergyPercentage;                                  // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ScoutDroneHUD_OnDroneEnergyChanged;

// Function ScoutDroneUI.ScoutDroneHUD.OnDroneHealthUpdated
// 0x0008 (0x0008 - 0x0000)
struct ScoutDroneHUD_OnDroneHealthUpdated final
{
public:
	float                                         HealthPercentage;                                  // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CurrentHealth;                                     // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ScoutDroneHUD_OnDroneHealthUpdated;

// Function ScoutDroneUI.ScoutDroneHUD.OnDroneSignalDataUpdated
// 0x0008 (0x0008 - 0x0000)
struct ScoutDroneHUD_OnDroneSignalDataUpdated final
{
public:
	float                                         DistanceFromPlayer;                                // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SignalPercentage;                                  // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ScoutDroneHUD_OnDroneSignalDataUpdated;

// Function ScoutDroneUI.ScoutDroneHUD.OnReticleChangeAbilityActivated
// 0x0004 (0x0004 - 0x0000)
struct ScoutDroneHUD_OnReticleChangeAbilityActivated final
{
public:
	struct FGameplayTag                           UpdatedTag;                                        // 0x0000(0x0004)(ConstParm, Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ScoutDroneHUD_OnReticleChangeAbilityActivated;

// Function ScoutDroneUI.ScoutDroneHUD.OnTargetingStatusChanged
// 0x0008 (0x0008 - 0x0000)
struct ScoutDroneHUD_OnTargetingStatusChanged final
{
public:
	struct FScoutDroneStatusData                  StatusData;                                        // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ScoutDroneHUD_OnTargetingStatusChanged;

// Function ScoutDroneUI.ScoutDroneHUD.GetControlledDrone
// 0x0008 (0x0008 - 0x0000)
struct ScoutDroneHUD_GetControlledDrone final
{
public:
	class AFortScoutDrone*                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ScoutDroneHUD_GetControlledDrone;

// Function ScoutDroneUI.ScoutDroneTetherIndicator.BP_WhileInWarningRange
// 0x0004 (0x0004 - 0x0000)
struct ScoutDroneTetherIndicator_BP_WhileInWarningRange final
{
public:
	float                                         SignalIntensityPercentage;                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ScoutDroneTetherIndicator_BP_WhileInWarningRange;

// Function ScoutDroneUI.ScoutDroneTetherIndicator.GetControlledDrone
// 0x0008 (0x0008 - 0x0000)
struct ScoutDroneTetherIndicator_GetControlledDrone final
{
public:
	class AFortScoutDrone*                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ScoutDroneTetherIndicator_GetControlledDrone;

}

