#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SidebarVRRVoiceChatDeactivated

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function SidebarVRRVoiceChatDeactivated.SidebarVRRVoiceChatDeactivated_C.UpdateText
// 0x0060 (0x0060 - 0x0000)
struct SidebarVRRVoiceChatDeactivated_C_UpdateText final
{
public:
	class FText                                   Title;                                             // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FText                                   Description;                                       // 0x0018(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FText                                   ButtonText;                                        // 0x0030(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FText                                   ButtonSecText;                                     // 0x0048(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
DUMPER7_ASSERTS_SidebarVRRVoiceChatDeactivated_C_UpdateText;

// Function SidebarVRRVoiceChatDeactivated.SidebarVRRVoiceChatDeactivated_C.ExecuteUbergraph_SidebarVRRVoiceChatDeactivated
// 0x00E8 (0x00E8 - 0x0000)
struct SidebarVRRVoiceChatDeactivated_C_ExecuteUbergraph_SidebarVRRVoiceChatDeactivated final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              CallFunc_GetPaintSpaceGeometry_ReturnValue;        // 0x0004(0x0038)(ConstParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_1;               // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetLocalSize_ReturnValue;                 // 0x0048(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X;                          // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Event_Title;                                // 0x0078(0x0018)(ConstParm)
	class FText                                   K2Node_Event_Description;                          // 0x0090(0x0018)(ConstParm)
	class FText                                   K2Node_Event_ButtonText;                           // 0x00A8(0x0018)(ConstParm)
	class FText                                   K2Node_Event_ButtonSecText;                        // 0x00C0(0x0018)(ConstParm)
	class AFortPlayerController*                  CallFunc_GetFirstLocalFortPlayerController_ReturnValue; // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInSplitscreen_ReturnValue;              // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_SidebarVRRVoiceChatDeactivated_C_ExecuteUbergraph_SidebarVRRVoiceChatDeactivated;

// Function SidebarVRRVoiceChatDeactivated.SidebarVRRVoiceChatDeactivated_C.BndEvt__SidebarVRRVoiceChatDeactivated_WBP_UIKit_Button_Regular_Sec_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct SidebarVRRVoiceChatDeactivated_C_BndEvt__SidebarVRRVoiceChatDeactivated_WBP_UIKit_Button_Regular_Sec_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_SidebarVRRVoiceChatDeactivated_C_BndEvt__SidebarVRRVoiceChatDeactivated_WBP_UIKit_Button_Regular_Sec_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature;

// Function SidebarVRRVoiceChatDeactivated.SidebarVRRVoiceChatDeactivated_C.BndEvt__SidebarVRRVoiceChatDeactivated_WBP_UIKit_Button_Regular_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct SidebarVRRVoiceChatDeactivated_C_BndEvt__SidebarVRRVoiceChatDeactivated_WBP_UIKit_Button_Regular_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_SidebarVRRVoiceChatDeactivated_C_BndEvt__SidebarVRRVoiceChatDeactivated_WBP_UIKit_Button_Regular_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature;

}

