#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SidebarRight

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SidebarRight.SidebarRight_C
// 0x00A8 (0x0790 - 0x06E8)
class USidebarRight_C final : public UFortSocialPanelView_Sidebar
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USidebarProfile_C*                      Panel_Profile;                                     // 0x06F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone;                                          // 0x06F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              Safezone_OnboardingTooltip;                        // 0x0700(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_SideBar;                                  // 0x0708(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USidebarOnboardingLookingForPartyRight_C* SidebarOnboardingLookingForPartyRight;           // 0x0710(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USidebarOnboardingTagsEditTooltipRight_C* SidebarOnboardingTagsEditTooltipRight;           // 0x0718(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USiderbarSupervisedSettingsTooltipRight_C* SiderbarSupervisedSettingsTooltipRight;         // 0x0720(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CaptureForPostBufferUpdate_C*      WBP_CaptureForPostBufferUpdate;                    // 0x0728(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   Text_PartyUp;                                      // 0x0730(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   Text_FindFriends;                                  // 0x0748(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   Text_VoiceChat;                                    // 0x0760(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   Text_UserSettings;                                 // 0x0778(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_SidebarRight(int32 EntryPoint);
	void BP_OnActivated();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("SidebarRight_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SidebarRight_C")
	}
	static class USidebarRight_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USidebarRight_C>();
	}
};
DUMPER7_ASSERTS_USidebarRight_C;

}

