#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SidebarExitPopupRight

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonInput_structs.hpp"
#include "UMG_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SidebarExitPopupRight.SidebarExitPopupRight_C
// 0x00D8 (0x05B8 - 0x04E0)
class USidebarExitPopupRight_C final : public UFortSidebarExitPopup
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                Border_SpacingMobile;                              // 0x04E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_Favorite;                                  // 0x04F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_SAC;                                       // 0x04F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone;                                          // 0x0500(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_AreYouSure;                                   // 0x0508(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CaptureForPostBufferUpdate_C*      WBP_CaptureForPostBufferUpdate;                    // 0x0510(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   LogoutAllowedNoButtonsText;                        // 0x0518(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   LogoutAndQuitNotAllowedNoButtonsText;              // 0x0530(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   QuitAllowedNoButtonsText;                          // 0x0548(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          Is_A;                                              // 0x0560(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_561[0x7];                                      // 0x0561(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   LeaveExperienceConfirmationMessageText;            // 0x0568(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   LogoutConfirmationMessageText;                     // 0x0580(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   ExitConfirmationMessageText;                       // 0x0598(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class USoundBase*                             AreYouSureWhoosh;                                  // 0x05B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void UpdateNoEnabledButtonsText(const bool bAllowLogout, const bool bAllowQuit);
	void RefreshButtonsVisual(bool IsTouch);
	void OnInputMethodChanged(ECommonInputType NewInputType);
	void OnButtonBaseClicked_Event(class UCommonButtonBase* Button);
	void ExecuteUbergraph_SidebarExitPopupRight(int32 EntryPoint);
	void Construct();
	void BndEvt__SidebarExitPopup_Button_Yes_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__SidebarExitPopup_Button_Yes_K2Node_ComponentBoundEvent_10_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__SidebarExitPopup_Button_No_K2Node_ComponentBoundEvent_9_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__SidebarExitPopup_Button_No_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__SidebarExitPopup_Button_Logout_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__SidebarExitPopup_Button_LeaveExperience_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__SidebarExitPopup_Button_ExitGame_K2Node_ComponentBoundEvent_8_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("SidebarExitPopupRight_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SidebarExitPopupRight_C")
	}
	static class USidebarExitPopupRight_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USidebarExitPopupRight_C>();
	}
};
DUMPER7_ASSERTS_USidebarExitPopupRight_C;

}

