#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Solaris

#include "Basic.hpp"

#include "Solaris_structs.hpp"
#include "VerseNative_structs.hpp"


namespace SDK::Params
{

// Function Solaris.SolarisWeakMapLibrary.Call
// 0x0058 (0x0058 - 0x0000)
struct SolarisWeakMapLibrary_Call final
{
public:
	TMap<struct FGenericKeyType, struct FGenericValueType> Map;                                      // 0x0000(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FGenericKeyType                        Key;                                               // 0x0050(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_SolarisWeakMapLibrary_Call;

// Function Solaris.SolarisWeakMapLibrary.CompletelyAssignedPersistentVarRefCall
// 0x0068 (0x0068 - 0x0000)
struct SolarisWeakMapLibrary_CompletelyAssignedPersistentVarRefCall final
{
public:
	class FString                                 Path;                                              // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<struct FGenericKeyType, struct FGenericValueType> Map;                                      // 0x0010(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FGenericKeyType                        Key;                                               // 0x0060(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_SolarisWeakMapLibrary_CompletelyAssignedPersistentVarRefCall;

// Function Solaris.SolarisWeakMapLibrary.CompletelyAssignedRefCall
// 0x0058 (0x0058 - 0x0000)
struct SolarisWeakMapLibrary_CompletelyAssignedRefCall final
{
public:
	TMap<struct FGenericKeyType, struct FGenericValueType> Map;                                      // 0x0000(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FGenericKeyType                        Key;                                               // 0x0050(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_SolarisWeakMapLibrary_CompletelyAssignedRefCall;

// Function Solaris.SolarisWeakMapLibrary.FitsInPlayerMap
// 0x0001 (0x0001 - 0x0000)
struct SolarisWeakMapLibrary_FitsInPlayerMap final
{
public:
	struct FGenericValueType                      Value;                                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SolarisWeakMapLibrary_FitsInPlayerMap;

// Function Solaris.SolarisWeakMapLibrary.PersistentVarCall
// 0x0058 (0x0058 - 0x0000)
struct SolarisWeakMapLibrary_PersistentVarCall final
{
public:
	TMap<struct FGenericKeyType, struct FGenericValueType> Map;                                      // 0x0000(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FGenericKeyType                        Key;                                               // 0x0050(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_SolarisWeakMapLibrary_PersistentVarCall;

// Function Solaris.SolarisWeakMapLibrary.PersistentVarRefCall
// 0x0068 (0x0068 - 0x0000)
struct SolarisWeakMapLibrary_PersistentVarRefCall final
{
public:
	class FString                                 Path;                                              // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<struct FGenericKeyType, struct FGenericValueType> Map;                                      // 0x0010(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FGenericKeyType                        Key;                                               // 0x0060(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_SolarisWeakMapLibrary_PersistentVarRefCall;

// Function Solaris.SolarisWeakMapLibrary.RefCall
// 0x0058 (0x0058 - 0x0000)
struct SolarisWeakMapLibrary_RefCall final
{
public:
	TMap<struct FGenericKeyType, struct FGenericValueType> Map;                                      // 0x0000(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FGenericKeyType                        Key;                                               // 0x0050(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_SolarisWeakMapLibrary_RefCall;

// Function Solaris.SolarisWeakMapLibrary.Type
// 0x0010 (0x0010 - 0x0000)
struct SolarisWeakMapLibrary_Type final
{
public:
	class UClass*                                 KeyType;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UClass*                                 ValueType;                                         // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SolarisWeakMapLibrary_Type;

// Function Solaris.SolarisArrayLibrary.Add
// 0x0020 (0x0020 - 0x0000)
struct SolarisArrayLibrary_Add final
{
public:
	TArray<struct FGenericElementType>            Array;                                             // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	struct FGenericElementType                    new_item;                                          // 0x0010(0x0001)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SolarisArrayLibrary_Add;

// Function Solaris.SolarisArrayLibrary.Call
// 0x0018 (0x0018 - 0x0000)
struct SolarisArrayLibrary_Call final
{
public:
	TArray<struct FGenericElementType>            Array;                                             // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	int64                                         Index_0;                                           // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SolarisArrayLibrary_Call;

// Function Solaris.SolarisArrayLibrary.Concat
// 0x0030 (0x0030 - 0x0000)
struct SolarisArrayLibrary_Concat final
{
public:
	TArray<struct FGenericElementType>            LHS;                                               // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<struct FGenericElementType>            RHS;                                               // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<struct FGenericElementType>            ReturnValue;                                       // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SolarisArrayLibrary_Concat;

// Function Solaris.SolarisArrayLibrary.ConcatEquals
// 0x0030 (0x0030 - 0x0000)
struct SolarisArrayLibrary_ConcatEquals final
{
public:
	TArray<struct FGenericElementType>            LHS;                                               // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FGenericElementType>            RHS;                                               // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<struct FGenericElementType>            ReturnValue;                                       // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SolarisArrayLibrary_ConcatEquals;

// Function Solaris.SolarisArrayLibrary.Empty
// 0x0010 (0x0010 - 0x0000)
struct SolarisArrayLibrary_Empty final
{
public:
	TArray<struct FGenericElementType>            Array;                                             // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SolarisArrayLibrary_Empty;

// Function Solaris.SolarisArrayLibrary.Length
// 0x0018 (0x0018 - 0x0000)
struct SolarisArrayLibrary_Length final
{
public:
	TArray<struct FGenericElementType>            Array;                                             // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	int64                                         ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SolarisArrayLibrary_Length;

// Function Solaris.SolarisArrayLibrary.Move
// 0x0020 (0x0020 - 0x0000)
struct SolarisArrayLibrary_Move final
{
public:
	TArray<struct FGenericElementType>            Target;                                            // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<struct FGenericElementType>            Source;                                            // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SolarisArrayLibrary_Move;

// Function Solaris.SolarisArrayLibrary.RefCall
// 0x0018 (0x0018 - 0x0000)
struct SolarisArrayLibrary_RefCall final
{
public:
	TArray<struct FGenericElementType>            Array;                                             // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	int64                                         Index_0;                                           // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SolarisArrayLibrary_RefCall;

// Function Solaris.SolarisArrayLibrary.UnsafeCall
// 0x0018 (0x0018 - 0x0000)
struct SolarisArrayLibrary_UnsafeCall final
{
public:
	TArray<struct FGenericElementType>            Array;                                             // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	int64                                         Index_0;                                           // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SolarisArrayLibrary_UnsafeCall;

// Function Solaris.SolarisCoroutineLibrary.TaskCancel
// 0x0008 (0x0008 - 0x0000)
struct SolarisCoroutineLibrary_TaskCancel final
{
public:
	class UObject*                                task;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SolarisCoroutineLibrary_TaskCancel;

// Function Solaris.SolarisCoroutineLibrary.TaskFree
// 0x0008 (0x0008 - 0x0000)
struct SolarisCoroutineLibrary_TaskFree final
{
public:
	class UObject*                                task;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SolarisCoroutineLibrary_TaskFree;

// Function Solaris.SolarisCoroutineLibrary.TaskGetReturnProperty
// 0x0008 (0x0008 - 0x0000)
struct SolarisCoroutineLibrary_TaskGetReturnProperty final
{
public:
	class UObject*                                task;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SolarisCoroutineLibrary_TaskGetReturnProperty;

// Function Solaris.SolarisCoroutineLibrary.TaskGetState
// 0x0010 (0x0010 - 0x0000)
struct SolarisCoroutineLibrary_TaskGetState final
{
public:
	class UObject*                                task;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SolarisCoroutineLibrary_TaskGetState;

// Function Solaris.SolarisCoroutineLibrary.TaskMake
// 0x0030 (0x0030 - 0x0000)
struct SolarisCoroutineLibrary_TaskMake final
{
public:
	class UClass*                                 Type;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                Caller;                                            // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         CallerResumeState;                                 // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         CallerCancelState;                                 // 0x0018(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                OwnerInstance;                                     // 0x0020(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                ReturnValue;                                       // 0x0028(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SolarisCoroutineLibrary_TaskMake;

// Function Solaris.SolarisMapLibrary.Add
// 0x0058 (0x0058 - 0x0000)
struct SolarisMapLibrary_Add final
{
public:
	TMap<struct FGenericKeyType, struct FGenericValueType> Map;                                      // 0x0000(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FGenericKeyType                        Key;                                               // 0x0050(0x0001)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGenericValueType                      Value;                                             // 0x0051(0x0001)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_52[0x6];                                       // 0x0052(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_SolarisMapLibrary_Add;

// Function Solaris.SolarisMapLibrary.Concat
// 0x00F0 (0x00F0 - 0x0000)
struct SolarisMapLibrary_Concat final
{
public:
	TMap<struct FGenericKeyType, struct FGenericValueType> LHS;                                      // 0x0000(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TMap<struct FGenericKeyType, struct FGenericValueType> RHS;                                      // 0x0050(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TMap<struct FGenericKeyType, struct FGenericValueType> ReturnValue;                              // 0x00A0(0x0050)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SolarisMapLibrary_Concat;

// Function Solaris.SolarisMapLibrary.GetKeyByIndex
// 0x0060 (0x0060 - 0x0000)
struct SolarisMapLibrary_GetKeyByIndex final
{
public:
	TMap<struct FGenericKeyType, struct FGenericValueType> Map;                                      // 0x0000(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	int64                                         Index_0;                                           // 0x0050(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGenericKeyType                        ReturnValue;                                       // 0x0058(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_SolarisMapLibrary_GetKeyByIndex;

// Function Solaris.SolarisMapLibrary.GetNextValidIndex
// 0x0060 (0x0060 - 0x0000)
struct SolarisMapLibrary_GetNextValidIndex final
{
public:
	TMap<struct FGenericKeyType, struct FGenericValueType> Map;                                      // 0x0000(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	int64                                         InitialIndex;                                      // 0x0050(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         ReturnValue;                                       // 0x0058(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SolarisMapLibrary_GetNextValidIndex;

// Function Solaris.SolarisMapLibrary.GetValueByIndex
// 0x0060 (0x0060 - 0x0000)
struct SolarisMapLibrary_GetValueByIndex final
{
public:
	TMap<struct FGenericKeyType, struct FGenericValueType> Map;                                      // 0x0000(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	int64                                         Index_0;                                           // 0x0050(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGenericValueType                      ReturnValue;                                       // 0x0058(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_SolarisMapLibrary_GetValueByIndex;

// Function Solaris.SolarisMapLibrary.InitMap
// 0x0050 (0x0050 - 0x0000)
struct SolarisMapLibrary_InitMap final
{
public:
	TMap<struct FGenericKeyType, struct FGenericValueType> Map;                                      // 0x0000(0x0050)(Parm, OutParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SolarisMapLibrary_InitMap;

// Function Solaris.SolarisMapLibrary.Length
// 0x0058 (0x0058 - 0x0000)
struct SolarisMapLibrary_Length final
{
public:
	TMap<struct FGenericKeyType, struct FGenericValueType> Map;                                      // 0x0000(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	int64                                         ReturnValue;                                       // 0x0050(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SolarisMapLibrary_Length;

// Function Solaris.SolarisMapLibrary.Move
// 0x00A0 (0x00A0 - 0x0000)
struct SolarisMapLibrary_Move final
{
public:
	TMap<struct FGenericKeyType, struct FGenericValueType> Dest;                                     // 0x0000(0x0050)(Parm, OutParm, NativeAccessSpecifierPublic)
	TMap<struct FGenericKeyType, struct FGenericValueType> Src;                                      // 0x0050(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SolarisMapLibrary_Move;

// Function Solaris.SolarisMathLibrary_Int.abs
// 0x0008 (0x0008 - 0x0000)
struct SolarisMathLibrary_Int_abs final
{
public:
	int64                                         Value;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SolarisMathLibrary_Int_abs;

// Function Solaris.SolarisMathLibrary_Int.Add
// 0x0010 (0x0010 - 0x0000)
struct SolarisMathLibrary_Int_Add final
{
public:
	int64                                         LHS;                                               // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         RHS;                                               // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SolarisMathLibrary_Int_Add;

// Function Solaris.SolarisMathLibrary_Int.AddEquals
// 0x0010 (0x0010 - 0x0000)
struct SolarisMathLibrary_Int_AddEquals final
{
public:
	int64                                         LHS;                                               // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         RHS;                                               // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SolarisMathLibrary_Int_AddEquals;

// Function Solaris.SolarisMathLibrary_Int.CheckConstrainedInt
// 0x0018 (0x0018 - 0x0000)
struct SolarisMathLibrary_Int_CheckConstrainedInt final
{
public:
	int64                                         Min;                                               // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         Max;                                               // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         Value;                                             // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SolarisMathLibrary_Int_CheckConstrainedInt;

// Function Solaris.SolarisMathLibrary_Int.Divide
// 0x0010 (0x0010 - 0x0000)
struct SolarisMathLibrary_Int_Divide final
{
public:
	int64                                         LHS;                                               // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         RHS;                                               // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SolarisMathLibrary_Int_Divide;

// Function Solaris.SolarisMathLibrary_Int.Greater
// 0x0010 (0x0010 - 0x0000)
struct SolarisMathLibrary_Int_Greater final
{
public:
	int64                                         LHS;                                               // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         RHS;                                               // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SolarisMathLibrary_Int_Greater;

// Function Solaris.SolarisMathLibrary_Int.GreaterEqual
// 0x0010 (0x0010 - 0x0000)
struct SolarisMathLibrary_Int_GreaterEqual final
{
public:
	int64                                         LHS;                                               // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         RHS;                                               // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SolarisMathLibrary_Int_GreaterEqual;

// Function Solaris.SolarisMathLibrary_Int.Less
// 0x0010 (0x0010 - 0x0000)
struct SolarisMathLibrary_Int_Less final
{
public:
	int64                                         LHS;                                               // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         RHS;                                               // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SolarisMathLibrary_Int_Less;

// Function Solaris.SolarisMathLibrary_Int.LessEqual
// 0x0010 (0x0010 - 0x0000)
struct SolarisMathLibrary_Int_LessEqual final
{
public:
	int64                                         LHS;                                               // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         RHS;                                               // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SolarisMathLibrary_Int_LessEqual;

// Function Solaris.SolarisMathLibrary_Int.Multiply
// 0x0010 (0x0010 - 0x0000)
struct SolarisMathLibrary_Int_Multiply final
{
public:
	int64                                         LHS;                                               // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         RHS;                                               // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SolarisMathLibrary_Int_Multiply;

// Function Solaris.SolarisMathLibrary_Int.MultiplyEquals
// 0x0010 (0x0010 - 0x0000)
struct SolarisMathLibrary_Int_MultiplyEquals final
{
public:
	int64                                         LHS;                                               // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         RHS;                                               // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SolarisMathLibrary_Int_MultiplyEquals;

// Function Solaris.SolarisMathLibrary_Int.Negate
// 0x0008 (0x0008 - 0x0000)
struct SolarisMathLibrary_Int_Negate final
{
public:
	int64                                         Value;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SolarisMathLibrary_Int_Negate;

// Function Solaris.SolarisMathLibrary_Int.PredicateEqual
// 0x0018 (0x0018 - 0x0000)
struct SolarisMathLibrary_Int_PredicateEqual final
{
public:
	int64                                         LHS;                                               // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         RHS;                                               // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_SolarisMathLibrary_Int_PredicateEqual;

// Function Solaris.SolarisMathLibrary_Int.PredicateGreater
// 0x0018 (0x0018 - 0x0000)
struct SolarisMathLibrary_Int_PredicateGreater final
{
public:
	int64                                         LHS;                                               // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         RHS;                                               // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_SolarisMathLibrary_Int_PredicateGreater;

// Function Solaris.SolarisMathLibrary_Int.PredicateGreaterEqual
// 0x0018 (0x0018 - 0x0000)
struct SolarisMathLibrary_Int_PredicateGreaterEqual final
{
public:
	int64                                         LHS;                                               // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         RHS;                                               // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_SolarisMathLibrary_Int_PredicateGreaterEqual;

// Function Solaris.SolarisMathLibrary_Int.PredicateLess
// 0x0018 (0x0018 - 0x0000)
struct SolarisMathLibrary_Int_PredicateLess final
{
public:
	int64                                         LHS;                                               // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         RHS;                                               // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_SolarisMathLibrary_Int_PredicateLess;

// Function Solaris.SolarisMathLibrary_Int.PredicateLessEqual
// 0x0018 (0x0018 - 0x0000)
struct SolarisMathLibrary_Int_PredicateLessEqual final
{
public:
	int64                                         LHS;                                               // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         RHS;                                               // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_SolarisMathLibrary_Int_PredicateLessEqual;

// Function Solaris.SolarisMathLibrary_Int.PredicateNotEqual
// 0x0018 (0x0018 - 0x0000)
struct SolarisMathLibrary_Int_PredicateNotEqual final
{
public:
	int64                                         LHS;                                               // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         RHS;                                               // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_SolarisMathLibrary_Int_PredicateNotEqual;

// Function Solaris.SolarisMathLibrary_Int.Subtract
// 0x0010 (0x0010 - 0x0000)
struct SolarisMathLibrary_Int_Subtract final
{
public:
	int64                                         LHS;                                               // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         RHS;                                               // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SolarisMathLibrary_Int_Subtract;

// Function Solaris.SolarisMathLibrary_Int.SubtractEquals
// 0x0010 (0x0010 - 0x0000)
struct SolarisMathLibrary_Int_SubtractEquals final
{
public:
	int64                                         LHS;                                               // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         RHS;                                               // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SolarisMathLibrary_Int_SubtractEquals;

// Function Solaris.SolarisMathLibrary_Int.UncheckedConvertI32I64
// 0x0010 (0x0010 - 0x0000)
struct SolarisMathLibrary_Int_UncheckedConvertI32I64 final
{
public:
	int64                                         RHS;                                               // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_SolarisMathLibrary_Int_UncheckedConvertI32I64;

// Function Solaris.SolarisMathLibrary_Rational.ceil
// 0x0010 (0x0010 - 0x0000)
struct SolarisMathLibrary_Rational_ceil final
{
public:
	struct FVerseRational                         Val;                                               // 0x0000(0x0010)(Parm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SolarisMathLibrary_Rational_ceil;

// Function Solaris.SolarisMathLibrary_Rational.floor
// 0x0010 (0x0010 - 0x0000)
struct SolarisMathLibrary_Rational_floor final
{
public:
	struct FVerseRational                         Val;                                               // 0x0000(0x0010)(Parm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SolarisMathLibrary_Rational_floor;

// Function Solaris.SolarisMathLibrary_Float.abs
// 0x0010 (0x0010 - 0x0000)
struct SolarisMathLibrary_Float_abs final
{
public:
	double                                        Value;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SolarisMathLibrary_Float_abs;

// Function Solaris.SolarisMathLibrary_Float.Add
// 0x0018 (0x0018 - 0x0000)
struct SolarisMathLibrary_Float_Add final
{
public:
	double                                        LHS;                                               // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        RHS;                                               // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SolarisMathLibrary_Float_Add;

// Function Solaris.SolarisMathLibrary_Float.AddEquals
// 0x0018 (0x0018 - 0x0000)
struct SolarisMathLibrary_Float_AddEquals final
{
public:
	double                                        LHS;                                               // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        RHS;                                               // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SolarisMathLibrary_Float_AddEquals;

// Function Solaris.SolarisMathLibrary_Float.CheckConstrainedFloat
// 0x0018 (0x0018 - 0x0000)
struct SolarisMathLibrary_Float_CheckConstrainedFloat final
{
public:
	double                                        Min;                                               // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        Max;                                               // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        Value;                                             // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SolarisMathLibrary_Float_CheckConstrainedFloat;

// Function Solaris.SolarisMathLibrary_Float.Divide
// 0x0018 (0x0018 - 0x0000)
struct SolarisMathLibrary_Float_Divide final
{
public:
	double                                        LHS;                                               // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        RHS;                                               // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SolarisMathLibrary_Float_Divide;

// Function Solaris.SolarisMathLibrary_Float.DivideEquals
// 0x0018 (0x0018 - 0x0000)
struct SolarisMathLibrary_Float_DivideEquals final
{
public:
	double                                        LHS;                                               // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        RHS;                                               // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SolarisMathLibrary_Float_DivideEquals;

// Function Solaris.SolarisMathLibrary_Float.Greater
// 0x0010 (0x0010 - 0x0000)
struct SolarisMathLibrary_Float_Greater final
{
public:
	double                                        LHS;                                               // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        RHS;                                               // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SolarisMathLibrary_Float_Greater;

// Function Solaris.SolarisMathLibrary_Float.GreaterEqual
// 0x0010 (0x0010 - 0x0000)
struct SolarisMathLibrary_Float_GreaterEqual final
{
public:
	double                                        LHS;                                               // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        RHS;                                               // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SolarisMathLibrary_Float_GreaterEqual;

// Function Solaris.SolarisMathLibrary_Float.Less
// 0x0010 (0x0010 - 0x0000)
struct SolarisMathLibrary_Float_Less final
{
public:
	double                                        LHS;                                               // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        RHS;                                               // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SolarisMathLibrary_Float_Less;

// Function Solaris.SolarisMathLibrary_Float.LessEqual
// 0x0010 (0x0010 - 0x0000)
struct SolarisMathLibrary_Float_LessEqual final
{
public:
	double                                        LHS;                                               // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        RHS;                                               // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SolarisMathLibrary_Float_LessEqual;

// Function Solaris.SolarisMathLibrary_Float.Multiply
// 0x0018 (0x0018 - 0x0000)
struct SolarisMathLibrary_Float_Multiply final
{
public:
	double                                        LHS;                                               // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        RHS;                                               // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SolarisMathLibrary_Float_Multiply;

// Function Solaris.SolarisMathLibrary_Float.MultiplyEquals
// 0x0018 (0x0018 - 0x0000)
struct SolarisMathLibrary_Float_MultiplyEquals final
{
public:
	double                                        LHS;                                               // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        RHS;                                               // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SolarisMathLibrary_Float_MultiplyEquals;

// Function Solaris.SolarisMathLibrary_Float.MultiplyFloatInt
// 0x0018 (0x0018 - 0x0000)
struct SolarisMathLibrary_Float_MultiplyFloatInt final
{
public:
	double                                        LHS;                                               // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         RHS;                                               // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SolarisMathLibrary_Float_MultiplyFloatInt;

// Function Solaris.SolarisMathLibrary_Float.MultiplyIntFloat
// 0x0018 (0x0018 - 0x0000)
struct SolarisMathLibrary_Float_MultiplyIntFloat final
{
public:
	int64                                         LHS;                                               // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        RHS;                                               // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SolarisMathLibrary_Float_MultiplyIntFloat;

// Function Solaris.SolarisMathLibrary_Float.Negate
// 0x0010 (0x0010 - 0x0000)
struct SolarisMathLibrary_Float_Negate final
{
public:
	double                                        Value;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SolarisMathLibrary_Float_Negate;

// Function Solaris.SolarisMathLibrary_Float.Subtract
// 0x0018 (0x0018 - 0x0000)
struct SolarisMathLibrary_Float_Subtract final
{
public:
	double                                        LHS;                                               // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        RHS;                                               // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SolarisMathLibrary_Float_Subtract;

// Function Solaris.SolarisMathLibrary_Float.SubtractEquals
// 0x0018 (0x0018 - 0x0000)
struct SolarisMathLibrary_Float_SubtractEquals final
{
public:
	double                                        LHS;                                               // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        RHS;                                               // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SolarisMathLibrary_Float_SubtractEquals;

// Function Solaris.SolarisMathLibrary_String.Add
// 0x0008 (0x0008 - 0x0000)
struct SolarisMathLibrary_String_Add final
{
public:
	int32                                         String;                                            // 0x0000(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int8                                          Character;                                         // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_SolarisMathLibrary_String_Add;

// Function Solaris.SolarisMathLibrary_String.Call
// 0x0010 (0x0010 - 0x0000)
struct SolarisMathLibrary_String_Call final
{
public:
	int32                                         String;                                            // 0x0000(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         Index_0;                                           // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SolarisMathLibrary_String_Call;

// Function Solaris.SolarisMathLibrary_String.Concat
// 0x000C (0x000C - 0x0000)
struct SolarisMathLibrary_String_Concat final
{
public:
	int32                                         LHS;                                               // 0x0000(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         RHS;                                               // 0x0004(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SolarisMathLibrary_String_Concat;

// Function Solaris.SolarisMathLibrary_String.ConcatEquals
// 0x000C (0x000C - 0x0000)
struct SolarisMathLibrary_String_ConcatEquals final
{
public:
	int32                                         LHS;                                               // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         RHS;                                               // 0x0004(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SolarisMathLibrary_String_ConcatEquals;

// Function Solaris.SolarisMathLibrary_String.Length
// 0x0010 (0x0010 - 0x0000)
struct SolarisMathLibrary_String_Length final
{
public:
	int32                                         Array;                                             // 0x0000(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SolarisMathLibrary_String_Length;

// Function Solaris.SolarisMathLibrary_String.MakeLiteral
// 0x0004 (0x0004 - 0x0000)
struct SolarisMathLibrary_String_MakeLiteral final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SolarisMathLibrary_String_MakeLiteral;

// Function Solaris.SolarisMathLibrary_String.Move
// 0x0008 (0x0008 - 0x0000)
struct SolarisMathLibrary_String_Move final
{
public:
	int32                                         Destination;                                       // 0x0000(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Source;                                            // 0x0004(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SolarisMathLibrary_String_Move;

// Function Solaris.SolarisMathLibrary_String.RefCall
// 0x0010 (0x0010 - 0x0000)
struct SolarisMathLibrary_String_RefCall final
{
public:
	int32                                         String;                                            // 0x0000(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         Index_0;                                           // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SolarisMathLibrary_String_RefCall;

// Function Solaris.SolarisMathLibrary_String.UncheckedCall
// 0x0010 (0x0010 - 0x0000)
struct SolarisMathLibrary_String_UncheckedCall final
{
public:
	int32                                         String;                                            // 0x0000(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         Index_0;                                           // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SolarisMathLibrary_String_UncheckedCall;

// Function Solaris.SolarisUtilLibrary.AddPropertyToSubobjectExclusionList
// 0x0010 (0x0010 - 0x0000)
struct SolarisUtilLibrary_AddPropertyToSubobjectExclusionList final
{
public:
