#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SoundLibrary

#include "Basic.hpp"

#include "DeveloperSettings_classes.hpp"
#include "AudioGameplay_structs.hpp"
#include "AudioGameplay_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "GameFeatures_classes.hpp"
#include "SoundLibrary_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class SoundLibrary.SoundLibraryContext
// 0x0030 (0x0058 - 0x0028)
class USoundLibraryContext : public UObject
{
public:
	TWeakObjectPtr<class AActor>                  Actor;                                             // 0x0028(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, ExposeOnSpawn, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           BaseEventName;                                     // 0x0030(0x0004)(BlueprintVisible, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bForwardToActorOwner;                              // 0x0034(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bForwardToAttachedActors;                          // 0x0035(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAutoResetContext;                                 // 0x0036(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_37[0x1];                                       // 0x0037(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  PlaybackTags;                                      // 0x0038(0x0020)(Transient, NativeAccessSpecifierPublic)

public:
	void OnAddedToActor(const class AActor* InActor);
	void OnRemovedFromActor(const class AActor* InActor);
	bool Play(const struct FSoundLibraryContextEventInput& InEventData, TArray<class UAudioComponent*>* OutComponents);

	bool CreateEventName(struct FGameplayTag& OutEventName) const;
	bool GatherActorTargets(TArray<class AActor*>& OutActors) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SoundLibraryContext")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SoundLibraryContext")
	}
	static class USoundLibraryContext* GetDefaultObj()
	{
		return GetDefaultObjImpl<USoundLibraryContext>();
	}
};
DUMPER7_ASSERTS_USoundLibraryContext;

// Class SoundLibrary.SoundLibraryAnimContext
// 0x0040 (0x0098 - 0x0058)
class USoundLibraryAnimContext : public USoundLibraryContext
{
public:
	struct FSoundLibraryAnimContextSettings       AnimSettings;                                      // 0x0058(0x0024)(Edit, BlueprintVisible, NoDestructor, ExposeOnSpawn, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class UAnimSequenceBase>       Animation;                                         // 0x007C(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, ExposeOnSpawn, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class USkeletalMeshComponent>  MeshComponent;                                     // 0x0084(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSupportsNotifyEnd;                                // 0x008C(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8D[0x3];                                       // 0x008D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         AnimRate;                                          // 0x0090(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ConfigureContext(class AActor* OwningActor, class UAnimSequenceBase* InAnimation, const struct FSoundLibraryAnimContextSettings& InSettings);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SoundLibraryAnimContext")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SoundLibraryAnimContext")
	}
	static class USoundLibraryAnimContext* GetDefaultObj()
	{
		return GetDefaultObjImpl<USoundLibraryAnimContext>();
	}
};
DUMPER7_ASSERTS_USoundLibraryAnimContext;

// Class SoundLibrary.SoundLibraryAnimNotifyHelper
// 0x0010 (0x0038 - 0x0028)
class USoundLibraryAnimNotifyHelper final : public UObject
{
public:
	TArray<TWeakObjectPtr<class UAudioComponent>> PlayingComps;                                      // 0x0028(0x0010)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SoundLibraryAnimNotifyHelper")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SoundLibraryAnimNotifyHelper")
	}
	static class USoundLibraryAnimNotifyHelper* GetDefaultObj()
	{
		return GetDefaultObjImpl<USoundLibraryAnimNotifyHelper>();
	}
};
DUMPER7_ASSERTS_USoundLibraryAnimNotifyHelper;

// Class SoundLibrary.AnimNotify_SoundLibrary
// 0x0010 (0x0048 - 0x0038)
class UAnimNotify_SoundLibrary final : public UAnimNotify
{
public:
	class USoundLibraryContext*                   SoundContext;                                      // 0x0038(0x0008)(Edit, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USoundLibraryAnimNotifyHelper*          NotifyHelper;                                      // 0x0040(0x0008)(BlueprintReadOnly, ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AnimNotify_SoundLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AnimNotify_SoundLibrary")
	}
	static class UAnimNotify_SoundLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimNotify_SoundLibrary>();
	}
};
DUMPER7_ASSERTS_UAnimNotify_SoundLibrary;

// Class SoundLibrary.AnimNotifyState_SoundLibrary
// 0x0010 (0x0040 - 0x0030)
class UAnimNotifyState_SoundLibrary final : public UAnimNotifyState
{
public:
	class USoundLibraryContext*                   SoundContext;                                      // 0x0030(0x0008)(Edit, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USoundLibraryAnimNotifyHelper*          NotifyHelper;                                      // 0x0038(0x0008)(BlueprintReadOnly, ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AnimNotifyState_SoundLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AnimNotifyState_SoundLibrary")
	}
	static class UAnimNotifyState_SoundLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimNotifyState_SoundLibrary>();
	}
};
DUMPER7_ASSERTS_UAnimNotifyState_SoundLibrary;

// Class SoundLibrary.GameFeatureAction_AddSoundLibraryCollection
// 0x0030 (0x0058 - 0x0028)
class UGameFeatureAction_AddSoundLibraryCollection final : public UGameFeatureAction
{
public:
	TArray<TSoftObjectPtr<class USoundLibraryCollection>> CollectionList;                            // 0x0028(0x0010)(Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<TWeakObjectPtr<class USoundLibrarySubsystem>> TrackedSubsystems;                          // 0x0038(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPublic)
	uint8                                         Pad_48[0x10];                                      // 0x0048(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameFeatureAction_AddSoundLibraryCollection")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameFeatureAction_AddSoundLibraryCollection")
	}
	static class UGameFeatureAction_AddSoundLibraryCollection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameFeatureAction_AddSoundLibraryCollection>();
	}
};
DUMPER7_ASSERTS_UGameFeatureAction_AddSoundLibraryCollection;

// Class SoundLibrary.SoundLibrary
// 0x0198 (0x01C0 - 0x0028)
class USoundLibrary final : public UObject
{
public:
	TMap<struct FGameplayTag, TSoftObjectPtr<class USoundBase>> Sounds;                              // 0x0028(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, UObjectWrapper, NativeAccessSpecifierPublic)
	struct FAudioGameplayRequirements             LibraryRequirements;                               // 0x0078(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FGameplayTag                           Channel;                                           // 0x00C8(0x0004)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Priority;                                          // 0x00CC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  MetaData;                                          // 0x00D0(0x0020)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TMap<struct FGameplayTag, TSoftObjectPtr<class USoundBase>> FullLibrary;                         // 0x00F0(0x0050)(Edit, DisableEditOnInstance, EditConst, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TMap<struct FGameplayTag, class USoundBase*>  RuntimeSounds;                                     // 0x0140(0x0050)(Transient, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TArray<class USoundBase*>                     LoadedSoundObjects;                                // 0x0190(0x0010)(ZeroConstructor, Transient, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TArray<TSoftObjectPtr<class USoundBase>>      Assets;                                            // 0x01A0(0x0010)(ZeroConstructor, Transient, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	uint8                                         Pad_1B0[0x10];                                     // 0x01B0(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AddSound(const struct FGameplayTag& InTag, class USoundBase* InSound);
	void SetChannel(const struct FGameplayTag& InTag);
	void SetPriority(int32 InPriority);

	class USoundBase* FindSound(const struct FGameplayTag& InTag) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SoundLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SoundLibrary")
	}
	static class USoundLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<USoundLibrary>();
	}
};
DUMPER7_ASSERTS_USoundLibrary;

// Class SoundLibrary.SoundLibraryComponent
// 0x00B0 (0x0158 - 0x00A8)
class USoundLibraryComponent : public UAudioGameplayComponent
{
public:
	uint8                                         Pad_A8[0x8];                                       // 0x00A8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           ComponentTag;                                      // 0x00B0(0x0004)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class USoundLibraryContext>       ContextClass;                                      // 0x00B8(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class USoundLibrary*>                  Libraries;                                         // 0x00C0(0x0010)(Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FSoundLibraryPlayResult& Results, const class USoundLibraryContext* Context)> OnSoundLibraryPlayEvent; // 0x00D0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FGameplayTag& EventName)> OnEventPlayedDelegate;      // 0x00E0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FGameplayTag& EventName)> OnEventStoppedDelegate;     // 0x00F0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_100[0x50];                                     // 0x0100(0x0050)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundLibraryContext*                   Context;                                           // 0x0150(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void AddLibraries(const TArray<class USoundLibrary*>& InLibraries);
	void AddLibrary(class USoundLibrary* InLibrary);
	bool IsEventActive(const struct FGameplayTag& InEventName);
	void OnEventPlayed(const struct FGameplayTag& InEventName);
	void OnEventStopped(const struct FGameplayTag& InEventName);
	void OnSoundPlayed(const struct FGameplayTag& InEventName, class UAudioComponent* InComponent);
	void OnSoundStopped(const struct FGameplayTag& InEventName, class UAudioComponent* InComponent, bool* bStopped);
	struct FSoundLibraryPlayResult PlayEvent(const struct FGameplayTag& InEventName);
	void RemoveLibraries(const TArray<class USoundLibrary*>& InLibraries);
	void RemoveLibrary(class USoundLibrary* InLibrary);
	bool StopEvent(const struct FGameplayTag& InEventName);

	class USoundLibraryContext* GetContext() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SoundLibraryComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SoundLibraryComponent")
	}
	static class USoundLibraryComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<USoundLibraryComponent>();
	}
};
DUMPER7_ASSERTS_USoundLibraryComponent;

// Class SoundLibrary.SoundLibraryProviderInterface
// 0x0000 (0x0000 - 0x0000)
class ISoundLibraryProviderInterface final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SoundLibraryProviderInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SoundLibraryProviderInterface")
	}
	static class ISoundLibraryProviderInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<ISoundLibraryProviderInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_ISoundLibraryProviderInterface;

// Class SoundLibrary.SoundLibraryCollection
// 0x0050 (0x0080 - 0x0030)
class USoundLibraryCollection final : public UDataAsset
{
public:
	TMap<struct FGameplayTag, struct FSoundLibrarySet> Libraries;                                    // 0x0030(0x0050)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SoundLibraryCollection")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SoundLibraryCollection")
	}
	static class USoundLibraryCollection* GetDefaultObj()
	{
		return GetDefaultObjImpl<USoundLibraryCollection>();
	}
};
DUMPER7_ASSERTS_USoundLibraryCollection;

// Class SoundLibrary.SoundLibrarySettings
// 0x0020 (0x0050 - 0x0030)
class USoundLibrarySettings final : public UDeveloperSettings
{
public:
	TSoftObjectPtr<class USoundLibraryCollection> CommonLibraries;                                   // 0x0030(0x0020)(Edit, Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SoundLibrarySettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SoundLibrarySettings")
	}
	static class USoundLibrarySettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<USoundLibrarySettings>();
	}
};
DUMPER7_ASSERTS_USoundLibrarySettings;

// Class SoundLibrary.SoundLibrarySimpleContext
// 0x0058 (0x00B0 - 0x0058)
class USoundLibrarySimpleContext : public USoundLibraryContext
{
public:
	struct FSoundLibrarySimpleContextSettings     Settings;                                          // 0x0058(0x0058)(Edit, BlueprintVisible, NoDestructor, ContainsInstancedReference, ExposeOnSpawn, NativeAccessSpecifierPublic)

public:
	void ConfigureContext(class AActor* OwningActor, const struct FSoundLibrarySimpleContextSettings& InSettings);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SoundLibrarySimpleContext")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SoundLibrarySimpleContext")
	}
	static class USoundLibrarySimpleContext* GetDefaultObj()
	{
		return GetDefaultObjImpl<USoundLibrarySimpleContext>();
	}
};
DUMPER7_ASSERTS_USoundLibrarySimpleContext;

// Class SoundLibrary.SoundLibrarySubsystem
// 0x0068 (0x0098 - 0x0030)
class USoundLibrarySubsystem final : public UWorldSubsystem
{
public:
	TArray<class USoundLibraryCollection*>        LibraryCollections;                                // 0x0030(0x0010)(ZeroConstructor, Transient, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	class USoundLibrarySimpleContext*             SimpleContext;                                     // 0x0040(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TMap<uint32, struct FSoundLibraryActorData>   ActorDataMap;                                      // 0x0048(0x0050)(Transient, Protected, NativeAccessSpecifierProtected)

public:
	class USoundLibraryContext* AddContext(const class AActor* Actor, TSubclassOf<class USoundLibraryContext> ContextClass);
	void AddLibraries(class AActor* Actor, const TArray<class USoundLibrary*>& Libraries);
	void AddLibrariesFromCollections(class AActor* Actor, const struct FGameplayTagContainer& CollectionTags);
	void AddLibrary(class AActor* Actor, class USoundLibrary* Library);
	void DisableEventsForActor(const class AActor* Actor);
	void EnableEventsForActor(const class AActor* Actor);
	class USoundLibraryContext* GetContext(const class AActor* Actor, TSubclassOf<class USoundLibraryContext> ContextClass);
	void PlaySound(class USoundLibraryContext* Context, struct FSoundLibraryPlayResult* OutResults);
	struct FSoundLibraryPlayResult PlaySoundSimple(class AActor* OwningActor, const struct FSoundLibrarySimpleContextSettings& InSettings);
	bool RemoveContext(const class AActor* Actor, TSubclassOf<class USoundLibraryContext> ContextClass);
	void RemoveLibraries(const class AActor* Actor, const TArray<class USoundLibrary*>& Libraries);
	void RemoveLibrariesFromCollections(const class AActor* Actor, const struct FGameplayTagContainer& CollectionTags);
	void RemoveLibrary(const class AActor* Actor, class USoundLibrary* Library);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SoundLibrarySubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SoundLibrarySubsystem")
	}
	static class USoundLibrarySubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<USoundLibrarySubsystem>();
	}
};
DUMPER7_ASSERTS_USoundLibrarySubsystem;

// Class SoundLibrary.SoundLibraryTagHelperFunctions
// 0x0000 (0x0028 - 0x0028)
class USoundLibraryTagHelperFunctions final : public UObject
{
public:
	static struct FSoundLibraryTag MakeSoundLibraryTag(const struct FGameplayTag& tag);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SoundLibraryTagHelperFunctions")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SoundLibraryTagHelperFunctions")
	}
	static class USoundLibraryTagHelperFunctions* GetDefaultObj()
	{
		return GetDefaultObjImpl<USoundLibraryTagHelperFunctions>();
	}
};
DUMPER7_ASSERTS_USoundLibraryTagHelperFunctions;

}

