#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SparksCoreUI

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"
#include "FortniteUI_classes.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// Class SparksCoreUI.FortSettingRegistryExtension_Sparks
// 0x0000 (0x0028 - 0x0028)
class UFortSettingRegistryExtension_Sparks final : public UFortGameSettingRegistryExtension
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortSettingRegistryExtension_Sparks")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortSettingRegistryExtension_Sparks")
	}
	static class UFortSettingRegistryExtension_Sparks* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortSettingRegistryExtension_Sparks>();
	}
};
DUMPER7_ASSERTS_UFortSettingRegistryExtension_Sparks;

// Class SparksCoreUI.SparksQuestScreenContainer
// 0x0018 (0x0300 - 0x02E8)
class USparksQuestScreenContainer final : public UCommonUserWidget
{
public:
	class FName                                   QuestTabID;                                        // 0x02E8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2EC[0x4];                                      // 0x02EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaMapScreenContainer*              AthenaScreenContainer;                             // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2F8[0x8];                                      // 0x02F8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleAthenaScreenDeactivated();
	void HandleMapPanelExitButtonPressed();
	void HandleToggleQuestList(bool bMapVisible);
	void SetQuestScreenVisible(const bool bVisible);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SparksQuestScreenContainer")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SparksQuestScreenContainer")
	}
	static class USparksQuestScreenContainer* GetDefaultObj()
	{
		return GetDefaultObjImpl<USparksQuestScreenContainer>();
	}
};
DUMPER7_ASSERTS_USparksQuestScreenContainer;

// Class SparksCoreUI.SparksSongItemDetailsVM
// 0x0000 (0x03C0 - 0x03C0)
class USparksSongItemDetailsVM final : public UAthenaItemDetailsVM
{
public:
	class UTexture2D*                             CoverArt;                                          // 0x03B8(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnSongCatalogRetrieved(bool bSuccess);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SparksSongItemDetailsVM")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SparksSongItemDetailsVM")
	}
	static class USparksSongItemDetailsVM* GetDefaultObj()
	{
		return GetDefaultObjImpl<USparksSongItemDetailsVM>();
	}
};
DUMPER7_ASSERTS_USparksSongItemDetailsVM;

// Class SparksCoreUI.SparksSongItemVM
// 0x0000 (0x0110 - 0x0110)
class USparksSongItemVM final : public UAthenaItemVM
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SparksSongItemVM")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SparksSongItemVM")
	}
	static class USparksSongItemVM* GetDefaultObj()
	{
		return GetDefaultObjImpl<USparksSongItemVM>();
	}
};
DUMPER7_ASSERTS_USparksSongItemVM;

// Class SparksCoreUI.SparksSongLockerCategoryConfig
// 0x0000 (0x0130 - 0x0130)
class USparksSongLockerCategoryConfig final : public UAthenaLockerCategoryConfig
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SparksSongLockerCategoryConfig")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SparksSongLockerCategoryConfig")
	}
	static class USparksSongLockerCategoryConfig* GetDefaultObj()
	{
		return GetDefaultObjImpl<USparksSongLockerCategoryConfig>();
	}
};
DUMPER7_ASSERTS_USparksSongLockerCategoryConfig;

// Class SparksCoreUI.SparksCoreUIGlobals
// 0x0000 (0x0028 - 0x0028)
class USparksCoreUIGlobals final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SparksCoreUIGlobals")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SparksCoreUIGlobals")
	}
	static class USparksCoreUIGlobals* GetDefaultObj()
	{
		return GetDefaultObjImpl<USparksCoreUIGlobals>();
	}
};
DUMPER7_ASSERTS_USparksCoreUIGlobals;

}

