#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SparksCharacterCommonRuntime

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "SparksCharacterCommonRuntime_structs.hpp"
#include "SparksCoreRuntime_structs.hpp"
#include "ModularGameplay_classes.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// Class SparksCharacterCommonRuntime.SparksAnimationSubsystem
// 0x0088 (0x00B8 - 0x0030)
class USparksAnimationSubsystem final : public UWorldSubsystem
{
public:
	TSoftObjectPtr<class USparksInstrumentAnimations> Anims_Default;                                 // 0x0030(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class USparksInstrumentAnimations> Anims_Light;                                   // 0x0050(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_70[0x28];                                      // 0x0070(0x0028)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         NumAnimationRefs;                                  // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_9C[0x1C];                                      // 0x009C(0x001C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class USparksInstrumentAnimations* GetLoadedSparksAnimations();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SparksAnimationSubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SparksAnimationSubsystem")
	}
	static class USparksAnimationSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<USparksAnimationSubsystem>();
	}
};
DUMPER7_ASSERTS_USparksAnimationSubsystem;

// Class SparksCharacterCommonRuntime.SparksBaseLayerAnimInstance
// 0x0050 (0x04C0 - 0x0470)
class USparksBaseLayerAnimInstance final : public UFortBaseLayerAnimInstance
{
public:
	float                                         MinTempo;                                          // 0x0468(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxTempo;                                          // 0x046C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<float>                                 BPMBucketMaxTempos;                                // 0x0470(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	float                                         BPMBucketCooldownSeconds;                          // 0x0480(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_484[0x4];                                      // 0x0484(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USparksInstrumentAnimPlayerStateComponent* InstrumentPSC;                                  // 0x0488(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ASparksMusicPlayspace*                  SparksPlayspace;                                   // 0x0490(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMusicClockComponent*                   MusicClock;                                        // 0x0498(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SongTempo;                                         // 0x04A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BPMBucketCooldownRemaining;                        // 0x04A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         BPMBucket;                                         // 0x04A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PreviousBPMBucket;                                 // 0x04AC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESparksInstrumentType                         Instrument;                                        // 0x04B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCanPlayMidiAnimations;                            // 0x04B1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bMusicBeatIsActive;                                // 0x04B2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsRoamingOrNotAnimatable;                         // 0x04B3(0x0001)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bTransitionBeat;                                   // 0x04B4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESparksAnimatableState                        AnimatableState;                                   // 0x04B5(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bIsRoaming;                                        // 0x04B6(0x0001)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_4B7[0x9];                                      // 0x04B7(0x0009)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnInstrumentPSCInitialized(class USparksInstrumentAnimPlayerStateComponent* NewInstrumentPSC);
	void SetIsRoaming(bool bInIsRoaming);

	ESparksAnimatableState GetAnimatableState() const;
	bool GetIsRoaming() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SparksBaseLayerAnimInstance")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SparksBaseLayerAnimInstance")
	}
	static class USparksBaseLayerAnimInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<USparksBaseLayerAnimInstance>();
	}
};
DUMPER7_ASSERTS_USparksBaseLayerAnimInstance;

// Class SparksCharacterCommonRuntime.SparksInstrumentAnimInstance
// 0x0020 (0x1640 - 0x1620)
#pragma pack(push, 0x1)
class alignas(0x10) USparksInstrumentAnimInstance : public UFortPlayerAnimInstanceProxy
{
public:
	TWeakObjectPtr<class ASparksMusicPlayspace>   SparksMusicPlayspace;                              // 0x1620(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1628[0x10];                                    // 0x1628(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetMidiEventDriver(TScriptInterface<class IMidiEventDriverInterface> NewMidiEventDriver);

	TScriptInterface<class IMidiEventDriverInterface> GetMidiEventDriver() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SparksInstrumentAnimInstance")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SparksInstrumentAnimInstance")
	}
	static class USparksInstrumentAnimInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<USparksInstrumentAnimInstance>();
	}
};
#pragma pack(pop)
DUMPER7_ASSERTS_USparksInstrumentAnimInstance;

// Class SparksCharacterCommonRuntime.SparksGuitarAnimInstance
// 0x0000 (0x1640 - 0x1640)
class USparksGuitarAnimInstance : public USparksInstrumentAnimInstance
{
public:
	int32                                         FretNumber;                                        // 0x1638(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_163C[0x4];                                     // 0x163C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static int32 GetFretNumberFromMidiNote(const uint8 MidiNote);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SparksGuitarAnimInstance")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SparksGuitarAnimInstance")
	}
	static class USparksGuitarAnimInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<USparksGuitarAnimInstance>();
	}
};
DUMPER7_ASSERTS_USparksGuitarAnimInstance;

// Class SparksCharacterCommonRuntime.SparksBassAnimInstance
// 0x0000 (0x1640 - 0x1640)
class USparksBassAnimInstance final : public USparksGuitarAnimInstance
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SparksBassAnimInstance")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SparksBassAnimInstance")
	}
	static class USparksBassAnimInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<USparksBassAnimInstance>();
	}
};
DUMPER7_ASSERTS_USparksBassAnimInstance;

// Class SparksCharacterCommonRuntime.SparksDrumsAnimInstance
// 0x0000 (0x1640 - 0x1640)
class USparksDrumsAnimInstance final : public USparksInstrumentAnimInstance
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SparksDrumsAnimInstance")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SparksDrumsAnimInstance")
	}
	static class USparksDrumsAnimInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<USparksDrumsAnimInstance>();
	}
};
DUMPER7_ASSERTS_USparksDrumsAnimInstance;

// Class SparksCharacterCommonRuntime.SparksInstrumentAnimations
// 0x0030 (0x0060 - 0x0030)
class USparksInstrumentAnimations final : public UDataAsset
{
public:
	TSubclassOf<class USparksBaseLayerAnimInstance> BandPlayAnimBP;                                  // 0x0030(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UAnimInstance>              InstrumentAnimBPs[0x5];                            // 0x0038(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	TSubclassOf<class UAnimInstance> GetAnimClassForInstrument(ESparksInstrumentType Instrument);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SparksInstrumentAnimations")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SparksInstrumentAnimations")
	}
	static class USparksInstrumentAnimations* GetDefaultObj()
	{
		return GetDefaultObjImpl<USparksInstrumentAnimations>();
	}
};
DUMPER7_ASSERTS_USparksInstrumentAnimations;

// Class SparksCharacterCommonRuntime.SparksInstrumentAnimPlayerStateComponent
// 0x0158 (0x01F8 - 0x00A0)
class USparksInstrumentAnimPlayerStateComponent final : public UPlayerStateComponent
{
public:
	uint8                                         Pad_A0[0x8];                                       // 0x00A0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class USparksInstrumentAnimations*            InstrumentAnimations;                              // 0x00A8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class ASparksMusicPlayspace*                  SparksPlayspace;                                   // 0x00B0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UMusicClockComponent*                   MusicClock;                                        // 0x00B8(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TScriptInterface<class IMidiEventDriverInterface> MidiEventDriver;                               // 0x00C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	ESparksInstrumentType                         CosmeticInstrumentType;                            // 0x00D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	ESparksAnimatableState                        AnimatableState;                                   // 0x00D1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bCanPlayMidiAnimations;                            // 0x00D2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_D3[0x5];                                       // 0x00D3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class ASparksMusicPlayspace>      SparksPlayspaceType;                               // 0x00D8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class ASparksMusicPlayspace* Playspace)> BP_OnEnteredSparksMusicPlayspace; // 0x00E0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_F0[0x18];                                      // 0x00F0(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(class ASparksMusicPlayspace* Playspace)> BP_OnExitedSparksMusicPlayspace; // 0x0108(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_118[0x18];                                     // 0x0118(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(class UMusicClockComponent* MusicClock)> BP_OnPlayerMusicClockChanged; // 0x0130(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_140[0x18];                                     // 0x0140(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(TScriptInterface<class IMidiEventDriverInterface> MidiEventDriver)> BP_OnPlayerMidiEventDriverChanged; // 0x0158(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_168[0x18];                                     // 0x0168(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(ESparksInstrumentType CosmeticInstrumentType)> BP_OnPlayerCosmeticInstrumentTypeChanged; // 0x0180(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_190[0x18];                                     // 0x0190(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(ESparksAnimatableState AnimatableState)> BP_OnPlayerAnimatableStateChanged; // 0x01A8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_1B8[0x18];                                     // 0x01B8(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(bool bCanPlayMidiAnimations)> BP_OnPlayerCanPlayMidiAnimationsChanged; // 0x01D0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_1E0[0x18];                                     // 0x01E0(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool CanSwapToInstrument(ESparksInstrumentType NewInstrumentType);
	void HandlePawnFinishedCharacterCustomization(class AFortPlayerPawn* Pawn);
	void HandlePlayerPawnSet(class APlayerState* Player, class APawn* NewPawn, class APawn* OldPawn);
	void LinkInstrumentAnimationLayer(class USparksInstrumentAnimations* Animations);
	void OverridePlayspace(class ASparksMusicPlayspace* Playspace);
	void SetAnimatableState(ESparksAnimatableState NewAnimatableState);
	void SetCanPlayMidiAnimations(bool bNewCanPlayMidiAnimations);
	void SetCosmeticInstrumentType(ESparksInstrumentType NewCosmeticInstrumentType);
	void SetMidiEventDriver(TScriptInterface<class IMidiEventDriverInterface> NewMidiEventDriver);
	void SetMusicClock(class UMusicClockComponent* NewMusicClock);
	void SwapCosmeticInstrument(ESparksInstrumentType NewInstrumentType);
	void UnlinkInstrumentAnimationLayer();

	bool CanPlayMidiAnimations() const;
	ESparksAnimatableState GetAnimatableState() const;
	ESparksInstrumentType GetCosmeticInstrumentType() const;
	class FName GetCurrentTrackName() const;
	class USparksInstrumentAnimations* GetInstrumentAnimations() const;
	class USparksBaseLayerAnimInstance* GetLinkedInstrumentAnimationLayer() const;
	TScriptInterface<class IMidiEventDriverInterface> GetMidiEventDriver() const;
	class UMusicClockComponent* GetMusicClock() const;
	ESparksInstrumentType GetRecentOrFirstInstrument() const;
	class ASparksMusicPlayspace* GetSparksPlayspace() const;
	ESparksInstrumentType GetTrackInstrumentType() const;
	bool IsInstrumentAnimationLayerLinked() const;
	bool IsUsable() const;
	bool PlayerHasCosmeticInstrument(ESparksInstrumentType InstrumentType) const;
	bool PlayerHasTrackInstrument(ESparksInstrumentType InstrumentType) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SparksInstrumentAnimPlayerStateComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SparksInstrumentAnimPlayerStateComponent")
	}
	static class USparksInstrumentAnimPlayerStateComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<USparksInstrumentAnimPlayerStateComponent>();
	}
};
DUMPER7_ASSERTS_USparksInstrumentAnimPlayerStateComponent;

// Class SparksCharacterCommonRuntime.SparksMicAnimInstance
// 0x0000 (0x1640 - 0x1640)
class USparksMicAnimInstance final : public USparksInstrumentAnimInstance
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SparksMicAnimInstance")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SparksMicAnimInstance")
	}
	static class USparksMicAnimInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<USparksMicAnimInstance>();
	}
};
DUMPER7_ASSERTS_USparksMicAnimInstance;

}

