#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SparksCharacterCommonRuntime

#include "Basic.hpp"

#include "SparksCharacterCommonRuntime_structs.hpp"
#include "SparksCoreRuntime_structs.hpp"


namespace SDK::Params
{

// Function SparksCharacterCommonRuntime.SparksAnimationSubsystem.GetLoadedSparksAnimations
// 0x0008 (0x0008 - 0x0000)
struct SparksAnimationSubsystem_GetLoadedSparksAnimations final
{
public:
	class USparksInstrumentAnimations*            ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SparksAnimationSubsystem_GetLoadedSparksAnimations;

// Function SparksCharacterCommonRuntime.SparksBaseLayerAnimInstance.OnInstrumentPSCInitialized
// 0x0008 (0x0008 - 0x0000)
struct SparksBaseLayerAnimInstance_OnInstrumentPSCInitialized final
{
public:
	class USparksInstrumentAnimPlayerStateComponent* NewInstrumentPSC;                               // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SparksBaseLayerAnimInstance_OnInstrumentPSCInitialized;

// Function SparksCharacterCommonRuntime.SparksBaseLayerAnimInstance.SetIsRoaming
// 0x0001 (0x0001 - 0x0000)
struct SparksBaseLayerAnimInstance_SetIsRoaming final
{
public:
	bool                                          bInIsRoaming;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SparksBaseLayerAnimInstance_SetIsRoaming;

// Function SparksCharacterCommonRuntime.SparksBaseLayerAnimInstance.GetAnimatableState
// 0x0001 (0x0001 - 0x0000)
struct SparksBaseLayerAnimInstance_GetAnimatableState final
{
public:
	ESparksAnimatableState                        ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SparksBaseLayerAnimInstance_GetAnimatableState;

// Function SparksCharacterCommonRuntime.SparksBaseLayerAnimInstance.GetIsRoaming
// 0x0001 (0x0001 - 0x0000)
struct SparksBaseLayerAnimInstance_GetIsRoaming final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SparksBaseLayerAnimInstance_GetIsRoaming;

// Function SparksCharacterCommonRuntime.SparksInstrumentAnimInstance.SetMidiEventDriver
// 0x0010 (0x0010 - 0x0000)
struct SparksInstrumentAnimInstance_SetMidiEventDriver final
{
public:
	TScriptInterface<class IMidiEventDriverInterface> NewMidiEventDriver;                            // 0x0000(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SparksInstrumentAnimInstance_SetMidiEventDriver;

// Function SparksCharacterCommonRuntime.SparksInstrumentAnimInstance.GetMidiEventDriver
// 0x0010 (0x0010 - 0x0000)
struct SparksInstrumentAnimInstance_GetMidiEventDriver final
{
public:
	TScriptInterface<class IMidiEventDriverInterface> ReturnValue;                                   // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SparksInstrumentAnimInstance_GetMidiEventDriver;

// Function SparksCharacterCommonRuntime.SparksGuitarAnimInstance.GetFretNumberFromMidiNote
// 0x0008 (0x0008 - 0x0000)
struct SparksGuitarAnimInstance_GetFretNumberFromMidiNote final
{
public:
	uint8                                         MidiNote;                                          // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SparksGuitarAnimInstance_GetFretNumberFromMidiNote;

// Function SparksCharacterCommonRuntime.SparksInstrumentAnimations.GetAnimClassForInstrument
// 0x0010 (0x0010 - 0x0000)
struct SparksInstrumentAnimations_GetAnimClassForInstrument final
{
public:
	ESparksInstrumentType                         Instrument;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UAnimInstance>              ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SparksInstrumentAnimations_GetAnimClassForInstrument;

// Function SparksCharacterCommonRuntime.SparksInstrumentAnimPlayerStateComponent.CanSwapToInstrument
// 0x0002 (0x0002 - 0x0000)
struct SparksInstrumentAnimPlayerStateComponent_CanSwapToInstrument final
{
public:
	ESparksInstrumentType                         NewInstrumentType;                                 // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SparksInstrumentAnimPlayerStateComponent_CanSwapToInstrument;

// Function SparksCharacterCommonRuntime.SparksInstrumentAnimPlayerStateComponent.HandlePawnFinishedCharacterCustomization
// 0x0008 (0x0008 - 0x0000)
struct SparksInstrumentAnimPlayerStateComponent_HandlePawnFinishedCharacterCustomization final
{
public:
	class AFortPlayerPawn*                        Pawn;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SparksInstrumentAnimPlayerStateComponent_HandlePawnFinishedCharacterCustomization;

// Function SparksCharacterCommonRuntime.SparksInstrumentAnimPlayerStateComponent.HandlePlayerPawnSet
// 0x0018 (0x0018 - 0x0000)
struct SparksInstrumentAnimPlayerStateComponent_HandlePlayerPawnSet final
{
public:
	class APlayerState*                           Player;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class APawn*                                  NewPawn;                                           // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class APawn*                                  OldPawn;                                           // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SparksInstrumentAnimPlayerStateComponent_HandlePlayerPawnSet;

// Function SparksCharacterCommonRuntime.SparksInstrumentAnimPlayerStateComponent.LinkInstrumentAnimationLayer
// 0x0008 (0x0008 - 0x0000)
struct SparksInstrumentAnimPlayerStateComponent_LinkInstrumentAnimationLayer final
{
public:
	class USparksInstrumentAnimations*            Animations;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SparksInstrumentAnimPlayerStateComponent_LinkInstrumentAnimationLayer;

// Function SparksCharacterCommonRuntime.SparksInstrumentAnimPlayerStateComponent.OverridePlayspace
// 0x0008 (0x0008 - 0x0000)
struct SparksInstrumentAnimPlayerStateComponent_OverridePlayspace final
{
public:
	class ASparksMusicPlayspace*                  Playspace;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SparksInstrumentAnimPlayerStateComponent_OverridePlayspace;

// Function SparksCharacterCommonRuntime.SparksInstrumentAnimPlayerStateComponent.SetAnimatableState
// 0x0001 (0x0001 - 0x0000)
struct SparksInstrumentAnimPlayerStateComponent_SetAnimatableState final
{
public:
	ESparksAnimatableState                        NewAnimatableState;                                // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SparksInstrumentAnimPlayerStateComponent_SetAnimatableState;

// Function SparksCharacterCommonRuntime.SparksInstrumentAnimPlayerStateComponent.SetCanPlayMidiAnimations
// 0x0001 (0x0001 - 0x0000)
struct SparksInstrumentAnimPlayerStateComponent_SetCanPlayMidiAnimations final
{
public:
	bool                                          bNewCanPlayMidiAnimations;                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SparksInstrumentAnimPlayerStateComponent_SetCanPlayMidiAnimations;

// Function SparksCharacterCommonRuntime.SparksInstrumentAnimPlayerStateComponent.SetCosmeticInstrumentType
// 0x0001 (0x0001 - 0x0000)
struct SparksInstrumentAnimPlayerStateComponent_SetCosmeticInstrumentType final
{
public:
	ESparksInstrumentType                         NewCosmeticInstrumentType;                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SparksInstrumentAnimPlayerStateComponent_SetCosmeticInstrumentType;

// Function SparksCharacterCommonRuntime.SparksInstrumentAnimPlayerStateComponent.SetMidiEventDriver
// 0x0010 (0x0010 - 0x0000)
struct SparksInstrumentAnimPlayerStateComponent_SetMidiEventDriver final
{
public:
	TScriptInterface<class IMidiEventDriverInterface> NewMidiEventDriver;                            // 0x0000(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SparksInstrumentAnimPlayerStateComponent_SetMidiEventDriver;

// Function SparksCharacterCommonRuntime.SparksInstrumentAnimPlayerStateComponent.SetMusicClock
// 0x0008 (0x0008 - 0x0000)
struct SparksInstrumentAnimPlayerStateComponent_SetMusicClock final
{
public:
	class UMusicClockComponent*                   NewMusicClock;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SparksInstrumentAnimPlayerStateComponent_SetMusicClock;

// Function SparksCharacterCommonRuntime.SparksInstrumentAnimPlayerStateComponent.SwapCosmeticInstrument
// 0x0001 (0x0001 - 0x0000)
struct SparksInstrumentAnimPlayerStateComponent_SwapCosmeticInstrument final
{
public:
	ESparksInstrumentType                         NewInstrumentType;                                 // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SparksInstrumentAnimPlayerStateComponent_SwapCosmeticInstrument;

// Function SparksCharacterCommonRuntime.SparksInstrumentAnimPlayerStateComponent.CanPlayMidiAnimations
// 0x0001 (0x0001 - 0x0000)
struct SparksInstrumentAnimPlayerStateComponent_CanPlayMidiAnimations final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SparksInstrumentAnimPlayerStateComponent_CanPlayMidiAnimations;

// Function SparksCharacterCommonRuntime.SparksInstrumentAnimPlayerStateComponent.GetAnimatableState
// 0x0001 (0x0001 - 0x0000)
struct SparksInstrumentAnimPlayerStateComponent_GetAnimatableState final
{
public:
	ESparksAnimatableState                        ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SparksInstrumentAnimPlayerStateComponent_GetAnimatableState;

// Function SparksCharacterCommonRuntime.SparksInstrumentAnimPlayerStateComponent.GetCosmeticInstrumentType
// 0x0001 (0x0001 - 0x0000)
struct SparksInstrumentAnimPlayerStateComponent_GetCosmeticInstrumentType final
{
public:
	ESparksInstrumentType                         ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SparksInstrumentAnimPlayerStateComponent_GetCosmeticInstrumentType;

// Function SparksCharacterCommonRuntime.SparksInstrumentAnimPlayerStateComponent.GetCurrentTrackName
// 0x0004 (0x0004 - 0x0000)
struct SparksInstrumentAnimPlayerStateComponent_GetCurrentTrackName final
{
public:
	class FName                                   ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SparksInstrumentAnimPlayerStateComponent_GetCurrentTrackName;

// Function SparksCharacterCommonRuntime.SparksInstrumentAnimPlayerStateComponent.GetInstrumentAnimations
// 0x0008 (0x0008 - 0x0000)
struct SparksInstrumentAnimPlayerStateComponent_GetInstrumentAnimations final
{
public:
	class USparksInstrumentAnimations*            ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SparksInstrumentAnimPlayerStateComponent_GetInstrumentAnimations;

// Function SparksCharacterCommonRuntime.SparksInstrumentAnimPlayerStateComponent.GetLinkedInstrumentAnimationLayer
// 0x0008 (0x0008 - 0x0000)
struct SparksInstrumentAnimPlayerStateComponent_GetLinkedInstrumentAnimationLayer final
{
public:
	class USparksBaseLayerAnimInstance*           ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SparksInstrumentAnimPlayerStateComponent_GetLinkedInstrumentAnimationLayer;

// Function SparksCharacterCommonRuntime.SparksInstrumentAnimPlayerStateComponent.GetMidiEventDriver
// 0x0010 (0x0010 - 0x0000)
struct SparksInstrumentAnimPlayerStateComponent_GetMidiEventDriver final
{
public:
	TScriptInterface<class IMidiEventDriverInterface> ReturnValue;                                   // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SparksInstrumentAnimPlayerStateComponent_GetMidiEventDriver;

// Function SparksCharacterCommonRuntime.SparksInstrumentAnimPlayerStateComponent.GetMusicClock
// 0x0008 (0x0008 - 0x0000)
struct SparksInstrumentAnimPlayerStateComponent_GetMusicClock final
{
public:
	class UMusicClockComponent*                   ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SparksInstrumentAnimPlayerStateComponent_GetMusicClock;

// Function SparksCharacterCommonRuntime.SparksInstrumentAnimPlayerStateComponent.GetRecentOrFirstInstrument
// 0x0001 (0x0001 - 0x0000)
struct SparksInstrumentAnimPlayerStateComponent_GetRecentOrFirstInstrument final
{
public:
	ESparksInstrumentType                         ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SparksInstrumentAnimPlayerStateComponent_GetRecentOrFirstInstrument;

// Function SparksCharacterCommonRuntime.SparksInstrumentAnimPlayerStateComponent.GetSparksPlayspace
// 0x0008 (0x0008 - 0x0000)
struct SparksInstrumentAnimPlayerStateComponent_GetSparksPlayspace final
{
public:
	class ASparksMusicPlayspace*                  ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SparksInstrumentAnimPlayerStateComponent_GetSparksPlayspace;

// Function SparksCharacterCommonRuntime.SparksInstrumentAnimPlayerStateComponent.GetTrackInstrumentType
// 0x0001 (0x0001 - 0x0000)
struct SparksInstrumentAnimPlayerStateComponent_GetTrackInstrumentType final
{
public:
	ESparksInstrumentType                         ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SparksInstrumentAnimPlayerStateComponent_GetTrackInstrumentType;

// Function SparksCharacterCommonRuntime.SparksInstrumentAnimPlayerStateComponent.IsInstrumentAnimationLayerLinked
// 0x0001 (0x0001 - 0x0000)
struct SparksInstrumentAnimPlayerStateComponent_IsInstrumentAnimationLayerLinked final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SparksInstrumentAnimPlayerStateComponent_IsInstrumentAnimationLayerLinked;

// Function SparksCharacterCommonRuntime.SparksInstrumentAnimPlayerStateComponent.IsUsable
// 0x0001 (0x0001 - 0x0000)
struct SparksInstrumentAnimPlayerStateComponent_IsUsable final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SparksInstrumentAnimPlayerStateComponent_IsUsable;

// Function SparksCharacterCommonRuntime.SparksInstrumentAnimPlayerStateComponent.PlayerHasCosmeticInstrument
// 0x0002 (0x0002 - 0x0000)
struct SparksInstrumentAnimPlayerStateComponent_PlayerHasCosmeticInstrument final
{
public:
	ESparksInstrumentType                         InstrumentType;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SparksInstrumentAnimPlayerStateComponent_PlayerHasCosmeticInstrument;

// Function SparksCharacterCommonRuntime.SparksInstrumentAnimPlayerStateComponent.PlayerHasTrackInstrument
// 0x0002 (0x0002 - 0x0000)
struct SparksInstrumentAnimPlayerStateComponent_PlayerHasTrackInstrument final
{
public:
	ESparksInstrumentType                         InstrumentType;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SparksInstrumentAnimPlayerStateComponent_PlayerHasTrackInstrument;

}

