#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SparksMidiParser

#include "Basic.hpp"


namespace SDK
{

// ScriptStruct SparksMidiParser.ParsedMidiEventBase
// 0x0008 (0x0008 - 0x0000)
struct FParsedMidiEventBase
{
public:
	int32                                         AtMidiTick;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         EndsAtMidiTick;                                    // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FParsedMidiEventBase;

// ScriptStruct SparksMidiParser.ParsedMidiTextEvent
// 0x0020 (0x0028 - 0x0008)
struct FParsedMidiTextEvent final : public FParsedMidiEventBase
{
public:
	class FString                                 EventString;                                       // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         EventPayload;                                      // 0x0018(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FParsedMidiTextEvent;

// ScriptStruct SparksMidiParser.MidiEventListenerParams
// 0x0004 (0x0004 - 0x0000)
struct FMidiEventListenerParams
{
public:
	class FName                                   TrackName;                                         // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FMidiEventListenerParams;

// ScriptStruct SparksMidiParser.MidiNoteEvent_DelayPool
// 0x000C (0x000C - 0x0000)
struct FMidiNoteEvent_DelayPool final
{
public:
	class FName                                   ID;                                                // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxSecondsBefore;                                  // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MinSecondsBefore;                                  // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FMidiNoteEvent_DelayPool;

// ScriptStruct SparksMidiParser.MidiNotePoolEventListenerParams
// 0x0034 (0x0038 - 0x0004)
struct FMidiNotePoolEventListenerParams final : public FMidiEventListenerParams
{
public:
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<uint8>                                 EventNotes;                                        // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<uint8>                                 WatchNotes;                                        // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FMidiNoteEvent_DelayPool>       DelayPools;                                        // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FMidiNotePoolEventListenerParams;

// ScriptStruct SparksMidiParser.MidiNoteEventListenerParams
// 0x001C (0x0020 - 0x0004)
struct FMidiNoteEventListenerParams final : public FMidiEventListenerParams
{
public:
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<uint8>                                 EventNotes;                                        // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	float                                         SecondsBeforeStartTick;                            // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SecondsBeforeEndTick;                              // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FMidiNoteEventListenerParams;

// ScriptStruct SparksMidiParser.ParsedMidiNoteEvent
// 0x0004 (0x000C - 0x0008)
struct FParsedMidiNoteEvent final : public FParsedMidiEventBase
{
public:
	uint8                                         EventNote;                                         // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FParsedMidiNoteEvent;

// ScriptStruct SparksMidiParser.MidiTextEventListenerParams
// 0x001C (0x0020 - 0x0004)
struct FMidiTextEventListenerParams final : public FMidiEventListenerParams
{
public:
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         EventStrings;                                      // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	float                                         SecondsBeforeStartTick;                            // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FMidiTextEventListenerParams;

// ScriptStruct SparksMidiParser.MidiEventListenerHandle
// 0x0010 (0x0010 - 0x0000)
struct FMidiEventListenerHandle final
{
public:
	uint64                                        ID;                                                // 0x0000(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TWeakObjectPtr<class UObject>                 WeakDriver;                                        // 0x0008(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};
DUMPER7_ASSERTS_FMidiEventListenerHandle;

// ScriptStruct SparksMidiParser.MidiPlaybackState
// 0x000C (0x000C - 0x0000)
struct FMidiPlaybackState final
{
public:
	int32                                         CurrentTimeTick;                                   // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CurrentTimeSeconds;                                // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsPlaybackEnded;                                  // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FMidiPlaybackState;

// ScriptStruct SparksMidiParser.MidiNoteEventList
// 0x0010 (0x0010 - 0x0000)
struct FMidiNoteEventList final
{
public:
	TArray<struct FParsedMidiNoteEvent>           Events;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FMidiNoteEventList;

// ScriptStruct SparksMidiParser.MidiTextEventList
// 0x0010 (0x0010 - 0x0000)
struct FMidiTextEventList final
{
public:
	TArray<struct FParsedMidiTextEvent>           Events;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FMidiTextEventList;

}

