#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SpatialMetricsExperimental

#include "Basic.hpp"

#include "SpatialMetricsCore_classes.hpp"
#include "SpatialMetricsExperimental_structs.hpp"
#include "SpatialMetrics_structs.hpp"


namespace SDK
{

// Class SpatialMetricsExperimental.ActorPackageDependencyARDiskSizeMetric_Archive
// 0x02D8 (0x0330 - 0x0058)
class UActorPackageDependencyARDiskSizeMetric_Archive final : public USpatialMetricInterface
{
public:
	uint8                                         Pad_58[0x2D8];                                     // 0x0058(0x02D8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ActorPackageDependencyARDiskSizeMetric_Archive")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ActorPackageDependencyARDiskSizeMetric_Archive")
	}
	static class UActorPackageDependencyARDiskSizeMetric_Archive* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActorPackageDependencyARDiskSizeMetric_Archive>();
	}
};
DUMPER7_ASSERTS_UActorPackageDependencyARDiskSizeMetric_Archive;

// Class SpatialMetricsExperimental.ActorPackageDependencyCountMetric_Archive
// 0x02D0 (0x0328 - 0x0058)
class UActorPackageDependencyCountMetric_Archive final : public USpatialMetricInterface
{
public:
	uint8                                         Pad_58[0x2D0];                                     // 0x0058(0x02D0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ActorPackageDependencyCountMetric_Archive")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ActorPackageDependencyCountMetric_Archive")
	}
	static class UActorPackageDependencyCountMetric_Archive* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActorPackageDependencyCountMetric_Archive>();
	}
};
DUMPER7_ASSERTS_UActorPackageDependencyCountMetric_Archive;

// Class SpatialMetricsExperimental.ActorPackageDependencyIoDispatcherSizeMetric_Archive
// 0x02E0 (0x0338 - 0x0058)
class UActorPackageDependencyIoDispatcherSizeMetric_Archive final : public USpatialMetricInterface
{
public:
	uint8                                         Pad_58[0x2D8];                                     // 0x0058(0x02D8)(Fixing Size After Last Property [ Dumper-7 ])
	EIoDispatcherChunkTypeFlags                   ChunkTypeFlags;                                    // 0x0330(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_334[0x4];                                      // 0x0334(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ActorPackageDependencyIoDispatcherSizeMetric_Archive")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ActorPackageDependencyIoDispatcherSizeMetric_Archive")
	}
	static class UActorPackageDependencyIoDispatcherSizeMetric_Archive* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActorPackageDependencyIoDispatcherSizeMetric_Archive>();
	}
};
DUMPER7_ASSERTS_UActorPackageDependencyIoDispatcherSizeMetric_Archive;

// Class SpatialMetricsExperimental.ActorPackageDependencyResourceSizeMetric_Archive
// 0x02E0 (0x0338 - 0x0058)
class UActorPackageDependencyResourceSizeMetric_Archive final : public USpatialMetricInterface
{
public:
	uint8                                         Pad_58[0x2D8];                                     // 0x0058(0x02D8)(Fixing Size After Last Property [ Dumper-7 ])
	EResourceSizeMemoryCategory                   MemoryCategoryFlags;                               // 0x0330(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_331[0x7];                                      // 0x0331(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ActorPackageDependencyResourceSizeMetric_Archive")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ActorPackageDependencyResourceSizeMetric_Archive")
	}
	static class UActorPackageDependencyResourceSizeMetric_Archive* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActorPackageDependencyResourceSizeMetric_Archive>();
	}
};
DUMPER7_ASSERTS_UActorPackageDependencyResourceSizeMetric_Archive;

// Class SpatialMetricsExperimental.LevelPackageDependencyIoDispatcherSizeMetric_IoStore
// 0x0360 (0x03B8 - 0x0058)
class ULevelPackageDependencyIoDispatcherSizeMetric_IoStore final : public USpatialMetricInterface
{
public:
	uint8                                         Pad_58[0x358];                                     // 0x0058(0x0358)(Fixing Size After Last Property [ Dumper-7 ])
	EIoDispatcherChunkTypeFlags                   ChunkTypeFlags;                                    // 0x03B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3B4[0x4];                                      // 0x03B4(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LevelPackageDependencyIoDispatcherSizeMetric_IoStore")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LevelPackageDependencyIoDispatcherSizeMetric_IoStore")
	}
	static class ULevelPackageDependencyIoDispatcherSizeMetric_IoStore* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULevelPackageDependencyIoDispatcherSizeMetric_IoStore>();
	}
};
DUMPER7_ASSERTS_ULevelPackageDependencyIoDispatcherSizeMetric_IoStore;

}

