#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SpatialMetrics

#include "Basic.hpp"

#include "SpatialMetricsCore_classes.hpp"
#include "SpatialMetrics_structs.hpp"


namespace SDK
{

// Class SpatialMetrics.SpatialActorCountMetric
// 0x0008 (0x00B8 - 0x00B0)
class USpatialActorCountMetric final : public USpatialMetricBase
{
public:
	uint8                                         Pad_B0[0x8];                                       // 0x00B0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SpatialActorCountMetric")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SpatialActorCountMetric")
	}
	static class USpatialActorCountMetric* GetDefaultObj()
	{
		return GetDefaultObjImpl<USpatialActorCountMetric>();
	}
};
DUMPER7_ASSERTS_USpatialActorCountMetric;

// Class SpatialMetrics.SpatialActorResourceSizeMetric
// 0x00E8 (0x0140 - 0x0058)
class USpatialActorResourceSizeMetric final : public USpatialMetricInterface
{
public:
	uint8                                         Pad_58[0xE0];                                      // 0x0058(0x00E0)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         UpdateTimeThresholdInMs;                           // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EResourceSizeMemoryCategory                   MemoryCategoryFlags;                               // 0x013C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_13D[0x3];                                      // 0x013D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SpatialActorResourceSizeMetric")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SpatialActorResourceSizeMetric")
	}
	static class USpatialActorResourceSizeMetric* GetDefaultObj()
	{
		return GetDefaultObjImpl<USpatialActorResourceSizeMetric>();
	}
};
DUMPER7_ASSERTS_USpatialActorResourceSizeMetric;

// Class SpatialMetrics.SpatialAvailableMemoryMetric
// 0x0000 (0x00B0 - 0x00B0)
class USpatialAvailableMemoryMetric final : public USpatialMetricBase
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SpatialAvailableMemoryMetric")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SpatialAvailableMemoryMetric")
	}
	static class USpatialAvailableMemoryMetric* GetDefaultObj()
	{
		return GetDefaultObjImpl<USpatialAvailableMemoryMetric>();
	}
};
DUMPER7_ASSERTS_USpatialAvailableMemoryMetric;

// Class SpatialMetrics.SpatialFrameTimeMetric
// 0x0000 (0x00B0 - 0x00B0)
class USpatialFrameTimeMetric final : public USpatialMetricBase
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SpatialFrameTimeMetric")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SpatialFrameTimeMetric")
	}
	static class USpatialFrameTimeMetric* GetDefaultObj()
	{
		return GetDefaultObjImpl<USpatialFrameTimeMetric>();
	}
};
DUMPER7_ASSERTS_USpatialFrameTimeMetric;

// Class SpatialMetrics.SpatialGameUpdateTimeMetric
// 0x0000 (0x00B0 - 0x00B0)
class USpatialGameUpdateTimeMetric final : public USpatialMetricBase
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SpatialGameUpdateTimeMetric")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SpatialGameUpdateTimeMetric")
	}
	static class USpatialGameUpdateTimeMetric* GetDefaultObj()
	{
		return GetDefaultObjImpl<USpatialGameUpdateTimeMetric>();
	}
};
DUMPER7_ASSERTS_USpatialGameUpdateTimeMetric;

// Class SpatialMetrics.SpatialMemoryUsageMetric
// 0x0000 (0x00B0 - 0x00B0)
class USpatialMemoryUsageMetric final : public USpatialMetricBase
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SpatialMemoryUsageMetric")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SpatialMemoryUsageMetric")
	}
	static class USpatialMemoryUsageMetric* GetDefaultObj()
	{
		return GetDefaultObjImpl<USpatialMemoryUsageMetric>();
	}
};
DUMPER7_ASSERTS_USpatialMemoryUsageMetric;

// Class SpatialMetrics.SpatialProxyMetric
// 0x0050 (0x00A8 - 0x0058)
class USpatialProxyMetric final : public USpatialMetricInterface
{
public:
	uint8                                         Pad_58[0x50];                                      // 0x0058(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SpatialProxyMetric")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SpatialProxyMetric")
	}
	static class USpatialProxyMetric* GetDefaultObj()
	{
		return GetDefaultObjImpl<USpatialProxyMetric>();
	}
};
DUMPER7_ASSERTS_USpatialProxyMetric;

// Class SpatialMetrics.SpatialRenderTimeMetric
// 0x0000 (0x00B0 - 0x00B0)
class USpatialRenderTimeMetric final : public USpatialMetricBase
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SpatialRenderTimeMetric")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SpatialRenderTimeMetric")
	}
	static class USpatialRenderTimeMetric* GetDefaultObj()
	{
		return GetDefaultObjImpl<USpatialRenderTimeMetric>();
	}
};
DUMPER7_ASSERTS_USpatialRenderTimeMetric;

}

