#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SpatialMetricsCore

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"
#include "SpatialMetricsCore_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class SpatialMetricsCore.SpatialMetricsActorIndexerSubscriber
// 0x0000 (0x0000 - 0x0000)
class ISpatialMetricsActorIndexerSubscriber final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SpatialMetricsActorIndexerSubscriber")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SpatialMetricsActorIndexerSubscriber")
	}
	static class ISpatialMetricsActorIndexerSubscriber* GetDefaultObj()
	{
		return GetDefaultObjImpl<ISpatialMetricsActorIndexerSubscriber>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_ISpatialMetricsActorIndexerSubscriber;

// Class SpatialMetricsCore.SpatialMetricsActorTrackerSubscriber
// 0x0000 (0x0000 - 0x0000)
class ISpatialMetricsActorTrackerSubscriber final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SpatialMetricsActorTrackerSubscriber")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SpatialMetricsActorTrackerSubscriber")
	}
	static class ISpatialMetricsActorTrackerSubscriber* GetDefaultObj()
	{
		return GetDefaultObjImpl<ISpatialMetricsActorTrackerSubscriber>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_ISpatialMetricsActorTrackerSubscriber;

// Class SpatialMetricsCore.SpatialMetricsSubsystemExtension
// 0x0058 (0x0080 - 0x0028)
class USpatialMetricsSubsystemExtension : public UObject
{
public:
	uint8                                         Pad_28[0x58];                                      // 0x0028(0x0058)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SpatialMetricsSubsystemExtension")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SpatialMetricsSubsystemExtension")
	}
	static class USpatialMetricsSubsystemExtension* GetDefaultObj()
	{
		return GetDefaultObjImpl<USpatialMetricsSubsystemExtension>();
	}
};
DUMPER7_ASSERTS_USpatialMetricsSubsystemExtension;

// Class SpatialMetricsCore.TestExtension
// 0x0018 (0x0098 - 0x0080)
class UTestExtension final : public USpatialMetricsSubsystemExtension
{
public:
	uint8                                         Pad_80[0x18];                                      // 0x0080(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("TestExtension")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"TestExtension")
	}
	static class UTestExtension* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTestExtension>();
	}
};
DUMPER7_ASSERTS_UTestExtension;

// Class SpatialMetricsCore.SpatialMetricInterface
// 0x0030 (0x0058 - 0x0028)
class USpatialMetricInterface : public UObject
{
public:
	struct FSpatialMetricProperties               Properties;                                        // 0x0028(0x0030)(NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SpatialMetricInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SpatialMetricInterface")
	}
	static class USpatialMetricInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<USpatialMetricInterface>();
	}
};
DUMPER7_ASSERTS_USpatialMetricInterface;

// Class SpatialMetricsCore.SpatialMetricBase
// 0x0058 (0x00B0 - 0x0058)
class USpatialMetricBase : public USpatialMetricInterface
{
public:
	uint8                                         Pad_58[0x58];                                      // 0x0058(0x0058)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SpatialMetricBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SpatialMetricBase")
	}
	static class USpatialMetricBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<USpatialMetricBase>();
	}
};
DUMPER7_ASSERTS_USpatialMetricBase;

// Class SpatialMetricsCore.SpatialMetricsActorIndexer
// 0x0138 (0x01B8 - 0x0080)
class USpatialMetricsActorIndexer final : public USpatialMetricsSubsystemExtension
{
public:
	uint8                                         Pad_80[0x134];                                     // 0x0080(0x0134)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         IndexCacheSize;                                    // 0x01B4(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SpatialMetricsActorIndexer")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SpatialMetricsActorIndexer")
	}
	static class USpatialMetricsActorIndexer* GetDefaultObj()
	{
		return GetDefaultObjImpl<USpatialMetricsActorIndexer>();
	}
};
DUMPER7_ASSERTS_USpatialMetricsActorIndexer;

// Class SpatialMetricsCore.SpatialMetricsActorTracker
// 0x0070 (0x00F0 - 0x0080)
class USpatialMetricsActorTracker final : public USpatialMetricsSubsystemExtension
{
public:
	uint8                                         Pad_80[0x70];                                      // 0x0080(0x0070)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SpatialMetricsActorTracker")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SpatialMetricsActorTracker")
	}
	static class USpatialMetricsActorTracker* GetDefaultObj()
	{
		return GetDefaultObjImpl<USpatialMetricsActorTracker>();
	}
};
DUMPER7_ASSERTS_USpatialMetricsActorTracker;

// Class SpatialMetricsCore.SpatialMetricsSubsystem
// 0x0040 (0x0070 - 0x0030)
class USpatialMetricsSubsystem final : public UWorldSubsystem
{
public:
	uint8                                         Pad_30[0x10];                                      // 0x0030(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USpatialMetricInterface*>        Metrics;                                           // 0x0040(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	TArray<class USpatialMetricsSubsystemExtension*> Extensions;                                     // 0x0050(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	float                                         UpdateRateInSeconds;                               // 0x0060(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         WarmUpFrames;                                      // 0x0064(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_68[0x8];                                       // 0x0068(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SpatialMetricsSubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SpatialMetricsSubsystem")
	}
	static class USpatialMetricsSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<USpatialMetricsSubsystem>();
	}
};
DUMPER7_ASSERTS_USpatialMetricsSubsystem;

// Class SpatialMetricsCore.TestMetric
// 0x0080 (0x00D8 - 0x0058)
class UTestMetric final : public USpatialMetricInterface
{
public:
	uint8                                         Pad_58[0x74];                                      // 0x0058(0x0074)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SamplingDistance;                                  // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         WorldSamplingFactor;                               // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("TestMetric")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"TestMetric")
	}
	static class UTestMetric* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTestMetric>();
	}
};
DUMPER7_ASSERTS_UTestMetric;

}

