#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SpecialEventGameplayRuntime

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "SpecialEventGameplayRuntime_structs.hpp"
#include "CommonInput_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function SpecialEventGameplayRuntime.FortAthenaMutator_SpecialEventTODM.OnPhaseActivated
// 0x0010 (0x0010 - 0x0000)
struct FortAthenaMutator_SpecialEventTODM_OnPhaseActivated final
{
public:
	class ASpecialEventScript*                    InSpecialEventScript;                              // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ASpecialEventPhase*                     InSpecialEventPhase;                               // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaMutator_SpecialEventTODM_OnPhaseActivated;

// Function SpecialEventGameplayRuntime.FortCheatManager_DestroyActorsAndComponents.DestroyActorsAndComponentsMutator_SetActorDefinitionsEnabled
// 0x0018 (0x0018 - 0x0000)
struct FortCheatManager_DestroyActorsAndComponents_DestroyActorsAndComponentsMutator_SetActorDefinitionsEnabled final
{
public:
	class FString                                 TagString;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnabled;                                          // 0x0010(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FortCheatManager_DestroyActorsAndComponents_DestroyActorsAndComponentsMutator_SetActorDefinitionsEnabled;

// Function SpecialEventGameplayRuntime.FortCheatManager_DestroyActorsAndComponents.DestroyActorsAndComponentsMutator_ListActorComponents
// 0x0010 (0x0010 - 0x0000)
struct FortCheatManager_DestroyActorsAndComponents_DestroyActorsAndComponentsMutator_ListActorComponents final
{
public:
	class FString                                 InActorName;                                       // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortCheatManager_DestroyActorsAndComponents_DestroyActorsAndComponentsMutator_ListActorComponents;

// Function SpecialEventGameplayRuntime.FortAthenaMutator_DestroyActorsAndComponents.OnActorSpawned
// 0x0008 (0x0008 - 0x0000)
struct FortAthenaMutator_DestroyActorsAndComponents_OnActorSpawned final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaMutator_DestroyActorsAndComponents_OnActorSpawned;

// Function SpecialEventGameplayRuntime.FortAthenaMutator_DestroyActorsAndComponents.OnRep_ActorDefinitions
// 0x0010 (0x0010 - 0x0000)
struct FortAthenaMutator_DestroyActorsAndComponents_OnRep_ActorDefinitions final
{
public:
	TArray<struct FDestroyActorsAndComponentsMutator_ActorDefinition> OldActorDefinitions;           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaMutator_DestroyActorsAndComponents_OnRep_ActorDefinitions;

// Function SpecialEventGameplayRuntime.FortAthenaMutator_DestroyActorsAndComponents.OnTrackedActorDestroyed
// 0x0008 (0x0008 - 0x0000)
struct FortAthenaMutator_DestroyActorsAndComponents_OnTrackedActorDestroyed final
{
public:
	class AActor*                                 DestroyedActor;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaMutator_DestroyActorsAndComponents_OnTrackedActorDestroyed;

// Function SpecialEventGameplayRuntime.FortAthenaMutator_DestroyActorsAndComponents.PermanentlyDisableActorDefinitions
// 0x0020 (0x0020 - 0x0000)
struct FortAthenaMutator_DestroyActorsAndComponents_PermanentlyDisableActorDefinitions final
{
public:
	struct FGameplayTagContainer                  InTags;                                            // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaMutator_DestroyActorsAndComponents_PermanentlyDisableActorDefinitions;

// Function SpecialEventGameplayRuntime.FortAthenaMutator_DestroyActorsAndComponents.SetActorDefinitionsEnabled
// 0x0028 (0x0028 - 0x0000)
struct FortAthenaMutator_DestroyActorsAndComponents_SetActorDefinitionsEnabled final
{
public:
	struct FGameplayTagContainer                  InTags;                                            // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          bEnabled;                                          // 0x0020(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FortAthenaMutator_DestroyActorsAndComponents_SetActorDefinitionsEnabled;

// Function SpecialEventGameplayRuntime.FortCheatManager_FakeKillRelevancy.FakeKillRelevancyDebug
// 0x0004 (0x0004 - 0x0000)
struct FortCheatManager_FakeKillRelevancy_FakeKillRelevancyDebug final
{
public:
	float                                         TextScale;                                         // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortCheatManager_FakeKillRelevancy_FakeKillRelevancyDebug;

// Function SpecialEventGameplayRuntime.FortCheatManager_FakeKillRelevancy.FakeKillRelevancySetUpPhase
// 0x0020 (0x0020 - 0x0000)
struct FortCheatManager_FakeKillRelevancy_FakeKillRelevancySetUpPhase final
{
public:
	int32                                         MaxPlayersRemaining;                               // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ReasonGameplayTagString;                           // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NumWaves;                                          // 0x0018(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RelevancyDelay;                                    // 0x001C(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortCheatManager_FakeKillRelevancy_FakeKillRelevancySetUpPhase;

// Function SpecialEventGameplayRuntime.FortCheatManager_FakeKillRelevancy.FakeKillRelevancyTestAlgorithm
// 0x0028 (0x0028 - 0x0000)
struct FortCheatManager_FakeKillRelevancy_FakeKillRelevancyTestAlgorithm final
{
public:
	int32                                         NumPlayers;                                        // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 MaxPlayersRemainingAfterPhases;                    // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MinSquadSize;                                      // 0x0018(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaxSquadSize;                                      // 0x001C(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Iterations;                                        // 0x0020(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         LogVerbosity;                                      // 0x0024(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortCheatManager_FakeKillRelevancy_FakeKillRelevancyTestAlgorithm;

// Function SpecialEventGameplayRuntime.FortControllerComponent_FakeKillRelevancy.CancelKillEffectsOnClient
// 0x0010 (0x0010 - 0x0000)
struct FortControllerComponent_FakeKillRelevancy_CancelKillEffectsOnClient final
{
public:
	TArray<class AFortPlayerStateAthena*>         PlayerStates;                                      // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortControllerComponent_FakeKillRelevancy_CancelKillEffectsOnClient;

// Function SpecialEventGameplayRuntime.FortControllerComponent_FakeKillRelevancy.OnKillEffectsPlayed
// 0x0008 (0x0008 - 0x0000)
struct FortControllerComponent_FakeKillRelevancy_OnKillEffectsPlayed final
{
public:
	const class AFortPlayerStateAthena*           PlayerState;                                       // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortControllerComponent_FakeKillRelevancy_OnKillEffectsPlayed;

// Function SpecialEventGameplayRuntime.FortControllerComponent_FakeKillRelevancy.PlayKillEffects
// 0x0040 (0x0040 - 0x0000)
struct FortControllerComponent_FakeKillRelevancy_PlayKillEffects final
{
public:
	struct FFakeKillRelevancyPlayerDataEntry      FakeKillData;                                      // 0x0000(0x0038)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	float                                         RelevancyDelay;                                    // 0x0038(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FortControllerComponent_FakeKillRelevancy_PlayKillEffects;

// Function SpecialEventGameplayRuntime.FortControllerComponent_FakeKillRelevancy.GetDeathLocation
// 0x0020 (0x0020 - 0x0000)
struct FortControllerComponent_FakeKillRelevancy_GetDeathLocation final
{
public:
	const class AFortPlayerStateAthena*           PlayerState;                                       // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ReturnValue;                                       // 0x0008(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortControllerComponent_FakeKillRelevancy_GetDeathLocation;

// Function SpecialEventGameplayRuntime.FortAthenaMutator_FakeKillRelevancy.EndWave
// 0x0008 (0x0008 - 0x0000)
struct FortAthenaMutator_FakeKillRelevancy_EndWave final
{
public:
	int32                                         EndPhaseNum;                                       // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         WaveNum;                                           // 0x0004(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaMutator_FakeKillRelevancy_EndWave;

// Function SpecialEventGameplayRuntime.FortAthenaMutator_FakeKillRelevancy.SetUpKillPhase
// 0x0010 (0x0010 - 0x0000)
struct FortAthenaMutator_FakeKillRelevancy_SetUpKillPhase final
{
public:
	int32                                         MaxPlayersRemaining;                               // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           Reason;                                            // 0x0004(0x0004)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NumWaves;                                          // 0x0008(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RelevancyDelay;                                    // 0x000C(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaMutator_FakeKillRelevancy_SetUpKillPhase;

// Function SpecialEventGameplayRuntime.FortAthenaMutator_LoadGameFeature.OnPlaylistDataReady
// 0x0030 (0x0030 - 0x0000)
struct FortAthenaMutator_LoadGameFeature_OnPlaylistDataReady final
{
public:
	class AFortGameStateAthena*                   GameState;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class UFortPlaylist*                    Playlist;                                          // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  PlaylistContextTags;                               // 0x0010(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaMutator_LoadGameFeature_OnPlaylistDataReady;

// Function SpecialEventGameplayRuntime.FortAthenaMutator_RemoveGameFeatures.OnPlaylistDataReady
// 0x0030 (0x0030 - 0x0000)
struct FortAthenaMutator_RemoveGameFeatures_OnPlaylistDataReady final
{
public:
	class AFortGameStateAthena*                   GameState;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class UFortPlaylist*                    Playlist;                                          // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  PlaylistContextTags;                               // 0x0010(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaMutator_RemoveGameFeatures_OnPlaylistDataReady;

// Function SpecialEventGameplayRuntime.FortCheatManager_SpecialEvent.AddCSVEvent
// 0x0010 (0x0010 - 0x0000)
struct FortCheatManager_SpecialEvent_AddCSVEvent final
{
public:
	class FString                                 CSVEventName;                                      // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortCheatManager_SpecialEvent_AddCSVEvent;

// Function SpecialEventGameplayRuntime.FortCheatManager_SpecialEvent.ChangeWinCondition
// 0x0004 (0x0004 - 0x0000)
struct FortCheatManager_SpecialEvent_ChangeWinCondition final
{
public:
	float                                         NewGoalScore;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortCheatManager_SpecialEvent_ChangeWinCondition;

// Function SpecialEventGameplayRuntime.FortCheatManager_SpecialEvent.PauseWinCondition
// 0x0001 (0x0001 - 0x0000)
struct FortCheatManager_SpecialEvent_PauseWinCondition final
{
public:
	bool                                          bLockScores;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortCheatManager_SpecialEvent_PauseWinCondition;

// Function SpecialEventGameplayRuntime.FortCheatManager_SpecialEvent.SetDestroyVehiclesInStorm
// 0x0001 (0x0001 - 0x0000)
struct FortCheatManager_SpecialEvent_SetDestroyVehiclesInStorm final
{
public:
	bool                                          bDestroyVehiclesInStorm;                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortCheatManager_SpecialEvent_SetDestroyVehiclesInStorm;

// Function SpecialEventGameplayRuntime.FortCheatManager_SpecialEvent.SetIsSimulatingDamage
// 0x0001 (0x0001 - 0x0000)
struct FortCheatManager_SpecialEvent_SetIsSimulatingDamage final
{
public:
	bool                                          bIsSimulating;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortCheatManager_SpecialEvent_SetIsSimulatingDamage;

// Function SpecialEventGameplayRuntime.FortCheatManager_SpecialEvent.SetLockingOnFocalPoint
// 0x0001 (0x0001 - 0x0000)
struct FortCheatManager_SpecialEvent_SetLockingOnFocalPoint final
{
public:
	bool                                          bInLockingOnFocalPoint;                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortCheatManager_SpecialEvent_SetLockingOnFocalPoint;

// Function SpecialEventGameplayRuntime.FortCheatManager_SpecialEvent.SetMatchTime
// 0x0004 (0x0004 - 0x0000)
struct FortCheatManager_SpecialEvent_SetMatchTime final
{
public:
	int32                                         NewMatchTime;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortCheatManager_SpecialEvent_SetMatchTime;

// Function SpecialEventGameplayRuntime.FortCheatManager_SpecialEvent.SetReturnToMainMenuDelay
// 0x0008 (0x0008 - 0x0000)
struct FortCheatManager_SpecialEvent_SetReturnToMainMenuDelay final
{
public:
	float                                         MinDelayReturnToMainMenu;                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxDelayReturnToMainMenu;                          // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortCheatManager_SpecialEvent_SetReturnToMainMenuDelay;

// Function SpecialEventGameplayRuntime.FortCheatManager_SpecialEvent.SpecialEventSetAdditionalViewpoint
// 0x000C (0x000C - 0x0000)
struct FortCheatManager_SpecialEvent_SpecialEventSetAdditionalViewpoint final
{
public:
	float                                         X;                                                 // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Y;                                                 // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Z;                                                 // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortCheatManager_SpecialEvent_SpecialEventSetAdditionalViewpoint;

// Function SpecialEventGameplayRuntime.FortCheatManager_SpecialEvent.StartEventScript
// 0x0008 (0x0008 - 0x0000)
struct FortCheatManager_SpecialEvent_StartEventScript final
{
public:
	int32                                         InStartingIndex;                                   // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SequenceTimeOffset;                                // 0x0004(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortCheatManager_SpecialEvent_StartEventScript;

// Function SpecialEventGameplayRuntime.FortCheatManager_SpecialEvent.TeleportAllPlayers
// 0x0004 (0x0004 - 0x0000)
struct FortCheatManager_SpecialEvent_TeleportAllPlayers final
{
public:
	int32                                         SafeZoneIndex;                                     // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortCheatManager_SpecialEvent_TeleportAllPlayers;

// Function SpecialEventGameplayRuntime.FortCheatManager_SpecialEvent.ToggleDisableParachutes
// 0x0001 (0x0001 - 0x0000)
struct FortCheatManager_SpecialEvent_ToggleDisableParachutes final
{
public:
	bool                                          bIsDisabled;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortCheatManager_SpecialEvent_ToggleDisableParachutes;

// Function SpecialEventGameplayRuntime.FortCheatManager_SpecialEvent.UnloadTerrainMaps
// 0x0004 (0x0004 - 0x0000)
struct FortCheatManager_SpecialEvent_UnloadTerrainMaps final
{
public:
	class FName                                   MapTag;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortCheatManager_SpecialEvent_UnloadTerrainMaps;

// Function SpecialEventGameplayRuntime.FortAthenaMutator_SpecialEvent.AddClientCSVEvent
// 0x0010 (0x0010 - 0x0000)
struct FortAthenaMutator_SpecialEvent_AddClientCSVEvent final
{
public:
	class FString                                 CSVEventName;                                      // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaMutator_SpecialEvent_AddClientCSVEvent;

// Function SpecialEventGameplayRuntime.FortAthenaMutator_SpecialEvent.AddCSVEvent
// 0x0018 (0x0018 - 0x0000)
struct FortAthenaMutator_SpecialEvent_AddCSVEvent final
{
public:
	class FString                                 CSVEventName;                                      // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShouldRepToClient;                                // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FortAthenaMutator_SpecialEvent_AddCSVEvent;

// Function SpecialEventGameplayRuntime.FortAthenaMutator_SpecialEvent.AddToBlockedNativeActions
// 0x0028 (0x0028 - 0x0000)
struct FortAthenaMutator_SpecialEvent_AddToBlockedNativeActions final
{
public:
	struct FGameplayTagContainer                  Actions;                                           // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          bCancelAbilities;                                  // 0x0020(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FortAthenaMutator_SpecialEvent_AddToBlockedNativeActions;

// Function SpecialEventGameplayRuntime.FortAthenaMutator_SpecialEvent.ChangeWinCondition
// 0x0004 (0x0004 - 0x0000)
struct FortAthenaMutator_SpecialEvent_ChangeWinCondition final
{
public:
	float                                         NewGoalScore;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaMutator_SpecialEvent_ChangeWinCondition;

// Function SpecialEventGameplayRuntime.FortAthenaMutator_SpecialEvent.ForceSafeZoneFinalLocation
// 0x0028 (0x0028 - 0x0000)
struct FortAthenaMutator_SpecialEvent_ForceSafeZoneFinalLocation final
{
public:
	struct FVector                                NewFinalLocation;                                  // 0x0000(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DefaultAircraftOffsetFromMidLine;                  // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MinDefaultMidlineAngle;                            // 0x001C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxDefaultMidlineAngle;                            // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FortAthenaMutator_SpecialEvent_ForceSafeZoneFinalLocation;

// Function SpecialEventGameplayRuntime.FortAthenaMutator_SpecialEvent.HandleSpecialEventMannequinDestroyed
// 0x0008 (0x0008 - 0x0000)
struct FortAthenaMutator_SpecialEvent_HandleSpecialEventMannequinDestroyed final
{
public:
	class AActor*                                 MannequinActor;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaMutator_SpecialEvent_HandleSpecialEventMannequinDestroyed;

// Function SpecialEventGameplayRuntime.FortAthenaMutator_SpecialEvent.JumpToSafeZonePhase
// 0x0020 (0x0020 - 0x0000)
struct FortAthenaMutator_SpecialEvent_JumpToSafeZonePhase final
{
public:
	struct FVector                                PawnSpawnCenterLocation;                           // 0x0000(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PawnSpawnMinDistance;                              // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PawnSpawnMaxDistance;                              // 0x001C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaMutator_SpecialEvent_JumpToSafeZonePhase;

// Function SpecialEventGameplayRuntime.FortAthenaMutator_SpecialEvent.OnActorPreSpawnInitialization
// 0x0008 (0x0008 - 0x0000)
struct FortAthenaMutator_SpecialEvent_OnActorPreSpawnInitialization final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaMutator_SpecialEvent_OnActorPreSpawnInitialization;

// Function SpecialEventGameplayRuntime.FortAthenaMutator_SpecialEvent.OnActorSpawned
// 0x0008 (0x0008 - 0x0000)
struct FortAthenaMutator_SpecialEvent_OnActorSpawned final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaMutator_SpecialEvent_OnActorSpawned;

// Function SpecialEventGameplayRuntime.FortAthenaMutator_SpecialEvent.OnAircraftEnteredDropZone
// 0x0008 (0x0008 - 0x0000)
struct FortAthenaMutator_SpecialEvent_OnAircraftEnteredDropZone final
{
public:
	class AFortAthenaAircraft*                    FortAthenaAircraft;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaMutator_SpecialEvent_OnAircraftEnteredDropZone;

// Function SpecialEventGameplayRuntime.FortAthenaMutator_SpecialEvent.OnAircraftExitedDropZone
// 0x0008 (0x0008 - 0x0000)
struct FortAthenaMutator_SpecialEvent_OnAircraftExitedDropZone final
{
public:
	class AFortAthenaAircraft*                    FortAthenaAircraft;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaMutator_SpecialEvent_OnAircraftExitedDropZone;

// Function SpecialEventGameplayRuntime.FortAthenaMutator_SpecialEvent.OnAircraftFlightEnded
// 0x0008 (0x0008 - 0x0000)
struct FortAthenaMutator_SpecialEvent_OnAircraftFlightEnded final
{
public:
	class AFortAthenaAircraft*                    FortAthenaAircraft;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaMutator_SpecialEvent_OnAircraftFlightEnded;

// Function SpecialEventGameplayRuntime.FortAthenaMutator_SpecialEvent.OnGameViewportActivationChanged
// 0x0001 (0x0001 - 0x0000)
struct FortAthenaMutator_SpecialEvent_OnGameViewportActivationChanged final
{
public:
	bool                                          bHasFocus;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaMutator_SpecialEvent_OnGameViewportActivationChanged;

// Function SpecialEventGameplayRuntime.FortAthenaMutator_SpecialEvent.OnWarmUpTeleportComplete
// 0x0008 (0x0008 - 0x0000)
struct FortAthenaMutator_SpecialEvent_OnWarmUpTeleportComplete final
{
public:
	class AFortPlayerPawn*                        PlayerPawn;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaMutator_SpecialEvent_OnWarmUpTeleportComplete;

// Function SpecialEventGameplayRuntime.FortAthenaMutator_SpecialEvent.PauseStormDamage
// 0x0001 (0x0001 - 0x0000)
struct FortAthenaMutator_SpecialEvent_PauseStormDamage final
{
public:
	bool                                          bPause;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaMutator_SpecialEvent_PauseStormDamage;

// Function SpecialEventGameplayRuntime.FortAthenaMutator_SpecialEvent.PauseStormProgression
// 0x0001 (0x0001 - 0x0000)
struct FortAthenaMutator_SpecialEvent_PauseStormProgression final
{
public:
	bool                                          bPause;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaMutator_SpecialEvent_PauseStormProgression;

// Function SpecialEventGameplayRuntime.FortAthenaMutator_SpecialEvent.PauseSupplyDrops
// 0x0001 (0x0001 - 0x0000)
struct FortAthenaMutator_SpecialEvent_PauseSupplyDrops final
{
public:
	bool                                          bPause;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaMutator_SpecialEvent_PauseSupplyDrops;

// Function SpecialEventGameplayRuntime.FortAthenaMutator_SpecialEvent.PauseWinCondition
// 0x0001 (0x0001 - 0x0000)
struct FortAthenaMutator_SpecialEvent_PauseWinCondition final
{
public:
	bool                                          bLockScores;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaMutator_SpecialEvent_PauseWinCondition;

// Function SpecialEventGameplayRuntime.FortAthenaMutator_SpecialEvent.RemoveFromBlockedNativeActions
// 0x0020 (0x0020 - 0x0000)
struct FortAthenaMutator_SpecialEvent_RemoveFromBlockedNativeActions final
{
public:
	struct FGameplayTagContainer                  Actions;                                           // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaMutator_SpecialEvent_RemoveFromBlockedNativeActions;

// Function SpecialEventGameplayRuntime.FortAthenaMutator_SpecialEvent.ResetSafeZoneOverrideAfterEvent
// 0x000C (0x000C - 0x0000)
struct FortAthenaMutator_SpecialEvent_ResetSafeZoneOverrideAfterEvent final
{
public:
	int32                                         MinResetSafeZoneIndex;                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MinDelayReturnToMainMenu;                          // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxDelayReturnToMainMenu;                          // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaMutator_SpecialEvent_ResetSafeZoneOverrideAfterEvent;

// Function SpecialEventGameplayRuntime.FortAthenaMutator_SpecialEvent.SetAdditionalViewpoint
// 0x0018 (0x0018 - 0x0000)
struct FortAthenaMutator_SpecialEvent_SetAdditionalViewpoint final
{
public:
	struct FVector                                WorldLocation;                                     // 0x0000(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaMutator_SpecialEvent_SetAdditionalViewpoint;

// Function SpecialEventGameplayRuntime.FortAthenaMutator_SpecialEvent.SetCanStreamBuildingFoundationsIn
// 0x0001 (0x0001 - 0x0000)
struct FortAthenaMutator_SpecialEvent_SetCanStreamBuildingFoundationsIn final
{
public:
	bool                                          bEnable;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaMutator_SpecialEvent_SetCanStreamBuildingFoundationsIn;

// Function SpecialEventGameplayRuntime.FortAthenaMutator_SpecialEvent.SetDestroyVehiclesInStorm
// 0x0001 (0x0001 - 0x0000)
struct FortAthenaMutator_SpecialEvent_SetDestroyVehiclesInStorm final
{
public:
	bool                                          bDestroyVehiclesInStorm;                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaMutator_SpecialEvent_SetDestroyVehiclesInStorm;

// Function SpecialEventGameplayRuntime.FortAthenaMutator_SpecialEvent.SetIsSimulatingDamage
// 0x0001 (0x0001 - 0x0000)
struct FortAthenaMutator_SpecialEvent_SetIsSimulatingDamage final
{
public:
	bool                                          bIsSimulating;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaMutator_SpecialEvent_SetIsSimulatingDamage;

// Function SpecialEventGameplayRuntime.FortAthenaMutator_SpecialEvent.SetLockingOnFocalPoint
// 0x0001 (0x0001 - 0x0000)
struct FortAthenaMutator_SpecialEvent_SetLockingOnFocalPoint final
{
public:
	bool                                          bInLockingOnFocalPoint;                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaMutator_SpecialEvent_SetLockingOnFocalPoint;

// Function SpecialEventGameplayRuntime.FortAthenaMutator_SpecialEvent.SetMatchTime
// 0x0004 (0x0004 - 0x0000)
struct FortAthenaMutator_SpecialEvent_SetMatchTime final
{
public:
	int32                                         NewMatchTime;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaMutator_SpecialEvent_SetMatchTime;

// Function SpecialEventGameplayRuntime.FortAthenaMutator_SpecialEvent.SetNamedWeightForContainerLootRoll
// 0x0004 (0x0004 - 0x0000)
struct FortAthenaMutator_SpecialEvent_SetNamedWeightForContainerLootRoll final
{
public:
	class FName                                   WeightName;                                        // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaMutator_SpecialEvent_SetNamedWeightForContainerLootRoll;

// Function SpecialEventGameplayRuntime.FortAthenaMutator_SpecialEvent.SetReturnToMainMenuDelay
// 0x0008 (0x0008 - 0x0000)
struct FortAthenaMutator_SpecialEvent_SetReturnToMainMenuDelay final
{
public:
	float                                         MinDelayReturnToMainMenu;                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxDelayReturnToMainMenu;                          // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaMutator_SpecialEvent_SetReturnToMainMenuDelay;

// Function SpecialEventGameplayRuntime.FortAthenaMutator_SpecialEvent.SetWeightForContainerLootRoll
// 0x0004 (0x0004 - 0x0000)
struct FortAthenaMutator_SpecialEvent_SetWeightForContainerLootRoll final
{
public:
	float                                         Weight;                                            // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaMutator_SpecialEvent_SetWeightForContainerLootRoll;

// Function SpecialEventGameplayRuntime.FortAthenaMutator_SpecialEvent.StartSafeZoneOverrideForEvent
// 0x0004 (0x0004 - 0x0000)
struct FortAthenaMutator_SpecialEvent_StartSafeZoneOverrideForEvent final
{
public:
	int32                                         SafeZoneIndexForEvent;                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaMutator_SpecialEvent_StartSafeZoneOverrideForEvent;

// Function SpecialEventGameplayRuntime.FortAthenaMutator_SpecialEvent.SwapBodyParts
// 0x0010 (0x0010 - 0x0000)
struct FortAthenaMutator_SpecialEvent_SwapBodyParts final
{
public:
	int32                                         ArrayIndex;                                        // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  FortPC;                                            // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaMutator_SpecialEvent_SwapBodyParts;

// Function SpecialEventGameplayRuntime.FortAthenaMutator_SpecialEvent.TeleportAllPlayers
// 0x0028 (0x0028 - 0x0000)
struct FortAthenaMutator_SpecialEvent_TeleportAllPlayers final
{
public:
	struct FGameplayTagContainer                  EventTags;                                         // 0x0000(0x0020)(Parm, NativeAccessSpecifierPublic)
	int32                                         TeleportsPerFrame;                                 // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SafeZoneIndex;                                     // 0x0024(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaMutator_SpecialEvent_TeleportAllPlayers;

// Function SpecialEventGameplayRuntime.FortAthenaMutator_SpecialEvent.ToggleAllPlayersInvincibility
// 0x0001 (0x0001 - 0x0000)
struct FortAthenaMutator_SpecialEvent_ToggleAllPlayersInvincibility final
{
public:
	bool                                          bInvincible;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaMutator_SpecialEvent_ToggleAllPlayersInvincibility;

// Function SpecialEventGameplayRuntime.FortAthenaMutator_SpecialEvent.ToggleDisableParachutes
// 0x0001 (0x0001 - 0x0000)
struct FortAthenaMutator_SpecialEvent_ToggleDisableParachutes final
{
public:
	bool                                          bDisable;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaMutator_SpecialEvent_ToggleDisableParachutes;

// Function SpecialEventGameplayRuntime.FortAthenaMutator_SpecialEvent.ToggleDisableWeapons
// 0x0001 (0x0001 - 0x0000)
struct FortAthenaMutator_SpecialEvent_ToggleDisableWeapons final
{
public:
	bool                                          bDisableWeapons;                                   // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaMutator_SpecialEvent_ToggleDisableWeapons;

// Function SpecialEventGameplayRuntime.FortAthenaMutator_SpecialEvent.ToggleHUDs
// 0x0001 (0x0001 - 0x0000)
struct FortAthenaMutator_SpecialEvent_ToggleHUDs final
{
public:
	bool                                          bHide;                                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaMutator_SpecialEvent_ToggleHUDs;

// Function SpecialEventGameplayRuntime.FortAthenaMutator_SpecialEvent.UnloadTerrainMaps
// 0x0004 (0x0004 - 0x0000)
struct FortAthenaMutator_SpecialEvent_UnloadTerrainMaps final
{
public:
	struct FGameplayTag                           MapTag;                                            // 0x0000(0x0004)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaMutator_SpecialEvent_UnloadTerrainMaps;

// Function SpecialEventGameplayRuntime.FortAthenaMutator_SpecialEvent.GetHasInfiniteSafeZonePhase
// 0x0001 (0x0001 - 0x0000)
struct FortAthenaMutator_SpecialEvent_GetHasInfiniteSafeZonePhase final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaMutator_SpecialEvent_GetHasInfiniteSafeZonePhase;

// Function SpecialEventGameplayRuntime.FortAthenaMutator_SpecialEvent.GetScript
// 0x0008 (0x0008 - 0x0000)
struct FortAthenaMutator_SpecialEvent_GetScript final
{
public:
	class ASpecialEventScript*                    ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaMutator_SpecialEvent_GetScript;

// Function SpecialEventGameplayRuntime.FortCameraMode_SpecialEventFocalPoint.OnBecomeActiveBP
// 0x0008 (0x0008 - 0x0000)
struct FortCameraMode_SpecialEventFocalPoint_OnBecomeActiveBP final
{
public:
	class AActor*                                 ViewTarget;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortCameraMode_SpecialEventFocalPoint_OnBecomeActiveBP;

// Function SpecialEventGameplayRuntime.FortCameraMode_SpecialEventFocalPoint.OnBecomeInactiveBP
// 0x0008 (0x0008 - 0x0000)
struct FortCameraMode_SpecialEventFocalPoint_OnBecomeInactiveBP final
{
public:
	class AActor*                                 ViewTarget;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortCameraMode_SpecialEventFocalPoint_OnBecomeInactiveBP;

// Function SpecialEventGameplayRuntime.FortCameraMode_SpecialEventFocalPoint.SetOverrideTransitionTime
// 0x0004 (0x0004 - 0x0000)
struct FortCameraMode_SpecialEventFocalPoint_SetOverrideTransitionTime final
{
public:
	float                                         InTransitionTime;                                  // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortCameraMode_SpecialEventFocalPoint_SetOverrideTransitionTime;

// Function SpecialEventGameplayRuntime.FortCameraMode_SpecialEventFocalPoint.UpdateCameraBP
// 0x07F0 (0x07F0 - 0x0000)
struct FortCameraMode_SpecialEventFocalPoint_UpdateCameraBP final
{
public:
	class AActor*                                 ViewTarget;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DeltaTime;                                         // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTViewTarget                           OutVT;                                             // 0x0010(0x07E0)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortCameraMode_SpecialEventFocalPoint_UpdateCameraBP;

// Function SpecialEventGameplayRuntime.FortCharacterMovementMutatorComponent.OnMovementModeChanged
// 0x0010 (0x0010 - 0x0000)
struct FortCharacterMovementMutatorComponent_OnMovementModeChanged final
{
public:
	class ACharacter*                             Character;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMovementMode                                 PreviousMovementMode;                              // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         PreviousCustomMode;                                // 0x0009(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FortCharacterMovementMutatorComponent_OnMovementModeChanged;

// Function SpecialEventGameplayRuntime.FortCharacterMovementMutatorComponent.OverrideBuffetFlyingMaxSpeed
// 0x000C (0x000C - 0x0000)
struct FortCharacterMovementMutatorComponent_OverrideBuffetFlyingMaxSpeed final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAsMultiplier;                                     // 0x0004(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         InterpSpeed;                                       // 0x0008(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortCharacterMovementMutatorComponent_OverrideBuffetFlyingMaxSpeed;

// Function SpecialEventGameplayRuntime.FortCharacterMovementMutatorComponent.OverrideBuffetFlyingVelocityDirectionInterpSpeed
// 0x0008 (0x0008 - 0x0000)
struct FortCharacterMovementMutatorComponent_OverrideBuffetFlyingVelocityDirectionInterpSpeed final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAsMultiplier;                                     // 0x0004(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FortCharacterMovementMutatorComponent_OverrideBuffetFlyingVelocityDirectionInterpSpeed;

// Function SpecialEventGameplayRuntime.FortCharacterMovementMutatorComponent.SetBuffetBubblesFollowActor
// 0x0008 (0x0008 - 0x0000)
struct FortCharacterMovementMutatorComponent_SetBuffetBubblesFollowActor final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortCharacterMovementMutatorComponent_SetBuffetBubblesFollowActor;

// Function SpecialEventGameplayRuntime.FortCharacterMovementMutatorComponent.SetBuffetBubblesInitialFollowBoxOffsetPercent
// 0x0018 (0x0018 - 0x0000)
struct FortCharacterMovementMutatorComponent_SetBuffetBubblesInitialFollowBoxOffsetPercent final
{
public:
	struct FVector                                BoxOffsetPercent;                                  // 0x0000(0x0018)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortCharacterMovementMutatorComponent_SetBuffetBubblesInitialFollowBoxOffsetPercent;

// Function SpecialEventGameplayRuntime.FortCharacterMovementMutatorComponent.SetBuffetBubblesIntroTargetTransform
// 0x0060 (0x0060 - 0x0000)
struct FortCharacterMovementMutatorComponent_SetBuffetBubblesIntroTargetTransform final
{
public:
	struct FTransform                             Transform;                                         // 0x0000(0x0060)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortCharacterMovementMutatorComponent_SetBuffetBubblesIntroTargetTransform;

// Function SpecialEventGameplayRuntime.FortCharacterMovementMutator.OnFortPawnChanged
// 0x0008 (0x0008 - 0x0000)
struct FortCharacterMovementMutator_OnFortPawnChanged final
{
public:
	class AFortPawn*                              NewPawn;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortCharacterMovementMutator_OnFortPawnChanged;

// Function SpecialEventGameplayRuntime.FortControllerComponent_GameplayCinematic.HideHUDElementsForLoadingScreen
// 0x0001 (0x0001 - 0x0000)
struct FortControllerComponent_GameplayCinematic_HideHUDElementsForLoadingScreen final
{
public:
	bool                                          bHideElements;                                     // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortControllerComponent_GameplayCinematic_HideHUDElementsForLoadingScreen;

// Function SpecialEventGameplayRuntime.FortControllerComponent_GameplayCinematic.SetReadyForGameplay
// 0x0001 (0x0001 - 0x0000)
struct FortControllerComponent_GameplayCinematic_SetReadyForGameplay final
{
public:
	bool                                          bIsReady;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortControllerComponent_GameplayCinematic_SetReadyForGameplay;

// Function SpecialEventGameplayRuntime.FortControllerComponent_GameplayCinematic.ShowCinematicWidget
// 0x0004 (0x0004 - 0x0000)
struct FortControllerComponent_GameplayCinematic_ShowCinematicWidget final
{
public:
	class FName                                   WidgetName;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortControllerComponent_GameplayCinematic_ShowCinematicWidget;

// Function SpecialEventGameplayRuntime.FortControllerComponent_SpecialEvent.SendSpecialClientEvent
// 0x0008 (0x0008 - 0x0000)
struct FortControllerComponent_SpecialEvent_SendSpecialClientEvent final
{
public:
	struct FGameplayTag                           EventTag;                                          // 0x0000(0x0004)(ConstParm, Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Count;                                             // 0x0004(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortControllerComponent_SpecialEvent_SendSpecialClientEvent;

// Function SpecialEventGameplayRuntime.FortControllerComponent_SpecialEvent.ServerHandleSpecialClientEvent
// 0x0008 (0x0008 - 0x0000)
struct FortControllerComponent_SpecialEvent_ServerHandleSpecialClientEvent final
{
public:
	struct FGameplayTag                           EventTag;                                          // 0x0000(0x0004)(ConstParm, Parm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Count;                                             // 0x0004(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortControllerComponent_SpecialEvent_ServerHandleSpecialClientEvent;

// Function SpecialEventGameplayRuntime.FortSpecialRelevancyActorSpawner.BP_OnActorSpawnedPerRelevancyGroup
// 0x0010 (0x0010 - 0x0000)
struct FortSpecialRelevancyActorSpawner_BP_OnActorSpawnedPerRelevancyGroup final
{
public:
	TArray<class AActor*>                         InSpawnedActors;                                   // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortSpecialRelevancyActorSpawner_BP_OnActorSpawnedPerRelevancyGroup;

// Function SpecialEventGameplayRuntime.SpecialEventAudioAnalysisBaseComponent.UpdateConstantQ
// 0x0004 (0x0004 - 0x0000)
struct SpecialEventAudioAnalysisBaseComponent_UpdateConstantQ final
{
public:
	float                                         Time;                                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SpecialEventAudioAnalysisBaseComponent_UpdateConstantQ;

// Function SpecialEventGameplayRuntime.SpecialEventAudioAnalysisBaseComponent.UpdateLoudness
// 0x0004 (0x0004 - 0x0000)
struct SpecialEventAudioAnalysisBaseComponent_UpdateLoudness final
{
public:
	float                                         Time;                                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SpecialEventAudioAnalysisBaseComponent_UpdateLoudness;

// Function SpecialEventGameplayRuntime.SpecialEventAudioAnalysisBaseComponent.UpdateOnset
// 0x0004 (0x0004 - 0x0000)
struct SpecialEventAudioAnalysisBaseComponent_UpdateOnset final
{
public:
	float                                         Time;                                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SpecialEventAudioAnalysisBaseComponent_UpdateOnset;

// Function SpecialEventGameplayRuntime.SpecialEventAudioAnalysisBaseComponent.UpdateTime
// 0x0004 (0x0004 - 0x0000)
struct SpecialEventAudioAnalysisBaseComponent_UpdateTime final
{
public:
	float                                         NewTime;                                           // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SpecialEventAudioAnalysisBaseComponent_UpdateTime;

// Function SpecialEventGameplayRuntime.SpecialEventAudioAnalysisBaseComponent.GetConstantQNRT
// 0x0008 (0x0008 - 0x0000)
struct SpecialEventAudioAnalysisBaseComponent_GetConstantQNRT final
{
public:
