#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SpecialEventGameplayUI

#include "Basic.hpp"

#include "CommonUI_classes.hpp"
#include "SpecialEventGameplayUI_structs.hpp"
#include "UMG_classes.hpp"
#include "FortniteUI_classes.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class SpecialEventGameplayUI.FortGameplayCinematicHostWidget
// 0x0038 (0x0360 - 0x0328)
class UFortGameplayCinematicHostWidget final : public UFortHUDElementWidget
{
public:
	class FName                                   IntroWidgetEntryName;                              // 0x0328(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_32C[0x4];                                      // 0x032C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FCinematicWidgetData>           WidgetEntries;                                     // 0x0330(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	class UAthenaLoadingScreenItemDefinition*     LoadingScreenDefinition;                           // 0x0340(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_348[0x18];                                     // 0x0348(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortGameplayCinematicHostWidget")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortGameplayCinematicHostWidget")
	}
	static class UFortGameplayCinematicHostWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortGameplayCinematicHostWidget>();
	}
};
DUMPER7_ASSERTS_UFortGameplayCinematicHostWidget;

// Class SpecialEventGameplayUI.FortGameplayCinematicWidget
// 0x0020 (0x0420 - 0x0400)
class UFortGameplayCinematicWidget final : public UCommonActivatableWidget
{
public:
	uint8                                         Pad_400[0x8];                                      // 0x0400(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bSkipCinematics;                                   // 0x0408(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_409[0x17];                                     // 0x0409(0x0017)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnCinematicFinished();
	void OnStartCinematic();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortGameplayCinematicWidget")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortGameplayCinematicWidget")
	}
	static class UFortGameplayCinematicWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortGameplayCinematicWidget>();
	}
};
DUMPER7_ASSERTS_UFortGameplayCinematicWidget;

// Class SpecialEventGameplayUI.FortGameplayIntroPanelWidget
// 0x0020 (0x0420 - 0x0400)
class UFortGameplayIntroPanelWidget final : public UCommonActivatableWidget
{
public:
	uint8                                         Pad_400[0x20];                                     // 0x0400(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnIntroFinished();
	void OnStartIntro();
	void OnWaitingForMinTime();
	void OnWaitingForPawn();
	void OnWaitingForReadyForGameplay();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortGameplayIntroPanelWidget")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortGameplayIntroPanelWidget")
	}
	static class UFortGameplayIntroPanelWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortGameplayIntroPanelWidget>();
	}
};
DUMPER7_ASSERTS_UFortGameplayIntroPanelWidget;

// Class SpecialEventGameplayUI.SpecialEventCursorWidget
// 0x0020 (0x02E0 - 0x02C0)
class USpecialEventCursorWidget final : public UUserWidget
{
public:
	uint8                                         Pad_2C0[0x8];                                      // 0x02C0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bAutomaticallyChangeVisibility;                    // 0x02C8(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2C9[0x7];                                      // 0x02C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USpecialEventCursorPawnComponent*       CursorPawnComponent;                               // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2D8[0x8];                                      // 0x02D8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BP_OnCursorModeChanged(class USpecialEventCursorPawnComponent* InCursorPawnComponent, const struct FGameplayTag& NewCursorModeTag, const struct FGameplayTag& OldCursorModeTag);
	void BP_OnDesiredVisibilityChanged(class USpecialEventCursorPawnComponent* InCursorPawnComponent, const struct FGameplayTag& CursorModeTag, const bool bShouldBeVisible);
	void OnCursorModeChanged(class USpecialEventCursorPawnComponent* InCursorPawnComponent, const struct FGameplayTag& NewCursorModeTag, const struct FGameplayTag& OldCursorModeTag);
	void OnDesiredVisibilityChanged(class USpecialEventCursorPawnComponent* InCursorPawnComponent, const struct FGameplayTag& CursorModeTag, const bool bShouldBeVisible);
	void OnViewportLocationChanged(class USpecialEventCursorPawnComponent* InCursorPawnComponent, const struct FVector2D& NormalizedLocation, const struct FVector2D& ViewportLocation);

	struct FGameplayTagContainer GetCursorModeTags() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SpecialEventCursorWidget")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SpecialEventCursorWidget")
	}
	static class USpecialEventCursorWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<USpecialEventCursorWidget>();
	}
};
DUMPER7_ASSERTS_USpecialEventCursorWidget;

// Class SpecialEventGameplayUI.SpecialEventPlayerInfoWidget
// 0x0020 (0x0348 - 0x0328)
class USpecialEventPlayerInfoWidget final : public UFortHUDElementWidget
{
public:
	uint8                                         Pad_328[0x8];                                      // 0x0328(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(class AFortPlayerStateAthena* OldPlayerState, class AFortPlayerStateAthena* NewPlayerState)> OnRepresentedPlayerStateChanged; // 0x0330(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_340[0x8];                                      // 0x0340(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class AFortPlayerStateAthena* GetRepresentedPlayerState() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SpecialEventPlayerInfoWidget")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SpecialEventPlayerInfoWidget")
	}
	static class USpecialEventPlayerInfoWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<USpecialEventPlayerInfoWidget>();
	}
};
DUMPER7_ASSERTS_USpecialEventPlayerInfoWidget;

// Class SpecialEventGameplayUI.SpecialEventUILibrary
// 0x0000 (0x0028 - 0x0028)
class USpecialEventUILibrary final : public UBlueprintFunctionLibrary
{
public:
	static void HideFrontEndStateWidget(const class UObject* WorldContextObject, bool bNewlyHidden);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SpecialEventUILibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SpecialEventUILibrary")
	}
	static class USpecialEventUILibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<USpecialEventUILibrary>();
	}
};
DUMPER7_ASSERTS_USpecialEventUILibrary;

}

