#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Speed_CameraShakeLocationPerlin_Sliding

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayCameras_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Speed_CameraShakeLocationPerlin_Sliding.Speed_CameraShakeLocationPerlin_Sliding_C
// 0x0030 (0x0220 - 0x01F0)
class USpeed_CameraShakeLocationPerlin_Sliding_C final : public ULegacyCameraShake
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x01F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	double                                        OscillatorAmplitudeX;                              // 0x01F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        OscillatorAmplitudeY;                              // 0x0200(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        OscillatorAmplitudeZ;                              // 0x0208(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MinShakeScalar;                                    // 0x0210(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BlueprintUpdateCameraShake(float DeltaTime, float Alpha, const struct FMinimalViewInfo& POV, struct FMinimalViewInfo* ModifiedPOV);
	void ExecuteUbergraph_Speed_CameraShakeLocationPerlin_Sliding(int32 EntryPoint);
	void ReceivePlayShake(float Scale);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Speed_CameraShakeLocationPerlin_Sliding_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Speed_CameraShakeLocationPerlin_Sliding_C")
	}
	static class USpeed_CameraShakeLocationPerlin_Sliding_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USpeed_CameraShakeLocationPerlin_Sliding_C>();
	}
};
DUMPER7_ASSERTS_USpeed_CameraShakeLocationPerlin_Sliding_C;

}

