#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SqueegeeUI

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "SqueegeeUI_structs.hpp"


namespace SDK::Params
{

// Function SqueegeeUI.FortContentGateDetailsWidget.OnShowGamemodeDescription
// 0x0010 (0x0010 - 0x0000)
struct FortContentGateDetailsWidget_OnShowGamemodeDescription final
{
public:
	class FString                                 ActivityTitle;                                     // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortContentGateDetailsWidget_OnShowGamemodeDescription;

// Function SqueegeeUI.FortContentGateRatingWidget.OnLabelUpdated
// 0x0038 (0x0038 - 0x0000)
struct FortContentGateRatingWidget_OnLabelUpdated final
{
public:
	bool                                          bLabelEnabled;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   LabelText;                                         // 0x0008(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FText                                   LabelNumber;                                       // 0x0020(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortContentGateRatingWidget_OnLabelUpdated;

// Function SqueegeeUI.FortContentGateRatingWidget.OnStyleUpdated
// 0x0030 (0x0030 - 0x0000)
struct FortContentGateRatingWidget_OnStyleUpdated final
{
public:
	struct FSqueegeeStyleParams                   StyleParams;                                       // 0x0000(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortContentGateRatingWidget_OnStyleUpdated;

// Function SqueegeeUI.FortContentManagementDetails.OnPreviewImageChanged
// 0x0010 (0x0010 - 0x0000)
struct FortContentManagementDetails_OnPreviewImageChanged final
{
public:
	bool                                          bIsLoading;                                        // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class UTexture*                         Texture;                                           // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortContentManagementDetails_OnPreviewImageChanged;

// Function SqueegeeUI.FortContentManagementDetails.OnShowActivityData
// 0x0070 (0x0070 - 0x0000)
struct FortContentManagementDetails_OnShowActivityData final
{
public:
	class FText                                   ActivityDisplayName;                               // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FText                                   ActivityDescription;                               // 0x0018(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 CreatorName;                                       // 0x0030(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   LinkCode;                                          // 0x0040(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          IsCreative;                                        // 0x0058(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDateTime                              UnlockTime;                                        // 0x0060(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortGameActivity*                      GameActivity;                                      // 0x0068(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortContentManagementDetails_OnShowActivityData;

// Function SqueegeeUI.FortContentManagementButton.OnChangeManagementState
// 0x0001 (0x0001 - 0x0000)
struct FortContentManagementButton_OnChangeManagementState final
{
public:
	EFortContentManagementState                   NewState;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortContentManagementButton_OnChangeManagementState;

// Function SqueegeeUI.FortContentManagementButton.OnShowError
// 0x0018 (0x0018 - 0x0000)
struct FortContentManagementButton_OnShowError final
{
public:
	class FText                                   ErrorText;                                         // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortContentManagementButton_OnShowError;

// Function SqueegeeUI.FortContentManagementButton.OnShowGameActivity
// 0x0008 (0x0008 - 0x0000)
struct FortContentManagementButton_OnShowGameActivity final
{
public:
	const class UFortGameActivity*                NewGameActivity;                                   // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortContentManagementButton_OnShowGameActivity;

// Function SqueegeeUI.FortContentManagementLabelWidget.OnSetLabel
// 0x0018 (0x0018 - 0x0000)
struct FortContentManagementLabelWidget_OnSetLabel final
{
public:
	class FText                                   InText;                                            // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortContentManagementLabelWidget_OnSetLabel;

// Function SqueegeeUI.FortContentManagementList.OnNextUnlockPageRequestCompleted
// 0x0001 (0x0001 - 0x0000)
struct FortContentManagementList_OnNextUnlockPageRequestCompleted final
{
public:
	bool                                          bSuccess;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortContentManagementList_OnNextUnlockPageRequestCompleted;

// Function SqueegeeUI.FortContentManagementList.CanRequestNextUnlockPage
// 0x0001 (0x0001 - 0x0000)
struct FortContentManagementList_CanRequestNextUnlockPage final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortContentManagementList_CanRequestNextUnlockPage;

}

