#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SqueegeeUI

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"
#include "UMG_classes.hpp"
#include "FortniteUI_classes.hpp"
#include "CommonUI_classes.hpp"
#include "SqueegeeUI_structs.hpp"


namespace SDK
{

// Class SqueegeeUI.FortContentGateDetailsWidget
// 0x0008 (0x0310 - 0x0308)
class UFortContentGateDetailsWidget final : public UFortSqueegeeWidget
{
public:
	class UFortContentGateRatingWidget*           ContentGateRatingWidget;                           // 0x0308(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void OnShowGamemodeDescription(const class FString& ActivityTitle);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortContentGateDetailsWidget")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortContentGateDetailsWidget")
	}
	static class UFortContentGateDetailsWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortContentGateDetailsWidget>();
	}
};
DUMPER7_ASSERTS_UFortContentGateDetailsWidget;

// Class SqueegeeUI.FortContentGateRatingWidget
// 0x0000 (0x0308 - 0x0308)
class UFortContentGateRatingWidget final : public UFortSqueegeeWidget
{
public:
	void OnLabelUpdated(bool bLabelEnabled, const class FText& LabelText, const class FText& LabelNumber);
	void OnStyleUpdated(const struct FSqueegeeStyleParams& StyleParams);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortContentGateRatingWidget")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortContentGateRatingWidget")
	}
	static class UFortContentGateRatingWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortContentGateRatingWidget>();
	}
};
DUMPER7_ASSERTS_UFortContentGateRatingWidget;

// Class SqueegeeUI.FortContentManagementDetails
// 0x0038 (0x0340 - 0x0308)
class UFortContentManagementDetails final : public UFortSqueegeeWidget
{
public:
	class UFortContentGateRatingWidget*           ContentGateRatingWidget;                           // 0x0308(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_310[0x30];                                     // 0x0310(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnPreviewImageChanged(const bool bIsLoading, const class UTexture* Texture);
	void OnShowActivityData(const class FText& ActivityDisplayName, const class FText& ActivityDescription, const class FString& CreatorName, const class FText& LinkCode, const bool IsCreative, const struct FDateTime& UnlockTime, class UFortGameActivity* GameActivity);
	void OnShowWeaponData();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortContentManagementDetails")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortContentManagementDetails")
	}
	static class UFortContentManagementDetails* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortContentManagementDetails>();
	}
};
DUMPER7_ASSERTS_UFortContentManagementDetails;

// Class SqueegeeUI.FortContentManagementButton
// 0x0030 (0x14C0 - 0x1490)
class UFortContentManagementButton final : public UCommonButtonBase
{
public:
	uint8                                         Pad_1490[0x30];                                    // 0x1490(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnChangeManagementState(EFortContentManagementState NewState);
	void OnShowError(const class FText& ErrorText);
	void OnShowGameActivity(const class UFortGameActivity* NewGameActivity);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortContentManagementButton")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortContentManagementButton")
	}
	static class UFortContentManagementButton* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortContentManagementButton>();
	}
};
DUMPER7_ASSERTS_UFortContentManagementButton;

// Class SqueegeeUI.FortContentManagementLabelWidget
// 0x0008 (0x02C8 - 0x02C0)
class UFortContentManagementLabelWidget final : public UUserWidget
{
public:
	uint8                                         Pad_2C0[0x8];                                      // 0x02C0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnSetLabel(const class FText& InText);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortContentManagementLabelWidget")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortContentManagementLabelWidget")
	}
	static class UFortContentManagementLabelWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortContentManagementLabelWidget>();
	}
};
DUMPER7_ASSERTS_UFortContentManagementLabelWidget;

// Class SqueegeeUI.FortContentManagementEntryLabelObject
// 0x0018 (0x0040 - 0x0028)
class UFortContentManagementEntryLabelObject final : public UObject
{
public:
	uint8                                         Pad_28[0x18];                                      // 0x0028(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortContentManagementEntryLabelObject")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortContentManagementEntryLabelObject")
	}
	static class UFortContentManagementEntryLabelObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortContentManagementEntryLabelObject>();
	}
};
DUMPER7_ASSERTS_UFortContentManagementEntryLabelObject;

// Class SqueegeeUI.FortContentManagementEntryDataObject
// 0x0038 (0x0060 - 0x0028)
class UFortContentManagementEntryDataObject final : public UObject
{
public:
	uint8                                         Pad_28[0x38];                                      // 0x0028(0x0038)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortContentManagementEntryDataObject")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortContentManagementEntryDataObject")
	}
	static class UFortContentManagementEntryDataObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortContentManagementEntryDataObject>();
	}
};
DUMPER7_ASSERTS_UFortContentManagementEntryDataObject;

// Class SqueegeeUI.FortContentManagementListView
// 0x0010 (0x0BE0 - 0x0BD0)
class UFortContentManagementListView final : public UCommonListView
{
public:
	TSubclassOf<class UFortContentManagementLabelWidget> LabelWidget;                                // 0x0BD0(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_BD8[0x8];                                      // 0x0BD8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortContentManagementListView")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortContentManagementListView")
	}
	static class UFortContentManagementListView* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortContentManagementListView>();
	}
};
DUMPER7_ASSERTS_UFortContentManagementListView;

// Class SqueegeeUI.FortContentManagementList
// 0x0080 (0x0388 - 0x0308)
class UFortContentManagementList final : public UFortSqueegeeWidget
{
public:
	class FText                                   WeaponLabelText;                                   // 0x0308(0x0018)(Edit, Protected, NativeAccessSpecifierProtected)
	class FText                                   GameModeLabelText;                                 // 0x0320(0x0018)(Edit, Protected, NativeAccessSpecifierProtected)
	class UFortContentManagementListView*         ContentManagementListView;                         // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_340[0x18];                                     // 0x0340(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UFortGameActivity*>              CachedActivities;                                  // 0x0358(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                         Pad_368[0x20];                                     // 0x0368(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnNextUnlockPageRequestCompleted(bool bSuccess);
	void RequestNextUnlockPage();
	void ResetUnlockList();

	bool CanRequestNextUnlockPage() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortContentManagementList")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortContentManagementList")
	}
	static class UFortContentManagementList* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortContentManagementList>();
	}
};
DUMPER7_ASSERTS_UFortContentManagementList;

// Class SqueegeeUI.FortContentManagementScreen
// 0x0018 (0x0560 - 0x0548)
class UFortContentManagementScreen final : public UFortPinScreen
{
public:
	class UCommonButtonBase*                      Button_CloseTouch;                                 // 0x0548(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortContentManagementList*             ContentManagementList;                             // 0x0550(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortContentManagementDetails*          ContentManagementDetails;                          // 0x0558(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void ExitScreen();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortContentManagementScreen")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortContentManagementScreen")
	}
	static class UFortContentManagementScreen* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortContentManagementScreen>();
	}
};
DUMPER7_ASSERTS_UFortContentManagementScreen;

// Class SqueegeeUI.SqueegeeUIGameFeatureAction
// 0x0040 (0x0068 - 0x0028)
class USqueegeeUIGameFeatureAction final : public UFortUIGameFeatureAction
{
public:
	TArray<struct FSqueegeeInjectionData>         SqueegeeWidgetInjections;                          // 0x0028(0x0010)(Edit, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<struct FSqueegeeTextData>              SqueegeTexts;                                      // 0x0038(0x0010)(Edit, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TSoftClassPtr<class UClass>                   SqueegeeIntroModalClass;                           // 0x0048(0x0020)(Edit, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SqueegeeUIGameFeatureAction")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SqueegeeUIGameFeatureAction")
	}
	static class USqueegeeUIGameFeatureAction* GetDefaultObj()
	{
		return GetDefaultObjImpl<USqueegeeUIGameFeatureAction>();
	}
};
DUMPER7_ASSERTS_USqueegeeUIGameFeatureAction;

}

