#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TODLighting_MaterialDataStruct

#include "Basic.hpp"

#include "DayPhaseLinearColor_structs.hpp"
#include "DayPhaseFloats_structs.hpp"


namespace SDK
{

// UserDefinedStruct TODLighting_MaterialDataStruct.TODLighting_MaterialDataStruct
// 0x0058 (0x0058 - 0x0000)
struct FTODLighting_MaterialDataStruct final
{
public:
	class FName                                   MaterialParamName_21_074764624CE1A181BC71C98592AA126E; // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsAFloatParam_22_6C839CDF4ED19C4F278620A0E5F7E523; // 0x0004(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDayPhaseFloats                        FloatValues_18_7A5E960D4F135E322711D997FE3D3E13;   // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDayPhaseLinearColor                   ColorValues_19_CEDF2F4740D4EFE5C331D0AF80FC29B4;   // 0x0018(0x0040)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FTODLighting_MaterialDataStruct;

}

