#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TODLightingComponent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "TODLighting_LightDataStruct_structs.hpp"
#include "TODLighting_MeshDataStruct_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass TODLightingComponent.TODLightingComponent_C
// 0x0148 (0x01E8 - 0x00A0)
class UTODLightingComponent_C final : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TArray<struct FTODLighting_MeshDataStruct>    TODMeshData;                                       // 0x00A8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FTODLighting_LightDataStruct>   TODLightData;                                      // 0x00B8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	double                                        AmortizationDelay;                                 // 0x00C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortDayPhase                                 CurrentDayPhase;                                   // 0x00D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class UMeshComponent*, struct FTODLighting_MeshDataStruct> FinalMeshToDataMap;              // 0x00D8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TMap<class ULightComponent*, struct FTODLighting_LightDataStruct> FinalLightToDataMap;           // 0x0128(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	EFortDayPhase                                 TestDayPhase;                                      // 0x0178(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_179[0x3];                                      // 0x0179(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         LightingQuality;                                   // 0x017C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<class FString, class ULightComponent*>   LightNameMap;                                      // 0x0180(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TScriptInterface<class IFortTimeOfDayManagerInterface> CachedTimeOfDayManager;                   // 0x01D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortAsyncAction_WaitForTimeOfDayManagerUpdated* WaitForTimeOfDayManagerAsyncTask;         // 0x01E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void UnregisterDayPhaseChanged();
	void TryGetBaseMaterialInstance(class UMaterialInterface* MatInterface, bool* Valid, class UMaterialInstanceConstant** MIC);
	void TODLightingComponent_AutoGenFunc(class UActorComponent* Component, bool bReset);
	void ShouldMeshAddToMap(const TMap<class FString, class UMeshComponent*>& TargetMap, const struct FTODLighting_MeshDataStruct& TODLighting_MeshDataStruct, bool* Valid, class UMeshComponent** Comp, struct FTODLighting_MeshDataStruct* Data);
	bool ShouldLightAddToMap(class ULightComponentBase* Light);
	void RunConstruct(EFortDayPhase TestDayPhase_0);
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void ReceiveBeginPlay();
	void OnUpdated_B2DD98EA4AFB750BC9863B98DFEC177C(TScriptInterface<class IFortTimeOfDayManagerInterface> TimeOfDayManager);
	void OnComponentDeactivated_Event(class UActorComponent* Component);
	void IsLightFunctionAllowed(bool* Value);
	bool IsLightDataValid(const struct FTODLighting_LightDataStruct& LightData);
	void InitLightingQuality();
	void HandleTodPhaseChanged(EFortDayPhase CurrentDayPhase_0, bool ForceUpdate);
	void HandleOnEffectsQualityChanged();
	void HandleDayPhaseChanged(EFortDayPhase CurrentDayPhase_0, EFortDayPhase PreviousDayPhase, bool bAtCreation);
	void GetVisibleFromDayPhaseBools(const struct FDayPhaseBools& DayPhaseLinearColor, bool* Value);
	void GetVectorFromDayPhaseColor(const struct FDayPhaseLinearColor& DayPhaseLinearColor, struct FVector* Value);
	void GetValueFromDayPhaseFloats(const struct FDayPhaseFloats& DayPhaseFloats, float* Value);
	void GetFriendlyCompName(const class UObject* Comp, class FString* Name_0);
	void getAmortizationDelay(double* AmortizationDelay_0);
	void GenerateComponentToDataMap();
	void ExecuteUbergraph_TODLightingComponent(int32 EntryPoint);
	void ClearLightFunction();
	void ApplyLightFunction();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("TODLightingComponent_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"TODLightingComponent_C")
	}
	static class UTODLightingComponent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTODLightingComponent_C>();
	}
};
DUMPER7_ASSERTS_UTODLightingComponent_C;

}

