#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TrainRuntime

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "TrainRuntime_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "TargetingSystem_structs.hpp"


namespace SDK
{

// Class TrainRuntime.FortTrainCheatManager
// 0x0018 (0x0040 - 0x0028)
class UFortTrainCheatManager final : public UChildCheatManager
{
public:
	uint8                                         Pad_28[0x18];                                      // 0x0028(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetTrainMoveInPositiveRailDirection(bool bMoveInPositiveRailDirection);
	void SetTrainStartLocationToCursor();
	void TeleportToTrain();
	void TeleportToTrainStartLocation();
	void TeleportTrainToCursor();
	void TeleportTrainToTrainStartLocation();

	void PrintTrainDebug() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortTrainCheatManager")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortTrainCheatManager")
	}
	static class UFortTrainCheatManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortTrainCheatManager>();
	}
};
DUMPER7_ASSERTS_UFortTrainCheatManager;

// Class TrainRuntime.FortTrainSpawner
// 0x0088 (0x0318 - 0x0290)
class AFortTrainSpawner final : public AActor
{
public:
	class UTrainConfig*                           TrainConfig;                                       // 0x0290(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FScalableFloat                         RandomizeSpawnLocation;                            // 0x0298(0x0028)(Edit, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         ReverseDirection;                                  // 0x02C0(0x0028)(Edit, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         RandomizeDirection;                                // 0x02E8(0x0028)(Edit, Protected, NativeAccessSpecifierProtected)
	class AFortTrainRail*                         Rail;                                              // 0x0310(0x0008)(Edit, ZeroConstructor, DisableEditOnTemplate, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortTrainSpawner")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortTrainSpawner")
	}
	static class AFortTrainSpawner* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFortTrainSpawner>();
	}
};
DUMPER7_ASSERTS_AFortTrainSpawner;

// Class TrainRuntime.TrainCar
// 0x0188 (0x0440 - 0x02B8)
class ATrainCar final : public AFortGameplayTagActor
{
public:
	uint8                                         Pad_2B8[0x14];                                     // 0x02B8(0x0014)(Fixing Size After Last Property [ Dumper-7 ])
	uint8                                         bCanBeMarked : 1;                                  // 0x02CC(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bBlockMarking : 1;                                 // 0x02CC(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         Pad_2CD[0x3];                                      // 0x02CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMarkedActorDisplayInfo                MarkerDisplay;                                     // 0x02D0(0x00A8)(Edit, BlueprintVisible, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FVector                                MarkerPositionOffset;                              // 0x0378(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         Length;                                            // 0x0390(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         ConnectorLength;                                   // 0x0394(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTargetingPreset*                       DestructionTargetingPreset;                        // 0x0398(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTargetingPreset*                       ImpulseTargetingPreset;                            // 0x03A0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FScalableFloat                         DestroyBuildings;                                  // 0x03A8(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         DestroyOnlyTargetPlayerBuilds;                     // 0x03D0(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                  DestructionActorTags;                              // 0x03F8(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                  DestructionIgnoredActorTags;                       // 0x0418(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FTargetingRequestHandle                DestructionAsyncTargetingHandle;                   // 0x0438(0x0004)(Transient, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FTargetingRequestHandle                ImpulseAsyncTargetingHandle;                       // 0x043C(0x0004)(Transient, NoDestructor, Protected, NativeAccessSpecifierProtected)

public:
	void OnActorTargetedForImpulse(class AActor* Actor);
	void OnPawnBasedOnTrainCar(class AFortPawn* Pawn);
	void OnPawnDebasedTrainCar(class AFortPawn* Pawn, class AActor* NewBase);

	int32 GetCarIndex() const;
	class UFortTrainManager* GetTrainManager() const;
	struct FTransform GetTransformAtServerTime(float ServerTime) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("TrainCar")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"TrainCar")
	}
	static class ATrainCar* GetDefaultObj()
	{
		return GetDefaultObjImpl<ATrainCar>();
	}
};
DUMPER7_ASSERTS_ATrainCar;

// Class TrainRuntime.TrainConfig
// 0x0068 (0x0098 - 0x0030)
class UTrainConfig final : public UPrimaryDataAsset
{
public:
	TSubclassOf<class UFortTrainManager>          TrainManagerClass;                                 // 0x0030(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<TSubclassOf<class ATrainCar>>          Cars;                                              // 0x0038(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, UObjectWrapper, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         MoveSpeed;                                         // 0x0048(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         DefaultConnectorLength;                            // 0x0070(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("TrainConfig")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"TrainConfig")
	}
	static class UTrainConfig* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTrainConfig>();
	}
};
DUMPER7_ASSERTS_UTrainConfig;

// Class TrainRuntime.FortTrainManager
// 0x0148 (0x0250 - 0x0108)
class UFortTrainManager final : public UMovementComponent
{
public:
	uint8                                         Pad_108[0x10];                                     // 0x0108(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bProceduralCarOrder;                               // 0x0118(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDataTable*                             CarTable;                                          // 0x0120(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FDataTableRowHandle>            CarOrder;                                          // 0x0128(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	float                                         DefaultConnectorLength;                            // 0x0138(0x0004)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         BaseMoveSpeed;                                     // 0x013C(0x0004)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FScalableFloat                         TruckLocationTolerance;                            // 0x0140(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         MaxIterations;                                     // 0x0168(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         MaxErrorOffset;                                    // 0x0190(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         ErrorCatchupSpeedModifier;                         // 0x01B8(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	class AFortTrainRail*                         Rail;                                              // 0x01E0(0x0008)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, RepNotify, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FTrainCarRuntimeData>           Cars;                                              // 0x01E8(0x0010)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_1F8[0x10];                                     // 0x01F8(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTrainMovementData                     ReplicatedMovementData;                            // 0x0208(0x0010)(Net, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_218[0x18];                                     // 0x0218(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioShapeLineListComponent*           CachedAudioShapeLineList;                          // 0x0230(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_238[0x18];                                     // 0x0238(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void MoveAlongRail(float DeltaDistance, bool bUpdateReplicatedMovementData);
	void MoveToPositionOnRail(float RailDistance, bool bUpdateReplicatedMovementData);
	void MoveToPositionOnRailAtCurrentServerTime(bool bUpdateReplicatedMovementData);
	void MoveToTimeAlongRail(float Time, bool bUpdateReplicatedMovementData);
	void OnRep_Rail();
	void PlaceOnRails();

	struct FVector GetWorldLocationAtServerTime(float ServerTime) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortTrainManager")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortTrainManager")
	}
	static class UFortTrainManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortTrainManager>();
	}
};
DUMPER7_ASSERTS_UFortTrainManager;

// Class TrainRuntime.FortTrainStationComponent
// 0x00B0 (0x02D0 - 0x0220)
class UFortTrainStationComponent final : public USceneComponent
{
public:
	struct FGameplayTag                           IdentifierTag;                                     // 0x0220(0x0004)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_224[0x4];                                      // 0x0224(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         EnterLength;                                       // 0x0228(0x0028)(Edit, NativeAccessSpecifierPublic)
	struct FScalableFloat                         CoastLength;                                       // 0x0250(0x0028)(Edit, NativeAccessSpecifierPublic)
	struct FScalableFloat                         ExitLength;                                        // 0x0278(0x0028)(Edit, NativeAccessSpecifierPublic)
	struct FScalableFloat                         SpeedMultiplier;                                   // 0x02A0(0x0028)(Edit, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C8[0x8];                                      // 0x02C8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortTrainStationComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortTrainStationComponent")
	}
	static class UFortTrainStationComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortTrainStationComponent>();
	}
};
DUMPER7_ASSERTS_UFortTrainStationComponent;

// Class TrainRuntime.FortTrainRail
// 0x0058 (0x02E8 - 0x0290)
class AFortTrainRail final : public AActor
{
public:
	TSoftObjectPtr<class ALandscapeSplineActor>   LandscapeSplineActor;                              // 0x0290(0x0020)(Edit, DisableEditOnTemplate, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bMinimizeSplineComponent;                          // 0x02B0(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2B1[0x3];                                      // 0x02B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MaxTangentDifference;                              // 0x02B4(0x0004)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USplineComponent*                       SplineComponent;                                   // 0x02B8(0x0008)(Edit, ExportObject, ZeroConstructor, DisableEditOnTemplate, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2C0[0x28];                                     // 0x02C0(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void GenerateSpline() const;
	float GetTimeFromNextTrainArrival(const struct FGameplayTag& StationIdentifierTag) const;
	void ValidateSpline() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortTrainRail")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortTrainRail")
	}
	static class AFortTrainRail* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFortTrainRail>();
	}
};
DUMPER7_ASSERTS_AFortTrainRail;

// Class TrainRuntime.FortTrainMovingPlatformComponent
// 0x0038 (0x0218 - 0x01E0)
class UFortTrainMovingPlatformComponent final : public UFortMovingPlatformComponent
{
public:
	class UCurveVector*                           PickupPushCurve;                                   // 0x01E0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FScalableFloat                         PickupTeleportDistance;                            // 0x01E8(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	uint8                                         Pad_210[0x8];                                      // 0x0210(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class UFortTrainManager* FindOrGetTrainManager() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortTrainMovingPlatformComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortTrainMovingPlatformComponent")
	}
	static class UFortTrainMovingPlatformComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortTrainMovingPlatformComponent>();
	}
};
DUMPER7_ASSERTS_UFortTrainMovingPlatformComponent;

}

