#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Transient

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "RigVM_structs.hpp"
#include "ControlRig_structs.hpp"
#include "AnimationCore_structs.hpp"


namespace SDK
{

// PropertyBag Transient.PropertyBag_85125b1eb4cc6b33
// 0x0004 (0x0004 - 0x0000)
struct FPropertyBag_85125b1eb4cc6b33 final
{
public:
	float                                         Size;                                              // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FPropertyBag_85125b1eb4cc6b33;

// PropertyBag Transient.PropertyBag_50c645ccd47b1e99
// 0x0010 (0x0010 - 0x0000)
struct FPropertyBag_50c645ccd47b1e99 final
{
public:
	class USoundBase*                             MTXOfferTileIntroWhoosh;                           // 0x0000(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             ShopRowWhooshIn;                                   // 0x0008(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FPropertyBag_50c645ccd47b1e99;

// PropertyBag Transient.PropertyBag_700e5e48b89b8d51
// 0x0008 (0x0008 - 0x0000)
struct FPropertyBag_700e5e48b89b8d51 final
{
public:
	float                                         LineHeightPercentage;                              // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Size;                                              // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FPropertyBag_700e5e48b89b8d51;

// PropertyBag Transient.PropertyBag_0
// 0x0000 (0x0000 - 0x0000)
struct FPropertyBag_0 final
{
};
DUMPER7_ASSERTS_FPropertyBag_0;

// PropertyBag Transient.PropertyBag_b8f7e39e1b84d733
// 0x0030 (0x0030 - 0x0000)
struct FPropertyBag_b8f7e39e1b84d733 final
{
public:
	struct FSlateSound                            PressedSlateSoundOverride;                         // 0x0000(0x0018)(Edit, NoDestructor)
	struct FSlateSound                            HoveredSlateSoundOverride;                         // 0x0018(0x0018)(Edit, NoDestructor)
};
DUMPER7_ASSERTS_FPropertyBag_b8f7e39e1b84d733;

// PropertyBag Transient.PropertyBag_85a5171357ffa522
// 0x0020 (0x0020 - 0x0000)
struct FPropertyBag_85a5171357ffa522 final
{
public:
	class USoundBase*                             BannerAppearSound;                                 // 0x0000(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             BannerAwaySound;                                   // 0x0008(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             IntroSound;                                        // 0x0010(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             OutroSound;                                        // 0x0018(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FPropertyBag_85a5171357ffa522;

// PropertyBag Transient.PropertyBag_862508c04c749853
// 0x0010 (0x0010 - 0x0000)
struct FPropertyBag_862508c04c749853 final
{
public:
	struct FMargin                                Margin;                                            // 0x0000(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_FPropertyBag_862508c04c749853;

// ScriptStruct Transient.ChaosDestructionEvent_SWC
// 0x0044 (0x0044 - 0x0000)
struct FChaosDestructionEvent_SWC final
{
public:
	struct FVector3f                              Position;                                          // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector3f                              Normal;                                            // 0x000C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector3f                              Velocity;                                          // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector3f                              AngularVelocity;                                   // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ExtentMin;                                         // 0x0030(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ExtentMax;                                         // 0x0034(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ParticleID;                                        // 0x0038(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Time;                                              // 0x003C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Type;                                              // 0x0040(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FChaosDestructionEvent_SWC;

// PropertyBag Transient.PropertyBag_9055436973ad2326
// 0x02C8 (0x02C8 - 0x0000)
struct FPropertyBag_9055436973ad2326 final
{
public:
	int32                                         RigVMModel___VariableNode_2_Value__Const;          // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FRigElementKey>                 Eye_Mapping_FNC___Eye_Mapping_FNC_is_expr_activated_FNC_11_2_2_1_1_2_1_1_1_Curves__Const; // 0x0008(0x0010)(Edit)
	double                                        Eye_Mapping_FNC___Eye_Mapping_FNC_is_expr_activated_FNC_11_2_2_1_1_2_1_1_1_value__Const; // 0x0018(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Eye_Mapping_FNC___Eye_Mapping_FNC_is_expr_activated_FNC_11_2_2_1_1_2_1_1_1_ApplyToAll__Const; // 0x0020(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          LocalVariableDefault__is_expr_activated_FNC_is_expr_activated__Const; // 0x0021(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          LocalVariable__FunctionLibrary___is_expr_activated_FNC_VariableNode_3_Value__Const; // 0x0022(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          LocalVariable__FunctionLibrary___is_expr_activated_FNC_VariableNode_Value__Const; // 0x0023(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FRigElementKey>                 Eye_Mapping_FNC___Eye_Mapping_FNC_is_expr_activated_FNC_11_2_2_1_1_2_2_Curves__Const; // 0x0028(0x0010)(Edit)
	bool                                          Eye_Mapping_FNC___Eye_Mapping_FNC_is_expr_activated_FNC_11_2_2_1_1_2_2_ApplyToAll__Const; // 0x0038(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Eye_Mapping_FNC___Eye_Mapping_FNC_VariableNode_26_2_Value__Const; // 0x003C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Eye_Mapping_FNC___Eye_Mapping_FNC_VariableNode_26_1_3_Value__Const; // 0x0040(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Eye_Mapping_FNC___Eye_Mapping_FNC_VariableNode_26_1_1_1_Value__Const; // 0x0044(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FRigElementKey>                 Eye_Mapping_FNC___Eye_Mapping_FNC_is_expr_activated_FNC_11_2_2_1_1_2_1_2_1_2_Curves__Const; // 0x0048(0x0010)(Edit)
	TArray<struct FRigElementKey>                 Eye_Mapping_FNC___Eye_Mapping_FNC_get_largest_val_index_FNC_Curves__Const; // 0x0058(0x0010)(Edit)
	TArray<int32>                                 Eye_Mapping_FNC___Eye_Mapping_FNC_get_largest_val_index_FNC_Indexes__Const; // 0x0068(0x0010)(Edit)
	double                                        LocalVariableDefault__get_largest_val_index_FNC_tmp_val__Const; // 0x0078(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LocalVariableDefault__get_largest_val_index_FNC_largest_val_index__Const; // 0x0080(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LocalVariable__FunctionLibrary___get_largest_val_index_FNC_VariableNode_5_Value__Const; // 0x0084(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Eye_Mapping_FNC___Eye_Mapping_FNC_VariableNode_26_1_2_1_1_2_Value__Const; // 0x0088(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FRigElementKey>                 Eye_Mapping_FNC___Eye_Mapping_FNC_is_expr_activated_FNC_11_2_2_1_1_2_1_2_1_1_1_1_Curves__Const; // 0x0090(0x0010)(Edit)
	int32                                         Eye_Mapping_FNC___Eye_Mapping_FNC_VariableNode_26_1_2_1_1_1_1_Value__Const; // 0x00A0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FRigElementKey>                 Eye_Mapping_FNC___Eye_Mapping_FNC_is_expr_activated_FNC_11_2_2_1_1_2_1_1_1_1_Curves__Const; // 0x00A8(0x0010)(Edit)
	TArray<struct FRigElementKey>                 Eye_Mapping_FNC___Eye_Mapping_FNC_is_expr_activated_FNC_11_2_2_1_1_2_2_1_Curves__Const; // 0x00B8(0x0010)(Edit)
	TArray<struct FRigElementKey>                 Eye_Mapping_FNC___Eye_Mapping_FNC_is_expr_activated_FNC_11_2_2_1_1_2_1_2_1_2_1_Curves__Const; // 0x00C8(0x0010)(Edit)
	TArray<struct FRigElementKey>                 Eye_Mapping_FNC___Eye_Mapping_FNC_is_expr_activated_FNC_11_2_2_1_1_2_1_2_1_1_1_1_1_Curves__Const; // 0x00D8(0x0010)(Edit)
	bool                                          LocalVariableDefault__Brow_Mapping_FNC_glabella_up__Const; // 0x00E8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          LocalVariableDefault__Brow_Mapping_FNC_glabella_dn__Const; // 0x00E9(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EA[0x6];                                       // 0x00EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FRigElementKey>                 Brow_Mapping_FNC___Brow_Mapping_FNC_get_largest_val_index_FNC_2_2_1_1_1_1_Curves__Const; // 0x00F0(0x0010)(Edit)
	TArray<int32>                                 Brow_Mapping_FNC___Brow_Mapping_FNC_get_largest_val_index_FNC_2_2_1_1_1_1_Indexes__Const; // 0x0100(0x0010)(Edit)
	int32                                         Brow_Mapping_FNC___Brow_Mapping_FNC_DISPATCH_RigVMDispatch_CoreEquals_1_B__Const; // 0x0110(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          LocalVariable__FunctionLibrary___Brow_Mapping_FNC_VariableNode_Value__Const; // 0x0114(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          LocalVariable__FunctionLibrary___Brow_Mapping_FNC_VariableNode_4_Value__Const; // 0x0115(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_116[0x2];                                      // 0x0116(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FRigElementKey>                 Brow_Mapping_FNC___Brow_Mapping_FNC_get_largest_val_index_FNC_2_2_1_1_2_Curves__Const; // 0x0118(0x0010)(Edit)
	TArray<int32>                                 Brow_Mapping_FNC___Brow_Mapping_FNC_get_largest_val_index_FNC_2_2_1_1_2_Indexes__Const; // 0x0128(0x0010)(Edit)
	int32                                         Brow_Mapping_FNC___Brow_Mapping_FNC_DISPATCH_RigVMDispatch_CoreEquals_2_B__Const; // 0x0138(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Brow_Mapping_FNC___Brow_Mapping_FNC_VariableNode_6_1_1_1_Value__Const; // 0x013C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Brow_Mapping_FNC___Brow_Mapping_FNC_VariableNode_6_1_1_Value__Const; // 0x0140(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Brow_Mapping_FNC___Brow_Mapping_FNC_DISPATCH_RigVMDispatch_CoreEquals_B__Const; // 0x0144(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Brow_Mapping_FNC___Brow_Mapping_FNC_VariableNode_6_1_Value__Const; // 0x0148(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Brow_Mapping_FNC___Brow_Mapping_FNC_VariableNode_6_Value__Const; // 0x014C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FRigElementKey>                 Brow_Mapping_FNC___Brow_Mapping_FNC_get_largest_val_index_FNC_2_2_1_1_2_1_Curves__Const; // 0x0150(0x0010)(Edit)
	TArray<struct FRigElementKey>                 Mouth_Mapping_FNC___Mouth_Mapping_FNC_get_largest_val_index_FNC_2_1_2_1_1_1_Curves__Const; // 0x0160(0x0010)(Edit)
	TArray<int32>                                 Mouth_Mapping_FNC___Mouth_Mapping_FNC_get_largest_val_index_FNC_2_1_2_1_1_1_Indexes__Const; // 0x0170(0x0010)(Edit)
	double                                        Mouth_Mapping_FNC___Mouth_Mapping_FNC_get_largest_val_index_FNC_2_1_2_1_1_1_value__Const; // 0x0180(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FRigElementKey>                 Mouth_Mapping_FNC___Mouth_Mapping_FNC_get_largest_val_index_FNC_2_1_2_1_2_Curves__Const; // 0x0188(0x0010)(Edit)
	TArray<int32>                                 Mouth_Mapping_FNC___Mouth_Mapping_FNC_get_largest_val_index_FNC_2_1_2_1_2_Indexes__Const; // 0x0198(0x0010)(Edit)
	double                                        Mouth_Mapping_FNC___Mouth_Mapping_FNC_get_largest_val_index_FNC_2_1_2_1_2_value__Const; // 0x01A8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FRigElementKey>                 Mouth_Mapping_FNC___Mouth_Mapping_FNC_is_expr_activated_FNC_11_1_1_Curves__Const; // 0x01B0(0x0010)(Edit)
	bool                                          Mouth_Mapping_FNC___Mouth_Mapping_FNC_is_expr_activated_FNC_11_1_1_ApplyToAll__Const; // 0x01C0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C1[0x3];                                      // 0x01C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Mouth_Mapping_FNC___Mouth_Mapping_FNC_VariableNode_23_1_3_Value__Const; // 0x01C4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FRigElementKey>                 Mouth_Mapping_FNC___Mouth_Mapping_FNC_is_expr_activated_FNC_11_2_2_1_1_1_1_1_Curves__Const; // 0x01C8(0x0010)(Edit)
	int32                                         Mouth_Mapping_FNC___Mouth_Mapping_FNC_VariableNode_23_2_2_1_1_1_1_Value__Const; // 0x01D8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1DC[0x4];                                      // 0x01DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FRigElementKey>                 Mouth_Mapping_FNC___Mouth_Mapping_FNC_is_expr_activated_FNC_11_2_2_1_1_1_2_Curves__Const; // 0x01E0(0x0010)(Edit)
	int32                                         Mouth_Mapping_FNC___Mouth_Mapping_FNC_VariableNode_23_2_2_1_1_2_Value__Const; // 0x01F0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F4[0x4];                                      // 0x01F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FRigElementKey>                 Mouth_Mapping_FNC___Mouth_Mapping_FNC_is_expr_activated_FNC_11_2_2_1_1_2_Curves__Const; // 0x01F8(0x0010)(Edit)
	bool                                          Mouth_Mapping_FNC___Mouth_Mapping_FNC_is_expr_activated_FNC_11_2_2_1_1_2_ApplyToAll__Const; // 0x0208(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_209[0x3];                                      // 0x0209(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Mouth_Mapping_FNC___Mouth_Mapping_FNC_VariableNode_23_2_2_1_2_Value__Const; // 0x020C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FRigElementKey>                 Mouth_Mapping_FNC___Mouth_Mapping_FNC_is_expr_activated_FNC_11_2_2_1_2_Curves__Const; // 0x0210(0x0010)(Edit)
	TArray<int32>                                 Mouth_Mapping_FNC___Mouth_Mapping_FNC_get_largest_val_index_FNC_2_1_2_2_Indexes__Const; // 0x0220(0x0010)(Edit)
	int32                                         Mouth_Mapping_FNC___Mouth_Mapping_FNC_DISPATCH_RigVMDispatch_CoreEquals_1_B__Const; // 0x0230(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_234[0x4];                                      // 0x0234(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FRigElementKey>                 Mouth_Mapping_FNC___Mouth_Mapping_FNC_is_expr_activated_FNC_11_2_3_Curves__Const; // 0x0238(0x0010)(Edit)
	TArray<struct FRigElementKey>                 Mouth_Mapping_FNC___Mouth_Mapping_FNC_is_expr_activated_FNC_11_2_1_1_Curves__Const; // 0x0248(0x0010)(Edit)
	int32                                         Mouth_Mapping_FNC___Mouth_Mapping_FNC_VariableNode_23_2_1_1_Value__Const; // 0x0258(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25C[0x4];                                      // 0x025C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FRigElementKey>                 Mouth_Mapping_FNC___Mouth_Mapping_FNC_is_expr_activated_FNC_11_3_1_Curves__Const; // 0x0260(0x0010)(Edit)
	int32                                         Mouth_Mapping_FNC___Mouth_Mapping_FNC_VariableNode_23_1_2_2_1_Value__Const; // 0x0270(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_274[0x4];                                      // 0x0274(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 Mouth_Mapping_FNC___Mouth_Mapping_FNC_get_largest_val_index_FNC_2_1_3_Indexes__Const; // 0x0278(0x0010)(Edit)
	TArray<struct FRigElementKey>                 Mouth_Mapping_FNC___Mouth_Mapping_FNC_get_largest_val_index_FNC_2_1_1_1_Curves__Const; // 0x0288(0x0010)(Edit)
	int32                                         Mouth_Mapping_FNC___Mouth_Mapping_FNC_VariableNode_23_3_Value__Const; // 0x0298(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29C[0x4];                                      // 0x029C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 Mouth_Mapping_FNC___Mouth_Mapping_FNC_get_largest_val_index_FNC_2_2_Indexes__Const; // 0x02A0(0x0010)(Edit)
	class FName                                   RigVMModel___SetCurveValue_2_Curve__Const;         // 0x02B0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   RigVMModel___SetCurveValue_1_2_Curve__Const;       // 0x02B4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   RigVMModel___SetCurveValue_1_1_2_Curve__Const;     // 0x02B8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   RigVMModel___SetCurveValue_1_1_1_2_Curve__Const;   // 0x02BC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   RigVMModel___SetCurveValue_1_1_1_1_1_Curve__Const; // 0x02C0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FPropertyBag_9055436973ad2326;

// PropertyBag Transient.PropertyBag_32198ad8ae01162a
// 0x0040 (0x0040 - 0x0000)
struct FPropertyBag_32198ad8ae01162a final
{
public:
	class UMaterialInstance*                      RegularFontMaterial;                               // 0x0000(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      RegularSecondaryFontMaterial;                      // 0x0008(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      RegularBackgroundMaterial;                         // 0x0010(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      RegularOutlineMaterial;                            // 0x0018(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      QuietFontMaterial;                                 // 0x0020(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      QuietSecondaryFontMaterial;                        // 0x0028(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      QuietBackgroundMaterial;                           // 0x0030(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      QuietOutlineMaterial;                              // 0x0038(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FPropertyBag_32198ad8ae01162a;

// PropertyBag Transient.PropertyBag_73c83f300aa939fa
// 0x0004 (0x0004 - 0x0000)
struct FPropertyBag_73c83f300aa939fa final
{
public:
	float                                         LineHeightPercentage;                              // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FPropertyBag_73c83f300aa939fa;

// PropertyBag Transient.PropertyBag_16760b1878cd5980
// 0x0014 (0x0014 - 0x0000)
struct FPropertyBag_16760b1878cd5980 final
{
public:
	struct FMargin                                Margin;                                            // 0x0000(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         LineHeightPercentage;                              // 0x0010(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FPropertyBag_16760b1878cd5980;

// PropertyBag Transient.PropertyBag_10e30536cff3ef0b
// 0x0008 (0x0008 - 0x0000)
struct FPropertyBag_10e30536cff3ef0b final
{
public:
	class USoundBase*                             MatchMakingSucceededSound;                         // 0x0000(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FPropertyBag_10e30536cff3ef0b;

// PropertyBag Transient.PropertyBag_82c781121f843240
// 0x0010 (0x0010 - 0x0000)
struct FPropertyBag_82c781121f843240 final
{
public:
	struct FMargin                                Margin;                                            // 0x0000(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_FPropertyBag_82c781121f843240;

// PropertyBag Transient.PropertyBag_9b3a5948429b3cc3
// 0x0004 (0x0004 - 0x0000)
struct FPropertyBag_9b3a5948429b3cc3 final
{
public:
	class FName                                   TypefaceFontName;                                  // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FPropertyBag_9b3a5948429b3cc3;

// PropertyBag Transient.PropertyBag_d6c5bdad1a1083e1
// 0x0D48 (0x0D48 - 0x0000)
struct FPropertyBag_d6c5bdad1a1083e1 final
{
public:
	bool                                          Eye_Mapping_FNC___Eye_Mapping_FNC_is_expr_activated_FNC_11_2_2_1_1_2_1_1_1_Output; // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         is_expr_activated_FNC_11_2_2_1_1_2_1_1_1___is_expr_activated_FNC_GetCurveValue_Value; // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         is_expr_activated_FNC_11_2_2_1_1_2_1_1_1___is_expr_activated_FNC_DISPATCH_RigVMDispatch_ArrayIterator_Element; // 0x0008(0x0008)(Edit, NoDestructor, HasGetValueTypeHash)
	class FName                                   is_expr_activated_FNC_11_2_2_1_1_2_1_1_1___is_expr_activated_FNC_GetCurveValue_Curve; // 0x0010(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          is_expr_activated_FNC_11_2_2_1_1_2_1_1_1___is_expr_activated_FNC_GetCurveValue_Valid; // 0x0014(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FCachedRigElement>              is_expr_activated_FNC_11_2_2_1_1_2_1_1_1___is_expr_activated_FNC_GetCurveValue_CachedCurveIndex; // 0x0018(0x0010)(Edit)
	bool                                          is_expr_activated_FNC_11_2_2_1_1_2_1_1_1___is_expr_activated_FNC_Less_Result; // 0x0028(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        is_expr_activated_FNC_11_2_2_1_1_2_1_1_1___is_expr_activated_FNC_Less_A; // 0x0030(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   is_expr_activated_FNC_11_2_2_1_1_2_1_1_1___is_expr_activated_FNC_RigVMFunction_ControlFlowBranch_2_BlockToRun; // 0x0038(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          is_expr_activated_FNC_11_2_2_1_1_2_1_1_1___is_expr_activated_FNC_GreaterEqual_Result; // 0x003C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        is_expr_activated_FNC_11_2_2_1_1_2_1_1_1___is_expr_activated_FNC_GreaterEqual_A; // 0x0040(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   is_expr_activated_FNC_11_2_2_1_1_2_1_1_1___is_expr_activated_FNC_RigVMFunction_ControlFlowBranch_BlockToRun; // 0x0048(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   is_expr_activated_FNC_11_2_2_1_1_2_1_1_1___is_expr_activated_FNC_RigVMFunction_ControlFlowBranch_1_BlockToRun; // 0x004C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         is_expr_activated_FNC_11_2_2_1_1_2_1_1_1___is_expr_activated_FNC_DISPATCH_RigVMDispatch_ArrayIterator_Index; // 0x0050(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         is_expr_activated_FNC_11_2_2_1_1_2_1_1_1___is_expr_activated_FNC_DISPATCH_RigVMDispatch_ArrayIterator_Count; // 0x0054(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         is_expr_activated_FNC_11_2_2_1_1_2_1_1_1___is_expr_activated_FNC_DISPATCH_RigVMDispatch_ArrayIterator_Ratio; // 0x0058(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   is_expr_activated_FNC_11_2_2_1_1_2_1_1_1___is_expr_activated_FNC_DISPATCH_RigVMDispatch_ArrayIterator_BlockToRun; // 0x005C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Eye_Mapping_FNC___Eye_Mapping_FNC_is_expr_activated_FNC_11_2_2_1_1_2_2_Output; // 0x0060(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         is_expr_activated_FNC_11_2_2_1_1_2_2___is_expr_activated_FNC_GetCurveValue_Value; // 0x0064(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         is_expr_activated_FNC_11_2_2_1_1_2_2___is_expr_activated_FNC_DISPATCH_RigVMDispatch_ArrayIterator_Element; // 0x0068(0x0008)(Edit, NoDestructor, HasGetValueTypeHash)
	class FName                                   is_expr_activated_FNC_11_2_2_1_1_2_2___is_expr_activated_FNC_GetCurveValue_Curve; // 0x0070(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          is_expr_activated_FNC_11_2_2_1_1_2_2___is_expr_activated_FNC_GetCurveValue_Valid; // 0x0074(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FCachedRigElement>              is_expr_activated_FNC_11_2_2_1_1_2_2___is_expr_activated_FNC_GetCurveValue_CachedCurveIndex; // 0x0078(0x0010)(Edit)
	bool                                          is_expr_activated_FNC_11_2_2_1_1_2_2___is_expr_activated_FNC_Less_Result; // 0x0088(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        is_expr_activated_FNC_11_2_2_1_1_2_2___is_expr_activated_FNC_Less_A; // 0x0090(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   is_expr_activated_FNC_11_2_2_1_1_2_2___is_expr_activated_FNC_RigVMFunction_ControlFlowBranch_2_BlockToRun; // 0x0098(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          is_expr_activated_FNC_11_2_2_1_1_2_2___is_expr_activated_FNC_GreaterEqual_Result; // 0x009C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9D[0x3];                                       // 0x009D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        is_expr_activated_FNC_11_2_2_1_1_2_2___is_expr_activated_FNC_GreaterEqual_A; // 0x00A0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   is_expr_activated_FNC_11_2_2_1_1_2_2___is_expr_activated_FNC_RigVMFunction_ControlFlowBranch_BlockToRun; // 0x00A8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   is_expr_activated_FNC_11_2_2_1_1_2_2___is_expr_activated_FNC_RigVMFunction_ControlFlowBranch_1_BlockToRun; // 0x00AC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         is_expr_activated_FNC_11_2_2_1_1_2_2___is_expr_activated_FNC_DISPATCH_RigVMDispatch_ArrayIterator_Index; // 0x00B0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         is_expr_activated_FNC_11_2_2_1_1_2_2___is_expr_activated_FNC_DISPATCH_RigVMDispatch_ArrayIterator_Count; // 0x00B4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         is_expr_activated_FNC_11_2_2_1_1_2_2___is_expr_activated_FNC_DISPATCH_RigVMDispatch_ArrayIterator_Ratio; // 0x00B8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   is_expr_activated_FNC_11_2_2_1_1_2_2___is_expr_activated_FNC_DISPATCH_RigVMDispatch_ArrayIterator_BlockToRun; // 0x00BC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Eye_Mapping_FNC___Eye_Mapping_FNC_is_expr_activated_FNC_11_2_2_1_1_2_1_3_Output; // 0x00C0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x3];                                       // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         is_expr_activated_FNC_11_2_2_1_1_2_1_3___is_expr_activated_FNC_GetCurveValue_Value; // 0x00C4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         is_expr_activated_FNC_11_2_2_1_1_2_1_3___is_expr_activated_FNC_DISPATCH_RigVMDispatch_ArrayIterator_Element; // 0x00C8(0x0008)(Edit, NoDestructor, HasGetValueTypeHash)
	class FName                                   is_expr_activated_FNC_11_2_2_1_1_2_1_3___is_expr_activated_FNC_GetCurveValue_Curve; // 0x00D0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          is_expr_activated_FNC_11_2_2_1_1_2_1_3___is_expr_activated_FNC_GetCurveValue_Valid; // 0x00D4(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D5[0x3];                                       // 0x00D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FCachedRigElement>              is_expr_activated_FNC_11_2_2_1_1_2_1_3___is_expr_activated_FNC_GetCurveValue_CachedCurveIndex; // 0x00D8(0x0010)(Edit)
	bool                                          is_expr_activated_FNC_11_2_2_1_1_2_1_3___is_expr_activated_FNC_Less_Result; // 0x00E8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        is_expr_activated_FNC_11_2_2_1_1_2_1_3___is_expr_activated_FNC_Less_A; // 0x00F0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   is_expr_activated_FNC_11_2_2_1_1_2_1_3___is_expr_activated_FNC_RigVMFunction_ControlFlowBranch_2_BlockToRun; // 0x00F8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          is_expr_activated_FNC_11_2_2_1_1_2_1_3___is_expr_activated_FNC_GreaterEqual_Result; // 0x00FC(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FD[0x3];                                       // 0x00FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        is_expr_activated_FNC_11_2_2_1_1_2_1_3___is_expr_activated_FNC_GreaterEqual_A; // 0x0100(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   is_expr_activated_FNC_11_2_2_1_1_2_1_3___is_expr_activated_FNC_RigVMFunction_ControlFlowBranch_BlockToRun; // 0x0108(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   is_expr_activated_FNC_11_2_2_1_1_2_1_3___is_expr_activated_FNC_RigVMFunction_ControlFlowBranch_1_BlockToRun; // 0x010C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         is_expr_activated_FNC_11_2_2_1_1_2_1_3___is_expr_activated_FNC_DISPATCH_RigVMDispatch_ArrayIterator_Index; // 0x0110(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         is_expr_activated_FNC_11_2_2_1_1_2_1_3___is_expr_activated_FNC_DISPATCH_RigVMDispatch_ArrayIterator_Count; // 0x0114(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         is_expr_activated_FNC_11_2_2_1_1_2_1_3___is_expr_activated_FNC_DISPATCH_RigVMDispatch_ArrayIterator_Ratio; // 0x0118(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   is_expr_activated_FNC_11_2_2_1_1_2_1_3___is_expr_activated_FNC_DISPATCH_RigVMDispatch_ArrayIterator_BlockToRun; // 0x011C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Eye_Mapping_FNC___Eye_Mapping_FNC_RigVMFunction_ControlFlowBranch_4_2_2_1_1_2_1_2_BlockToRun; // 0x0120(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Eye_Mapping_FNC___Eye_Mapping_FNC_RigVMFunction_ControlFlowBranch_4_2_2_1_1_2_2_BlockToRun; // 0x0124(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Eye_Mapping_FNC___Eye_Mapping_FNC_is_expr_activated_FNC_11_2_2_1_1_2_1_2_1_2_Output; // 0x0128(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_129[0x3];                                      // 0x0129(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         is_expr_activated_FNC_11_2_2_1_1_2_1_2_1_2___is_expr_activated_FNC_GetCurveValue_Value; // 0x012C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         is_expr_activated_FNC_11_2_2_1_1_2_1_2_1_2___is_expr_activated_FNC_DISPATCH_RigVMDispatch_ArrayIterator_Element; // 0x0130(0x0008)(Edit, NoDestructor, HasGetValueTypeHash)
	class FName                                   is_expr_activated_FNC_11_2_2_1_1_2_1_2_1_2___is_expr_activated_FNC_GetCurveValue_Curve; // 0x0138(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          is_expr_activated_FNC_11_2_2_1_1_2_1_2_1_2___is_expr_activated_FNC_GetCurveValue_Valid; // 0x013C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13D[0x3];                                      // 0x013D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FCachedRigElement>              is_expr_activated_FNC_11_2_2_1_1_2_1_2_1_2___is_expr_activated_FNC_GetCurveValue_CachedCurveIndex; // 0x0140(0x0010)(Edit)
	bool                                          is_expr_activated_FNC_11_2_2_1_1_2_1_2_1_2___is_expr_activated_FNC_Less_Result; // 0x0150(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        is_expr_activated_FNC_11_2_2_1_1_2_1_2_1_2___is_expr_activated_FNC_Less_A; // 0x0158(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   is_expr_activated_FNC_11_2_2_1_1_2_1_2_1_2___is_expr_activated_FNC_RigVMFunction_ControlFlowBranch_2_BlockToRun; // 0x0160(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          is_expr_activated_FNC_11_2_2_1_1_2_1_2_1_2___is_expr_activated_FNC_GreaterEqual_Result; // 0x0164(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_165[0x3];                                      // 0x0165(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        is_expr_activated_FNC_11_2_2_1_1_2_1_2_1_2___is_expr_activated_FNC_GreaterEqual_A; // 0x0168(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   is_expr_activated_FNC_11_2_2_1_1_2_1_2_1_2___is_expr_activated_FNC_RigVMFunction_ControlFlowBranch_BlockToRun; // 0x0170(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   is_expr_activated_FNC_11_2_2_1_1_2_1_2_1_2___is_expr_activated_FNC_RigVMFunction_ControlFlowBranch_1_BlockToRun; // 0x0174(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         is_expr_activated_FNC_11_2_2_1_1_2_1_2_1_2___is_expr_activated_FNC_DISPATCH_RigVMDispatch_ArrayIterator_Index; // 0x0178(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         is_expr_activated_FNC_11_2_2_1_1_2_1_2_1_2___is_expr_activated_FNC_DISPATCH_RigVMDispatch_ArrayIterator_Count; // 0x017C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         is_expr_activated_FNC_11_2_2_1_1_2_1_2_1_2___is_expr_activated_FNC_DISPATCH_RigVMDispatch_ArrayIterator_Ratio; // 0x0180(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   is_expr_activated_FNC_11_2_2_1_1_2_1_2_1_2___is_expr_activated_FNC_DISPATCH_RigVMDispatch_ArrayIterator_BlockToRun; // 0x0184(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Eye_Mapping_FNC___Eye_Mapping_FNC_get_largest_val_index_FNC_is_activated; // 0x0188(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_189[0x3];                                      // 0x0189(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Eye_Mapping_FNC___Eye_Mapping_FNC_get_largest_val_index_FNC_out_index; // 0x018C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         get_largest_val_index_FNC___get_largest_val_index_FNC_GetCurveValue_Value; // 0x0190(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         get_largest_val_index_FNC___get_largest_val_index_FNC_DISPATCH_RigVMDispatch_ArrayIterator_Element; // 0x0194(0x0008)(Edit, NoDestructor, HasGetValueTypeHash)
	class FName                                   get_largest_val_index_FNC___get_largest_val_index_FNC_GetCurveValue_Curve; // 0x019C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          get_largest_val_index_FNC___get_largest_val_index_FNC_GetCurveValue_Valid; // 0x01A0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A1[0x7];                                      // 0x01A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FCachedRigElement>              get_largest_val_index_FNC___get_largest_val_index_FNC_GetCurveValue_CachedCurveIndex; // 0x01A8(0x0010)(Edit)
	bool                                          get_largest_val_index_FNC___get_largest_val_index_FNC_RigVMFunction_MathBoolAnd_Result; // 0x01B8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          get_largest_val_index_FNC___get_largest_val_index_FNC_GreaterEqual_Result; // 0x01B9(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1BA[0x6];                                      // 0x01BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        get_largest_val_index_FNC___get_largest_val_index_FNC_GreaterEqual_A; // 0x01C0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          get_largest_val_index_FNC___get_largest_val_index_FNC_GreaterEqual_1_Result; // 0x01C8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C9[0x7];                                      // 0x01C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        get_largest_val_index_FNC___get_largest_val_index_FNC_GreaterEqual_1_A; // 0x01D0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        LocalVariable__get_largest_val_index_FNC_tmp_val;  // 0x01D8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         get_largest_val_index_FNC___get_largest_val_index_FNC_DISPATCH_RigVMDispatch_ArrayGetAtIndex_Element; // 0x01E0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         get_largest_val_index_FNC___get_largest_val_index_FNC_DISPATCH_RigVMDispatch_ArrayIterator_Index; // 0x01E4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   get_largest_val_index_FNC___get_largest_val_index_FNC_RigVMFunction_ControlFlowBranch_BlockToRun; // 0x01E8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         get_largest_val_index_FNC___get_largest_val_index_FNC_DISPATCH_RigVMDispatch_ArrayIterator_Count; // 0x01EC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         get_largest_val_index_FNC___get_largest_val_index_FNC_DISPATCH_RigVMDispatch_ArrayIterator_Ratio; // 0x01F0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   get_largest_val_index_FNC___get_largest_val_index_FNC_DISPATCH_RigVMDispatch_ArrayIterator_BlockToRun; // 0x01F4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Eye_Mapping_FNC___Eye_Mapping_FNC_RigVMFunction_ControlFlowBranch_1_BlockToRun; // 0x01F8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Eye_Mapping_FNC___Eye_Mapping_FNC_is_expr_activated_FNC_11_2_2_1_1_2_1_2_1_1_1_1_Output; // 0x01FC(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1FD[0x3];                                      // 0x01FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         is_expr_activated_FNC_11_2_2_1_1_2_1_2_1_1_1_1___is_expr_activated_FNC_GetCurveValue_Value; // 0x0200(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         is_expr_activated_FNC_11_2_2_1_1_2_1_2_1_1_1_1___is_expr_activated_FNC_DISPATCH_RigVMDispatch_ArrayIterator_Element; // 0x0204(0x0008)(Edit, NoDestructor, HasGetValueTypeHash)
	class FName                                   is_expr_activated_FNC_11_2_2_1_1_2_1_2_1_1_1_1___is_expr_activated_FNC_GetCurveValue_Curve; // 0x020C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          is_expr_activated_FNC_11_2_2_1_1_2_1_2_1_1_1_1___is_expr_activated_FNC_GetCurveValue_Valid; // 0x0210(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_211[0x7];                                      // 0x0211(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FCachedRigElement>              is_expr_activated_FNC_11_2_2_1_1_2_1_2_1_1_1_1___is_expr_activated_FNC_GetCurveValue_CachedCurveIndex; // 0x0218(0x0010)(Edit)
	bool                                          is_expr_activated_FNC_11_2_2_1_1_2_1_2_1_1_1_1___is_expr_activated_FNC_Less_Result; // 0x0228(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_229[0x7];                                      // 0x0229(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        is_expr_activated_FNC_11_2_2_1_1_2_1_2_1_1_1_1___is_expr_activated_FNC_Less_A; // 0x0230(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   is_expr_activated_FNC_11_2_2_1_1_2_1_2_1_1_1_1___is_expr_activated_FNC_RigVMFunction_ControlFlowBranch_2_BlockToRun; // 0x0238(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          is_expr_activated_FNC_11_2_2_1_1_2_1_2_1_1_1_1___is_expr_activated_FNC_GreaterEqual_Result; // 0x023C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23D[0x3];                                      // 0x023D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        is_expr_activated_FNC_11_2_2_1_1_2_1_2_1_1_1_1___is_expr_activated_FNC_GreaterEqual_A; // 0x0240(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   is_expr_activated_FNC_11_2_2_1_1_2_1_2_1_1_1_1___is_expr_activated_FNC_RigVMFunction_ControlFlowBranch_BlockToRun; // 0x0248(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   is_expr_activated_FNC_11_2_2_1_1_2_1_2_1_1_1_1___is_expr_activated_FNC_RigVMFunction_ControlFlowBranch_1_BlockToRun; // 0x024C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         is_expr_activated_FNC_11_2_2_1_1_2_1_2_1_1_1_1___is_expr_activated_FNC_DISPATCH_RigVMDispatch_ArrayIterator_Index; // 0x0250(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         is_expr_activated_FNC_11_2_2_1_1_2_1_2_1_1_1_1___is_expr_activated_FNC_DISPATCH_RigVMDispatch_ArrayIterator_Count; // 0x0254(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         is_expr_activated_FNC_11_2_2_1_1_2_1_2_1_1_1_1___is_expr_activated_FNC_DISPATCH_RigVMDispatch_ArrayIterator_Ratio; // 0x0258(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   is_expr_activated_FNC_11_2_2_1_1_2_1_2_1_1_1_1___is_expr_activated_FNC_DISPATCH_RigVMDispatch_ArrayIterator_BlockToRun; // 0x025C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Eye_Mapping_FNC___Eye_Mapping_FNC_RigVMFunction_ControlFlowBranch_4_2_2_1_1_2_1_1_1_1_1_1_BlockToRun; // 0x0260(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Eye_Mapping_FNC___Eye_Mapping_FNC_RigVMFunction_ControlFlowBranch_BlockToRun; // 0x0264(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Eye_Mapping_FNC___Eye_Mapping_FNC_RigVMFunction_ControlFlowBranch_5_1_BlockToRun; // 0x0268(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Eye_Mapping_FNC___Eye_Mapping_FNC_is_expr_activated_FNC_11_2_2_1_1_2_1_1_1_1_Output; // 0x026C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_26D[0x3];                                      // 0x026D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         is_expr_activated_FNC_11_2_2_1_1_2_1_1_1_1___is_expr_activated_FNC_GetCurveValue_Value; // 0x0270(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         is_expr_activated_FNC_11_2_2_1_1_2_1_1_1_1___is_expr_activated_FNC_DISPATCH_RigVMDispatch_ArrayIterator_Element; // 0x0274(0x0008)(Edit, NoDestructor, HasGetValueTypeHash)
	class FName                                   is_expr_activated_FNC_11_2_2_1_1_2_1_1_1_1___is_expr_activated_FNC_GetCurveValue_Curve; // 0x027C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          is_expr_activated_FNC_11_2_2_1_1_2_1_1_1_1___is_expr_activated_FNC_GetCurveValue_Valid; // 0x0280(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_281[0x7];                                      // 0x0281(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FCachedRigElement>              is_expr_activated_FNC_11_2_2_1_1_2_1_1_1_1___is_expr_activated_FNC_GetCurveValue_CachedCurveIndex; // 0x0288(0x0010)(Edit)
	bool                                          is_expr_activated_FNC_11_2_2_1_1_2_1_1_1_1___is_expr_activated_FNC_Less_Result; // 0x0298(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_299[0x7];                                      // 0x0299(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        is_expr_activated_FNC_11_2_2_1_1_2_1_1_1_1___is_expr_activated_FNC_Less_A; // 0x02A0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   is_expr_activated_FNC_11_2_2_1_1_2_1_1_1_1___is_expr_activated_FNC_RigVMFunction_ControlFlowBranch_2_BlockToRun; // 0x02A8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          is_expr_activated_FNC_11_2_2_1_1_2_1_1_1_1___is_expr_activated_FNC_GreaterEqual_Result; // 0x02AC(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2AD[0x3];                                      // 0x02AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        is_expr_activated_FNC_11_2_2_1_1_2_1_1_1_1___is_expr_activated_FNC_GreaterEqual_A; // 0x02B0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   is_expr_activated_FNC_11_2_2_1_1_2_1_1_1_1___is_expr_activated_FNC_RigVMFunction_ControlFlowBranch_BlockToRun; // 0x02B8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   is_expr_activated_FNC_11_2_2_1_1_2_1_1_1_1___is_expr_activated_FNC_RigVMFunction_ControlFlowBranch_1_BlockToRun; // 0x02BC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         is_expr_activated_FNC_11_2_2_1_1_2_1_1_1_1___is_expr_activated_FNC_DISPATCH_RigVMDispatch_ArrayIterator_Index; // 0x02C0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         is_expr_activated_FNC_11_2_2_1_1_2_1_1_1_1___is_expr_activated_FNC_DISPATCH_RigVMDispatch_ArrayIterator_Count; // 0x02C4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         is_expr_activated_FNC_11_2_2_1_1_2_1_1_1_1___is_expr_activated_FNC_DISPATCH_RigVMDispatch_ArrayIterator_Ratio; // 0x02C8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   is_expr_activated_FNC_11_2_2_1_1_2_1_1_1_1___is_expr_activated_FNC_DISPATCH_RigVMDispatch_ArrayIterator_BlockToRun; // 0x02CC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
