#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIChart

#include "Basic.hpp"

#include "UIChart_structs.hpp"
#include "ModelViewViewModel_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "DeveloperSettings_classes.hpp"
#include "CommonInput_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class UIChart.UIStateSettings
// 0x0018 (0x0048 - 0x0030)
class UUIStateSettings final : public UDeveloperSettings
{
public:
	float                                         StateLoadTimeout;                                  // 0x0030(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StateUnloadTimeout;                                // 0x0034(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         WidgetStateComponentLoadTimeout;                   // 0x0038(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         WidgetStateComponentUnloadTimeout;                 // 0x003C(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EWidgetStateComponentUnloadDefaultBehavior    WidgetStateComponentDefaultUnloadBehavior;         // 0x0040(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("UIStateSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UIStateSettings")
	}
	static class UUIStateSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUIStateSettings>();
	}
};
DUMPER7_ASSERTS_UUIStateSettings;

// Class UIChart.UIStateComponent
// 0x0020 (0x0048 - 0x0028)
class UUIStateComponent : public UObject
{
public:
	EStateComponentStatus                         Status;                                            // 0x0028(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIStateComponentConfiguration*         ComponentConfiguration;                            // 0x0030(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UUIState*                               OwningState;                                       // 0x0038(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UUIStateChartRegion*                    StateChartRegion;                                  // 0x0040(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("UIStateComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UIStateComponent")
	}
	static class UUIStateComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUIStateComponent>();
	}
};
DUMPER7_ASSERTS_UUIStateComponent;

// Class UIChart.CommonUIContextUpdaterUIStateComponent
// 0x0000 (0x0048 - 0x0048)
class UCommonUIContextUpdaterUIStateComponent final : public UUIStateComponent
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CommonUIContextUpdaterUIStateComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CommonUIContextUpdaterUIStateComponent")
	}
	static class UCommonUIContextUpdaterUIStateComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCommonUIContextUpdaterUIStateComponent>();
	}
};
DUMPER7_ASSERTS_UCommonUIContextUpdaterUIStateComponent;

// Class UIChart.UIStateComponentConfiguration
// 0x0000 (0x0028 - 0x0028)
class UUIStateComponentConfiguration : public UObject
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("UIStateComponentConfiguration")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UIStateComponentConfiguration")
	}
	static class UUIStateComponentConfiguration* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUIStateComponentConfiguration>();
	}
};
DUMPER7_ASSERTS_UUIStateComponentConfiguration;

// Class UIChart.CommonUIContextUpdaterUIStateComponentConfiguration
// 0x0000 (0x0028 - 0x0028)
class UCommonUIContextUpdaterUIStateComponentConfiguration final : public UUIStateComponentConfiguration
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CommonUIContextUpdaterUIStateComponentConfiguration")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CommonUIContextUpdaterUIStateComponentConfiguration")
	}
	static class UCommonUIContextUpdaterUIStateComponentConfiguration* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCommonUIContextUpdaterUIStateComponentConfiguration>();
	}
};
DUMPER7_ASSERTS_UCommonUIContextUpdaterUIStateComponentConfiguration;

// Class UIChart.ContextSetterUIStateComponent
// 0x0008 (0x0050 - 0x0048)
class UContextSetterUIStateComponent final : public UUIStateComponent
{
public:
	class UContextSetterUIStateComponentConfiguration* Configuration;                                // 0x0048(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ContextSetterUIStateComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ContextSetterUIStateComponent")
	}
	static class UContextSetterUIStateComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UContextSetterUIStateComponent>();
	}
};
DUMPER7_ASSERTS_UContextSetterUIStateComponent;

// Class UIChart.ContextSetterUIStateComponentConfiguration
// 0x0040 (0x0068 - 0x0028)
class UContextSetterUIStateComponentConfiguration final : public UUIStateComponentConfiguration
{
public:
	struct FContextSetterChanges                  ActivationChanges;                                 // 0x0028(0x0020)(Edit, NativeAccessSpecifierPublic)
	struct FContextSetterChanges                  DeactivationChanges;                               // 0x0048(0x0020)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ContextSetterUIStateComponentConfiguration")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ContextSetterUIStateComponentConfiguration")
	}
	static class UContextSetterUIStateComponentConfiguration* GetDefaultObj()
	{
		return GetDefaultObjImpl<UContextSetterUIStateComponentConfiguration>();
	}
};
DUMPER7_ASSERTS_UContextSetterUIStateComponentConfiguration;

// Class UIChart.GlobalViewModelUIStateComponent
// 0x0060 (0x00A8 - 0x0048)
class UGlobalViewModelUIStateComponent final : public UUIStateComponent
{
public:
	class UGlobalViewModelUIStateComponentConfiguration* Configuration;                              // 0x0048(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSet<struct FGameplayTag>                     ConditionContextKeys;                              // 0x0050(0x0050)(Transient, NativeAccessSpecifierPublic)
	uint8                                         Pad_A0[0x8];                                       // 0x00A0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GlobalViewModelUIStateComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GlobalViewModelUIStateComponent")
	}
	static class UGlobalViewModelUIStateComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGlobalViewModelUIStateComponent>();
	}
};
DUMPER7_ASSERTS_UGlobalViewModelUIStateComponent;

// Class UIChart.GlobalViewModelUIStateComponentConfiguration
// 0x0020 (0x0048 - 0x0028)
class UGlobalViewModelUIStateComponentConfiguration final : public UUIStateComponentConfiguration
{
public:
	TArray<struct FMVVMViewModelContext>          ViewModelContexts;                                 // 0x0028(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FUIStateChartContextCondition>  ContextConditions;                                 // 0x0038(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GlobalViewModelUIStateComponentConfiguration")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GlobalViewModelUIStateComponentConfiguration")
	}
	static class UGlobalViewModelUIStateComponentConfiguration* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGlobalViewModelUIStateComponentConfiguration>();
	}
};
DUMPER7_ASSERTS_UGlobalViewModelUIStateComponentConfiguration;

// Class UIChart.StackingUIStateComponent
// 0x0008 (0x0050 - 0x0048)
class UStackingUIStateComponent : public UUIStateComponent
{
public:
	EStateChartResourceScope                      StackScope;                                        // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bAlwaysRemoveStackingBehavior;                     // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsOnStack;                                        // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_4E[0x2];                                       // 0x004E(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("StackingUIStateComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"StackingUIStateComponent")
	}
	static class UStackingUIStateComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStackingUIStateComponent>();
	}
};
DUMPER7_ASSERTS_UStackingUIStateComponent;

// Class UIChart.InputConfigUIStateComponent
// 0x0008 (0x0058 - 0x0050)
class UInputConfigUIStateComponent final : public UStackingUIStateComponent
{
public:
	class UInputConfigUIStateComponentConfiguration* Configuration;                                  // 0x0050(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("InputConfigUIStateComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"InputConfigUIStateComponent")
	}
	static class UInputConfigUIStateComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInputConfigUIStateComponent>();
	}
};
DUMPER7_ASSERTS_UInputConfigUIStateComponent;

// Class UIChart.InputConfigUIStateComponentConfiguration
// 0x0008 (0x0030 - 0x0028)
class UInputConfigUIStateComponentConfiguration final : public UUIStateComponentConfiguration
{
public:
	ECommonInputMode                              InputMode;                                         // 0x0028(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMouseCaptureMode                             MouseCaptureMode;                                  // 0x0029(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHideCursorDuringCapture;                          // 0x002A(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIgnoreLookInput;                                  // 0x002B(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIgnoreMovementInput;                              // 0x002C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFlushPlayerInputWhenActivating;                   // 0x002D(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFlushPlayerInputWhenDeactivating;                 // 0x002E(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2F[0x1];                                       // 0x002F(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("InputConfigUIStateComponentConfiguration")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"InputConfigUIStateComponentConfiguration")
	}
	static class UInputConfigUIStateComponentConfiguration* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInputConfigUIStateComponentConfiguration>();
	}
};
DUMPER7_ASSERTS_UInputConfigUIStateComponentConfiguration;

// Class UIChart.SceneUIStateComponent
// 0x0068 (0x00B0 - 0x0048)
class USceneUIStateComponent final : public UUIStateComponent
{
public:
	class USceneUIStateComponentConfiguration*    Configuration;                                     // 0x0048(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSet<struct FGameplayTag>                     ConditionContextKeys;                              // 0x0050(0x0050)(Transient, NativeAccessSpecifierPrivate)
	uint8                                         Pad_A0[0x10];                                      // 0x00A0(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SceneUIStateComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SceneUIStateComponent")
	}
	static class USceneUIStateComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<USceneUIStateComponent>();
	}
};
DUMPER7_ASSERTS_USceneUIStateComponent;

// Class UIChart.SceneUIStateComponentConfiguration
// 0x0018 (0x0040 - 0x0028)
class USceneUIStateComponentConfiguration final : public UUIStateComponentConfiguration
{
public:
	class UDynamicUIScene*                        Scene;                                             // 0x0028(0x0008)(Edit, ExportObject, ZeroConstructor, DisableEditOnTemplate, InstancedReference, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FUIStateChartContextCondition>  ContextConditions;                                 // 0x0030(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SceneUIStateComponentConfiguration")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SceneUIStateComponentConfiguration")
	}
	static class USceneUIStateComponentConfiguration* GetDefaultObj()
	{
		return GetDefaultObjImpl<USceneUIStateComponentConfiguration>();
	}
};
DUMPER7_ASSERTS_USceneUIStateComponentConfiguration;

// Class UIChart.SplitScreenUIStateComponentBase
// 0x0068 (0x00B0 - 0x0048)
class USplitScreenUIStateComponentBase final : public UUIStateComponent
{
public:
	class USplitScreenUIStateComponentBaseConfiguration* BaseConfiguration;                          // 0x0048(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class ULocalPlayer*, int32>              ChildStateCharts;                                  // 0x0050(0x0050)(Transient, Protected, NativeAccessSpecifierProtected)
	TArray<int32>                                 DeactivatingStateCharts;                           // 0x00A0(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SplitScreenUIStateComponentBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SplitScreenUIStateComponentBase")
	}
	static class USplitScreenUIStateComponentBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<USplitScreenUIStateComponentBase>();
	}
};
DUMPER7_ASSERTS_USplitScreenUIStateComponentBase;

// Class UIChart.SplitScreenUIStateComponentBaseConfiguration
// 0x0058 (0x0080 - 0x0028)
class USplitScreenUIStateComponentBaseConfiguration final : public UUIStateComponentConfiguration
{
public:
	class UUIStateChart*                          PlayerStateChart;                                  // 0x0028(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIgnoreTransitionParametersOnActivation;           // 0x0030(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EUIStateTransitionUrgency                     UrgencyOnPlayerAdd;                                // 0x0031(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  AnimationHintsOnPlayerAdd;                         // 0x0038(0x0020)(Edit, NativeAccessSpecifierPublic)
	bool                                          bIgnoreTransitionParametersOnDeactivation;         // 0x0058(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EUIStateTransitionUrgency                     UrgencyOnPlayerRemove;                             // 0x0059(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5A[0x6];                                       // 0x005A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  AnimationHintsOnPlayerRemove;                      // 0x0060(0x0020)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SplitScreenUIStateComponentBaseConfiguration")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SplitScreenUIStateComponentBaseConfiguration")
	}
	static class USplitScreenUIStateComponentBaseConfiguration* GetDefaultObj()
	{
		return GetDefaultObjImpl<USplitScreenUIStateComponentBaseConfiguration>();
	}
};
DUMPER7_ASSERTS_USplitScreenUIStateComponentBaseConfiguration;

// Class UIChart.StackingUIStateComponentSharedData
// 0x0050 (0x0078 - 0x0028)
class UStackingUIStateComponentSharedData final : public UObject
{
public:
	TMap<class UClass*, struct FUIStateComponentInstanceStack> InstanceStacks;                       // 0x0028(0x0050)(Transient, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("StackingUIStateComponentSharedData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"StackingUIStateComponentSharedData")
	}
	static class UStackingUIStateComponentSharedData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStackingUIStateComponentSharedData>();
	}
};
DUMPER7_ASSERTS_UStackingUIStateComponentSharedData;

// Class UIChart.UIStateConfiguration
// 0x0088 (0x00B0 - 0x0028)
class UUIStateConfiguration final : public UObject
{
public:
	class FString                                 Name_0;                                            // 0x0028(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  StateTags;                                         // 0x0038(0x0020)(Edit, NativeAccessSpecifierPublic)
	int32                                         ID;                                                // 0x0058(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UUIStateConfiguration*>          Children;                                          // 0x0060(0x0010)(Edit, ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	TArray<class UUIStateConfiguration*>          ParallelRegions;                                   // 0x0070(0x0010)(Edit, ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	TArray<class UUIStateComponentConfiguration*> Components;                                        // 0x0080(0x0010)(Edit, ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	float                                         MinimumUnloadTime;                                 // 0x0090(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EUIStateAutomationType                        AutomationType;                                    // 0x0094(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_95[0x3];                                       // 0x0095(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FUIStateAutomationRule>         AutomationRules;                                   // 0x0098(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bSupportsBacktracking;                             // 0x00A8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOverrideIncomingBacktracks;                       // 0x00A9(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_AA[0x6];                                       // 0x00AA(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("UIStateConfiguration")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UIStateConfiguration")
	}
	static class UUIStateConfiguration* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUIStateConfiguration>();
	}
};
DUMPER7_ASSERTS_UUIStateConfiguration;

// Class UIChart.UIState
// 0x00C0 (0x00E8 - 0x0028)
class UUIState final : public UObject
{
public:
	TArray<class UUIState*>                       Children;                                          // 0x0028(0x0010)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, NativeAccessSpecifierPublic)
	TArray<class UUIStateChartRegion*>            ParallelRegions;                                   // 0x0038(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPublic)
	TArray<class UUIStateComponent*>              Components;                                        // 0x0048(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPublic)
	class UUIStateConfiguration*                  Configuration;                                     // 0x0058(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UUIStateChartTransition*>        OutgoingTransitions;                               // 0x0060(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	float                                         SecondsUntilTimeout;                               // 0x0070(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIState*                               Parent;                                            // 0x0078(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UUIStateChartRegion*                    StateChartRegion;                                  // 0x0080(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EStateComponentStatus                         Status;                                            // 0x0088(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSet<struct FGameplayTag>                     ContinualAutomationContextKeys;                    // 0x0090(0x0050)(Transient, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_E0[0x8];                                       // 0x00E0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("UIState")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UIState")
	}
	static class UUIState* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUIState>();
	}
};
DUMPER7_ASSERTS_UUIState;

// Class UIChart.UIStateChart
// 0x0018 (0x0048 - 0x0030)
class UUIStateChart final : public UDataAsset
{
public:
	class UUIStateConfiguration*                  RootState;                                         // 0x0030(0x0008)(Edit, ExportObject, ZeroConstructor, DisableEditOnTemplate, InstancedReference, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FUIStateTransitionData>         Transitions;                                       // 0x0038(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("UIStateChart")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UIStateChart")
	}
	static class UUIStateChart* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUIStateChart>();
	}
};
DUMPER7_ASSERTS_UUIStateChart;

// Class UIChart.UIStateChartContext
// 0x0068 (0x0090 - 0x0028)
class UUIStateChartContext final : public UObject
{
public:
	TMap<struct FGameplayTag, class UUIStateChartContextEntry*> Store;                               // 0x0028(0x0050)(Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_78[0x18];                                      // 0x0078(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BP_ApplyCommonChanges(const struct FUIStateChartContextChangeSet& ContextChanges);
	void BP_ApplyPlayerChanges(const class ULocalPlayer* LocalPlayer, const struct FUIStateChartContextChangeSet& ContextChanges);
	void BP_ClearCommonValue(const struct FGameplayTag& Key);
	void BP_ClearEntry(const struct FGameplayTag& Key);
	void BP_ClearPlayerValue(const class ULocalPlayer* LocalPlayer, const struct FGameplayTag& Key);
	void BP_SetCommonBoolValue(const struct FGameplayTag& Key, bool Value);
	void BP_SetCommonFloatValue(const struct FGameplayTag& Key, float Value);
	void BP_SetCommonIntValue(const struct FGameplayTag& Key, int32 Value);
	void BP_SetCommonStringValue(const struct FGameplayTag& Key, const class FString& Value);
	void BP_SetPlayerBoolValue(const class ULocalPlayer* LocalPlayer, const struct FGameplayTag& Key, bool Value);
	void BP_SetPlayerFloatValue(const class ULocalPlayer* LocalPlayer, const struct FGameplayTag& Key, float Value);
	void BP_SetPlayerStringValue(const class ULocalPlayer* LocalPlayer, const struct FGameplayTag& Key, const class FString& Value);
	void BP_SetPlayerValue(const class ULocalPlayer* LocalPlayer, const struct FGameplayTag& Key, int32 Value);

	class UUIStateChartContextEntry* BP_FindEntry(const struct FGameplayTag& Key) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("UIStateChartContext")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UIStateChartContext")
	}
	static class UUIStateChartContext* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUIStateChartContext>();
	}
};
DUMPER7_ASSERTS_UUIStateChartContext;

// Class UIChart.UIStateChartContextEntry
// 0x0080 (0x00A8 - 0x0028)
class UUIStateChartContextEntry final : public UObject
{
public:
	class FString                                 CommonValue;                                       // 0x0028(0x0010)(ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TMap<class ULocalPlayer*, struct FUIStateChartContextEntryOverride> PlayerOverrides;             // 0x0038(0x0050)(Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_88[0x20];                                      // 0x0088(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool GetCommonValueAsBool() const;
	float GetCommonValueAsFloat() const;
	int32 GetCommonValueAsInt() const;
	class FString GetCommonValueAsString() const;
	bool GetPlayerValueAsBool(const class ULocalPlayer* InLocalPlayer) const;
	float GetPlayerValueAsFloat(const class ULocalPlayer* InLocalPlayer) const;
	int32 GetPlayerValueAsInt(const class ULocalPlayer* InLocalPlayer) const;
	class FString GetPlayerValueAsString(const class ULocalPlayer* InLocalPlayer) const;
	bool IsEmptyForPlayer(class ULocalPlayer* InLocalPlayer) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("UIStateChartContextEntry")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UIStateChartContextEntry")
	}
	static class UUIStateChartContextEntry* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUIStateChartContextEntry>();
	}
};
DUMPER7_ASSERTS_UUIStateChartContextEntry;

// Class UIChart.UIStateChartManager
// 0x00C8 (0x00F8 - 0x0030)
class UUIStateChartManager final : public UGameInstanceSubsystem
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class ULocalPlayer*, class UUIStateChartManagerPlayer*> PlayerEntries;                      // 0x0038(0x0050)(Protected, NativeAccessSpecifierProtected)
	TArray<class UUIStateChartManagerPlayer*>     RemovedPlayerEntries;                              // 0x0088(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	class UUIStateChartContext*                   Context;                                           // 0x0098(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UUIStateChartResourceCollection*        GlobalResources;                                   // 0x00A0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_A8[0x50];                                      // 0x00A8(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	int32 BP_AddStateChart(const class UUIStateChart* StateChartAsset, class ULocalPlayer* OwningLocalPlayer, const struct FGameplayTagContainer& AnimationHints, const struct FGameplayTag& InitialStateTag, EUIStateTransitionUrgency Urgency);
	bool BP_DeactivateStateChart(int32 Key, const struct FGameplayTagContainer& AnimationHints, const struct FUIStateChartContextChangeSet& ContextChanges, EUIStateTransitionUrgency Urgency);
	bool BP_DispatchTransitionEvent(const struct FGameplayTag& TransitionTag, const class ULocalPlayer* StateChartOwner, const struct FGameplayTagContainer& AnimationHints, const struct FUIStateChartContextChangeSet& ContextChanges, EUIStateTransitionUrgency Urgency, bool bBacktrack);
	void BP_ReactivateStateChart(int32 Key, const struct FGameplayTagContainer& AnimationHints, const struct FGameplayTag& StateTag, EUIStateTransitionUrgency Urgency);
	bool BP_RemoveStateChart(int32 Key, const struct FGameplayTagContainer& AnimationHints, const struct FUIStateChartContextChangeSet& ContextChanges, EUIStateTransitionUrgency Urgency);

	class UUIStateChartContext* GetChartContext() const;
	class UUIStateChartContext* GetContext() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("UIStateChartManager")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UIStateChartManager")
	}
	static class UUIStateChartManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUIStateChartManager>();
	}
};
DUMPER7_ASSERTS_UUIStateChartManager;

// Class UIChart.UIStateChartManagerEntry
// 0x0018 (0x0040 - 0x0028)
class UUIStateChartManagerEntry final : public UObject
{
public:
	class UUIStateChartRegion*                    MainRegion;                                        // 0x0028(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UUIStateChartManagerPlayer*             ManagerPlayer;                                     // 0x0030(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UUIStateChartResourceCollection*        StateChartResources;                               // 0x0038(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("UIStateChartManagerEntry")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UIStateChartManagerEntry")
	}
	static class UUIStateChartManagerEntry* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUIStateChartManagerEntry>();
	}
};
DUMPER7_ASSERTS_UUIStateChartManagerEntry;

// Class UIChart.UIStateChartManagerPlayer
// 0x00D0 (0x00F8 - 0x0028)
class UUIStateChartManagerPlayer final : public UObject
{
public:
	TMap<int32, class UUIStateChartManagerEntry*> ActiveChartEntries;                                // 0x0028(0x0050)(Transient, Protected, NativeAccessSpecifierProtected)
	TMap<int32, class UUIStateChartManagerEntry*> InactiveChartEntries;                              // 0x0078(0x0050)(Transient, Protected, NativeAccessSpecifierProtected)
	TArray<struct FUIStateChartManagerChartDeactivationRequest> DeactivationRequests;                // 0x00C8(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_D8[0x10];                                      // 0x00D8(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIStateChartManager*                   Manager;                                           // 0x00E8(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UUIStateChartResourceCollection*        PlayerResources;                                   // 0x00F0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("UIStateChartManagerPlayer")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UIStateChartManagerPlayer")
	}
	static class UUIStateChartManagerPlayer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUIStateChartManagerPlayer>();
	}
};
DUMPER7_ASSERTS_UUIStateChartManagerPlayer;

// Class UIChart.UIStateBacktrackStep
// 0x0078 (0x00A0 - 0x0028)
class UUIStateBacktrackStep final : public UObject
{
public:
	struct FGameplayTag                           TransitionTag;                                     // 0x0028(0x0004)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIState*                               ReturnState;                                       // 0x0030(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UUIState*                               AvailableState;                                    // 0x0038(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FUIStateChartContextChangeSet          ReverseContextChanges;                             // 0x0040(0x0050)(NativeAccessSpecifierPublic)
	TArray<class UUIStateBacktrackStep*>          AvailablePaths;                                    // 0x0090(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("UIStateBacktrackStep")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UIStateBacktrackStep")
	}
	static class UUIStateBacktrackStep* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUIStateBacktrackStep>();
	}
};
DUMPER7_ASSERTS_UUIStateBacktrackStep;

// Class UIChart.UIStateChartRegion
// 0x00C0 (0x00E8 - 0x0028)
class UUIStateChartRegion final : public UObject
{
public:
	class UUIStateChartManagerEntry*              ManagerEntry;                                      // 0x0028(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UUIState*                               RootState;                                         // 0x0030(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UUIState*                               ParentState;                                       // 0x0038(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UUIStateChartRegion*>            ParallelRegions;                                   // 0x0040(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	TMap<struct FGameplayTag, class UUIState*>    TaggedStates;                                      // 0x0050(0x0050)(ExportObject, Transient, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	class UUIState*                               ActiveLeafState;                                   // 0x00A0(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UUIStateChartTransitionOperation*       ActiveTransitionOperation;                         // 0x00A8(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UUIStateChartTransitionOperation*       QueuedTransitionOperation;                         // 0x00B0(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UUIStateBacktrackStep*>          AvailableBacktrackPaths;                           // 0x00B8(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	class UUIStateBacktrackStep*                  ActiveTransitionBacktrackStep;                     // 0x00C8(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                 ChartName;                                         // 0x00D0(0x0010)(ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_E0[0x8];                                       // 0x00E0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("UIStateChartRegion")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UIStateChartRegion")
	}
	static class UUIStateChartRegion* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUIStateChartRegion>();
	}
};
DUMPER7_ASSERTS_UUIStateChartRegion;

// Class UIChart.UIStateChartResourceCollection
// 0x0050 (0x0078 - 0x0028)
class UUIStateChartResourceCollection final : public UObject
{
public:
	TMap<class UClass*, class UObject*>           ResourcesByClass;                                  // 0x0028(0x0050)(Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("UIStateChartResourceCollection")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UIStateChartResourceCollection")
	}
	static class UUIStateChartResourceCollection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUIStateChartResourceCollection>();
	}
};
DUMPER7_ASSERTS_UUIStateChartResourceCollection;

// Class UIChart.UIStateChartTransition
// 0x0018 (0x0040 - 0x0028)
class UUIStateChartTransition final : public UObject
{
public:
	class UUIState*                               Source;                                            // 0x0028(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UUIState*                               Target;                                            // 0x0030(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_38[0x8];                                       // 0x0038(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("UIStateChartTransition")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UIStateChartTransition")
	}
	static class UUIStateChartTransition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUIStateChartTransition>();
	}
};
DUMPER7_ASSERTS_UUIStateChartTransition;

// Class UIChart.UIStateChartTransitionOperation
// 0x0098 (0x00C0 - 0x0028)
class UUIStateChartTransitionOperation final : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIStateChartRegion*                    Region;                                            // 0x0030(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UUIState*                               OriginState;                                       // 0x0038(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UUIState*                               EndState;                                          // 0x0040(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UUIState*                               TransitionTargetState;                             // 0x0048(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_50[0x8];                                       // 0x0050(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UUIState*>                       KnownStatesToActivate;                             // 0x0058(0x0010)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	TArray<class UUIState*>                       StatesToDeactivate;                                // 0x0068(0x0010)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	class UUIStateChartTransitionOperationGroup*  Group;                                             // 0x0078(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FUIStateRelay                          StateRelay;                                        // 0x0080(0x0028)(ContainsInstancedReference, NativeAccessSpecifierPrivate)
	uint8                                         Pad_A8[0x8];                                       // 0x00A8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIState*                               BacktrackReturnState;                              // 0x00B0(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_B8[0x8];                                       // 0x00B8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("UIStateChartTransitionOperation")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UIStateChartTransitionOperation")
	}
	static class UUIStateChartTransitionOperation* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUIStateChartTransitionOperation>();
	}
};
DUMPER7_ASSERTS_UUIStateChartTransitionOperation;

// Class UIChart.UIStateChartTransitionOperationGroup
// 0x0180 (0x01A8 - 0x0028)
class UUIStateChartTransitionOperationGroup final : public UObject
{
public:
	TSet<class UUIStateChartTransitionOperation*> Operations;                                        // 0x0028(0x0050)(Transient, NativeAccessSpecifierPrivate)
	TSet<class UUIStateChartTransitionOperation*> OperationsReadyForContextUpdate;                   // 0x0078(0x0050)(Transient, NativeAccessSpecifierPrivate)
	class UUIStateChartContext*                   Context;                                           // 0x00C8(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class ULocalPlayer*                           LocalPlayer;                                       // 0x00D0(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FUIStateChartContextChangeSet          ContextChanges;                                    // 0x00D8(0x0050)(Transient, NativeAccessSpecifierPrivate)
	struct FUIStateChartContextChangeSet          ReverseContextChanges;                             // 0x0128(0x0050)(Transient, NativeAccessSpecifierPrivate)
	struct FUIStateChartTransitionOperationParameters Parameters;                                    // 0x0178(0x0028)(Transient, NativeAccessSpecifierPrivate)
	struct FGameplayTag                           TransitionEventTag;                                // 0x01A0(0x0004)(Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1A4[0x4];                                      // 0x01A4(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("UIStateChartTransitionOperationGroup")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UIStateChartTransitionOperationGroup")
	}
	static class UUIStateChartTransitionOperationGroup* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUIStateChartTransitionOperationGroup>();
	}
};
DUMPER7_ASSERTS_UUIStateChartTransitionOperationGroup;

}

