#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VaultingCodeRuntime

#include "Basic.hpp"

#include "FortniteAI_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "ContextualTraversalRuntime_classes.hpp"
#include "GameplayAbilities_structs.hpp"
#include "VaultingCodeRuntime_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class VaultingCodeRuntime.FortMovementMode_ExtLogicHurdle
// 0x0050 (0x01C8 - 0x0178)
class UFortMovementMode_ExtLogicHurdle final : public UFortMovementMode_ExtLogicTraversalBase
{
public:
	struct FGameplayTagContainer                  HurdleTag;                                         // 0x0178(0x0020)(Edit, BlueprintVisible, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTag                           HurdleStartedTag;                                  // 0x0198(0x0004)(Edit, BlueprintVisible, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_19C[0x4];                                      // 0x019C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  HurdleFinishedTag;                                 // 0x01A0(0x0020)(Edit, BlueprintVisible, Protected, NativeAccessSpecifierProtected)
	float                                         DestroyPropsSweepDistance;                         // 0x01C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         DestroyPropsWindowSillOffsetDistance;              // 0x01C4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void BP_DestroyProp(class ABuildingProp* BuildPropToDestroy);
	void BP_GetAnimationMontageInformation(const struct FSynchedActionInfo& SynchedActionInfo, EHurdleType Type, bool bIsNarrowOpening, bool bIsCrouched, class UAnimMontage** AnimMontage, class FName* StartSectionName, class FName* MontageMiddleSectionName);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortMovementMode_ExtLogicHurdle")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortMovementMode_ExtLogicHurdle")
	}
	static class UFortMovementMode_ExtLogicHurdle* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortMovementMode_ExtLogicHurdle>();
	}
};
DUMPER7_ASSERTS_UFortMovementMode_ExtLogicHurdle;

// Class VaultingCodeRuntime.HurdleNavLinkProcessor
// 0x0000 (0x0028 - 0x0028)
class UHurdleNavLinkProcessor final : public UFortCustomNavLinkProcessor
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HurdleNavLinkProcessor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HurdleNavLinkProcessor")
	}
	static class UHurdleNavLinkProcessor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHurdleNavLinkProcessor>();
	}
};
DUMPER7_ASSERTS_UHurdleNavLinkProcessor;

// Class VaultingCodeRuntime.HurdleCameraMode
// 0x0200 (0x1DA0 - 0x1BA0)
class UHurdleCameraMode final : public UFortCameraMode_ThirdPerson
{
public:
	struct FVector                                StartCameraOriginInterpSpeed;                      // 0x1BA0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                                ApexCameraOriginInterpSpeed;                       // 0x1BB8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                                EndCameraOriginInterpSpeed;                        // 0x1BD0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         ConstantSpeedCameraTrackInterpolationExponent;     // 0x1BE8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         CameraOriginVerticalThreshold;                     // 0x1BEC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         FallingVerticalInterpSpeed;                        // 0x1BF0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         FallSpeedThreshold;                                // 0x1BF4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         NonSprintFOV;                                      // 0x1BF8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bOverrideSpectatorCamera;                          // 0x1BFC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1BFD[0x3];                                     // 0x1BFD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHurdleTargetingData                   HurdleTargetingData;                               // 0x1C00(0x0130)(Transient, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1D30[0x70];                                    // 0x1D30(0x0070)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HurdleCameraMode")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HurdleCameraMode")
	}
	static class UHurdleCameraMode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHurdleCameraMode>();
	}
};
DUMPER7_ASSERTS_UHurdleCameraMode;

// Class VaultingCodeRuntime.HurdleComponent
// 0x0A90 (0x0B38 - 0x00A8)
class UHurdleComponent final : public UFortPawnComponent
{
public:
	uint8                                         Pad_A8[0x8];                                       // 0x00A8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHurdleInputConfig                     HurdleInputConfig;                                 // 0x00B0(0x0620)(Edit, BlueprintVisible, BlueprintReadOnly, Config, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FHurdleInputConfigCache                HurdleInputConfigCache;                            // 0x06D0(0x00A0)(BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	TSubclassOf<class UFortMovementMode_BaseExtLogic> MovementModeExtension;                         // 0x0770(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           SynchedActionMMETag;                               // 0x0778(0x0004)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_77C[0x4];                                      // 0x077C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         HurdleEnabled;                                     // 0x0780(0x0028)(Edit, Config, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         AutoHurdleEnabled;                                 // 0x07A8(0x0028)(Edit, Config, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_7D0[0x138];                                    // 0x07D0(0x0138)(Fixing Size After Last Property [ Dumper-7 ])
	struct FReplicatedHurdleTargetingData         ReplayHurdleTargetingData;                         // 0x0908(0x0070)(Net, NoDestructor, NativeAccessSpecifierPrivate)
	double                                        LastTeleportTime;                                  // 0x0978(0x0008)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FHurdleTargetingData                   ParallelTargetingData;                             // 0x0980(0x0130)(Transient, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	uint8                                         Pad_AB0[0x1];                                      // 0x0AB0(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	EHurdleState                                  ReplicatedHurdleState;                             // 0x0AB1(0x0001)(Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_AB2[0x3E];                                     // 0x0AB2(0x003E)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                HighlightPositionOffset;                           // 0x0AF0(0x0018)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FVector                                HighlightNormalMultiplier;                         // 0x0B08(0x0018)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FVector                                HighlightScale;                                    // 0x0B20(0x0018)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void BP_HandleHurdleEnded();
	void BP_HandleHurdleStarted(const struct FHurdleTargetingData& TargetingData, const struct FSynchedActionInfo& SynchedActionInfo);
	void BP_HandleSpringJump();
	void HandleNavLinkMoveStarted(const struct FVector& LinkEndPoint);
	void HandleOwnerJumpInput(bool bPressed);
	void HandleOwnerMovementModeChanged(class ACharacter* Character, EMovementMode PreviousMovementMode, uint8 PreviousCustomMode);
	void HandleOwnerTeleported(class AFortPawn* TeleportedOwner);
	void HandleTargetingDataInvalid(const struct FHurdleTargetingData& TargetingData);
	void HandleTargetingDataValid(const struct FHurdleTargetingData& TargetingData);
	void OnMutatorUpdated();
	void OnPlayerStatePawnSet(class APlayerState* Player, class APawn* NewPawn, class APawn* OldPawn);
	void OnRep_ReplicatedHurdleState();
	void OnRep_ReplicatedLastTeleportTime();
	void RegisterMutatorUpdatedDelegate(class APawn* AffectedPawn);
	void ServerStartHurdle(const struct FReplicatedHurdleTargetingData& InReplicatedTargetingData, const double ClientLastTeleportTime);
	void UnregisterMutatorUpdatedDelegate();

	void BP_CanStartHurdle(bool* OutCanStartHurdle) const;
	bool BP_IsTacticalSprinting() const;
	bool BP_UseAutoHurdle() const;
	struct FTransform GetHurdleHighlightTransform() const;
	bool IsUsingGamepad() const;
	bool ShouldShowHurdleIndicator() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HurdleComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HurdleComponent")
	}
	static class UHurdleComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHurdleComponent>();
	}
};
DUMPER7_ASSERTS_UHurdleComponent;

// Class VaultingCodeRuntime.HurdleLibrary
// 0x0000 (0x0028 - 0x0028)
class UHurdleLibrary final : public UBlueprintFunctionLibrary
{
public:
	static bool PerformHurdleTargeting(const class ACharacter* Character, struct FHurdleInputConfigCache* HurdleInputConfig, struct FHurdleTargetingData* OutTargetingData, bool bIsAutoHurdle, const struct FVector& OverrideAimDirection);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HurdleLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HurdleLibrary")
	}
	static class UHurdleLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHurdleLibrary>();
	}
};
DUMPER7_ASSERTS_UHurdleLibrary;

}

