#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VerseDevices

#include "Basic.hpp"

#include "GameFeatures_classes.hpp"
#include "CoreUObject_classes.hpp"
#include "VerseDevices_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class VerseDevices.VerseCreativePropAsset
// 0x0068 (0x0090 - 0x0028)
class UVerseCreativePropAsset : public UObject
{
public:
	class FName                                   AssetPathName;                                     // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULevelSaveRecord*                       LevelSaveRecord;                                   // 0x0030(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftClassPtr<class UClass>                   ActorClass;                                        // 0x0038(0x0020)(UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_58[0x38];                                      // 0x0058(0x0038)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("VerseCreativePropAsset")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"VerseCreativePropAsset")
	}
	static class UVerseCreativePropAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseCreativePropAsset>();
	}
};
DUMPER7_ASSERTS_UVerseCreativePropAsset;

// Class VerseDevices.PlaylistUserOptionScript
// 0x0018 (0x01E8 - 0x01D0)
class UPlaylistUserOptionScript final : public UPlaylistUserOptionBase
{
public:
	TArray<struct FPlaylistOptionScriptValue>     OptionValues;                                      // 0x01D0(0x0010)(Edit, ZeroConstructor, Transient, DisableEditOnInstance, EditConst, NativeAccessSpecifierPublic)
	int32                                         DefaultValueIndex;                                 // 0x01E0(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1E4[0x4];                                      // 0x01E4(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PlaylistUserOptionScript")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PlaylistUserOptionScript")
	}
	static class UPlaylistUserOptionScript* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlaylistUserOptionScript>();
	}
};
DUMPER7_ASSERTS_UPlaylistUserOptionScript;

// Class VerseDevices.ScriptDevice
// 0x0028 (0x0BF0 - 0x0BC8)
class AScriptDevice final : public ABuildingProp
{
public:
	uint8                                         Pad_BC8[0x8];                                      // 0x0BC8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UVerseCreativeDevice*                   Script;                                            // 0x0BD0(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, SaveGame, NoDestructor, Protected, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UVerseCreativeDevice*                   ScriptInstance;                                    // 0x0BD8(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_BE0[0x10];                                     // 0x0BE0(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BP_SetVisibility(bool bVisible);
	void SetEnabled(bool bInEnabled);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ScriptDevice")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ScriptDevice")
	}
	static class AScriptDevice* GetDefaultObj()
	{
		return GetDefaultObjImpl<AScriptDevice>();
	}
};
DUMPER7_ASSERTS_AScriptDevice;

// Class VerseDevices.VerseMovableObjectBase
// 0x0078 (0x00A0 - 0x0028)
class UVerseMovableObjectBase : public UObject
{
public:
	uint8                                         Pad_28[0x78];                                      // 0x0028(0x0078)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("VerseMovableObjectBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"VerseMovableObjectBase")
	}
	static class UVerseMovableObjectBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseMovableObjectBase>();
	}
};
DUMPER7_ASSERTS_UVerseMovableObjectBase;

// Class VerseDevices.VerseCreativeDevice
// 0x0020 (0x00C0 - 0x00A0)
#pragma pack(push, 0x1)
class alignas(0x10) UVerseCreativeDevice : public UVerseMovableObjectBase
{
public:
	uint8                                         Pad_A0[0x10];                                      // 0x00A0(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 ActorOwner;                                        // 0x00B0(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("VerseCreativeDevice")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"VerseCreativeDevice")
	}
	static class UVerseCreativeDevice* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseCreativeDevice>();
	}
};
#pragma pack(pop)
DUMPER7_ASSERTS_UVerseCreativeDevice;

// Class VerseDevices.VerseCreativeObject
// 0x0020 (0x00C0 - 0x00A0)
#pragma pack(push, 0x1)
class alignas(0x10) UVerseCreativeObject : public UVerseMovableObjectBase
{
public:
	class AActor*                                 SavedActor;                                        // 0x00A0(0x0008)(Edit, ZeroConstructor, SaveGame, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A8[0x10];                                      // 0x00A8(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("VerseCreativeObject")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"VerseCreativeObject")
	}
	static class UVerseCreativeObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseCreativeObject>();
	}
};
#pragma pack(pop)
DUMPER7_ASSERTS_UVerseCreativeObject;

// Class VerseDevices.VerseCreativeObjectQuotaHelperComponent
// 0x0018 (0x00B8 - 0x00A0)
class UVerseCreativeObjectQuotaHelperComponent final : public UActorComponent
{
public:
	uint8                                         Pad_A0[0x18];                                      // 0x00A0(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("VerseCreativeObjectQuotaHelperComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"VerseCreativeObjectQuotaHelperComponent")
	}
	static class UVerseCreativeObjectQuotaHelperComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseCreativeObjectQuotaHelperComponent>();
	}
};
DUMPER7_ASSERTS_UVerseCreativeObjectQuotaHelperComponent;

// Class VerseDevices.VerseDevicesFeatureAction_RegisterWrapperClasses
// 0x0028 (0x0050 - 0x0028)
class UVerseDevicesFeatureAction_RegisterWrapperClasses final : public UGameFeatureAction
{
public:
	TSoftObjectPtr<class UVerseDeviceWrapperClassMap> DeviceToWrapperClassMapAsset;                  // 0x0028(0x0020)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_48[0x8];                                       // 0x0048(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("VerseDevicesFeatureAction_RegisterWrapperClasses")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"VerseDevicesFeatureAction_RegisterWrapperClasses")
	}
	static class UVerseDevicesFeatureAction_RegisterWrapperClasses* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseDevicesFeatureAction_RegisterWrapperClasses>();
	}
};
DUMPER7_ASSERTS_UVerseDevicesFeatureAction_RegisterWrapperClasses;

// Class VerseDevices.VerseDeviceSubsystem
// 0x0118 (0x0148 - 0x0030)
class UVerseDeviceSubsystem final : public UWorldSubsystem
{
public:
	TMap<TSoftClassPtr<class UClass>, TSubclassOf<class UObject>> DeviceClassToVerseClassMap;        // 0x0030(0x0050)(Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                         Pad_80[0xC8];                                      // 0x0080(0x00C8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("VerseDeviceSubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"VerseDeviceSubsystem")
	}
	static class UVerseDeviceSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseDeviceSubsystem>();
	}
};
DUMPER7_ASSERTS_UVerseDeviceSubsystem;

// Class VerseDevices.VerseDeviceWrapperClassMap
// 0x0050 (0x0080 - 0x0030)
class UVerseDeviceWrapperClassMap final : public UDataAsset
{
public:
	TMap<TSoftClassPtr<class UClass>, TSubclassOf<class UVerseCreativeObject>> DeviceClassMap;       // 0x0030(0x0050)(Edit, UObjectWrapper, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("VerseDeviceWrapperClassMap")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"VerseDeviceWrapperClassMap")
	}
	static class UVerseDeviceWrapperClassMap* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseDeviceWrapperClassMap>();
	}
};
DUMPER7_ASSERTS_UVerseDeviceWrapperClassMap;

}

