#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VerseQuery

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"
#include "Engine_classes.hpp"
#include "Entity_classes.hpp"
#include "PlayspaceSystem_classes.hpp"


namespace SDK
{

// Class VerseQuery.QueryIteratorBase
// 0x0018 (0x0040 - 0x0028)
class UQueryIteratorBase : public UObject
{
public:
	uint8                                         Pad_28[0x18];                                      // 0x0028(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("QueryIteratorBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"QueryIteratorBase")
	}
	static class UQueryIteratorBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UQueryIteratorBase>();
	}
};
DUMPER7_ASSERTS_UQueryIteratorBase;

// Class VerseQuery.EntityQueryManager
// 0x0010 (0x0038 - 0x0028)
class UEntityQueryManager final : public UObject
{
public:
	class UEntityTypeQueryContainer*              EntityTypeQueryContainer;                          // 0x0028(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UTaggedObjectQueryContainer*            TagQueryContainer;                                 // 0x0030(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EntityQueryManager")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EntityQueryManager")
	}
	static class UEntityQueryManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEntityQueryManager>();
	}
};
DUMPER7_ASSERTS_UEntityQueryManager;

// Class VerseQuery.EntityTypeQueryContainer
// 0x00A0 (0x00C8 - 0x0028)
class UEntityTypeQueryContainer final : public UObject
{
public:
	uint8                                         Pad_28[0xA0];                                      // 0x0028(0x00A0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EntityTypeQueryContainer")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EntityTypeQueryContainer")
	}
	static class UEntityTypeQueryContainer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEntityTypeQueryContainer>();
	}
};
DUMPER7_ASSERTS_UEntityTypeQueryContainer;

// Class VerseQuery.GlobalEntityQueryManagerComponent
// 0x0008 (0x00A8 - 0x00A0)
class UGlobalEntityQueryManagerComponent final : public UActorComponent
{
public:
	class UEntityQueryManager*                    QueryManager;                                      // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GlobalEntityQueryManagerComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GlobalEntityQueryManagerComponent")
	}
	static class UGlobalEntityQueryManagerComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGlobalEntityQueryManagerComponent>();
	}
};
DUMPER7_ASSERTS_UGlobalEntityQueryManagerComponent;

// Class VerseQuery.CoreEntityLevelPlayspaceAssociationComponent
// 0x0010 (0x00B0 - 0x00A0)
class UCoreEntityLevelPlayspaceAssociationComponent final : public UActorComponent
{
public:
	TWeakObjectPtr<class AGameplayVolume>         Volume;                                            // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TWeakObjectPtr<class APlayspace>              Playspace;                                         // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CoreEntityLevelPlayspaceAssociationComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CoreEntityLevelPlayspaceAssociationComponent")
	}
	static class UCoreEntityLevelPlayspaceAssociationComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCoreEntityLevelPlayspaceAssociationComponent>();
	}
};
DUMPER7_ASSERTS_UCoreEntityLevelPlayspaceAssociationComponent;

// Class VerseQuery.CoreEntityRegistry
// 0x0000 (0x0030 - 0x0030)
class UCoreEntityRegistry final : public UCoreEntityRegistryBase
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CoreEntityRegistry")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CoreEntityRegistry")
	}
	static class UCoreEntityRegistry* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCoreEntityRegistry>();
	}
};
DUMPER7_ASSERTS_UCoreEntityRegistry;

// Class VerseQuery.PlayspaceComponent_EntityQueryContainer
// 0x0008 (0x00A8 - 0x00A0)
class UPlayspaceComponent_EntityQueryContainer final : public UPlayspaceComponent
{
public:
	class UEntityQueryManager*                    QueryManager;                                      // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PlayspaceComponent_EntityQueryContainer")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PlayspaceComponent_EntityQueryContainer")
	}
	static class UPlayspaceComponent_EntityQueryContainer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlayspaceComponent_EntityQueryContainer>();
	}
};
DUMPER7_ASSERTS_UPlayspaceComponent_EntityQueryContainer;

// Class VerseQuery.TaggedObjectQueryContainer
// 0x0050 (0x0078 - 0x0028)
class UTaggedObjectQueryContainer final : public UObject
{
public:
	uint8                                         Pad_28[0x50];                                      // 0x0028(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("TaggedObjectQueryContainer")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"TaggedObjectQueryContainer")
	}
	static class UTaggedObjectQueryContainer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTaggedObjectQueryContainer>();
	}
};
DUMPER7_ASSERTS_UTaggedObjectQueryContainer;

}

