#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VerseSimulationMetadata_0

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"
#include "VerseNative_structs.hpp"


namespace SDK
{

// VerseClass VerseSimulationMetadata.Simulation
// 0x0000 (0x0028 - 0x0028)
class VerseSimulationMetadata_0::USimulation final : public UObject
{
public:
	static class UClass* _L_2fVerse_2eorg_2fSimulation_N_Reditable__number_L_Nt_20where_20t_R(class UClass* __verse_0xB2CDDD72_Argument);
	static class UClass* _L_2fVerse_2eorg_2fSimulation_N_Reditable__slider_L_Nt_20where_20t_R(class UClass* __verse_0xB2CDDD72_Argument);
	static class UClass* _L_2fVerse_2eorg_2fSimulation_N_Reditable__vector_L_Nt_20where_20t_R(class UClass* __verse_0xB2CDDD72_Argument);

	void _InitCDO();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL_FULLNAME("VerseClass VerseSimulationMetadata.Simulation")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Simulation")
	}
	static class VerseSimulationMetadata_0::USimulation* GetDefaultObj()
	{
		return GetDefaultObjImpl<VerseSimulationMetadata_0::USimulation>();
	}
};
DUMPER7_ASSERTS_VerseSimulationMetadata_0__USimulation;

// VerseClass VerseSimulationMetadata.Simulation_editable_widget
// 0x0000 (0x0028 - 0x0028)
class USimulation_editable_widget : public UObject
{
public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("Simulation_editable_widget")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Simulation_editable_widget")
	}
	static class USimulation_editable_widget* GetDefaultObj()
	{
		return GetDefaultObjImpl<USimulation_editable_widget>();
	}
};
DUMPER7_ASSERTS_USimulation_editable_widget;

// VerseClass VerseSimulationMetadata.Simulation_editable_text_box
// 0x0010 (0x0038 - 0x0028)
class USimulation_editable_text_box final : public USimulation_editable_widget
{
public:
	uint8                                         __verse_0x3FDB56EA_MultiLine : 1;                  // 0x0028(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (InstancedReference, NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         __verse_0x7472347D_MaxLength;                      // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("Simulation_editable_text_box")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Simulation_editable_text_box")
	}
	static class USimulation_editable_text_box* GetDefaultObj()
	{
		return GetDefaultObjImpl<USimulation_editable_text_box>();
	}
};
DUMPER7_ASSERTS_USimulation_editable_text_box;

// VerseClass VerseSimulationMetadata.Simulation_editable_number
// 0x0048 (0x0070 - 0x0028)
class USimulation_editable_number final : public USimulation_editable_widget
{
public:
	TOptional<FUtf8String>                        __verse_0x556DEFE1_MinValue;                       // 0x0028(0x0018)(ZeroConstructor, InstancedReference, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<FUtf8String>                        __verse_0xD0A81623_MaxValue;                       // 0x0040(0x0018)(ZeroConstructor, InstancedReference, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<FUtf8String>                        __verse_0xCBC33970_SpinBoxDelta;                   // 0x0058(0x0018)(ZeroConstructor, InstancedReference, ContainsInstancedReference, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("Simulation_editable_number")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Simulation_editable_number")
	}
	static class USimulation_editable_number* GetDefaultObj()
	{
		return GetDefaultObjImpl<USimulation_editable_number>();
	}
};
DUMPER7_ASSERTS_USimulation_editable_number;

// VerseClass VerseSimulationMetadata.Simulation_editable_vector
// 0x0050 (0x0078 - 0x0028)
class USimulation_editable_vector final : public USimulation_editable_widget
{
public:
	uint8                                         __verse_0x39F2BDB1_PreserveRatio : 1;              // 0x0028(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (InstancedReference, NoDestructor, HasGetValueTypeHash))
	uint8                                         BitPad_28_1 : 7;                                   // 0x0028(0x0001)(Fixing Bit-Field Size For New Byte [ Dumper-7 ])
	uint8                                         __verse_0xA5742405_Normalize : 1;                  // 0x0029(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (InstancedReference, NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TOptional<FUtf8String>                        __verse_0x052BDC83_MinComponentValue;              // 0x0030(0x0018)(ZeroConstructor, InstancedReference, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<FUtf8String>                        __verse_0xF1AF0AE9_MaxComponentValue;              // 0x0048(0x0018)(ZeroConstructor, InstancedReference, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<FUtf8String>                        __verse_0xCBC33970_SpinBoxDelta;                   // 0x0060(0x0018)(ZeroConstructor, InstancedReference, ContainsInstancedReference, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("Simulation_editable_vector")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Simulation_editable_vector")
	}
	static class USimulation_editable_vector* GetDefaultObj()
	{
		return GetDefaultObjImpl<USimulation_editable_vector>();
	}
};
DUMPER7_ASSERTS_USimulation_editable_vector;

// VerseClass VerseSimulationMetadata.Simulation_editable_slider
// 0x0070 (0x0098 - 0x0028)
class USimulation_editable_slider final : public USimulation_editable_widget
{
public:
	TOptional<FUtf8String>                        __verse_0x556DEFE1_MinValue;                       // 0x0028(0x0018)(ZeroConstructor, InstancedReference, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<FUtf8String>                        __verse_0xD0A81623_MaxValue;                       // 0x0040(0x0018)(ZeroConstructor, InstancedReference, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<FUtf8String>                        __verse_0x736C6B28_SliderDelta;                    // 0x0058(0x0018)(ZeroConstructor, InstancedReference, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<FUtf8String>                        __verse_0xE932FBDD_Exponent;                       // 0x0070(0x0018)(ZeroConstructor, InstancedReference, ContainsInstancedReference, HasGetValueTypeHash)
	double                                        __verse_0x4E4EAC3B_MouseLinearDeltaSensitivity;    // 0x0088(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __verse_0x600AAAA6_MouseShiftMovePixelPerDelta;    // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("Simulation_editable_slider")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Simulation_editable_slider")
	}
	static class USimulation_editable_slider* GetDefaultObj()
	{
		return GetDefaultObjImpl<USimulation_editable_slider>();
	}
};
DUMPER7_ASSERTS_USimulation_editable_slider;

// VerseClass VerseSimulationMetadata.Simulation_editable_container
// 0x0008 (0x0030 - 0x0028)
class USimulation_editable_container final : public USimulation_editable_widget
{
public:
	uint8                                         __verse_0x49D4DB55_AllowReordering : 1;            // 0x0028(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (InstancedReference, NoDestructor, HasGetValueTypeHash))

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("Simulation_editable_container")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Simulation_editable_container")
	}
	static class USimulation_editable_container* GetDefaultObj()
	{
		return GetDefaultObjImpl<USimulation_editable_container>();
	}
};
DUMPER7_ASSERTS_USimulation_editable_container;

}

