#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VerseNPC

#include "Basic.hpp"

#include "VerseFortnite_classes.hpp"
#include "EntityCore_classes.hpp"
#include "VerseAIBase_classes.hpp"
#include "FortniteAI_structs.hpp"


namespace SDK
{

// Class VerseNPC.NPCCharacterModifier_Perception
// 0x0028 (0x0050 - 0x0028)
class UNPCCharacterModifier_Perception final : public UNPCCharacterModifier
{
public:
	uint8                                         bOverrideSightSettings : 1;                        // 0x0028(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bEnableSight : 1;                                  // 0x0028(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bOverrideHearingSettings : 1;                      // 0x0028(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bEnableHearing : 1;                                // 0x0028(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bOverrideTouchSettings : 1;                        // 0x0028(0x0001)(BitIndex: 0x04, PropSize: 0x0001 (Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bEnableTouch : 1;                                  // 0x0028(0x0001)(BitIndex: 0x05, PropSize: 0x0001 (Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bOverrideDamageSettings : 1;                       // 0x0028(0x0001)(BitIndex: 0x06, PropSize: 0x0001 (Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bEnableDamage : 1;                                 // 0x0028(0x0001)(BitIndex: 0x07, PropSize: 0x0001 (Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAISenseConfig_Sight*                   SightPerceptionSettings;                           // 0x0030(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, NoClear, NoDestructor, Protected, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAISenseConfig_Hearing*                 HearingPerceptionSettings;                         // 0x0038(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, NoClear, NoDestructor, Protected, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAISenseConfig_Touch*                   TouchPerceptionSettings;                           // 0x0040(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, NoClear, NoDestructor, Protected, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAISenseConfig_Damage*                  DamagePerceptionSettings;                          // 0x0048(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, NoClear, NoDestructor, Protected, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NPCCharacterModifier_Perception")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NPCCharacterModifier_Perception")
	}
	static class UNPCCharacterModifier_Perception* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNPCCharacterModifier_Perception>();
	}
};
DUMPER7_ASSERTS_UNPCCharacterModifier_Perception;

// Class VerseNPC.CharacterModifier_GuardPerception
// 0x0088 (0x00B0 - 0x0028)
class UCharacterModifier_GuardPerception final : public UNPCCharacterModifier
{
public:
	uint8                                         bOverrideSightSettings : 1;                        // 0x0028(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bEnableSight : 1;                                  // 0x0028(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bOverrideHearingSettings : 1;                      // 0x0028(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bEnableHearing : 1;                                // 0x0028(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bOverrideTouchSettings : 1;                        // 0x0028(0x0001)(BitIndex: 0x04, PropSize: 0x0001 (Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bEnableTouch : 1;                                  // 0x0028(0x0001)(BitIndex: 0x05, PropSize: 0x0001 (Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bOverrideDamageSettings : 1;                       // 0x0028(0x0001)(BitIndex: 0x06, PropSize: 0x0001 (Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bEnableDamage : 1;                                 // 0x0028(0x0001)(BitIndex: 0x07, PropSize: 0x0001 (Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAISenseConfig_Sight*                   SightPerceptionSettings[0x4];                      // 0x0030(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, NoClear, NoDestructor, Protected, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAISenseConfig_Hearing*                 HearingPerceptionSettings[0x4];                    // 0x0050(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, NoClear, NoDestructor, Protected, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAISenseConfig_Touch*                   TouchPerceptionSettings[0x4];                      // 0x0070(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, NoClear, NoDestructor, Protected, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAISenseConfig_Damage*                  DamagePerceptionSettings[0x4];                     // 0x0090(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, NoClear, NoDestructor, Protected, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CharacterModifier_GuardPerception")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CharacterModifier_GuardPerception")
	}
	static class UCharacterModifier_GuardPerception* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCharacterModifier_GuardPerception>();
	}
};
DUMPER7_ASSERTS_UCharacterModifier_GuardPerception;

// Class VerseNPC.InventoryComponentBase
// 0x0040 (0x0098 - 0x0058)
class UInventoryComponentBase : public UEntityComponent
{
public:
	uint8                                         Pad_58[0x28];                                      // 0x0058(0x0028)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortInventory*                         CachedFortInventory;                               // 0x0080(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class AFortPawn*                              CachedFortPawn;                                    // 0x0088(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBlackboardComponent*                   CachedBlackboardComponent;                         // 0x0090(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("InventoryComponentBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"InventoryComponentBase")
	}
	static class UInventoryComponentBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInventoryComponentBase>();
	}
};
DUMPER7_ASSERTS_UInventoryComponentBase;

// Class VerseNPC.LeashComponentBase
// 0x0000 (0x0070 - 0x0070)
class ULeashComponentBase : public UAIComponent
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LeashComponentBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LeashComponentBase")
	}
	static class ULeashComponentBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULeashComponentBase>();
	}
};
DUMPER7_ASSERTS_ULeashComponentBase;

// Class VerseNPC.NPCPerceptionComponentBase
// 0x0000 (0x0090 - 0x0090)
#pragma pack(push, 0x1)
class alignas(0x08) UNPCPerceptionComponentBase : public UAIPerceptionComponentBase
{
public:
	void OnBotControllerAlertLevelChanged(class AFortAthenaAIBotController* BotController, EAlertLevel OldAlertLevel, EAlertLevel NewAlertLevel);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NPCPerceptionComponentBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NPCPerceptionComponentBase")
	}
	static class UNPCPerceptionComponentBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNPCPerceptionComponentBase>();
	}
};
#pragma pack(pop)
DUMPER7_ASSERTS_UNPCPerceptionComponentBase;

}

