#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_PinnedQuestMarkerIndicator

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function W_PinnedQuestMarkerIndicator.W_PinnedQuestMarkerIndicator_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_PinnedQuestMarkerIndicator_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_PinnedQuestMarkerIndicator_C_PreConstruct;

// Function W_PinnedQuestMarkerIndicator.W_PinnedQuestMarkerIndicator_C.NotifyWillBeRemoved
// 0x0008 (0x0008 - 0x0000)
struct W_PinnedQuestMarkerIndicator_C_NotifyWillBeRemoved final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_PinnedQuestMarkerIndicator_C_NotifyWillBeRemoved;

// Function W_PinnedQuestMarkerIndicator.W_PinnedQuestMarkerIndicator_C.GetRemovalDuration
// 0x0008 (0x0008 - 0x0000)
struct W_PinnedQuestMarkerIndicator_C_GetRemovalDuration final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_PinnedQuestMarkerIndicator_C_GetRemovalDuration;

// Function W_PinnedQuestMarkerIndicator.W_PinnedQuestMarkerIndicator_C.ExecuteUbergraph_W_PinnedQuestMarkerIndicator
// 0x0018 (0x0018 - 0x0000)
struct W_PinnedQuestMarkerIndicator_C_ExecuteUbergraph_W_PinnedQuestMarkerIndicator final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_PinnedQuestMarkerIndicator_C_ExecuteUbergraph_W_PinnedQuestMarkerIndicator;

// Function W_PinnedQuestMarkerIndicator.W_PinnedQuestMarkerIndicator_C.GetIndicatedActor
// 0x0008 (0x0008 - 0x0000)
struct W_PinnedQuestMarkerIndicator_C_GetIndicatedActor final
{
public:
	class AActor*                                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_PinnedQuestMarkerIndicator_C_GetIndicatedActor;

// Function W_PinnedQuestMarkerIndicator.W_PinnedQuestMarkerIndicator_C.GetCanvasPanelContainer
// 0x0010 (0x0010 - 0x0000)
struct W_PinnedQuestMarkerIndicator_C_GetCanvasPanelContainer final
{
public:
	EFortActorIndicatorContainerWidget            ContainerEnum;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanel*                           ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_PinnedQuestMarkerIndicator_C_GetCanvasPanelContainer;

}

