#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_VoiceRep_Reporting_Step_Complete

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_VoiceRep_Reporting_Step_Complete.WBP_VoiceRep_Reporting_Step_Complete_C.ExecuteUbergraph_WBP_VoiceRep_Reporting_Step_Complete
// 0x0014 (0x0014 - 0x0000)
struct WBP_VoiceRep_Reporting_Step_Complete_C_ExecuteUbergraph_WBP_VoiceRep_Reporting_Step_Complete final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobileGame_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_real_Variable;                                // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_1;                              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default;                             // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_VoiceRep_Reporting_Step_Complete_C_ExecuteUbergraph_WBP_VoiceRep_Reporting_Step_Complete;

}

