#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_AthenaHUDMenu

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_AthenaHUDMenu.WBP_AthenaHUDMenu_C
// 0x0028 (0x03E8 - 0x03C0)
class UWBP_AthenaHUDMenu_C final : public UAthenaHUDMenu
{
public:
	class UAthenaServerShutdownWidget_C*          AthenaServerShutdownWidget;                        // 0x03C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonVisibilitySwitcher*              BottomBar;                                         // 0x03C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UContentOnDemand_C*                     ContentOnDemand;                                   // 0x03D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_AthenaBottomBarWidget_C*           LegacyBottomBar;                                   // 0x03D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_AthenaBottomBarWidget_C*           MenuBottomBar;                                     // 0x03E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void SetBottomBarVisibility(const ESlateVisibility NewVisibility, const bool bIsUsingLegacyBottomBar);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_AthenaHUDMenu_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_AthenaHUDMenu_C")
	}
	static class UWBP_AthenaHUDMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_AthenaHUDMenu_C>();
	}
};
DUMPER7_ASSERTS_UWBP_AthenaHUDMenu_C;

}

