#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UIKit_ButtonText_CTA

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "WBP_UIKit_Block_Base_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UIKit_ButtonText_CTA.WBP_UIKit_ButtonText_CTA_C
// 0x0090 (0x0388 - 0x02F8)
class UWBP_UIKit_ButtonText_CTA_C final : public UWBP_UIKit_Block_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Anim_Bounce;                                       // 0x0300(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_Disabled_Transition;                          // 0x0308(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_Pressed_Transition;                           // 0x0310(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_Focused_Transition;                           // 0x0318(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextBlock;                                         // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FSlateFontInfo                         Font;                                              // 0x0328(0x0058)(Edit, BlueprintVisible, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               FontDynamicMaterial;                               // 0x0380(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_UIKit_ButtonText_CTA(int32 EntryPoint);
	void OnInstantTransitionToDisabled();
	void OnInstantTransitionToEnabled();
	void OnTransitionDisabledRequested();
	void OnTransitionEnabledRequested();
	void OnTransitionFocusedRequested();
	void OnTransitionPressedRequested();
	void OnTransitionReleasedRequested();
	void OnTransitionUnfocusedRequested();
	void RefreshDynamicFontMaterial();
	void SetFont(struct FSlateFontInfo& Font_0);
	void SetMobileFontSizeMultiplier(float MobileFontSizeMultiplier);
	void SetText(const class FText& Text, bool* Empty);
	void SetTransformPolicy(ETextTransformPolicy Transform_Policy);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_UIKit_ButtonText_CTA_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_UIKit_ButtonText_CTA_C")
	}
	static class UWBP_UIKit_ButtonText_CTA_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UIKit_ButtonText_CTA_C>();
	}
};
DUMPER7_ASSERTS_UWBP_UIKit_ButtonText_CTA_C;

}

