#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PanelRebootRally_Header

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_PanelRebootRally_Header.WBP_PanelRebootRally_Header_C
// 0x0058 (0x0360 - 0x0308)
class UWBP_PanelRebootRally_Header_C final : public UFortSidebarPanelRebootHeader
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0308(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Default;                                           // 0x0310(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_Rewards;                                     // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   RichText_RebootRallyDetails;                       // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_RebootRally_Logo_C*                WBP_RebootRally_Logo;                              // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   Text_Eligible;                                     // 0x0330(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   Text_Ineligible;                                   // 0x0348(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void OnRebootRallyEligibilityUpdated(bool bEligible);
	void ExecuteUbergraph_WBP_PanelRebootRally_Header(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_PanelRebootRally_Header_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_PanelRebootRally_Header_C")
	}
	static class UWBP_PanelRebootRally_Header_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_PanelRebootRally_Header_C>();
	}
};
DUMPER7_ASSERTS_UWBP_PanelRebootRally_Header_C;

}

