#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Augments_InteractionIndicatorInfo

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_Augments_InteractionIndicatorInfo.WBP_Augments_InteractionIndicatorInfo_C.ExecuteUbergraph_WBP_Augments_InteractionIndicatorInfo
// 0x0060 (0x0060 - 0x0000)
struct WBP_Augments_InteractionIndicatorInfo_C_ExecuteUbergraph_WBP_Augments_InteractionIndicatorInfo final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable;                              // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D;                   // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UObject>                 K2Node_CustomEvent_Asset;                          // 0x0028(0x0020)(HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate;              // 0x0050(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Augments_InteractionIndicatorInfo_C_ExecuteUbergraph_WBP_Augments_InteractionIndicatorInfo;

// Function WBP_Augments_InteractionIndicatorInfo.WBP_Augments_InteractionIndicatorInfo_C.OnLoaded_2A5949E64DAB0291DE31D1B67C0E8EB9
// 0x0008 (0x0008 - 0x0000)
struct WBP_Augments_InteractionIndicatorInfo_C_OnLoaded_2A5949E64DAB0291DE31D1B67C0E8EB9 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Augments_InteractionIndicatorInfo_C_OnLoaded_2A5949E64DAB0291DE31D1B67C0E8EB9;

// Function WBP_Augments_InteractionIndicatorInfo.WBP_Augments_InteractionIndicatorInfo_C.SetAugmentIcon
// 0x0020 (0x0020 - 0x0000)
struct WBP_Augments_InteractionIndicatorInfo_C_SetAugmentIcon final
{
public:
	TSoftObjectPtr<class UObject>                 Asset;                                             // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Augments_InteractionIndicatorInfo_C_SetAugmentIcon;

// Function WBP_Augments_InteractionIndicatorInfo.WBP_Augments_InteractionIndicatorInfo_C.SetAugmentInfo
// 0x0028 (0x0028 - 0x0000)
struct WBP_Augments_InteractionIndicatorInfo_C_SetAugmentInfo final
{
public:
	class UFortPlayerAugmentItemDefinition*       InAugmentItemDefinition;                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              CallFunc_GetHUDEffectImage_ReturnValue;            // 0x0008(0x0020)(UObjectWrapper, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Augments_InteractionIndicatorInfo_C_SetAugmentInfo;

}

