#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_Block_Backplate_BlurWidget

#include "Basic.hpp"

#include "UMG_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UI_Block_Backplate_BlurWidget.WBP_UI_Block_Backplate_BlurWidget_C
// 0x0050 (0x0310 - 0x02C0)
class UWBP_UI_Block_Backplate_BlurWidget_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBackgroundBlur*                        BlurWidget;                                        // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMaterialInterface*                     FallbackBrushMaterial;                             // 0x02D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               FallBackDynamicMaterialInstance;                   // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FVector4                               Corner_Radius;                                     // 0x02E0(0x0020)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Blur_Amount;                                       // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Radius_in_Pixels;                                  // 0x0308(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_UI_Block_Backplate_BlurWidget(int32 EntryPoint);
	void InitFallbackBrush();
	void InitializeBlock();
	void PreConstruct(bool IsDesignTime);
	void SetBlur(double BlurAmount);
	void SetCornerRadius(const struct FVector4& CornerRadius, bool RadiusInPixels);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_UI_Block_Backplate_BlurWidget_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_UI_Block_Backplate_BlurWidget_C")
	}
	static class UWBP_UI_Block_Backplate_BlurWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UI_Block_Backplate_BlurWidget_C>();
	}
};
DUMPER7_ASSERTS_UWBP_UI_Block_Backplate_BlurWidget_C;

}

