#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WeaponModsCodeRuntime

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "WeaponModsCodeRuntime_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK
{

// Class WeaponModsCodeRuntime.FortModStation_WeaponUICapture
// 0x0020 (0x02B0 - 0x0290)
class AFortModStation_WeaponUICapture final : public AActor
{
public:
	uint8                                         PSOPrecachingCheckMaxRetries;                      // 0x0290(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_291[0x3];                                      // 0x0291(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TWeakObjectPtr<class UMeshComponent>          MeshComponentPtr;                                  // 0x0294(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_29C[0x14];                                     // 0x029C(0x0014)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnRefreshCapture();
	void RefreshCaptureWhenPSOPrecachingDone(class UMeshComponent* PreviewMeshComponent);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortModStation_WeaponUICapture")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortModStation_WeaponUICapture")
	}
	static class AFortModStation_WeaponUICapture* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFortModStation_WeaponUICapture>();
	}
};
DUMPER7_ASSERTS_AFortModStation_WeaponUICapture;

// Class WeaponModsCodeRuntime.FortWeaponModManagementComponent
// 0x0010 (0x00B8 - 0x00A8)
class UFortWeaponModManagementComponent final : public UFortControllerComponent
{
public:
	TMulticastInlineDelegate<void(class AFortWeapon* Weapon)> OnWeaponModSlotsChanged;               // 0x00A8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)

public:
	void HandleWeaponUnequip(class AFortWeapon* Weapon);
	void ServerRequestAddModToWeaponFromInventory(const struct FGuid& WeaponModItemGUID, const struct FGuid& WeaponItemGuid);
	void ServerRequestRemoveModFromWeaponToInventory(class UFortWeaponModItemDefinition* WeaponModDef, const struct FGuid& WeaponItemGuid);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortWeaponModManagementComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortWeaponModManagementComponent")
	}
	static class UFortWeaponModManagementComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortWeaponModManagementComponent>();
	}
};
DUMPER7_ASSERTS_UFortWeaponModManagementComponent;

// Class WeaponModsCodeRuntime.FortWeaponModStationBase
// 0x00C0 (0x0C88 - 0x0BC8)
class AFortWeaponModStationBase final : public ABuildingProp
{
public:
	struct FMarkedActorDisplayInfo                MarkerDisplay;                                     // 0x0BC8(0x00A8)(Edit, BlueprintVisible, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FVector                                MarkerPositionOffset;                              // 0x0C70(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	bool GetModCostOverride(float* OutModCostOverride) const;
	class UFortResourceItemDefinition* GetTransactionCurrency() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortWeaponModStationBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortWeaponModStationBase")
	}
	static class AFortWeaponModStationBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFortWeaponModStationBase>();
	}
};
DUMPER7_ASSERTS_AFortWeaponModStationBase;

// Class WeaponModsCodeRuntime.FortWeaponModStationSharedDataComponent
// 0x00F8 (0x0198 - 0x00A0)
class UFortWeaponModStationSharedDataComponent final : public UFortGameStateComponent
{
public:
	class UDataTable*                             ModCostData;                                       // 0x00A0(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TMap<struct FGameplayTag, struct FFortModSlotPurchaseList> ModSlotPurchaseLists;                 // 0x00A8(0x0050)(BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	TMap<struct FPrimaryAssetId, struct FFortModStationDataRow> ModCostMap;                          // 0x00F8(0x0050)(BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_148[0x50];                                     // 0x0148(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortWeaponModStationSharedDataComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortWeaponModStationSharedDataComponent")
	}
	static class UFortWeaponModStationSharedDataComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortWeaponModStationSharedDataComponent>();
	}
};
DUMPER7_ASSERTS_UFortWeaponModStationSharedDataComponent;

// Class WeaponModsCodeRuntime.FortWeaponModStationComponent
// 0x00E0 (0x0188 - 0x00A8)
class UFortWeaponModStationComponent final : public UFortControllerComponent
{
public:
	TMulticastInlineDelegate<void(const struct FFortLocalModPurchaseEventParams& EventParams)> OnLocalModPurchaseStarted; // 0x00A8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class AFortWeaponModStationBase* NewInteractingWeaponModStation)> OnStartInteractWithWorkbenchActor; // 0x00B8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class AFortWeaponModStationBase* WeaponModStation)> OnStopInteractWithWorkbenchActor; // 0x00C8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class AFortWeaponModStationBase*              CurrentInteractingWeaponModStation;                // 0x00D8(0x0008)(BlueprintVisible, ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FScalableFloat                         ModStationHotfixEnabled;                           // 0x00E0(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         RemoveModCost;                                     // 0x0108(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         CancelInteractDistance;                            // 0x0130(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	class UFortWeaponModItemDefinition*           DefaultIronSightMod;                               // 0x0158(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortWeaponModItemDefinition*           DefaultMagazineMod;                                // 0x0160(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_168[0x20];                                     // 0x0168(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ClientNotifyServerForcedInteractOver();
	void ClientStartInteractWithWorkbenchActor(class AFortWeaponModStationBase* NewInteractingWeaponModStation);
	void LocalPurchaseRemoveMod(class UFortWeaponModItemDefinition* WeaponMod, class AFortWeapon* Weapon);
	void LocalPurchaseWeaponModForWeapon(class UFortWeaponModItemDefinition* WeaponMod, class AFortWeapon* Weapon);
	void ServerPurchaseRemoveMod(class UFortWeaponModItemDefinition* WeaponMod, class AFortWeapon* Weapon);
	void ServerPurchaseWeaponModForWeapon(class UFortWeaponModItemDefinition* WeaponMod, class AFortWeapon* Weapon);
	void ServerStopInteractWithWorkbenchActor(class AFortWeaponModStationBase* NewInteractingWeaponModStation);
	void StartInteractWithWorkbenchActor(class AFortWeaponModStationBase* NewInteractingWeaponModStation);

	bool CanPlayerAffordModForWeapon(const class UFortWeaponModItemDefinition* WeaponMod, const class AFortWeapon* Weapon, const class AController* Controller) const;
	bool CanPlayerAffordRemoveModFromWeapon(const class UFortWeaponModItemDefinition* WeaponMod, const class AFortWeapon* Weapon, const class AController* Controller) const;
	bool DoesCurrentWorkbenchHaveModsForWeapon(class AFortWeapon* Weapon) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortWeaponModStationComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortWeaponModStationComponent")
	}
	static class UFortWeaponModStationComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortWeaponModStationComponent>();
	}
};
DUMPER7_ASSERTS_UFortWeaponModStationComponent;

// Class WeaponModsCodeRuntime.FortPickupInteractOverrideComponent_WeaponMods
// 0x0000 (0x00C0 - 0x00C0)
class UFortPickupInteractOverrideComponent_WeaponMods final : public UFortPickupInteractOverrideComponent
{
public:
	void ServerApplyWeaponModFromPickup(class AFortPickup* Pickup, const class UFortWeaponModItemDefinition* WeaponModDef, class AFortWeapon* Weapon);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortPickupInteractOverrideComponent_WeaponMods")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortPickupInteractOverrideComponent_WeaponMods")
	}
	static class UFortPickupInteractOverrideComponent_WeaponMods* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortPickupInteractOverrideComponent_WeaponMods>();
	}
};
DUMPER7_ASSERTS_UFortPickupInteractOverrideComponent_WeaponMods;

}

