#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WeaponModsUI

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function WeaponModsUI.AthenaEquippedItemInfoWeaponMods.HandleWeaponFullyEquipped
// 0x0010 (0x0010 - 0x0000)
struct AthenaEquippedItemInfoWeaponMods_HandleWeaponFullyEquipped final
{
public:
	class AFortWeapon*                            NewWeapon;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFortWeapon*                            PrevWeapon;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AthenaEquippedItemInfoWeaponMods_HandleWeaponFullyEquipped;

// Function WeaponModsUI.AthenaEquippedItemInfoWeaponMods.SetItemSlotInfo
// 0x0010 (0x0010 - 0x0000)
struct AthenaEquippedItemInfoWeaponMods_SetItemSlotInfo final
{
public:
	struct FFortWeaponModSlot                     ModSlot;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AthenaEquippedItemInfoWeaponMods_SetItemSlotInfo;

// Function WeaponModsUI.AthenaInventoryGroupWeaponMods.HandleButtonClicked
// 0x0008 (0x0008 - 0x0000)
struct AthenaInventoryGroupWeaponMods_HandleButtonClicked final
{
public:
	class UObject*                                Object;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AthenaInventoryGroupWeaponMods_HandleButtonClicked;

// Function WeaponModsUI.AthenaInventoryGroupWeaponMods.CanWeaponEquipMod
// 0x0018 (0x0018 - 0x0000)
struct AthenaInventoryGroupWeaponMods_CanWeaponEquipMod final
{
public:
	const class AFortWeapon*                      Weapon;                                            // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class UFortWeaponModItemDefinition*     Mod;                                               // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AthenaInventoryGroupWeaponMods_CanWeaponEquipMod;

// Function WeaponModsUI.AthenaInventoryItemInfoWeaponMods.HandleInventoryItemSelected
// 0x0008 (0x0008 - 0x0000)
struct AthenaInventoryItemInfoWeaponMods_HandleInventoryItemSelected final
{
public:
	class UFortItem*                              SelectedItem;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AthenaInventoryItemInfoWeaponMods_HandleInventoryItemSelected;

// Function WeaponModsUI.AthenaInventoryItemInfoWeaponMods.HandleWeaponModSlotsChanged
// 0x0008 (0x0008 - 0x0000)
struct AthenaInventoryItemInfoWeaponMods_HandleWeaponModSlotsChanged final
{
public:
	class AFortWeapon*                            Weapon;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AthenaInventoryItemInfoWeaponMods_HandleWeaponModSlotsChanged;

// Function WeaponModsUI.AthenaInventoryItemInfoWeaponMods.SetIsModifiableWeapon
// 0x0001 (0x0001 - 0x0000)
struct AthenaInventoryItemInfoWeaponMods_SetIsModifiableWeapon final
{
public:
	bool                                          bIsModifiable;                                     // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AthenaInventoryItemInfoWeaponMods_SetIsModifiableWeapon;

// Function WeaponModsUI.AthenaInventoryItemInfoWeaponMods.SetItemSlotInfo
// 0x0010 (0x0010 - 0x0000)
struct AthenaInventoryItemInfoWeaponMods_SetItemSlotInfo final
{
public:
	struct FFortWeaponModSlot                     ModSlot;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AthenaInventoryItemInfoWeaponMods_SetItemSlotInfo;

// Function WeaponModsUI.AthenaInventoryItemInfoWeaponModsConfigurator.RemoveMod
// 0x0008 (0x0008 - 0x0000)
struct AthenaInventoryItemInfoWeaponModsConfigurator_RemoveMod final
{
public:
	class UFortWeaponModItemDefinition*           ModItemDef;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AthenaInventoryItemInfoWeaponModsConfigurator_RemoveMod;

// Function WeaponModsUI.AthenaLastKillerWeaponModsInfo.SetKillerWeaponMods
// 0x0010 (0x0010 - 0x0000)
struct AthenaLastKillerWeaponModsInfo_SetKillerWeaponMods final
{
public:
	TArray<struct FFortWeaponModSlot>             ModSlots;                                          // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AthenaLastKillerWeaponModsInfo_SetKillerWeaponMods;

// Function WeaponModsUI.AthenaPickupIndicatorWeaponMods.HandlePickupHovered
// 0x0008 (0x0008 - 0x0000)
struct AthenaPickupIndicatorWeaponMods_HandlePickupHovered final
{
public:
	class AFortPickup*                            Pickup;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AthenaPickupIndicatorWeaponMods_HandlePickupHovered;

// Function WeaponModsUI.AthenaPickupIndicatorWeaponMods.HandleWeaponEquipped
// 0x0010 (0x0010 - 0x0000)
struct AthenaPickupIndicatorWeaponMods_HandleWeaponEquipped final
{
public:
	class AFortWeapon*                            NewWeapon;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFortWeapon*                            PrevWeapon;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AthenaPickupIndicatorWeaponMods_HandleWeaponEquipped;

// Function WeaponModsUI.AthenaPickupIndicatorWeaponMods.SetEquippedWeaponItemInfo
// 0x0008 (0x0008 - 0x0000)
struct AthenaPickupIndicatorWeaponMods_SetEquippedWeaponItemInfo final
{
public:
	const class UFortItemDefinition*              ItemDef;                                           // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AthenaPickupIndicatorWeaponMods_SetEquippedWeaponItemInfo;

// Function WeaponModsUI.AthenaPickupIndicatorWeaponMods.SetEquippedWeaponItemSlotInfo
// 0x0010 (0x0010 - 0x0000)
struct AthenaPickupIndicatorWeaponMods_SetEquippedWeaponItemSlotInfo final
{
public:
	struct FFortWeaponModSlot                     ModSlot;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AthenaPickupIndicatorWeaponMods_SetEquippedWeaponItemSlotInfo;

// Function WeaponModsUI.AthenaPickupIndicatorWeaponMods.SetItemModifiedWeaponName
// 0x0018 (0x0018 - 0x0000)
struct AthenaPickupIndicatorWeaponMods_SetItemModifiedWeaponName final
{
public:
	class FText                                   ModifiedWeaponName;                                // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AthenaPickupIndicatorWeaponMods_SetItemModifiedWeaponName;

// Function WeaponModsUI.AthenaPickupIndicatorWeaponMods.SetItemSlotInfo
// 0x0010 (0x0010 - 0x0000)
struct AthenaPickupIndicatorWeaponMods_SetItemSlotInfo final
{
public:
	struct FFortWeaponModSlot                     ModSlot;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AthenaPickupIndicatorWeaponMods_SetItemSlotInfo;

// Function WeaponModsUI.AthenaPickupIndicatorWeaponMods.IsInspectViewCollapsedBySettings
// 0x0001 (0x0001 - 0x0000)
struct AthenaPickupIndicatorWeaponMods_IsInspectViewCollapsedBySettings final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AthenaPickupIndicatorWeaponMods_IsInspectViewCollapsedBySettings;

// Function WeaponModsUI.AthenaQuickBarSlotWeaponModsIndicator.HandleQuickBarSlotFocusChanged
// 0x0008 (0x0008 - 0x0000)
struct AthenaQuickBarSlotWeaponModsIndicator_HandleQuickBarSlotFocusChanged final
{
public:
	EFortQuickBars                                QuickBarType;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         QuickBarSlot;                                      // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AthenaQuickBarSlotWeaponModsIndicator_HandleQuickBarSlotFocusChanged;

// Function WeaponModsUI.AthenaQuickBarSlotWeaponModsIndicator.HandleWeaponFullyEquipped
// 0x0010 (0x0010 - 0x0000)
struct AthenaQuickBarSlotWeaponModsIndicator_HandleWeaponFullyEquipped final
{
public:
	class AFortWeapon*                            NewWeapon;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFortWeapon*                            PrevWeapon;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AthenaQuickBarSlotWeaponModsIndicator_HandleWeaponFullyEquipped;

// Function WeaponModsUI.AthenaQuickBarSlotWeaponModsIndicator.HandleWeaponModSlotsChanged
// 0x0008 (0x0008 - 0x0000)
struct AthenaQuickBarSlotWeaponModsIndicator_HandleWeaponModSlotsChanged final
{
public:
	class AFortWeapon*                            Weapon;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AthenaQuickBarSlotWeaponModsIndicator_HandleWeaponModSlotsChanged;

// Function WeaponModsUI.AthenaQuickBarSlotWeaponModsIndicator.SetItemSlotInfo
// 0x0010 (0x0010 - 0x0000)
struct AthenaQuickBarSlotWeaponModsIndicator_SetItemSlotInfo final
{
public:
	struct FFortWeaponModSlot                     ModSlot;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AthenaQuickBarSlotWeaponModsIndicator_SetItemSlotInfo;

// Function WeaponModsUI.AthenaQuickBarSlotWeaponModsIndicator.SetItemSlotSelected
// 0x0001 (0x0001 - 0x0000)
struct AthenaQuickBarSlotWeaponModsIndicator_SetItemSlotSelected final
{
public:
	bool                                          bIsSelected;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AthenaQuickBarSlotWeaponModsIndicator_SetItemSlotSelected;

// Function WeaponModsUI.AthenaQuickBarSlotWeaponModsIndicator.SetItemSlotsInfo
// 0x0010 (0x0010 - 0x0000)
struct AthenaQuickBarSlotWeaponModsIndicator_SetItemSlotsInfo final
{
public:
	TArray<struct FFortWeaponModSlot>             ModSlots;                                          // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AthenaQuickBarSlotWeaponModsIndicator_SetItemSlotsInfo;

}

