#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WeaponModStationUI

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "CommonInput_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function WeaponModStationUI.AthenaWeaponModsWorkbenchContext.GetCurrentModCategory
// 0x0004 (0x0004 - 0x0000)
struct AthenaWeaponModsWorkbenchContext_GetCurrentModCategory final
{
public:
	struct FGameplayTag                           ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AthenaWeaponModsWorkbenchContext_GetCurrentModCategory;

// Function WeaponModStationUI.AthenaWeaponModsWorkbenchWidgetBase.HandleWeaponEquipped
// 0x0010 (0x0010 - 0x0000)
struct AthenaWeaponModsWorkbenchWidgetBase_HandleWeaponEquipped final
{
public:
	class AFortWeapon*                            NewWeapon;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFortWeapon*                            PrevWeapon;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AthenaWeaponModsWorkbenchWidgetBase_HandleWeaponEquipped;

// Function WeaponModStationUI.AthenaWeaponModsWorkbenchWidgetBase.OnWeaponModCategoryChanged
// 0x0004 (0x0004 - 0x0000)
struct AthenaWeaponModsWorkbenchWidgetBase_OnWeaponModCategoryChanged final
{
public:
	struct FGameplayTag                           ModTypeTag;                                        // 0x0000(0x0004)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AthenaWeaponModsWorkbenchWidgetBase_OnWeaponModCategoryChanged;

// Function WeaponModStationUI.AthenaWeaponModsWorkbenchEquippedModDetails.HandleCurrentlySelectedModChanged
// 0x0008 (0x0008 - 0x0000)
struct AthenaWeaponModsWorkbenchEquippedModDetails_HandleCurrentlySelectedModChanged final
{
public:
	class UFortWeaponModItemDefinition*           NewSelectedMod;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AthenaWeaponModsWorkbenchEquippedModDetails_HandleCurrentlySelectedModChanged;

// Function WeaponModStationUI.AthenaWeaponModsWorkbenchEquippedModDetails.HandleSetEquippedModInfo
// 0x0008 (0x0008 - 0x0000)
struct AthenaWeaponModsWorkbenchEquippedModDetails_HandleSetEquippedModInfo final
{
public:
	const class UFortWeaponModItemDefinition*     WeaponMod;                                         // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AthenaWeaponModsWorkbenchEquippedModDetails_HandleSetEquippedModInfo;

// Function WeaponModStationUI.AthenaWeaponModsWorkbenchEquippedModDetails.OnSetCurrentlySelectedModInfo
// 0x0010 (0x0010 - 0x0000)
struct AthenaWeaponModsWorkbenchEquippedModDetails_OnSetCurrentlySelectedModInfo final
{
public:
	const class UFortWeaponModItemDefinition*     ModItemDefinition;                                 // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsSameCategory;                                   // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsEquippedMod;                                    // 0x0009(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AthenaWeaponModsWorkbenchEquippedModDetails_OnSetCurrentlySelectedModInfo;

// Function WeaponModStationUI.AthenaWeaponModsWorkbenchEquippedModDetails.OnSetEquippedModInfo
// 0x0010 (0x0010 - 0x0000)
struct AthenaWeaponModsWorkbenchEquippedModDetails_OnSetEquippedModInfo final
{
public:
	const class UFortWeaponModItemDefinition*     ModItemDefinition;                                 // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsDefaultMod;                                     // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSlotHasDefaultMod;                                // 0x0009(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCanRemoveMod;                                     // 0x000A(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B[0x5];                                        // 0x000B(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AthenaWeaponModsWorkbenchEquippedModDetails_OnSetEquippedModInfo;

// Function WeaponModStationUI.AthenaWeaponModsWorkbenchModal.HandleModStationComponentForceStop
// 0x0008 (0x0008 - 0x0000)
struct AthenaWeaponModsWorkbenchModal_HandleModStationComponentForceStop final
{
public:
	class AFortWeaponModStationBase*              WeaponModStation;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AthenaWeaponModsWorkbenchModal_HandleModStationComponentForceStop;

// Function WeaponModStationUI.AthenaWeaponModsWorkbenchModal.HandleWeaponEquipped
// 0x0010 (0x0010 - 0x0000)
struct AthenaWeaponModsWorkbenchModal_HandleWeaponEquipped final
{
public:
	class AFortWeapon*                            NewWeapon;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFortWeapon*                            PrevWeapon;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AthenaWeaponModsWorkbenchModal_HandleWeaponEquipped;

// Function WeaponModStationUI.AthenaWeaponModsWorkbenchModal.OnInputTypeChanged
// 0x0001 (0x0001 - 0x0000)
struct AthenaWeaponModsWorkbenchModal_OnInputTypeChanged final
{
public:
	ECommonInputType                              NewInputType;                                      // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AthenaWeaponModsWorkbenchModal_OnInputTypeChanged;

// Function WeaponModStationUI.AthenaWeaponModsWorkbenchModal.OnWeaponEquipped
// 0x0001 (0x0001 - 0x0000)
struct AthenaWeaponModsWorkbenchModal_OnWeaponEquipped final
{
public:
	bool                                          bIsModdable;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AthenaWeaponModsWorkbenchModal_OnWeaponEquipped;

// Function WeaponModStationUI.AthenaWeaponModsWorkbenchModListEntry.OnListItemSet
// 0x0008 (0x0008 - 0x0000)
struct AthenaWeaponModsWorkbenchModListEntry_OnListItemSet final
{
public:
	const class UFortItemDefinition*              Item;                                              // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AthenaWeaponModsWorkbenchModListEntry_OnListItemSet;

// Function WeaponModStationUI.AthenaWeaponModsWorkbenchModListEntry.IsEquippableMod
// 0x0001 (0x0001 - 0x0000)
struct AthenaWeaponModsWorkbenchModListEntry_IsEquippableMod final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AthenaWeaponModsWorkbenchModListEntry_IsEquippableMod;

// Function WeaponModStationUI.AthenaWeaponModsWorkbenchModListEntry.IsEquippedMod
// 0x0001 (0x0001 - 0x0000)
struct AthenaWeaponModsWorkbenchModListEntry_IsEquippedMod final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AthenaWeaponModsWorkbenchModListEntry_IsEquippedMod;

// Function WeaponModStationUI.AthenaWeaponModsWorkbenchModSelection.GetSelectedModCostAndOwnedCurrency
// 0x0008 (0x0008 - 0x0000)
struct AthenaWeaponModsWorkbenchModSelection_GetSelectedModCostAndOwnedCurrency final
{
public:
	int32                                         ModCost;                                           // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OwnedCurrency;                                     // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AthenaWeaponModsWorkbenchModSelection_GetSelectedModCostAndOwnedCurrency;

// Function WeaponModStationUI.AthenaWeaponModsWorkbenchModSelection.OnRefreshMods
// 0x0010 (0x0010 - 0x0000)
struct AthenaWeaponModsWorkbenchModSelection_OnRefreshMods final
{
public:
	TArray<class UFortWeaponModItemDefinition*>   WeaponModItemDefinitions;                          // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AthenaWeaponModsWorkbenchModSelection_OnRefreshMods;

// Function WeaponModStationUI.AthenaWeaponModsWorkbenchModSelection.OnRefreshModType
// 0x0004 (0x0004 - 0x0000)
struct AthenaWeaponModsWorkbenchModSelection_OnRefreshModType final
{
public:
	struct FGameplayTag                           ModCategoryTag;                                    // 0x0000(0x0004)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AthenaWeaponModsWorkbenchModSelection_OnRefreshModType;

// Function WeaponModStationUI.AthenaWeaponModsWorkbenchModSelection.OnSetSelectedModCostAndOwnedCurrency
// 0x0008 (0x0008 - 0x0000)
struct AthenaWeaponModsWorkbenchModSelection_OnSetSelectedModCostAndOwnedCurrency final
{
public:
	int32                                         ModCost;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OwnedCurrency;                                     // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AthenaWeaponModsWorkbenchModSelection_OnSetSelectedModCostAndOwnedCurrency;

// Function WeaponModStationUI.AthenaWeaponModsWorkbenchModSelection.OnSetSelectedModInfo
// 0x0008 (0x0008 - 0x0000)
struct AthenaWeaponModsWorkbenchModSelection_OnSetSelectedModInfo final
{
public:
	const class UFortWeaponModItemDefinition*     ModItemDef;                                        // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AthenaWeaponModsWorkbenchModSelection_OnSetSelectedModInfo;

// Function WeaponModStationUI.AthenaWeaponModsWorkbenchModSelection.OnSetSelectedRemoveModCostAndOwnedCurrency
// 0x0008 (0x0008 - 0x0000)
struct AthenaWeaponModsWorkbenchModSelection_OnSetSelectedRemoveModCostAndOwnedCurrency final
{
public:
	int32                                         ModCost;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OwnedCurrency;                                     // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AthenaWeaponModsWorkbenchModSelection_OnSetSelectedRemoveModCostAndOwnedCurrency;

// Function WeaponModStationUI.AthenaWeaponModsWorkbenchModSelection.SetCanRemoveMod
// 0x0001 (0x0001 - 0x0000)
struct AthenaWeaponModsWorkbenchModSelection_SetCanRemoveMod final
{
public:
	bool                                          bCanRemoveMod;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AthenaWeaponModsWorkbenchModSelection_SetCanRemoveMod;

// Function WeaponModStationUI.AthenaWeaponModsWorkbenchModSelection.CanApplySelectedModToEquippedWeapon
// 0x0001 (0x0001 - 0x0000)
struct AthenaWeaponModsWorkbenchModSelection_CanApplySelectedModToEquippedWeapon final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AthenaWeaponModsWorkbenchModSelection_CanApplySelectedModToEquippedWeapon;

// Function WeaponModStationUI.AthenaWeaponModsWorkbenchModSelection.CanRemoveSelectedModFromWeapon
// 0x0001 (0x0001 - 0x0000)
struct AthenaWeaponModsWorkbenchModSelection_CanRemoveSelectedModFromWeapon final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AthenaWeaponModsWorkbenchModSelection_CanRemoveSelectedModFromWeapon;

// Function WeaponModStationUI.AthenaWeaponModsWorkbenchModSelection.DoesEquippedWeaponHaveDefaultModForSlot
// 0x0001 (0x0001 - 0x0000)
struct AthenaWeaponModsWorkbenchModSelection_DoesEquippedWeaponHaveDefaultModForSlot final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AthenaWeaponModsWorkbenchModSelection_DoesEquippedWeaponHaveDefaultModForSlot;

// Function WeaponModStationUI.AthenaWeaponModsWorkbenchModSelection.GetSelectedRemoveModCostAndOwnedCurrency
// 0x0008 (0x0008 - 0x0000)
struct AthenaWeaponModsWorkbenchModSelection_GetSelectedRemoveModCostAndOwnedCurrency final
{
public:
	int32                                         RemoveModCost;                                     // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OwnedCurrency;                                     // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AthenaWeaponModsWorkbenchModSelection_GetSelectedRemoveModCostAndOwnedCurrency;

// Function WeaponModStationUI.AthenaWeaponModsWorkbenchModSelection.IsSelectedModEquippedOnWeapon
// 0x0001 (0x0001 - 0x0000)
struct AthenaWeaponModsWorkbenchModSelection_IsSelectedModEquippedOnWeapon final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AthenaWeaponModsWorkbenchModSelection_IsSelectedModEquippedOnWeapon;

// Function WeaponModStationUI.AthenaWeaponModsWorkbenchModTypeButton.HandleWeaponEquipped
// 0x0010 (0x0010 - 0x0000)
struct AthenaWeaponModsWorkbenchModTypeButton_HandleWeaponEquipped final
{
public:
	class AFortWeapon*                            NewWeapon;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFortWeapon*                            PrevWeapon;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AthenaWeaponModsWorkbenchModTypeButton_HandleWeaponEquipped;

// Function WeaponModStationUI.AthenaWeaponModsWorkbenchModTypeButton.SetEquippedOrDefaultMod
// 0x0010 (0x0010 - 0x0000)
struct AthenaWeaponModsWorkbenchModTypeButton_SetEquippedOrDefaultMod final
{
public:
	class UFortWeaponModItemDefinition*           ItemDefinition;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsAvailableCategory;                              // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AthenaWeaponModsWorkbenchModTypeButton_SetEquippedOrDefaultMod;

// Function WeaponModStationUI.AthenaWeaponModsWorkbenchModTypeButton.GetModTypeTag
// 0x0004 (0x0004 - 0x0000)
struct AthenaWeaponModsWorkbenchModTypeButton_GetModTypeTag final
{
public:
	struct FGameplayTag                           ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AthenaWeaponModsWorkbenchModTypeButton_GetModTypeTag;

// Function WeaponModStationUI.AthenaWeaponModsWorkbenchModTypeTabs.GetTabButtons
// 0x0010 (0x0010 - 0x0000)
struct AthenaWeaponModsWorkbenchModTypeTabs_GetTabButtons final
{
public:
	TArray<class UAthenaWeaponModsWorkbenchModTypeButton*> ReturnValue;                              // 0x0000(0x0010)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AthenaWeaponModsWorkbenchModTypeTabs_GetTabButtons;

// Function WeaponModStationUI.AthenaWeaponModsWorkbenchModTypeTabs.OnModTypeTabClicked
// 0x0004 (0x0004 - 0x0000)
struct AthenaWeaponModsWorkbenchModTypeTabs_OnModTypeTabClicked final
{
public:
	struct FGameplayTag                           ModTypeTag;                                        // 0x0000(0x0004)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AthenaWeaponModsWorkbenchModTypeTabs_OnModTypeTabClicked;

// Function WeaponModStationUI.AthenaWeaponModsWorkbenchModTypeTabs.SetItemSlotInfo
// 0x0010 (0x0010 - 0x0000)
struct AthenaWeaponModsWorkbenchModTypeTabs_SetItemSlotInfo final
{
public:
	TArray<struct FFortWeaponModSlot>             ModSlots;                                          // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AthenaWeaponModsWorkbenchModTypeTabs_SetItemSlotInfo;

// Function WeaponModStationUI.AthenaWeaponModsWorkbenchWeaponDetails.OnWeaponEquipped
// 0x0020 (0x0020 - 0x0000)
struct AthenaWeaponModsWorkbenchWeaponDetails_OnWeaponEquipped final
{
public:
	const class UFortItemDefinition*              ItemDefinition;                                    // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   DisplayName;                                       // 0x0008(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AthenaWeaponModsWorkbenchWeaponDetails_OnWeaponEquipped;

// Function WeaponModStationUI.AthenaWeaponModsWorkbenchWeaponDetails.SetWeaponType
// 0x0020 (0x0020 - 0x0000)
struct AthenaWeaponModsWorkbenchWeaponDetails_SetWeaponType final
{
public:
	class FText                                   WeaponTypeText;                                    // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class UTexture2D*                             WeaponTypeTexture;                                 // 0x0018(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AthenaWeaponModsWorkbenchWeaponDetails_SetWeaponType;

// Function WeaponModStationUI.AthenaWeaponModsWorkbenchWeaponRenderContainer.HandleWeaponModSlotPreview
// 0x0008 (0x0008 - 0x0000)
struct AthenaWeaponModsWorkbenchWeaponRenderContainer_HandleWeaponModSlotPreview final
{
public:
	class UFortWeaponModItemDefinition*           PreviewingModItemDefinition;                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AthenaWeaponModsWorkbenchWeaponRenderContainer_HandleWeaponModSlotPreview;

// Function WeaponModStationUI.AthenaWeaponModsWorkbenchWeaponRenderContainer.OnWeaponModSlotPreview
// 0x0010 (0x0010 - 0x0000)
struct AthenaWeaponModsWorkbenchWeaponRenderContainer_OnWeaponModSlotPreview final
{
public:
	class AFortWeapon*                            Weapon;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortWeaponModItemDefinition*           PreviewingModItemDefinition;                       // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AthenaWeaponModsWorkbenchWeaponRenderContainer_OnWeaponModSlotPreview;

// Function WeaponModStationUI.AthenaWeaponModsWorkbenchWeaponRenderContainer.OnWeaponModSlotsChanged
// 0x0008 (0x0008 - 0x0000)
struct AthenaWeaponModsWorkbenchWeaponRenderContainer_OnWeaponModSlotsChanged final
{
public:
	class AFortWeapon*                            Weapon;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AthenaWeaponModsWorkbenchWeaponRenderContainer_OnWeaponModSlotsChanged;

}

